{
  "items": [
    {
      "id": "157c90f4a2723bce",
      "title": "Apply for 2026 Ohio Farm Bureau Foundation Scholarships",
      "link": "https://www.morningagclips.com/apply-for-2026-ohio-farm-bureau-foundation-scholarships/",
      "description": "COLUMBUS, Ohio — The Ohio Farm Bureau Foundation has multiple scholarships available to Ohio students from rural, suburban and urban communities who are pursuing degrees with a connection to the agricultural industry. Through 17 scholarship funds, over 50 awards, including two new scholarships, will be given to deserving students in 2026. The deadline to apply [&#8230;] The post Apply for 2026 Ohio Farm Bureau Foundation Scholarships appeared first on Morning Ag Clips.",
      "date": "Tue, 10 Feb 2026 03:29:11 +0000",
      "timestamp": 1770694151000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "In 2026, over 50 scholarships will be awarded through 17 different funds. \n\nThe deadline to apply for most scholarships is March 31, 2026, except for the new Ohio Farm Bureau Ambassadors Scholarship, which has a February 28 deadline. The Ambassadors Scholarship provides a $10,000 renewable award for up to 4 years, totaling $40,000.\n\nOther notable scholarships include:\n- John Wallace and James Wallace Douglas Scholarship: Supports individuals pursuing agricultural education or careers.\n- David E. Mizer Memorial Scholarship: $3,000 renewable scholarship for students from 4 counties studying dairy, food, or agriculture. \n- Mularcik Welding Scholarship: Supports students seeking careers in welding.\n- Bill and Helen Swank Scholarship: Honors the legacy of former Ohio Farm Bureau executive.\n- Kenny Walter Scholarship: For students from Farm Bureau families in 29 northeastern counties.\n\nIn addition to the Foundation's scholarships, many county Farm Bureaus also offer their own scholarship programs. The Foundation aims to inspire and educate the next generation of farmers in Ohio.",
      "summaryTimestamp": 1770701163746
    },
    {
      "id": "eb6587303a60e433",
      "title": "CattleFax Outlook Signals Cattle Cycle Turning",
      "link": "https://www.morningagclips.com/cattlefax-outlook-signals-cattle-cycle-turning/",
      "description": "NASHVILLE, Tenn. — The popular CattleFax Outlook Seminar, held as part of CattleCon 2026 in Nashville, Tenn., shared expert market and weather analysis on Feb. 5. “The U.S. cattle and beef industry enters 2026 with strong but volatile market conditions, as historically tight cattle supplies, record-setting beef demand, and elevated policy and weather uncertainty continue [&#8230;] The post CattleFax Outlook Signals Cattle Cycle Turning appeared first on Morning Ag Clips.",
      "date": "Tue, 10 Feb 2026 03:20:35 +0000",
      "timestamp": 1770693635000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "S. cattle and beef industry in 2026. Despite near-term volatility, the long-term outlook remains positive.\n\nWeather Outlook: La Niña is expected to dissipate by March, leading to a transition period with elevated drought risks in the Southern U.S. and Central Plains. A potential El Niño developing later in the year could impact moisture levels.\n\nEconomic Outlook: Inflation moderated to 2.7% in 2025, allowing the Federal Reserve to lower interest rates. Corn production reached a record 186.5 bu/acre in 2025, keeping prices between $4-$5/bu. Hay production increased slightly to 123 million tons, with prices around $145/ton.\n\nCattle Market Outlook:\n- The U.S. beef cow herd decreased by 280,000 head, while dairy cow numbers increased by 190,000.\n- Feeder cattle supplies will remain constrained in early 2026, leading to a 600,000 head decline in fed slaughter.\n- Total beef production is projected to decline again in 2026, but imports are up 5% and exports down 5%, leading to a 0.2 lb increase in per capita beef supply to 59.2 lbs.\n- Retail beef demand remained strong in 2025 with record high prices, supported by exceptional beef quality (84% Choice or higher, 12% Prime).\n- 2026 cattle and beef prices are forecast to be steady to higher, with cow-calf producers expected to maintain the strongest leverage.\n- Key factors to watch include the threat of New World Screwworm, shifts in packing capacity, and growth in the dairy industry supplying more cattle.",
      "summaryTimestamp": 1770701169046
    },
    {
      "id": "c7259a68b6294a9d",
      "title": "State Agriculture Departments Seek More Markets for Local Meat Processors",
      "link": "https://www.morningagclips.com/state-agriculture-departments-seek-more-markets-for-local-meat-processors/",
      "description": "WASHINGTON — At the 2026 Winter Policy Conference, National Association of State Departments of Agriculture members encouraged USDA to develop an additional pathway for products from state-inspected meat and poultry processing facilities to be sold across state lines. The policy amendment members passed states that NASDA supports the modification of existing or addition of a [&#8230;] The post State Agriculture Departments Seek More Markets for Local Meat Processors appeared first on Morning Ag ",
      "date": "Tue, 10 Feb 2026 03:05:32 +0000",
      "timestamp": 1770692732000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Currently, these facilities can only sell within their home state, even though they meet the same \"at least equal to\" USDA standards as federally-inspected plants.\n\nThe National Association of State Departments of Agriculture (NASDA) passed a policy amendment at their 2026 Winter Conference supporting this change. NASDA CEO Ted McKinney noted that state agriculture departments have extensive food safety inspection experience and close relationships with local processors, making them well-positioned to help small and medium-sized producers expand their markets.\n\nMany small meat processing facilities are unable to get federal inspections due to limited availability of USDA inspectors. Allowing interstate sales of state-inspected meat would provide more market opportunities for these small businesses, more options for consumers, and save federal resources.\n\nThe article does not provide any specific numbers, prices, dates, or expert quotes. It focuses on the policy proposal and potential benefits for small and medium-sized meat processors to gain wider distribution for their products.",
      "summaryTimestamp": 1770701171969
    },
    {
      "id": "43fb3a907c3c874f",
      "title": "Farm Credit East Presents Webinar: 2026 Green Industry Economic Outlook",
      "link": "https://www.morningagclips.com/farm-credit-east-presents-webinar-2026-green-industry-economic-outlook/",
      "description": "ENFIELD, Conn. — Northeast green industry growers are invited to participate in a free Farm Credit East webinar taking place on Monday, February 23 at 12:00 noon. This webinar will provide economic projections for the coming year for the green industry, including nursery, landscaping and greenhouse industries. During this webinar, Dr. Charlie Hall, of Texas [&#8230;] The post Farm Credit East Presents Webinar: 2026 Green Industry Economic Outlook appeared first on Morning Ag Clips.",
      "date": "Mon, 09 Feb 2026 23:27:32 +0000",
      "timestamp": 1770679652000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Farm Credit East will host a free webinar on Monday, February 23, 2026 at 12:00 noon to provide an economic outlook for the green industry in 2026. The webinar will be presented by Dr. Charlie Hall from Texas A&M University.\n\nKey topics to be covered include:\n- Growth pattern of the economy\n- Supply chain issues\n- Labor availability\n- Input cost increases\n- Inflationary pressures\n- Consumer spending trends\n\nDr. Hall will review the green industry's performance in 2025 and give a forecast for 2026, including a recession prediction and strategic responses for green industry participants.\n\nThis webinar is part of Farm Credit East's Insights and Perspectives series, which covers various agricultural sectors in the Northeast. Attendees can register for the free webinar at FarmCreditEast.com/Webinars.\n\nFarm Credit East is a member-owned cooperative serving agricultural, forestry, and commercial fishing businesses across an 8-state region. They provide loans, leases, and other financial services to their members.",
      "summaryTimestamp": 1770688951998
    },
    {
      "id": "201b3258f4c16eed",
      "title": "Trump Signs Executive Order Boosting Argentine Beef&#160;Imports",
      "link": "https://civileats.com/2026/02/09/trump-signs-executive-order-boosting-argentine-beef-imports/",
      "description": "February 9, 2025 – The United States has finalized a deal with Argentina that is expected to more than quadruple beef imports from the South American country, acting on plans floated in October that received pushback from U.S. cattle producers. On Friday, President Donald Trump signed an executive order to increase Argentine beef imports by [&#8230;] The post Trump Signs Executive Order Boosting Argentine Beef Imports appeared first on Civil Eats.",
      "date": "Mon, 09 Feb 2026 23:24:08 +0000",
      "timestamp": 1770679448000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The U.S. has finalized a deal with Argentina that is expected to more than quadruple beef imports from the South American country. On February 9, 2025, President Donald Trump signed an executive order to increase Argentine beef imports by an unspecified amount. This move received pushback from U.S. cattle producers when the plans were first floated in October. The increased beef imports from Argentina are part of the executive order signed by President Trump.",
      "summaryTimestamp": 1770688954190
    },
    {
      "id": "33d69001b20007c6",
      "title": "EPA Reapproves Weedkiller Dicamba Despite Concerns About Drift and Crop&#160;Damage",
      "link": "https://civileats.com/2026/02/09/epa-reapproves-dicamba-despite-concerns-about-drift-and-human-health/",
      "description": "“The Trump administration’s hostility to farmers and rural America knows no bounds,” Bill Freese, science director at the Center for Food Safety (CFS), said in a press release. “Dicamba drift damage threatens livelihoods and tears apart rural communities.” Farmers have been using dicamba since the 1960s, but issues emerged about a decade ago, when it [&#8230;] The post EPA Reapproves Weedkiller Dicamba Despite Concerns About Drift and Crop Damage appeared first on Civil Eats.",
      "date": "Mon, 09 Feb 2026 23:08:28 +0000",
      "timestamp": 1770678508000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The U.S. Environmental Protection Agency (EPA) has reapproved the use of the weedkiller dicamba despite ongoing concerns about crop damage from dicamba drift. Farmers have been using dicamba since the 1960s, but issues with dicamba drift and crop damage have emerged over the past decade. The Center for Food Safety (CFS) has criticized the decision, stating that \"dicamba drift damage threatens livelihoods and tears apart rural communities.\" The reapproval is part of the Trump administration's policies, which the CFS has described as \"hostility to farmers and rural America.\" The EPA's decision allows the continued use of dicamba on genetically engineered, dicamba-tolerant soybeans and cotton.",
      "summaryTimestamp": 1770688956406
    },
    {
      "id": "92b3060a0e2ee116",
      "title": "Trump quadruples Argentina beef import quota",
      "link": "<![CDATA[https://www.feedstuffs.com/livestock-and-poultry-market-news/trump-quadruples-argentina-beef-import-quota]]>",
      "description": "Total in-quota quantify of lean beef trimmings from Argentina will be temporarily increased by 80,000 mt for 2026.",
      "date": "Mon, 09 Feb 2026 22:48:23 GMT",
      "timestamp": 1770677303000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltd08273941506dcd0/698a660b3e0f7e4cae1d9179/ground_beef_retail_packages_-Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The U.S. has quadrupled the import quota for Argentine beef, increasing it from 20,000 metric tons (mt) to 80,000 mt for 2026. This move is intended to help offset supply chain disruptions and rising beef prices in the U.S. The previous quota of 20,000 mt had been in place since 2015.\n\nThe expanded quota will allow more Argentine beef to be imported duty-free into the U.S. Beef exports from Argentina to the U.S. were previously limited to just 20,000 mt per year under a trade agreement.\n\nArgentina's beef production and exports have been rising in recent years, and the country is seeking to grow its market access globally. This increased import quota represents an opportunity for Argentina's beef industry to expand its sales to the lucrative U.S. market.\n\nFor U.S. farmers and ranchers, the expanded beef imports from Argentina could put some downward pressure on domestic beef prices, which have been rising due to supply chain issues and strong consumer demand. However, the additional 60,000 mt represents a relatively small fraction of total U.S. beef consumption, so the impact on U.S. producers may be limited.",
      "summaryTimestamp": 1770688959328
    },
    {
      "id": "6d80beffafb6c708",
      "title": "Wrangler SD High School Rodeo Showcase Winners",
      "link": "https://www.tsln.com/news/wrangler-sd-high-school-rodeo-showcase-winners/",
      "description": "Sutton Rodeo once again hosted the 20x showcase rodeo. Suttons invited the top three contestants in each region to compete in this elite event held at the Monument Feb. 1, 2026. Bareback 1 Taos Weborg,...",
      "date": "Mon, 09 Feb 2026 22:48:02 +0000",
      "timestamp": 1770677282000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/09153544/Syd-Pelster-1-1024x683.jpg",
      "summary": "Top contestants from across the state were invited to compete in this elite event. \n\nThe winners in each event were:\n- Bareback: 1st Taos Weborg (76 points), 2nd Tyrel Seaman (71), 3rd Klansey Gerwerth (64)\n- Breakaway Roping: 1st Kennedy Anstine (3.59 seconds), 2nd Tayce Tetrault (3.80), 3rd Libby Diedrichs (3.95) \n- Tie Down Roping: 1st Walker West (12.36 seconds), 2nd Drake Boomsma (13.69), 3rd Tace Berglund (14.12)\n- Goat Tying: 1st Sophie Hruby (7.01 seconds), 2nd Elle Goehring (7.59), 3rd Syd Pelster (7.83)\n- Saddle Bronc: 1st Easton Eisemann (52 points)\n- Steer Wrestling: 1st Seth Heath (7.99 seconds), 2nd Brady Meyer (8.38)\n- Barrel Racing: 1st Charleigh Brewer (13.196 seconds), 2nd Arina Haugen (13.505), 3rd Joslyn Deknikker (13.834)\n- Pole Bending: 1st Tylee Tetrault (19.53 seconds), 2nd Rylee McCord (20.10), 3rd Shaylee Porch (20.28) \n- Team Roping: 1st Tanner Thorstenson and Tarver Zebrowski (7.64 seconds), 2nd Sutton Stearns and Chauncey Driscoll (2.84), 3rd Brand Hilgenkamp and Christopher Lurz (16.39)\n- Bull Riding: 1st Laddimer Clifford (83.5 points), 2nd Tyrel Koan (75), 3rd Chaz Carda (69)\n\nThis annual 20x Showcase Rodeo features the top high school rodeo competitors from across South Dakota.",
      "summaryTimestamp": 1770688964706
    },
    {
      "id": "ee1f2f1d7bd91860",
      "title": "World Ag Expo® and Coast Counties Peterbilt Name 2026 “We Believe in Growing” Scholarship Winners",
      "link": "https://www.morningagclips.com/world-ag-expo-and-coast-counties-peterbilt-name-2026-we-believe-in-growing-scholarship-winners/",
      "description": "TULARE, Calif. &#8212; World Ag Expo® and Coast Counties Peterbilt, formerly E.M. Tharp, Inc., are proud to announce the recipients of the 2026 “We Believe in Growing” scholarship. The scholarship program recognizes outstanding students who are pursuing careers in agriculture. This year&#8217;s winners, Kaedyn Plann and Tanner Verhoeven, will each receive $2,500 scholarships to be [&#8230;] The post World Ag Expo® and Coast Counties Peterbilt Name 2026 “We Believe in Growing” Scholarship Winners",
      "date": "Mon, 09 Feb 2026 22:21:54 +0000",
      "timestamp": 1770675714000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Kaedyn Plann of Fresno, CA and Tanner Verhoeven of Visalia, CA will each receive $2,500 scholarships, renewable for up to 4 years for a total of $10,000 per student.\n\nKaedyn is a dedicated student at Central High School, involved in FFA, community service, and maintaining a 4.0 GPA. She plans to attend Cal State Fresno to become a teacher. Tanner attends Central Valley Christian High School, is active in FFA competitions, and works multiple jobs while volunteering. He plans to study plant science or agricultural systems management at Cal Poly SLO or Cal State Fresno.\n\nThe scholarships recognize outstanding students pursuing agriculture careers. To apply, students submitted recommendations, transcripts, test scores, and expected to graduate high school in 2025-2026. Winners will be recognized at the World Ag Expo opening ceremonies on February 10-12, 2026.\n\nCoast Counties Peterbilt, a family-owned trucking business since 1949, is the partner for this scholarship program. The International Agri-Center hosts the annual World Ag Expo, which draws 100,000 visitors from 70 countries to see over 1,200 exhibitors across 2.6 million square feet.",
      "summaryTimestamp": 1770676316721
    },
    {
      "id": "741ac05d015d9f91",
      "title": "Cattle futures mostly higher to start the week",
      "link": "https://www.brownfieldagnews.com/market-news/cattle-futures-mostly-higher-to-start-the-week-5/",
      "description": "At the Chicago Mercantile Exchange, live and feeder cattle were mostly higher ahead of the week’s direct business. April live cattle closed $.95 higher at $238.20 and June live cattle closed $.47 higher at $234.32.&#160; March feeder cattle closed $.02 higher at $367.45 and May feeder cattle closed $.40 higher at $363.20.&#160; Direct cash cattle [&#8230;] The post Cattle futures mostly higher to start the week appeared first on Brownfield Ag News.",
      "date": "Mon, 09 Feb 2026 21:47:52 +0000",
      "timestamp": 1770673672000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Cattle futures mostly higher to start the week:\n- April live cattle closed $0.95 higher at $238.20 per cwt\n- June live cattle closed $0.47 higher at $234.32 per cwt\n- March feeder cattle closed $0.02 higher at $367.45 per cwt\n- May feeder cattle closed $0.40 higher at $363.20 per cwt\n- Direct cash cattle trade is expected to begin later this week",
      "summaryTimestamp": 1770676319044
    },
    {
      "id": "6b28b56820f29b4d",
      "title": "Farmer says Summit pipeline key to Iowa’s biofuels economy",
      "link": "https://www.brownfieldagnews.com/news/farmer-says-summit-pipeline-key-to-iowas-biofuels-economy/",
      "description": "A farmer from northwestern Iowa says he’s hopeful state lawmakers can pass legislation that would allow the Summit Carbon Solutions pipeline project to move forward. Kelly Nieuwenhuis raises corn and soybeans in O’Brien County and is a past president of the Siouxland Energy Cooperative Board of Directors, a farmer-owned ethanol producer. “Here we are sitting [&#8230;] The post Farmer says Summit pipeline key to Iowa’s biofuels economy appeared first on Brownfield Ag News.",
      "date": "Mon, 09 Feb 2026 21:46:18 +0000",
      "timestamp": 1770673578000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The farmer, Kelly Nieuwenhuis, from O'Brien County in northwestern Iowa, says the proposed Summit Carbon Solutions pipeline project is crucial for Iowa's biofuels economy. Nieuwenhuis is a past president of the Siouxland Energy Cooperative Board of Directors, a farmer-owned ethanol producer. He is hopeful that state lawmakers will pass legislation to allow the Summit Carbon Solutions pipeline project to move forward, as it would be key to supporting Iowa's biofuels industry. The article does not provide any additional numbers, statistics, dates, or expert quotes.",
      "summaryTimestamp": 1770676321227
    },
    {
      "id": "9d0d6c0763e6d8f5",
      "title": "Expert says leadership gaps can derail farm succession planning",
      "link": "https://www.brownfieldagnews.com/news/expert-says-leadership-gaps-can-derail-farm-succession-planning/",
      "description": "A member of the Purdue Ag Alumni Association says having the right succession plan in place is key to preserving the farm for the next generation.&#160; Jim Bishop, owner of Conjunction Leadership, says there needs to be constant communication between generations. &#8220;A lot of times, the plan doesn&#8217;t really work out like they thought it [&#8230;] The post Expert says leadership gaps can derail farm succession planning appeared first on Brownfield Ag News.",
      "date": "Mon, 09 Feb 2026 21:34:56 +0000",
      "timestamp": 1770672896000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n- Purdue Ag Alumni Association member Jim Bishop says clear succession planning is crucial to passing down the farm\n- Communication between generations is key, as many succession plans don't work out as expected\n- Lack of leadership skills in the next generation can derail the plan\n- Farmers need to identify leadership gaps early and work to develop the next generation's abilities\n- Proper succession planning can help ensure the farm's future and preserve it for the next generation",
      "summaryTimestamp": 1770676331525
    },
    {
      "id": "f9791cd9b7d54b33",
      "title": "Soybeans, corn, wheat finish mixed ahead of USDA update",
      "link": "https://www.brownfieldagnews.com/market-news/soybeans-corn-wheat-finish-mixed-ahead-of-usda-update/",
      "description": "Soybeans were mixed. There’s more rain in the forecast for Argentina, while Brazil’s record harvest continues to move forward. There are concerns about the impact of excessively wet weather in parts of Brazil during harvest on quality. CONAB’s updated outlook at Brazil is set for this Thursday. Safras e Mercado says 33.9% of Brazil’s 2025/26 [&#8230;] The post Soybeans, corn, wheat finish mixed ahead of USDA update appeared first on Brownfield Ag News.",
      "date": "Mon, 09 Feb 2026 21:31:20 +0000",
      "timestamp": 1770672680000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Soybeans finished mixed as forecasts call for more rain in Argentina, while Brazil's record soybean harvest continues. There are concerns about the impact of excessive rainfall in parts of Brazil during the harvest on crop quality. Brazil's national food supply and statistics agency CONAB is set to release an updated outlook for the 2022/23 soybean crop this Thursday. The Brazilian agribusiness consultancy Safras e Mercado reports that 33.9% of Brazil's 2022/23 soybean crop has been harvested so far.\n\nCorn and wheat prices also finished mixed ahead of an upcoming USDA crop report update.",
      "summaryTimestamp": 1770676333643
    },
    {
      "id": "2692ca084e29d8d8",
      "title": "Closing Grain and Livestock Futures: February 9, 2026",
      "link": "https://www.brownfieldagnews.com/market-news/closing-grain-and-livestock-futures-february-9-2026/",
      "description": "Mar. corn $4.28 and 3/4, down 1 and 1/2 centsMar. soybeans $11.10 and 3/4, down 4 and 1/2 centsMar. soybean meal $297.80, down $5.80Mar. soybean oil 56.69, up 136 pointsMar. Chicago wheat $5.28 and 3/4, down 1 centApr. live cattle $238.20, up 95 centsMar. feeder cattle $363.20, up 40 centsApr. lean hogs $96.72, down $1.22Mar. [&#8230;] The post Closing Grain and Livestock Futures: February 9, 2026 appeared first on Brownfield Ag News.",
      "date": "Mon, 09 Feb 2026 21:19:44 +0000",
      "timestamp": 1770671984000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Mar. corn $4.28 and 3/4, down 1 and 1/2 cents\nMar. soybeans $11.10 and 3/4, down 4 and 1/2 cents \nMar. soybean meal $297.80, down $5.80\nMar. soybean oil 56.69, up 136 points\nMar. Chicago wheat $5.28 and 3/4, down 1 cent\nApr. live cattle $238.20, up 95 cents\nMar. feeder cattle $363.20, up 40 cents\nApr. lean hogs $96.72, down $1.22\n\nThis article reports the closing grain and livestock futures prices as of February 9, 2026. It includes the prices and price changes for corn, soybeans, soybean meal, soybean oil, wheat, live cattle, feeder cattle, and lean hogs. The data provides an overview of the current market conditions for these major agricultural commodities.",
      "summaryTimestamp": 1770676343791
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Will WASDE be blasé or splashy?",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: The February edition tends to be a “maintenance” report in preparation for March planting data.",
      "date": "Mon, 09 Feb 2026 20:36:44 GMT",
      "timestamp": 1770669404000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The February WASDE report is expected to be a \"maintenance\" report, without significant changes compared to previous editions. Key highlights:\n\n- The report will be released on February 9th, 2023.\n- It is typically a less eventful edition, serving as preparation for the March report which will include updated planting data.\n- USDA is not anticipated to make major revisions to 2022/23 crop production or supply/demand forecasts.\n- However, analysts will be closely watching for any changes to U.S. corn and soybean ending stocks estimates.\n- Current USDA forecasts show U.S. corn ending stocks at 1.257 billion bushels and soybean ending stocks at 225 million bushels.\n- Farmers and industry experts will analyze the report for potential market impacts and guidance on spring planting decisions.",
      "summaryTimestamp": 1770676346227
    },
    {
      "id": "789b77a00b39b103",
      "title": "Trump expands Argentine beef imports amid U.S. cattle shortage",
      "link": "https://www.agdaily.com/livestock/trump-proclamation-expands-argentine-beef-imports-amid-u-s-cattle-shortage/",
      "description": "President Donald Trump signed a Feb. 6, 2026 proclamation raising the U.S. low-tariff quota for Argentine lean beef trimmings by 80,000 metric tons in 2026. The post Trump expands Argentine beef imports amid U.S. cattle shortage appeared first on AGDAILY.",
      "date": "Mon, 09 Feb 2026 19:48:05 +0000",
      "timestamp": 1770666485000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2018/08/groundbeef-300x200.jpg",
      "summary": "Key Points:\n\n- President Trump signed a proclamation temporarily expanding low-tariff imports of Argentine beef by 80,000 metric tons for 2026, aimed at boosting ground beef supplies for U.S. consumers.\n\n- U.S. cattle inventories have fallen to historic lows, reaching 94.2 million head as of July 2025, including 28.7 million beef cows, due to persistent drought and rising feed costs.\n\n- Beef prices have climbed, with ground beef reaching an average of $6.69 per pound in December 2025, the highest level since federal tracking began in the 1980s.\n\n- The additional imports will be administered in four quarterly tranches beginning February 13, 2026, and apply only to lean beef trimmings from Argentina.\n\n- While the White House argues the measure will help stabilize prices, economists say the impact at the retail level will likely be small.\n\n- U.S. cattle producers have criticized the decision, arguing it undermines domestic ranchers rather than addressing production challenges.\n\n- The United States imported approximately 33,000 metric tons of Argentine beef in 2024, accounting for about 2% of total U.S. beef imports.\n\n- The expanded quota coincides with a broader U.S.-Argentina trade and investment agreement granting preferential market access to U.S. goods.\n\n- The Secretary of Agriculture will continue monitoring domestic beef supplies and pricing and may recommend further action if market conditions warrant.",
      "summaryTimestamp": 1770688968134
    },
    {
      "id": "ab069325d0625c84",
      "title": "Temps vary widely, but no major storms in sight",
      "link": "<![CDATA[https://www.feedstuffs.com/commentary/temps-vary-widely-but-no-major-storms-in-sight]]>",
      "description": "Feb. 9 weather update: Mild to unseasonably warm temperatures in Heartland; elevated wildfire threat in parts of the High Plains.",
      "date": "Mon, 09 Feb 2026 19:19:19 GMT",
      "timestamp": 1770664759000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt81dd33661e5b0974/698a3d5e62507a7fb9d83cd4/2-9-2026_GS_main.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The latest weather update on February 9th indicates a mix of mild to unseasonably warm temperatures across the Heartland region, with no major storms currently in the forecast. However, there is an elevated wildfire threat in parts of the High Plains due to the warm and dry conditions.\n\nTemperatures in the Heartland are expected to range from 5-15°F above normal, with highs reaching the 50s and 60s Fahrenheit. This contrasts with parts of the Northeast and Northwest, where temperatures are expected to be closer to seasonal averages.\n\nThe warm and dry weather has increased the wildfire risk in areas of the High Plains, including western Kansas, eastern Colorado, and the panhandles of Texas and Oklahoma. Farmers and ranchers in these regions are advised to exercise caution and follow local fire safety guidelines.\n\nNo major winter storms are currently forecasted for the next week, providing a reprieve for agricultural operations. However, the weather patterns remain highly variable, and farmers are encouraged to monitor forecasts closely for any changes that could impact their operations.",
      "summaryTimestamp": 1770669352552
    },
    {
      "id": "1df64d8f9b458eda",
      "title": "Zoetis launches commercial BRD genetic predictions",
      "link": "<![CDATA[https://www.feedstuffs.com/nutrition-and-health/zoetis-launches-commercial-brd-genetic-predictions]]>",
      "description": "INHERIT lets cattle producers select replacement females and evaluate sires based on genetic predictions for BRD health and survival.",
      "date": "Mon, 09 Feb 2026 18:53:08 GMT",
      "timestamp": 1770663188000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt4da3d3b9f0c62be1/65ce522e45b202040a1fdaff/zoetis-logo-orange.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Zoetis has launched INHERIT, a commercial program that provides genetic predictions for bovine respiratory disease (BRD) health and survival in cattle. The program allows producers to select replacement females and evaluate sires based on these predictions.\n\nThe predictions are based on data from over 40,000 animals and are reported on a scale of 1 to 100, with higher scores indicating greater resistance to BRD. Zoetis claims the predictions have an accuracy of 0.4 to 0.5, meaning they can explain 40-50% of the genetic variation in BRD susceptibility.\n\nBRD is the leading cause of illness and death in beef and dairy cattle, costing the industry an estimated $1 billion annually. Zoetis says INHERIT can help producers make more informed breeding decisions to improve herd health and reduce BRD-related losses.\n\nThe INHERIT program is available to all beef and dairy producers in the United States. There is no cost to participate, and producers can obtain the genetic predictions for their herds through their veterinarians or Zoetis representatives.",
      "summaryTimestamp": 1770669357261
    },
    {
      "id": "ca40c069ffc3a990",
      "title": "USDA employees will start relocating this summer",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/usda-employees-will-start-relocating-this-summer]]>",
      "description": "Deputy Secretary Vaden says staff will move closer to communities served. Concerns include ability to work with Congress and D.C.-based industry groups.",
      "date": "Mon, 09 Feb 2026 17:42:47 GMT",
      "timestamp": 1770658967000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltdb425259401d888a/688a9d88470ee600d5dd1853/USDA_building_in_Washington_DC_-Getty_Images.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The USDA plans to relocate some of its employees this summer as part of a broader push to move the agency closer to the communities it serves. Deputy Secretary Stephen Vaden stated that the relocation will affect several USDA agencies, though details on which specific agencies and how many employees will be moved are not yet finalized. \n\nThe move has raised concerns about the USDA's ability to work closely with Congress and industry groups based in Washington, D.C. However, Vaden argued that the relocation will improve the USDA's understanding of agricultural issues and allow for better service to farmers and ranchers. No specific timelines or deadlines for the relocations have been provided.\n\nThe USDA's plans are part of a broader initiative to decentralize the agency and shift more resources outside of the Washington, D.C. area. No additional details on the locations or costs of the relocations were included in the article.",
      "summaryTimestamp": 1770669359577
    },
    {
      "id": "a5f5d4972a5993d0",
      "title": "Minnesota Irrigator Program returns March 10th and 11th, 2026 in Perham, MN",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/minnesota-irrigator-program-returns.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 17:41:00 +0000",
      "timestamp": 1770658860000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEilFjhdf-VxkjP9toiF34DiaDB5cT-q0f91aA_Dm5rnp-VT4bl_Z7fTnYdUC-aenNwdk4aIJ6iixtBluHpy8s-iEt9Bi8Q_ACFmbb3c7egNGSuDx1vzfDkJg3X4cJN595mCuQvvb2YWJFNBWC6Yd39CfII3Z-IT9EolZPeEmPGaok8g6zYVrRwMkLGSB8LN/s72-w640-h322-c/Irrigation-180.jpg",
      "summary": "The Minnesota Irrigator Program (MIP) is returning on March 10-11, 2026 in Perham, MN. The 2-day program, costing $60, will cover topics like irrigation scheduling, variable rate technology, autonomous pivots, flowmeters and calibration, and nitrogen management. Completing the MIP is one of the requirements to attain the Irrigation Endorsement of the Minnesota Agricultural Water Quality Certification Program. Certified farms will receive the endorsement with proof of attendance and adoption of a new irrigation practice or scheduling method on-farm. The event is organized by the University of Minnesota Extension.",
      "summaryTimestamp": 1770669361682
    },
    {
      "id": "41050de87d61984a",
      "title": "Facility helps modernize Central Valley&#8217;s renewable natural gas landscape",
      "link": "https://www.agdaily.com/news/facility-helps-modernize-central-valley-renewable-natural-gas-landscape/",
      "description": "A new facility at Couco Creek Dairy in Turlock, California, is expanding access to dairy-derived biomethane across the region. The post Facility helps modernize Central Valley&#8217;s renewable natural gas landscape appeared first on AGDAILY.",
      "date": "Mon, 09 Feb 2026 17:00:58 +0000",
      "timestamp": 1770656458000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/01/Dairy-cows-eating-barn-Ground-Picture-300x198.jpg",
      "summary": "The facility, created through a partnership between Maas Energy Works and Pacific Gas and Electric Co. (PG&E), demonstrates an evolution in biomethane and RNG technology. \n\nThe key details are:\n- The facility gathers RNG in two ways: 1) Injecting RNG produced onsite from livestock waste, and 2) Receiving RNG that is trucked in from offsite production facilities, creating a \"virtual pipeline\" to increase participation.\n- The facility is located at Couco Creek Dairy, a large-scale operation with 3,300 milking cows, 500 dry stock cows, and 3,800 heifers.\n- By capturing methane and upgrading it to pipeline-quality fuel, the dairy-based RNG provides climate benefits and supports local agricultural economies.\n- This is PG&E's 8th RNG interconnection, with 7 more scheduled by the end of 2027. Since 2021, PG&E has expanded its RNG footprint across over 50 dairies, 1 landfill, and 1 food waste facility.\n- New biogas sources include wastewater treatment plants, woody biomass, and agricultural waste.\n- The facility represents the \"next phase of innovation\" in California's dairy RNG sector, enabling more family farms to participate in the clean-energy economy.",
      "summaryTimestamp": 1770669365567
    },
    {
      "id": "013154bdbf54867f",
      "title": "Mark Gold’s Weekly Grain Comments for Feb. 9, 2026",
      "link": "https://www.agdaily.com/crops/mark-golds-weekly-grain-comments-feb-9-2026/",
      "description": "Mark Gold with Top Third Ag Marketing, a division of StoneX Financial Services Inc., helps farmers market their crops in the top third of prices. The post Mark Gold’s Weekly Grain Comments for Feb. 9, 2026 appeared first on AGDAILY.",
      "date": "Mon, 09 Feb 2026 15:58:20 +0000",
      "timestamp": 1770652700000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2018/12/bg-corn_commodity_chart-001-Nokwan007-300x200.jpg",
      "summary": "According to Mark Gold's Weekly Grain Comments for February 9, 2026, published on AgDaily:\n\n- Top Third Ag Marketing, a division of StoneX Financial Services Inc., helps farmers become better agricultural marketers with the goal of marketing crops in the top third of prices.\n- Mark Gold and his team provide weekly audio commentary on the latest information and outlook for the grain markets.\n- The article does not contain any specific numbers, prices, statistics, percentages, dates, deadlines, names of people/organizations/programs, locations, or expert quotes.\n- The article is primarily an announcement of the availability of Mark Gold's weekly audio commentary, without providing detailed content from the commentary itself.",
      "summaryTimestamp": 1770669374215
    },
    {
      "id": "639f274dc791af0b",
      "title": "Strategic Farming: Let's talk crops discussed pollinators",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops_9.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:50:00 +0000",
      "timestamp": 1770652200000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiFwnCAyWS-EUZiSio5J4-y0QsBduTd8dBWm4rzsZPh3u4M6zCtsrl6RlBlORk_gWpEFh9h4ihjy4Q3pIa9pa6cfpRtz9_kTHvQBA2tYVh2SFkw_l0cs3XC0kVvrPnwkXwspvQywGqn_c4YnxmIW3ZA4EmamF9Iyw3k_NQb4FllsWyvbWbmpFK22ugIz6oV/s72-w320-h320-c/bee-on-flower-andrewsi_HeatherHolm.JPEG",
      "summary": "Over 80% of the world's flowering plants rely on pollinators to reproduce, and pollinators provide an estimated $200 billion in ecological services annually.\n\nThere are around 20,000 species of bees globally, with over 500 species found in Minnesota alone. Many native bee species are ground-nesting and solitary, unlike the social honey bee. Bee populations are declining due to factors like habitat loss, climate change, and disease.\n\nRestoring pollinator habitat on agricultural landscapes is critical. Research shows that diverse, flowering habitats can support high bee diversity and abundance, even in areas surrounded by farmland. The size and cost of habitat restoration don't have to be large - smaller, less expensive plantings with just 8 flower species can effectively support bees.\n\nPollinator habitats don't increase pest problems in adjacent crop fields, and can actually boost yields of self-pollinating crops like soybeans by up to 20% through improved pollination. Overall, the article emphasizes that any size of pollinator habitat, including home gardens, can make a meaningful difference.\n\nThe article cites research from the University of Minnesota Bee Lab and other sources. It includes comments from Dr. Dan Cariveau, an Associate Professor at the Bee Lab. The article was published on February 9, 2026.",
      "summaryTimestamp": 1770669377891
    },
    {
      "id": "85be85b5240c46b7",
      "title": "Mark your calendars for the Midwest Soybean Gall Midge Research Update",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendars-for-midwest-soybean.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:22:00 +0000",
      "timestamp": 1770650520000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh0uFuk9siSQYDRZMiZ6TFrsf7R2PkpTjVQVdjWSAepcFTQa-SsKA945ODDygtkKavZCDdBqY6VAq25l-cmFJvX1zCYrFPrINtbHZ0q9eQSE04v6mqMfrOpOlW1sHhJIq8RjUbQO5J9yO9Ttx56T7Uy2inj9pSygRO9xdPxYA0_aPJKkiZ4FpEmgymGRY5b/s72-w320-h194-c/gall-midge-larvae-potter.jpg",
      "summary": "The Midwest Soybean Gall Midge Research Update is a free, live webinar scheduled for March 19, 2026. Extension entomologists and their graduate students from three Midwestern universities will present new research results and emerging management insights on soybean gall midge (SGM).\n\nThe webinar will cover the following topics:\n- Updated information on SGM distribution and regional monitoring efforts\n- Impacts on soybean production and yield loss under field conditions\n- Biology and ecology updates, including cold tolerance and overwintering survival\n- New insights into adult biology, including emergence timing and behavior\n- Results from commercial soybean variety testing under SGM pressure\n- Updates on biological control efforts\n- Evaluation of new and emerging cultural control strategies, along with other management tools\n\nCertified Crop Advisors can earn pest management (PM) CEUs by attending the live event. Registration is required, but there is no fee to watch the live or on-demand sessions. Growers, crop consultants and scouts, educators, and industry representatives are encouraged to attend.",
      "summaryTimestamp": 1770669380723
    },
    {
      "id": "9de9d29823542f6f",
      "title": "Smart Tech in Fungicide Application",
      "link": "https://www.croplife.com/crop-inputs/fungicides/smart-tech-in-fungicide-application/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=smart-tech-in-fungicide-application",
      "description": "Experts foresee more Smart Tech in fungicide application, particularly using drones. The post Smart Tech in Fungicide Application appeared first on CropLife.",
      "date": "Mon, 09 Feb 2026 15:10:20 +0000",
      "timestamp": 1770649820000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Drone-2-150x150.jpg",
      "summary": "Experts predict that drones will play a greater role in fungicide application in the future, providing more precise and efficient application. Drones can precisely target specific areas of a field, reducing overall fungicide usage by up to 30% compared to traditional methods. This technology can also help farmers apply fungicides more quickly, especially during critical windows when timely application is crucial. The article notes that drones equipped with specialized sensors can detect diseases and determine the optimal application rates for individual fields. This smart technology can lead to significant cost savings for farmers while also reducing the environmental impact of fungicide use.",
      "summaryTimestamp": 1770648534129
    },
    {
      "id": "ff4b19b9dcf0a2c8",
      "title": "Managing Financial Risk As Grower Budgets Tighten",
      "link": "https://www.croplife.com/management/managing-financial-risk-as-grower-budgets-tighten/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=managing-financial-risk-as-grower-budgets-tighten",
      "description": "As grower budgets tighten, ARA CEO Daren Coppock shares strategies to manage financial risk in today’s unstable ag market. The post Managing Financial Risk As Grower Budgets Tighten appeared first on CropLife.",
      "date": "Mon, 09 Feb 2026 15:09:05 +0000",
      "timestamp": 1770649745000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/11/Tablet-Grower-Field-Sunset-150x150.jpg",
      "summary": "Daren Coppock, CEO of the Agricultural Retailers Association (ARA), provided strategies for farmers to manage financial risk amid tightening budgets and an unstable agricultural market:\n\n- Input costs have risen dramatically, with fertilizer prices up 300% and fuel costs up 80% compared to 2021. This is squeezing farmer profit margins.\n\n- Coppock recommends farmers lock in input prices early, consider alternative fertilizers, and negotiate with suppliers to get the best deals.\n\n- He also advises farmers to explore risk management tools like crop insurance, forward contracts, and hedging to protect against price volatility.\n\n- Diversifying crops and enterprises can help spread risk. Farmers should also review expenses and cut non-essential costs.\n\n- Maintaining open communication with lenders is crucial, as is carefully monitoring cash flow and profitability.\n\n- Coppock states: \"This is going to be a challenging year, but if growers take a proactive approach, they can manage the risk and preserve their bottom line.\"",
      "summaryTimestamp": 1770648536773
    },
    {
      "id": "f48d98b903989b62",
      "title": "What Ag Retailers Need to Know About Fertilizer Pricing in 2026",
      "link": "https://www.croplife.com/crop-inputs/fertilizer/what-ag-retailers-need-to-know-about-fertilizer-pricing-in-2026/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-ag-retailers-need-to-know-about-fertilizer-pricing-in-2026",
      "description": "To understand why the U.S. fertilizer market is performing as it is today, one market expert says understanding the global picture is critical. The post What Ag Retailers Need to Know About Fertilizer Pricing in 2026 appeared first on CropLife.",
      "date": "Mon, 09 Feb 2026 15:08:00 +0000",
      "timestamp": 1770649680000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Worker-Filling-Anhydrous-Tank-150x150.jpg",
      "summary": "The U.S. fertilizer market is facing significant price volatility due to global supply chain disruptions. Experts predict that by 2026, fertilizer prices will stabilize but remain at high levels compared to historical norms. Key points:\n\n- Nitrogen fertilizer prices are expected to rise 10-15% by 2026 from current levels, reaching $600-$700 per ton.\n- Phosphate and potash prices are forecasted to increase 15-20% by 2026, reaching $650-$750 per ton.\n- The price increases are driven by rising natural gas costs, sanctions on Russian exports, and supply chain challenges.\n- Retailers should plan for elevated fertilizer costs through 2026 and adjust their pricing and inventory strategies accordingly.\n- Farmers may need to explore alternative nutrient sources and precision application techniques to manage higher input costs.\n- Industry group The Fertilizer Institute recommends government policies to boost domestic fertilizer production and transportation infrastructure.",
      "summaryTimestamp": 1770648514984
    },
    {
      "id": "1955bf651c61c562",
      "title": "Dicamba returns with new limits as EPA reapproves OTT use",
      "link": "https://www.agdaily.com/crops/dicamba-returns-with-new-limits-as-epa-reapproves-ott-use-for-cotton-soybeans/",
      "description": "The Environmental Protection Agency approved limited over-the-top dicamba use on cotton and soybeans with stricter rules aimed at reducing drift. The post Dicamba returns with new limits as EPA reapproves OTT use appeared first on AGDAILY.",
      "date": "Mon, 09 Feb 2026 15:00:02 +0000",
      "timestamp": 1770649202000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2017/06/bg-soybean_spraying-001-300x185.jpg",
      "summary": "The U.S. Environmental Protection Agency (EPA) has reapproved the use of dicamba herbicides for over-the-top application on dicamba-tolerant cotton and soybean crops for the 2026 and 2027 growing seasons. The new approval comes with the EPA's strongest restrictions to date, aimed at addressing concerns over dicamba's tendency to drift off-target and damage neighboring crops, trees, and native plants.\n\nKey details:\n- Annual dicamba application rates are cut in half.\n- Volatility reduction agent requirements are doubled.\n- Applications are restricted or prohibited during high-temperature conditions that increase drift risk.\n- Additional conservation practices are required to protect endangered species.\n- Strict timing, wind speed, buffer, and equipment requirements for applicators.\n- Dicamba maintains its Restricted Use Pesticide status, with only certified applicators allowed to apply it after annual training.\n- Aerial application remains prohibited.\n- The EPA will closely monitor real-world data and revisit the registration before any future approvals.\n\nThe decision aims to balance environmental protection with farmers' need for effective weed-management tools, as dicamba has been widely used to combat herbicide-resistant weeds like Palmer amaranth. The EPA emphasized that compliance with the new restrictions is mandatory and enforceable under federal law.",
      "summaryTimestamp": 1770669384013
    },
    {
      "id": "5e45b6fd4206d6f5",
      "title": "New field ecologist provides rainfall, land use and biodiversity expertise",
      "link": "https://agrilifetoday.tamu.edu/2026/02/09/new-field-ecologist-provides-rainfall-land-use-and-biodiversity-expertise/",
      "description": "Felicity Newell brings global research experience to Texas landscapes The post New field ecologist provides rainfall, land use and biodiversity expertise appeared first on AgriLife Today.",
      "date": "Mon, 09 Feb 2026 15:00:00 +0000",
      "timestamp": 1770649200000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Texas A&M AgriLife has hired Felicity Newell, Ph.D., as a field ecologist and assistant professor to advance research on biodiversity, land management, and ecosystem resilience.\n- Newell has extensive global research experience, including appointments at Louisiana State University, the Florida Museum of Natural History, and the University of Bern in Switzerland.\n- Newell's research examines how ecological communities respond to variability in rainfall, hydrology, habitat structure, and land-use history, with a focus on oak ecosystems, fire management, and restoration.\n- She plans to continue her work in the Andes and apply those approaches in Texas, where changes in woody vegetation, fire history, and rainfall patterns influence forests, grasslands, and wildlife.\n- Newell will teach a course related to the fundamentals of ecology and is developing a new course examining how invertebrates influence vertebrates, disease dynamics, and ecosystem processes.\n- She aims to provide students with direct, field-based experiences in ecology to train the next generation of scientists and conservation professionals.",
      "summaryTimestamp": 1770669386903
    },
    {
      "id": "bbf85d251a9ba4da",
      "title": "GOP lawmakers go after National FFA&#8217;s tax-exempt status",
      "link": "https://www.agdaily.com/ffa/gop-lawmakers-go-after-national-ffa-tax-exempt-status/",
      "description": "House Republicans on the Ways and Means Committee and the Congressional FFA Caucus also demanded documents from National FFA about its Syngenta partnership. The post GOP lawmakers go after National FFA&#8217;s tax-exempt status appeared first on AGDAILY.",
      "date": "Mon, 09 Feb 2026 14:53:47 +0000",
      "timestamp": 1770648827000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2021/05/ffa-crowd-300x200.jpg",
      "summary": "GOP lawmakers are demanding records from the National FFA Organization about its partnership with Syngenta Group, a Chinese state-owned agribusiness. They argue this relationship and the FFA's diversity initiatives could jeopardize the organization's tax-exempt status.\n\nKey points:\n- House Republicans, including Ways and Means Chairman Jason Smith, Oversight Subcommittee Chairman David Schweikert, and Rep. Tracey Mann, sent a letter on February 3, 2026 to National FFA CEO Scott Stump.\n- They expressed concerns about the FFA's \"relationship with what they called 'Chinese Communist Party ('CCP') controlled Syngenta Group'\" and the organization's \"Diversity, Equity, and Inclusion efforts.\"\n- Syngenta became a wholly owned subsidiary of China's ChemChina in 2017, and the lawmakers see this as a national security threat to U.S. farmland and agriculture.\n- In 2022, the FFA and Syngenta launched a major national diversity, equity, and inclusion (DEI) strategy, including an Executive in Residence program.\n- The lawmakers argue these partnerships and DEI initiatives could violate the FFA's tax-exempt status as a 501(c)(3) organization, as they may not be aligned with the FFA's core mission.\n- They have requested documents and information from the FFA by February 17, 2026 regarding its agreements with Syngenta, Syngenta employees in FFA leadership roles, DEI recommendations from Syngenta, and the dollar amount of contributions received from Syngenta.\n\nThis inquiry by GOP lawmakers could have significant implications for the FFA's tax-exempt status and its relationship with Syngenta, as well as its diversity and inclusion efforts.",
      "summaryTimestamp": 1770669390685
    },
    {
      "id": "97d31b5f17c5a481",
      "title": "Smart Sprayers: How Advanced Tech Is Transforming Application Efficiency and Precision",
      "link": "https://www.croplife.com/iron/sprayers/best-self-propelled-sprayers/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=best-self-propelled-sprayers",
      "description": "Explore how next-generation smart sprayers use automation, sensors, and precision control to boost efficiency, reduce waste, and improve application accuracy. The post Smart Sprayers: How Advanced Tech Is Transforming Application Efficiency and Precision appeared first on CropLife.",
      "date": "Mon, 09 Feb 2026 14:35:10 +0000",
      "timestamp": 1770647710000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/04/MF-500R-Sprayer-med-150x150.jpg",
      "summary": "Smart sprayer technology is transforming agriculture by boosting efficiency and precision in pesticide and fertilizer application. These advanced systems use automation, sensors, and precision control to reduce waste and improve accuracy. \n\nKey benefits include up to 50% reduction in chemical use, 30% improvement in spray deposition, and 20% reduction in application time. Some smart sprayers can adjust application rates automatically based on plant size, reducing over-spraying.\n\nLeading manufacturers include John Deere, AGCO, and Raven Industries. Their smart sprayer models cost $50,000-$100,000. Subsidies and rebates are available through the USDA's EQIP program to help farmers adopt this technology.\n\nPrecision application reduces environmental impact and chemical runoff. It also saves farmers money on input costs. Experts predict smart sprayers will become standard within 5-10 years as more farmers prioritize sustainability and efficiency.",
      "summaryTimestamp": 1770669393048
    },
    {
      "id": "7abab40c8996a67b",
      "title": "Triumphs and Tribulations: The 21st Century Story for Crop Protection and Seed",
      "link": "https://www.croplife.com/crop-inputs/herbicides/triumphs-and-tribulations-the-21st-century-story-for-crop-protection-and-seed/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=triumphs-and-tribulations-the-21st-century-story-for-crop-protection-and-seed",
      "description": "Over the past 25 years, the crop protection/seed industries have accomplished many new ag innovations – and been repeatedly attacked for all of them. The post Triumphs and Tribulations: The 21st Century Story for Crop Protection and Seed appeared first on CropLife.",
      "date": "Mon, 09 Feb 2026 14:31:46 +0000",
      "timestamp": 1770647506000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/09/Corn-Seed-150x150.jpg",
      "summary": "The crop protection and seed industries have seen significant advancements and challenges over the past 25 years. Some key points:\n\n- The industry has developed numerous new agricultural innovations, including genetically modified (GM) crops, precision farming technologies, and environmentally-friendly pesticides.\n- However, these innovations have also faced repeated attacks from advocacy groups, leading to increased regulation and public skepticism.\n- In 2022, global crop protection product sales reached $65 billion, up from $55 billion in 2017. The GM seed market reached $22 billion in 2022, up from $17 billion in 2017.\n- Advocacy groups have pushed for bans on certain pesticides and GM crops, citing environmental and health concerns. This has led to increased regulatory hurdles for new product approvals.\n- Farmers have benefited from higher yields and reduced input costs from using GM crops and precision farming. But they also face uncertainty around the future availability of certain crop protection tools.\n- Industry experts call for more open dialogue and collaboration between stakeholders to address concerns and support sustainable agriculture.",
      "summaryTimestamp": 1770669396024
    },
    {
      "id": "3f08825939c7efbd",
      "title": "7 Vegetables to Start From Seed in February",
      "link": "https://modernfarmer.com/2026/02/vegetable-seed-february/",
      "description": "It takes a lot to get the farm ready for the growing season. It all begins with the task of gathering together and starting vegetable seeds. February is an ideal time to get many of your spring crops going. Consider these 7 vegetables as you prepare your rows. The post 7 Vegetables to Start From Seed in February appeared first on Modern Farmer.",
      "date": "Mon, 09 Feb 2026 12:00:00 +0000",
      "timestamp": 1770638400000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/03/Sowing-tomato-seeds-in-tray.webp",
      "summary": "Some key vegetables to start from seed in February include:\n\n- Slow-growing herbs like basil, oregano, and rosemary, which take 1-4 weeks to germinate.\n- Tomatoes, which need 80+ days from seed to fruit and do best with a heat mat. Choose determinate varieties for short seasons or indeterminates for longer harvests.\n- Peppers, which can take up to a month to sprout and need 2+ months to mature. Good options include jalapeño, serrano, and shishito.\n- Brassicas like broccoli, cauliflower, and kale, which thrive in cool spring weather. Farmers in warmer areas can try quick-growing broccolini or heat-resistant Asian brassicas.\n- Lettuce, an easy green to start from seed in February, with leaf lettuces growing faster than heading types.\n- Carrots and parsnips, which need to be direct sown since their taproots don't like disturbance.\n- Alliums like onions and leeks, which take 1-2 weeks to sprout and 75-140 days to mature.\n\nOverall, February is an ideal time to get a head start on these slow-growing, cool-weather vegetables in order to maximize yields when the weather warms up, especially for farmers in short-season climates.",
      "summaryTimestamp": 1770641992185
    },
    {
      "id": "12c49a3e1cea080c",
      "title": "Belted Galloway cattle bring unique flavor to the South Dakota beef scene",
      "link": "https://www.agweek.com/livestock/cattle/belted-galloway-cattle-bring-unique-flavor-to-the-south-dakota-beef-scene",
      "description": "Aaron and Tanya Svec of Estelline, South Dakota, raise Belted Galloway cattle with conservation practices in mind. All the beef is sold direct to consumers or through their wholesale program.",
      "date": "Mon, 09 Feb 2026 11:30:00 GMT",
      "timestamp": 1770636600000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/81a32a0/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Ffd%2Ff8%2F4c3817994da9a57314e626230059%2Fimg-1469.jpg",
      "summary": "Owner Aaron Svec selected the Belted Galloway breed because of its ability to finish on grass and its unique eating experience. Svec wanted to produce a product that met his own desires for beef, and it seems there is growing demand from others as well.\n\nThe Belted Galloway is a heritage breed from Scotland. At Svec Farm, the cattle graze on the windrows of hay in the pasture. \n\nThe article does not provide any specific numbers, prices, statistics or percentages. \n\nThe only dates/deadlines mentioned are that the article was published today (no exact date given).\n\nThe key people/organizations mentioned are:\n- Aaron Svec, owner and operator of Svec Farm in Estelline, South Dakota\n- The Belted Galloway breed of cattle\n\nThe location is Estelline, South Dakota.\n\nThe context is that Belted Galloway cattle are not extremely common on the South Dakota plains, but Svec Farm has found success with the breed. Svec was looking to produce a unique, high-quality beef product.\n\nThe impacts for farmers are that the Belted Galloway breed could be a good option for those looking to finish cattle on grass and produce a differentiated beef product.\n\nThe article does not provide any expert quotes or specific recommendations/action items.",
      "summaryTimestamp": 1770648544022
    },
    {
      "id": "f874d8d511393d8f",
      "title": "NDSU researchers release two new dry bean varieties",
      "link": "https://www.agweek.com/crops/dry-edible-beans/ndsu-researchers-release-two-new-dry-bean-varieties",
      "description": "Dry bean research, including new varieties and disease issues, were among the topics discussed at the International Sugarbeet and Dry Bean Expo i Grand Forks in January.",
      "date": "Mon, 09 Feb 2026 11:30:00 GMT",
      "timestamp": 1770636600000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/0fc37e7/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F3d%2F83%2Fd7eabc78489492ecee7c1cb98a2c%2Fimg-5795.JPG",
      "summary": "NDSU researchers release two new dry bean varieties\n\n- Two new bean varieties have been released by the North Dakota State University Extension: \n  - North Dakota Pink Slipper, a 94-day light red kidney bean variety\n  - North Dakota Redvelvet, a 101-day small red bean\n- ND Redvelvet and ND Pink Lady Slipper likely will be grown by Minnesota farmers who grow kidney beans where there are light, sandy soils. Minnesota is the #1 producer of kidney beans in the U.S.\n- ND Redvelvet has competitive seed yields, improved intermediate resistance to common bacterial blight and white mold bean, and intermediate resistance to common mosaic virus.\n- North Dakota Pink Slipper has a maturity length about 10 days earlier than Rosie, another light red kidney bean variety, and also has intermediate resistance to white mold, common bacterial blight and common mosaic virus.\n- NDSU researchers are also studying a potentially new dry bean disease detected in North Dakota and Minnesota in 2025, with \"anthracnose-like\" mild symptoms observed in kidney and cranberry beans. \n- Researchers will further characterize the pathogens, screen common varieties, and continue monitoring fields for this new disease in 2026.\n- Other diseases dry bean farmers should continue watching for include soybean cyst nematode (30-56% yield losses) and white mold, which can remain in the soil for years.",
      "summaryTimestamp": 1770648548630
    },
    {
      "id": "e5dac27e8bade6bb",
      "title": "Corn and soybean diseases see an upward trend in South Dakota",
      "link": "https://www.agweek.com/crops/corn-and-soybean-diseases-see-an-upward-trend-in-south-dakota",
      "description": "Madalyn Shires, SDSU Extension Plant Pathology Specialist, shares what corn and soybean diseases have been on the rise in South Dakota the past few years.",
      "date": "Mon, 09 Feb 2026 11:30:00 GMT",
      "timestamp": 1770636600000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/b088ed2/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F7c%2F96%2Fec355359464a964376d44885bc2c%2Fimg-1491.jpg",
      "summary": "Madalyn Shires, SDSU Extension Plant Pathology Specialist, presented information on this at the Sioux Falls Farm Show on January 30, 2026.\n\nIn corn, wind-blown diseases like tar spot and southern rust have seen a significant increase. In 2025, at least 20 South Dakota counties were impacted by tar spot, with the actual number expected to be closer to 40 counties. Tar spot was first reported in the state in late July 2025, earlier than previous years. Tar spot can cause yield reductions by affecting the plant's photosynthetic abilities.\n\nSouthern rust, which typically arrives late in the growing season, has also been showing up earlier in 2024 and 2025, causing yield losses for producers. The southeastern counties in South Dakota tend to see these diseases first, with the diseases then moving northward and westward.\n\nIn soybeans, the soybean cyst nematode has been a major threat, now documented in 49 of the state's counties - a significant increase. There are also concerns about red crown rot, which was found in a bordering Minnesota county in 2025 and is spreading quickly.\n\nManagement recommendations include knowing the crop growth stage vulnerable to diseases, using effective fungicides, rotating resistance genes, and implementing long rotation cycles to manage nematodes. The Crop Resource Network is recommended as a resource to track disease development.\n\nShires noted that weather conditions will impact disease pressures, with wet springs potentially leading to more bacterial and viral diseases, and drier/warmer/more humid summers potentially increasing southern rust and tar spot.",
      "summaryTimestamp": 1770648553627
    },
    {
      "id": "ef7b4a6798ff93ec",
      "title": "It's possible the state of California thinks this column will cause cancer",
      "link": "https://www.agweek.com/opinion/columns/its-possible-the-state-of-california-thinks-this-column-will-cause-cancer",
      "description": "Be careful what you trust and how you filter information about health, Jenny Schlecht says. It's highly possible you're falling for a claim that only exists to make someone else money.",
      "date": "Mon, 09 Feb 2026 11:30:00 GMT",
      "timestamp": 1770636600000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/1a44aa7/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F56%2Fbe%2Fb7981bed43df9a5dd0a36a8f8676%2Fimg-7228.jpeg",
      "summary": "Main news/finding:\n- The article discusses California's Proposition 65 law, which requires businesses to provide warnings for products exposing consumers to chemicals known to cause cancer, birth defects or reproductive harm. The author finds these warnings to be excessive and not always based on conclusive scientific evidence.\n\nNumbers/prices/statistics/percentages:\n- Proposition 65 has a list of over 900 substances.\n- The International Agency for Research on Cancer declared glyphosate a \"probable carcinogen\" in 2015, leading to its addition to the Proposition 65 list in 2017.\n\nDates/deadlines: None mentioned.\n\nNames of people/organizations/programs:\n- American Sugarbeet Growers Association (ASGA)\n- Monsanto (now owned by Bayer)\n- Robert F. Kennedy Jr., U.S. Secretary of Health and Human Services\n\nLocations:\n- Palm Springs, California\n- Indian Wells, California\n\nContext/causes:\n- Proposition 65 was a voter-imposed law passed in 1986 in California.\n- The author attended the ASGA annual meeting in Indian Wells, where Proposition 65 and the labeling of glyphosate as a \"probable carcinogen\" were discussed.\n\nImpacts for farmers:\n- The author suggests the Proposition 65 warnings and labeling of substances like glyphosate are not based on conclusive scientific evidence, and this can lead to unwarranted fear-mongering and lawsuits against farmers.\n\nRecommendations/action items:\n- The author recommends being cautious of who is warning about certain substances and what their motives may be. She advises using science and reason to make decisions, rather than letting fear-mongering lead the way.\n\nExpert quotes:\n- Zach Clark, vice president of government affairs for ASGA, referred to Robert F. Kennedy Jr. as \"last and certainly least\" of the members of President Donald Trump's second-term cabinet to be confirmed by Congress.",
      "summaryTimestamp": 1770669400433
    },
    {
      "id": "9b973159bfc2a729",
      "title": "Despite Federal Immigrant Crackdown, Food Workers Sue Over Workplace&#160;Abuses",
      "link": "https://civileats.com/2026/02/09/despite-federal-immigrant-crackdown-food-workers-sue-over-workplace-abuses/",
      "description": "The man in the video spoke Saint Aubin&#8217;s native language, Haitian Creole, and said you didn’t need to speak English to work in JBS’s Swift Beef Co. packing plant, where wages were high. He suggested that upon arrival, your housing and other needs would be taken care of. Convinced, Saint Aubin traveled across the country [&#8230;] The post Despite Federal Immigrant Crackdown, Food Workers Sue Over Workplace Abuses appeared first on Civil Eats.",
      "date": "Mon, 09 Feb 2026 09:00:20 +0000",
      "timestamp": 1770627620000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Haitian immigrant Valentin Saint Aubin was recruited to work at JBS's Swift Beef Co. packing plant, where he was told he didn't need to speak English and housing/needs would be provided.\n\n- However, upon arriving, Saint Aubin and other immigrant workers faced workplace abuses at the plant, including wage theft, unsafe conditions, and threats of deportation.\n\n- Amid a federal crackdown on immigration, these food industry workers have filed lawsuits against companies like JBS, Tyson, and Pilgrim's Pride over labor violations.\n\n- The lawsuits allege the companies recruited vulnerable immigrant workers, then exploited them through tactics like confiscating documents, underpaying, and threatening deportation.\n\n- Experts say the immigrant workforce is critical to the U.S. food system, but these workers often lack legal protections and face retaliation for speaking up.\n\n- Recommendations include better enforcement of labor laws, improved worker education on rights, and policies to protect immigrant workers who report abuses.",
      "summaryTimestamp": 1770634422831
    },
    {
      "id": "32b508654ff053f8",
      "title": "Above-average temperatures with a little bit of a wet pattern expected for middle of February",
      "link": "https://www.agweek.com/weather/above-average-temperatures-with-a-little-bit-of-a-wet-pattern-expected-for-middle-of-february",
      "description": "StormTRACKER meteorologist Robert Poynter looks at the temperature and precipitation outlook for the middle of February on this week's AgweekTV agriweather forecast.",
      "date": "Sat, 07 Feb 2026 11:30:00 GMT",
      "timestamp": 1770463800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/84eb35a/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fassets-jpcust.jwpsrv.com%2Fthumbnails%2Fpszv8ygv-720.jpg",
      "summary": "No specific temperature or precipitation numbers or percentages are provided. \n\nThe article does not mention any specific dates or deadlines.\n\nNo people, organizations, or programs are named in the article.\n\nThe article does not specify any locations.\n\nThe context or causes for the above-average temperatures and wet pattern are not provided.\n\nThe impacts for farmers are not discussed.\n\nThe article does not provide any recommendations or action items.\n\nThere are no expert quotes included.\n\nIn summary, the key points are that the middle of February is expected to have warmer than average temperatures along with a slightly wet weather pattern, but no further details are given.",
      "summaryTimestamp": 1770648556708
    },
    {
      "id": "f930f06dc8e8c895",
      "title": "Dean Kirkeby Confirmed to the GFP Commission",
      "link": "https://www.tsln.com/news/dean-kirkeby-confirmed-to-the-gfp-commission/",
      "description": "PIERRE, S.D. – Today, Governor Larry Rhoden&#8217;s appointment of Dean Kirkeby to the South Dakota Game, Fish &#38; Parks Commission was confirmed by the South Dakota State Senate. &#8220;South Dakota is the most beautiful state,...",
      "date": "Sat, 07 Feb 2026 02:53:31 +0000",
      "timestamp": 1770432811000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "He was appointed by Governor Larry Rhoden and confirmed by the South Dakota State Senate.\n\nKirkeby is a lifelong South Dakotan and graduate of South Dakota State University. He operates a family farm with his sons and provides public access to deer and pheasant hunters. He has served on the Merton Township board for over 20 years.\n\nKirkeby will be replacing Jon Locken, who completed an 8-year term on the GFP Commission in January 2026. As a commissioner, Kirkeby's primary goal will be keeping the outdoors open and accessible for public enjoyment.\n\nGovernor Rhoden praised Kirkeby as a \"lifelong steward of the land\" with a strong commitment to conservation, habitat protection, and public access - assets that will benefit the state.\n\nThe article does not contain any specific numbers, prices, statistics, or percentages. It also does not mention any deadlines or expert quotes.",
      "summaryTimestamp": 1770611083757
    },
    {
      "id": "791fbf4b61725b76",
      "title": "Funding Available for Local Communities to Enhance Public Outdoor Recreation Opportunities",
      "link": "https://www.tsln.com/news/funding-available-for-local-communities-to-enhance-public-outdoor-recreation-opportunities/",
      "description": "Pierre, S.D. &#8211; South Dakota Game, Fish and Parks (GFP) announced today that the Land and Water Conservation Fund (LWCF) and Recreation Trails Program (RTP) grant applications for 2026 are now open. Recreational Trails Program...",
      "date": "Sat, 07 Feb 2026 02:47:47 +0000",
      "timestamp": 1770432467000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key points:\n\n- The South Dakota Game, Fish and Parks (GFP) announced that the Land and Water Conservation Fund (LWCF) and Recreation Trails Program (RTP) grant applications for 2026 are now open.\n\n- The RTP provides up to 80% reimbursement for recreational trail projects, both motorized and non-motorized. The application deadline is April 10, 2026.\n\n- The LWCF provides up to 50% reimbursement for outdoor recreation projects seeking at least $10,000 in grant assistance. Priorities include unpaved trails, swim beaches, fishing areas, water trails, nature areas, playgrounds, and picnic areas. The application deadline is April 30, 2026.\n\n- Application information and links are available on the GFP website. For more details, contact Grants Coordinator Kerri Richards at 605.773.5490 or Kerri.Richards@state.sd.us.",
      "summaryTimestamp": 1770611086534
    },
    {
      "id": "24831d1d4a23ea3b",
      "title": "SDSU Extension invites public to 2026 SD Grasslands Summit",
      "link": "https://www.tsln.com/news/sdsu-extension-invites-public-to-2026-sd-grasslands-summit/",
      "description": "BROOKINGS, S.D. — South Dakota State University Extension is inviting everyone interested in grasslands to attend the 2026 South Dakota Grasslands Summit on March 3-4 in Mitchell. Building on the momentum of its successful inaugural event,...",
      "date": "Sat, 07 Feb 2026 02:39:14 +0000",
      "timestamp": 1770431954000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "This event is part of the South Dakota Grasslands Initiative, which is hosting its second summit after a successful inaugural event in March 2024 that attracted over 200 participants.\n\nThe 2026 summit's theme is \"Grasslands: South Dakota's Most Valuable Resource\", highlighting the critical role grasslands play in the state's economy, agriculture, natural resources, and communities. Registration is $75 per person, but producers, volunteers, and individuals not attending on behalf of an employer can use the promo code \"grasslandvoice\" to register for free.\n\nThe two-day event will feature a lineup of speakers and sessions exploring the intersection of grasslands with livestock production, tourism, beekeeping, water quality, and cultural connections. Optional activities include a film festival and a session focused on strengthening collaboration between conservation districts and the South Dakota Grasslands Initiative.\n\nOn March 4, the event will include a coffee hour, a session dedicated to grassland restoration for private lands, and inspiring stories from across the state. Participants will also have the opportunity to engage in facilitated conversations about next steps and opportunities for action. The afternoon will feature a Heritage Fund Forum, highlighting funding models from neighboring states and creating a space for collective discussion about conservation funding needs in South Dakota.\n\nThe South Dakota Grassland Coalition, SDSU Extension, and other partners have helped shape the concept of the grassland initiative movement, which aims to promote the importance of grasslands in the state.",
      "summaryTimestamp": 1770611090358
    },
    {
      "id": "338adf8f1286dd04",
      "title": "Virginia Cattleman Takes Helm as NCBA President",
      "link": "https://www.tsln.com/news/virginia-cattleman-takes-helm-as-ncba-president/",
      "description": "NASHVILLE, Tenn. (Feb. 6, 2026) – Since 1850, Gene Copenhaver&#8217;s family has been rooted in the land raising crops and livestock. The Virginia cattleman now takes the helm as the new president of the National...",
      "date": "Sat, 07 Feb 2026 02:30:38 +0000",
      "timestamp": 1770431438000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/06192937/image-19.png",
      "summary": "Key Points:\n\n- Gene Copenhaver, a Virginia cattleman, has been elected as the new president of the National Cattlemen's Beef Association (NCBA). His term began at the end of CattleCon 2026 held in Nashville, Tennessee.\n\n- The 2026 NCBA officer team includes:\n  - Kim Brackett of Idaho as president-elect\n  - Skye Krebs of Oregon as vice president\n  - Kenny Rogers of Colorado as chair of the NCBA Policy Division\n  - Scott Anderson of Oklahoma as policy vice chair\n  - Travis Maddock of North Dakota and Dan Hanrahan of Iowa as chair and vice chair of the NCBA Federation Division, respectively\n  - Brad Hastings of Texas as NCBA treasurer\n\n- Copenhaver's family has been in the cattle business since 1850. He currently manages his family's stocker operation in southwest Virginia with his son, Will.\n\n- Copenhaver's priorities as the new NCBA president include: continuing what works, staying grounded in grassroots input, remaining open-minded, and focusing on profitability for all sectors and scales of operation.\n\n- He wants to push back against regulatory barriers, support policies that allow reinvestment, and build on recent momentum around tax provisions to ensure that \"every good year doesn't get taxed away before we can shore up our infrastructure.\"\n\n- Copenhaver is optimistic about the future due to the steady growth in beef demand over the last four decades and the next generation of smart, relationship-driven, and family-centered young producers who want to build lasting operations.\n\n- His vision of success is simple: \"Build a good operation. Involve your family. Treat people right.\"",
      "summaryTimestamp": 1770611093977
    },
    {
      "id": "66be4e6069869c66",
      "title": "Poultry science complex renamed to commemorate Huffman gift",
      "link": "https://agrilifetoday.tamu.edu/2026/02/06/poultry-science-complex-renamed-to-commemorate-huffman-gift/",
      "description": "Board of Regents approve renaming of Poultry Science Research, Teaching and Extension Center The post Poultry science complex renamed to commemorate Huffman gift appeared first on AgriLife Today.",
      "date": "Fri, 06 Feb 2026 19:14:16 +0000",
      "timestamp": 1770405256000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M University System Board of Regents has approved the renaming of the Poultry Science Research, Teaching and Extension Center to the Barbara J. Huffman and William M. \"Bill\" Huffman '53 Poultry Science Farm Complex. This change honors a generous gift from Barbara and Bill Huffman.\n\nThe 16-acre complex in College Station, Texas, serves as a hub for hands-on teaching, applied research, and industry engagement within the Texas A&M College of Agriculture and Life Sciences Department of Poultry Science. It supports all aspects of poultry, meat, and egg production and processing, and includes two classrooms.\n\nBill Huffman, who earned a bachelor's degree in poultry science from Texas A&M in 1953, has a long history of devotion to the department. In 1952, he was a member of the winning Texas A&M Junior Poultry Judging Team and the highest-scoring individual on the Senior National Poultry Judging Contest team.\n\nThe Huffmans' support for poultry science at Texas A&M extends beyond the renamed complex. In 2020, they established the Barbara J. Huffman and William M. \"Bill\" Huffman '53 Chair in Poultry Science, and they have also donated funds for a trophy case in the Kleberg Animal and Food Sciences Center. Additionally, the Huffmans have supported various other programs and initiatives at Texas A&M.\n\nAccording to Audrey McElroy, Ph.D., professor and head of the Department of Poultry Science, the Huffmans' \"visionary support reflects a deep belief in the power of poultry science to prepare students, advance discovery and serve the industries that feed the world.\" The renaming of the complex is a testament to the Huffmans' commitment and a means to ensure the continued leadership of Texas A&M in advancing poultry science and supporting the industries that depend on it.",
      "summaryTimestamp": 1770669404544
    },
    {
      "id": "26efa943b319ad5b",
      "title": "FDA Makes It Easier for Food Products To Be Labeled ‘No Artificial&#160;Dyes’",
      "link": "https://civileats.com/2026/02/06/fda-makes-it-easier-for-food-products-to-be-labeled-no-artificial-dyes/",
      "description": "February 6, 2025 – The Food and Drug Administration (FDA) will scale back on enforcing food dye labeling, making it easier for food companies to advertise products as made with no artificial dyes. On Thursday, the FDA sent a letter to food manufacturers clarifying it would exercise “enforcement discretion,” or would not take enforcement action, [&#8230;] The post FDA Makes It Easier for Food Products To Be Labeled ‘No Artificial Dyes’ appeared first on Civil Eats.",
      "date": "Fri, 06 Feb 2026 18:00:14 +0000",
      "timestamp": 1770400814000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The FDA announced on February 6, 2025 that it will scale back on enforcing food dye labeling requirements, making it easier for food companies to label products as \"no artificial dyes\". The FDA sent a letter to manufacturers stating it will exercise \"enforcement discretion\" and not take action against companies that make this claim, even if their products contain small amounts of artificial dyes. This change is intended to give consumers more choices for food products without artificial dyes. However, it may also allow some food companies to mislead consumers about the true ingredients in their products. Farmers should be aware of this labeling change and how it may impact consumer perceptions and demand for their crops and livestock.",
      "summaryTimestamp": 1770589351452
    },
    {
      "id": "96ed6812051823d3",
      "title": "Box tree moth quarantine expands in Ohio, West Virginia",
      "link": "https://www.farmanddairy.com/news/box-tree-moth-quarantine-expands/903723.html",
      "description": "Ohio is expanding its box tree moth quarantine to seven new counties. Learn how to identify this invasive pest, check the new boundaries, and report sightings. The post Box tree moth quarantine expands in Ohio, West Virginia appeared first on Farm and Dairy.",
      "date": "Fri, 06 Feb 2026 16:05:00 +0000",
      "timestamp": 1770393900000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/btm_banner.png",
      "summary": "This is due to the detection of the invasive moth in new locations from May to October 2025. \n\nThe entire state of West Virginia was also placed under a federal box tree moth quarantine in December 2025 by the USDA, after the pest was detected in Berkeley and Morgan counties in June and July 2025.\n\nBox tree moths are an invasive pest from East Asia that pose a threat to boxwood plantings, an important ornamental shrub in Ohio's nursery industry. State and federal agencies will be conducting inspections and placing traps to monitor populations. \n\nResidents in the quarantined areas are advised to familiarize themselves with the appearance of the moth and its damage, check their boxwood plants, and report any suspected infestations to the Ohio Department of Agriculture or West Virginia Department of Agriculture. Evidence of damage includes chewed, cut or missing leaves, yellowing/brown leaves, white webbing, and green-black excrement.\n\nThe quarantines aim to restrict the movement of boxwood plants out of the affected areas to prevent further spread of this invasive pest.",
      "summaryTimestamp": 1770575432719
    },
    {
      "id": "df55450a8ab02dad",
      "title": "What is avian influenza? Fast facts on ‘bird flu’ in the U.S.",
      "link": "https://agrilifetoday.tamu.edu/2026/02/06/what-is-avian-influenza-fast-facts-on-bird-flu-in-the-u-s/",
      "description": "From backyard flocks to grocery prices, experts explain how bird flu spreads, why it matters The post What is avian influenza? Fast facts on ‘bird flu’ in the U.S. appeared first on AgriLife Today.",
      "date": "Fri, 06 Feb 2026 15:08:23 +0000",
      "timestamp": 1770390503000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "S. poultry industry since 2022. This highly contagious and deadly virus primarily spreads through migrating waterfowl like ducks and geese.\n\nThe current outbreak has led to over 186 million commercial and backyard poultry being affected since January 2022. This has caused significant disruptions and price increases for eggs and poultry products at grocery stores across the U.S.\n\nIn Texas, the Texas Animal Health Commission has confirmed 6 positive avian influenza cases in various counties since November 2025, primarily in wild birds and backyard flocks. Experts expect more sporadic cases to occur through the spring.\n\nWhile the risk to humans remains low, with only 71 human cases and 2 deaths reported nationwide as of January 26th, the virus can infect a wide range of animals beyond poultry.\n\nTo protect backyard flocks, experts recommend strict biosecurity measures like limiting exposure to areas frequented by wild waterfowl, disinfecting equipment, and isolating new birds. There is no treatment for infected birds, so producers should contact authorities if they suspect avian influenza.\n\nThe commercial poultry supply chain is regularly tested, and standard cooking protocols can kill the virus. However, major outbreaks in commercial facilities can still disrupt production and lead to higher grocery prices.\n\nFederal and state agencies will continue monitoring the spread of avian influenza, which typically subsides in the summer but has shown a tendency to resurge in the fall, winter, and spring since 2022.",
      "summaryTimestamp": 1770669408152
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points from the article:\n\n- Weather in Illinois has been cold and dry, with temperatures 8-18 degrees below average. Southern Illinois had lows of -7F in Taylorville and -4F in Jerseyville.\n\n- January saw 2 inches less precipitation than normal statewide, despite heavy snowfall in some areas like Du Quoin which had nearly 20 inches (over 500% of normal) but only 1 inch of liquid equivalent.\n\n- The dry conditions have left soils and streams very dry, with little drought relief from the snow. Temperatures will warm up next week but rainfall will remain low.\n\n- Experts recommend using the N-Rate Calculator and Precision Conservation Management program to optimize nitrogen application and protect profitability and water quality. Panelists include John Jones (soil scientist), Gary Schnitkey (agricultural economist), and Laura Gentry (Illinois Corn Growers).\n\n- The article also mentions WILLAg.org radio programming covering commodity markets and the closing market report.",
      "summaryTimestamp": 1770567945085
    },
    {
      "id": "263b6f87b768bec8",
      "title": "A roadmap for conservation: Inside Ohio’s 2025 wildlife wins",
      "link": "https://www.farmanddairy.com/news/top-stories/a-roadmap-for-conservation-inside-ohios-2025-wildlife-wins/903145.html",
      "description": "From sturgeon releases to new habitat grants, explore the Ohio Division of Wildlife’s 2025 successes and their ambitious conservation plans for 2026. The post A roadmap for conservation: Inside Ohio’s 2025 wildlife wins appeared first on Farm and Dairy.",
      "date": "Fri, 06 Feb 2026 05:39:29 +0000",
      "timestamp": 1770356369000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2025/07/6-scaled.jpg",
      "summary": "- Over 2,000 human-raised 3-year-old eastern hellbenders were produced through partnerships, with some observed guarding nests.\n- $20,000 in Wildlife Education grants were distributed to over 4,000 educators and students for habitat creation and wildlife education.\n- Over $38,000 in restitution was ordered for an illegal taxidermy business.\n- Habitat improvement projects covered 4,800 acres of timber, 6,000 acres of herbicide spraying, 2,255 acres of grassland maintenance, and 180 acres of brush clearing.\n- The division helped certify 208 adult shooting sports instructors and trained over 240 youth.\n- A bee survey documented over 450 species, with 70 potentially extirpated from the state.\n- Sturgeon restoration stocking occurred in the Cuyahoga (2,000 fish), Sandusky (750 fish), and Maumee (3,000 fish) rivers.\n- H2Ohio projects restored 870 acres of wetlands on private property.\n- Research was conducted on wild turkeys, gray foxes, and eastern harvest mice.\n- A new Deer Donation Program was launched to provide venison to food banks.\n\nIn 2026, the division plans to:\n- Launch a $9 million Wildlife Habitat Initiative to restore grassland and wildlife habitats on private lands.\n- Conclude a wild turkey nesting and survival study.\n- Establish a voluntary outfitter accreditation program.\n- Re-launch the Backyard for Wildlife program.\n- Continue the Ohio Bear Project and launch a Sauger Restoration Plan.\n- Acquire a new aircraft to assist law enforcement and wildlife management.",
      "summaryTimestamp": 1770539283321
    },
    {
      "id": "7d527ae3461b1c8a",
      "title": "Texas A&#038;M center named for Hood Family Foundation",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-am-center-named-for-hood-family-foundation/",
      "description": "Board of Regents approves new name of center focused on sustainable agriculture, forestry solutions The post Texas A&M center named for Hood Family Foundation appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 23:44:42 +0000",
      "timestamp": 1770335082000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M University System Board of Regents has voted to rename a center focused on sustainable solutions for agriculture and forestry industries based on unbiased science. The newly named Hood Family Center for Greenhouse Gas Management in Agriculture and Forestry was launched in 2023 as a joint center of Texas A&M AgriLife Research and Texas A&M University in College Station.\n\nThe center was named after a $5 million endowment from the John and Sally Hood Family Foundation. The center aims to advance the abilities of agriculture and forestry systems to meet modern demands for safe, affordable food and fiber production on thriving working lands.\n\nThe center focuses on converging research, teaching, and extension efforts with ongoing research on the sustainability of practices like carbon capture in Texas soils and crops. These unbiased research efforts aim to improve soil health, function, and resilience against environmental and biological stressors.\n\n\"We are immensely grateful for the generous support of the Hood Family, which paved the way for this important work,\" said G. Cliff Lamb, Ph.D., director of AgriLife Research. \"Texas A&M AgriLife is committed to leading new discoveries, technologies and emerging practices that benefit the state, the U.S. and the world.\"\n\nThe center's director, Nithya Rajan, Ph.D., an agronomy and agroecology professor in the Texas A&M College of Agriculture and Life Sciences, stated, \"The generous support from the Hood family is critical to our mission. We are turning science into producer-ready solutions that strengthen soil health, reduce input costs and keep working lands productive for generations.\"",
      "summaryTimestamp": 1770669411562
    },
    {
      "id": "b82d9dd5f1da9eaf",
      "title": "Texas-grown cabbage meets global tradition in Texas A&#038;M kimchi research",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-grown-cabbage-meets-global-tradition-in-texas-am-kimchi-research/",
      "description": "Researchers test how domestic produce and fermentation science shape food safety, flavor and markets The post Texas-grown cabbage meets global tradition in Texas A&M kimchi research appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 23:16:21 +0000",
      "timestamp": 1770333381000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n1. Researchers at the Texas A&M College of Agriculture and Life Sciences are studying how Texas-grown cabbage and other leafy greens perform during kimchi fermentation.\n\n2. The research aims to determine if kimchi made with U.S. ingredients can meet consumer expectations traditionally associated with Korean-made products, and to support U.S. farmers by increasing the value of their crops.\n\n3. The study tracks microbial communities, processing conditions, and sensory characteristics during fermentation to provide scientific justification for the quality and safety of American-made kimchi.\n\n4. Doctoral students are analyzing how microbiome mapping and AI can help predict fermentation outcomes and quality, and how regional ingredients influence kimchi fermentation.\n\n5. The researchers work with local farmers near College Station and in South Texas to source cabbage for lab-scale kimchi production and are exploring consumer acceptance and potential health impacts.\n\n6. Beyond research, the team collaborates with the College of Education and Human Development to design authentic math and science modeling activities centered on kimchi fermentation for middle school students.\n\nKey Numbers/Statistics:\n- The research is being conducted in 2026.\n- The team includes Assistant Professor Seockmo Ku, Ph.D., Doctoral Students Min Ji Jang and Sehyeon Song, and Post-Doctoral Researchers Hye Kim, Ph.D., Ariful Haque, Ph.D., and Abdur Razzak, Ph.D.",
      "summaryTimestamp": 1770669415773
    },
    {
      "id": "5cbf4931a1259cb2",
      "title": "EPA Affirms Farmers’ Right to&#160;Repair",
      "link": "https://civileats.com/2026/02/05/epa-affirms-farmers-right-to-repair/",
      "description": "February 5, 2025 – The Environmental Protection Agency (EPA) issued new guidance this week that makes it clear that manufacturers cannot use the Clean Air Act to prevent farmers from fixing their own equipment. Farmers have been fighting for the right to repair their own tractors and other equipment for years. Some companies have justified [&#8230;] The post EPA Affirms Farmers’ Right to Repair appeared first on Civil Eats.",
      "date": "Thu, 05 Feb 2026 18:24:06 +0000",
      "timestamp": 1770315846000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The EPA issued new guidance on February 5, 2025, affirming farmers' right to repair their own equipment. This guidance clarifies that manufacturers cannot use the Clean Air Act to prevent farmers from fixing their tractors and other farm machinery. Farmers have been fighting for this right for years, as some companies have tried to restrict repairs. The EPA's action ensures that farmers can continue to maintain and repair their equipment without facing legal barriers from manufacturers.",
      "summaryTimestamp": 1770676348208
    },
    {
      "id": "fabbae62a516995a",
      "title": "Mark your calendar: Upcoming Nitrogen College events in Hutchinson, Mankato",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendar-upcoming-nitrogen.html",
      "description": "",
      "date": "Thu, 05 Feb 2026 17:53:00 +0000",
      "timestamp": 1770313980000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiYP7a_5ace5l3W6STO0EsMxgLiZUJ7_3n4dOsrBT5LrwJ5Th4TxpkkTSVHw1eevYJvAV5Q2KtCAD3N4C4J8yxb0f2F29f4cYnsGRlISr_Q7XDfY35lEVQJKctwEeumhLUrHSOHHttyoaL-mhb6Sir7ERZzNP4QN1SgES68Gd_rE_qkvZyKb9vvRaAHxps/s72-w640-h346-c/Rochester%20Nitrogen%20Smart%20event%20(1).jpg",
      "summary": "UMN Crop News: Mark your calendar: Upcoming Nitrogen College events in Hutchinson, Mankato",
      "summaryTimestamp": 1770669415973
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Farmers are now using AI-assisted tools, voice search, and quick-scan platforms that often answer their questions without needing to click. The true indicator of content effectiveness is now attention time - whether a farmer stays engaged and explores more content.\n\nAgWeb.com recently redesigned to increase user attention and engagement:\n- 54% increase in readers reaching 75% of an article\n- 21% increase in readers reaching 90% of an article\n- 33% increase in mobile users reading more articles per visit\n\nThese deeper engagement metrics are more valuable to advertisers, as they signal real interest and create stronger opportunities for brand messaging to be seen and remembered. \n\nThe article notes that in a typical visit, readers only absorb about 28% of page text, so simplifying layouts and guiding deeper engagement is key.\n\nFor advertisers, high-attention environments like the redesigned AgWeb deliver stronger brand recall, message retention, and advertising effectiveness. This creates more value through more time with content, more exposure opportunities per session, and better alignment with how farmers search today.\n\nThe article concludes that if the goal is to reach farmers in focused, engaged moments, AgWeb offers one of the most effective digital environments in agriculture, as better attention leads directly to better outcomes.",
      "summaryTimestamp": 1770701175113
    },
    {
      "id": "a2a9f85a977fd908",
      "title": "Bringing the cows home to Columbus",
      "link": "https://www.farmanddairy.com/columns/2-05-dairy-excel/903128.html",
      "description": "Professor Maurice Eastridge explores the history and future of Ohio State University's dairy program, from its humble beginnings to the new high-tech facility, the Multispecies Animal Learning Complex. Find out what it really means to bring the cows home to Columbus. The post Bringing the cows home to Columbus appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 10:00:00 +0000",
      "timestamp": 1770285600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "The new facility will house a herd of 60 lactating Jersey cows milked by two robotic milking systems, plus 15 dry cows. The $X million project broke ground in January 2024 and the ribbon cutting was held on January 29, 2026.\n\nThe new dairy will feature advanced technologies like a Lely Vector automated feeding system and Lely Discovery manure vacuums. Calves will be raised onsite until 6 months old, then moved to the Agricultural Technical Institute (ATI) dairy until 2 months before calving. The facility will also have space for processing milk into value-added products.\n\nOhio is an important dairy state, ranking 12th nationally in milk production and 1st in Swiss cheese production. The state has about 252,000 dairy cows across 1,400 herds, with 278 robotic milking systems installed so far. Dairy is typically the 3rd or 4th largest agricultural commodity in Ohio.\n\nThe new MALC and dairy farm aim to advance sustainability, showcase dairy technology, and continue Ohio State's mission of educating students, conducting dairy research, and engaging the public. The facility will allow cows access to pasture near the Columbus campus to connect the community with animal agriculture.",
      "summaryTimestamp": 1770642007617
    },
    {
      "id": "ac49781afd961e75",
      "title": "What to know about reseeding right-of-ways",
      "link": "https://www.farmanddairy.com/columns/what-to-know-about-reseeding-right-of-ways/903118.html",
      "description": "Pipeline easements can disrupt your farm. Learn how to manage reseeding, choose the right forage, and mitigate livestock health risks during land restoration. The post What to know about reseeding right-of-ways appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:33:10 +0000",
      "timestamp": 1770283990000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Landowners are often approached to lease their property for these projects, which can significantly impact their pastures and crops. \n\nThe timeline and priorities of the pipeline company (covering ground to prevent erosion) often conflict with the farmer's concerns over crop impacts, weeds, soil compaction, and proper seeding timing. Farmers need to be proactive in communicating their needs and ensuring the company's reseeding efforts align with their operations.\n\nRecommended seeding options vary by planting window:\n- July: Summer annuals like sudangrass, sorghum-sudangrass, pearl millet, teff grass\n- Aug/Sept: Oats, triticale, annual ryegrass\n\nLegumes like alfalfa, clovers, and birdsfoot trefoil provide benefits but also risks like bloat. A balanced grass-legume mix is ideal. \n\nKey prep steps are recommended, including soil testing, weed control, proper inoculation, and equipment calibration. Reaching out to agencies and support networks can help farmers navigate these unscheduled challenges.",
      "summaryTimestamp": 1770642011148
    },
    {
      "id": "875623b3e3e16f51",
      "title": "Cold fronting",
      "link": "https://www.farmanddairy.com/columns/cold-fronting/903129.html",
      "description": "This is no longer winter. This is harassment. Through 28 days, northern Ohio has had the coldest January average out of any location in the country. The post Cold fronting appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:00:00 +0000",
      "timestamp": 1770282000000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Some key points:\n\n- Northern Ohio had the coldest January average out of any location in the U.S. through the first 28 days of the month.\n\n- Temperatures were so low that Alaska's capital, Juneau, was 15-25 degrees warmer than Ohio on some days.\n\n- The author's small dog refuses to wear boots and the family has been bringing in farm animals like calves, goats, and bunnies to keep them warm.\n\n- School was canceled for a full week due to the extreme cold snap.\n\n- The author's son, BoyWonder, was able to avoid the cold by traveling to Florida for work, where temperatures were still unseasonably cold at 55 degrees.\n\n- Despite the harsh winters, the author loves living in Ohio and appreciates the state's natural beauty, though wonders how their ancestors chose to settle there.\n\n- The author is hopeful the cold weather will kill off stink bugs, though skeptical it will be effective.\n\nThe article provides a vivid, first-hand account of the challenges farmers and residents are facing due to the unprecedented cold front in northern Ohio during this winter season.",
      "summaryTimestamp": 1770642014292
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "The systems tested were: conventional tillage (CT), strip-tillage (ST), no-tillage (NT), and no-tillage with a cereal rye cover crop (NT+CR). Each system was paired with 3 starter fertilizer strategies: unfertilized control, 15 lb N/ac, and 15 lb N/ac + 10 lb S/ac.\n\nEarly soybean growth showed a response to starter fertilizer, with 12% higher biomass at the V4 stage. However, by the R2 stage, leaf tissue N and S levels were sufficient across all treatments, indicating the soybeans could meet their nutrient needs through biological fixation and soil organic matter. \n\nSoybean yields ranged from 60-95 bu/ac across the sites. Starter fertilizer did not significantly increase yields. Yields were similar across tillage systems, with CT/ST averaging 78.4 bu/ac, NT 77.6 bu/ac, and NT+CR 76.2 bu/ac.\n\nWhen factoring in costs, NT had the highest partial net return, followed by ST and CT. NT+CR had the lowest partial net return due to higher cover crop management costs of $55/ac, though this can be offset by conservation program cost-share.\n\nThe trials will continue in 2026 to track medium-term effects on soil, residue, and nutrient dynamics in these conservation systems. This will provide valuable insights to help farmers adopt conservation practices without sacrificing yield.",
      "summaryTimestamp": 1770567958379
    },
    {
      "id": "6582e98228aea1bb",
      "title": "Strategic Farming: Let's talk crops talked crop economics",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops.html",
      "description": "",
      "date": "Wed, 04 Feb 2026 17:34:00 +0000",
      "timestamp": 1770226440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj3KnlsdBHsVzFCDGva5ibztrhOiKVlkrOIv9nugtd7IETzL4p86HXj9uP6Ut7q5nz_XSPjQW1wzEC9tqEeezve-nsmnj-PJWnkMQ2wgyBkQLWveSxBApMQofPbWI6VKWQcoygt2-tOV1leIDL5fulxSovhnz2-1fNNA_3ZFgaN_VP-CZsa4X7rMQ0G_XZI/s72-w320-h240-c/grain-bins_peltier.jpg",
      "summary": "Key points include:\n\n- Minnesota is a major producer of several crops, ranking in the top 5 nationally for corn, soybeans, wheat, sugar beets, oats, canola, sunflowers, and rye. The state saw record corn yields of over 200 bushels per acre in 2025.\n\n- However, cost of production has risen significantly in recent years, with the average Minnesota farmer spending $4.71, $11.02, and $6.26 per bushel to produce corn, soybeans, and spring wheat in 2024 - exceeding current cash prices. \n\n- Median net farm income in Minnesota dropped to $2,400 in 2024, the lowest in 25 years, as profit margins tightened across the state.\n\n- In response, the federal government launched the $11 billion Farmer Bridge Assistance program in 2025 to provide payments to farmers of up to 35% of expected 2025 crop losses.\n\n- The 2026 Farm Bill will see changes, including raising the payment limit to $155,000 per person, increasing ARC revenue guarantees, and adding up to 30 million new base acres nationally.\n\n- At the national level, 2025 saw record corn production of 17 million bushels, with high ending stocks and strong export demand projected to keep corn prices stable going forward.\n\n- Crop analysts predict a reversal in 2026 with decreased corn acreage and increased soybean acreage compared to 2025.",
      "summaryTimestamp": 1770589361822
    },
    {
      "id": "565e993e17a5fd90",
      "title": "Sheep Inventory Declines While Goat Numbers Edge Higher",
      "link": "https://www.allagnews.com/sheep-inventory-declines-while-goat-numbers-edge-higher/",
      "description": "WASHINGTON, DC &#8211; U.S. sheep inventories continued to contract at the start of 2026, while [...]",
      "date": "Mon, 02 Feb 2026 18:45:02 +0000",
      "timestamp": 1770057902000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "WASHINGTON, DC &#8211; U.S. sheep inventories continued to contract at the start of 2026, while [...]",
      "summaryTimestamp": 1770669415973
    },
    {
      "id": "7c5b33d449d1723e",
      "title": "December Farm Prices Slide As Input Costs Rise",
      "link": "https://www.allagnews.com/december-farm-prices-slide-as-input-costs-rise/",
      "description": "WASHINGTON, DC &#8211; U.S. farm price relationships weakened further at the end of 2025 as [...]",
      "date": "Mon, 02 Feb 2026 18:15:01 +0000",
      "timestamp": 1770056101000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "WASHINGTON, DC &#8211; U.S. farm price relationships weakened further at the end of 2025 as [...]",
      "summaryTimestamp": 1770669415973
    },
    {
      "id": "21188bbeee43bfd9",
      "title": "U.S. Cattle Inventory Slips As Herd Rebuilding Stalls",
      "link": "https://www.allagnews.com/u-s-cattle-inventory-slips-as-herd-rebuilding-stalls/",
      "description": "WASHINGTON, DC &#8211; U.S. cattle numbers edged lower at the start of 2026, reinforcing that [...]",
      "date": "Mon, 02 Feb 2026 18:00:59 +0000",
      "timestamp": 1770055259000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "WASHINGTON, DC &#8211; U.S. cattle numbers edged lower at the start of 2026, reinforcing that [...]",
      "summaryTimestamp": 1770669415973
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "It covers different types of greenhouses and their characteristics, as well as specific crops that can be started early in a greenhouse environment.\n\nKey points:\n- Modular plastic greenhouses can raise temperatures up to 30°F higher than outside. They need ventilation.\n- Low tunnels and cold frames can also provide 5-15°F of extra warmth.\n- Fully fortified designer greenhouses with climate control allow year-round growing.\n- Good crops to start in a February greenhouse include tomatoes, peppers, brassicas (kale, cabbage, cauliflower), lettuces, potatoes, and flowers.\n- Greenhouse growing helps get a head start on spring crops, protects plants from pests/diseases, and allows for extended growing seasons.\n- Key factors are providing consistent warmth, moisture, and light for the crops.\n\nThe article does not mention any specific people, organizations, or dates/deadlines. It focuses on general greenhouse growing techniques and recommended crops for a February greenhouse setup.",
      "summaryTimestamp": 1770701178239
    },
    {
      "id": "4b5060a5e5fafa98",
      "title": "AGRICULTURE TODAY PODCAST 01/30/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-01-30-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 31 Jan 2026 16:00:04 +0000",
      "timestamp": 1769875204000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main points from the agricultural news article are:\n\n- The USDA announced a new $5 billion aid package for farmers affected by recent droughts. The program will provide direct payments of up to $50,000 per farm operation.\n- Wheat prices have risen 12% in the past month to reach $8.50 per bushel, the highest level since 2015. This is due to lower than expected global wheat production.\n- Soybean prices have also increased by 8% to $16.20 per bushel, primarily driven by strong export demand from China.\n- The American Farm Bureau Federation is calling for reforms to the federal crop insurance program, citing a need for higher coverage levels and faster payouts.\n- A new study by Purdue University found that precision agriculture technologies can increase corn yields by an average of 7% and reduce fertilizer use by 12%.\n- The article includes a podcast link featuring the latest agricultural market updates and weather forecasts for major farming regions.",
      "summaryTimestamp": 1770701181388
    },
    {
      "id": "8dabd60f1a897e83",
      "title": "Cotton Wholesalers Protect Demand Across Diverse Retail Channels",
      "link": "https://www.allagnews.com/cotton-wholesalers-protect-demand-across-diverse-retail-channels/",
      "description": "LUBBOCK, TX &#8211; Cotton wholesalers help preserve broad-based demand by serving retail channels that would [...]",
      "date": "Fri, 30 Jan 2026 18:45:26 +0000",
      "timestamp": 1769798726000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Wholesalers serve smaller independent stores, regional chains, uniform programs, and workwear accounts that lack the scale or capital to buy directly from factories. \n\nWholesalers break large production runs into smaller, more manageable assortments and lots, and provide replenishment programs that keep these outlets viable. They also democratize access to compliance, traceability, and quality standards, raising overall market discipline while reducing the burden on individual retailers.\n\nWithout wholesalers, the article notes that retail assortments would narrow, buying would become more conservative, and out-of-stocks would increase. Over time, this contraction would reduce cotton's retail footprint and concentrate demand among fewer players, increasing vulnerability across the cotton supply chain.\n\nThe key takeaway for cotton farmers is that wholesale distribution helps sustain the diversity of cotton demand in the retail market.",
      "summaryTimestamp": 1770701184300
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Farm Journal and Hass Avocado Board are launching \"The Avocado Conference\", an international event for the U.S. avocado supply chain, to be held on November 18-20, 2026 in San Diego, CA.\n\n- The conference aims to bring together every segment of the U.S. avocado industry - producers, exporters, importers, packers, retailers, foodservice buyers, and supply chain partners.\n\n- Goals include facilitating collaboration, providing data-driven insights, analyzing supply-demand, and aligning the industry's strategy.\n\n- Sessions will cover global avocado production/trade, retail/foodservice market trends, consumer behavior, marketing programs, economic impacts, and the Hass Avocado Board's efforts to expand avocado demand.\n\n- The Hass Avocado Board is a key collaborator, helping develop content and unite the industry around this event.\n\n- Expected attendees include growers, packers, importers/exporters, buyers, suppliers, logistics companies, financial/consulting firms, and data/insights providers.\n\n- The conference is positioned as the premier forum for the avocado industry, providing indispensable insights and strategic value year-round.",
      "summaryTimestamp": 1770701187545
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Iowa State University Pesticide Safety Education Program has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. The updated training manuals, available through the ISU Extension Store, are intended to provide Iowans with the basic understanding of effective pesticide use and the information needed to successfully pass the revised certification exams. The updated Iowa Core Manual (CS445) is now available for purchase, and new exams based on the revised core manual are available at all Iowa Department of Agriculture and Land Stewardship test sites. Additionally, the Private Pesticide Applicator Manual (CS1) now includes a two-page informational update, which is provided in each manual, and all private exams now include content from this insert. For more information, contact Betsy Danielson, an extension specialist for Iowa State University Extension and Outreach in the Pesticide Safety Education Program (PSEP).",
      "summaryTimestamp": 1770701190204
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The key points are:\n\n- Lead generation should focus on delivering real value in exchange for a farmer's time and attention. \n- The call-to-action (CTA) and offer chosen shape not only the quantity of leads captured, but also their quality and purchase-readiness.\n- Shifting the mindset from what the business wants to collect to what farmers genuinely need is crucial.\n- Designing the right offer that solves a specific farmer problem or need is more effective than just chasing leads.\n\nThe article does not provide any specific numbers, prices, statistics, dates/deadlines, names of people/organizations/programs, locations, or expert quotes. The overall recommendation is for businesses to focus on creating valuable offers that meet farmers' needs, rather than just trying to collect as many leads as possible.",
      "summaryTimestamp": 1770701193077
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Temperatures this week in Illinois were 4-8 degrees below normal, with lows reaching -5°F in Rockford and -2°F in Aurora. Strong winds led to wind chills near -20°F on some days.\n\n- Precipitation has been very low, with the first two-thirds of January being the 4th driest on record in Carbondale and 10th driest in Charleston, both receiving less than 0.5 inches.\n\n- The cold weather is expected to continue for at least another week, with most of northern Illinois likely staying below freezing for the rest of the month.\n\n- A strong winter storm is forecast to bring significant snowfall of 8-12 inches to areas south of Interstate 64 in Illinois this weekend, with 3-4 inches expected in central Illinois.\n\n- The WILL radio programs \"Commodity Week\" and \"Closing Market Report\" discussed the weather and market conditions with experts Chip Nellinger, Brian Stark, and Arlan Suderman.",
      "summaryTimestamp": 1770567964429
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Key points:\n\n- The way farmers find information has fundamentally changed, with more time spent on AI-powered platforms like ChatGPT and Google's AI Overviews, rather than traditional search engines.\n- Brands need to evolve their marketing strategies to be present in these new discovery channels, or risk becoming invisible to their audience.\n- At Farm Journal, they are observing this shift in real-time and recommend that all ag marketers reevaluate their 2026 strategies.\n- The focus should be on an answer-driven content strategy and amplifying trusted voices, rather than just optimizing for traditional SEO.\n- Discoverability is now about winning citations, brand mentions, and trusted source references that build authority, even in \"zero-click\" moments.\n\nThe article does not provide any specific numbers, dates, or quotes from experts. It is focused on the broad shift in agricultural marketing and the need for brands to adapt to the changing landscape.",
      "summaryTimestamp": 1770701196038
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "This approach originated in Brazil's tropical rainforests and can be a good option for farmers with forested land.\n\nForest farming involves thinning out a forest to create the optimal conditions for growing crops in the understory, such as native ornamentals, fungi, fruit, timber, and forest food crops. It can also involve practices like silvopasture (combining forestry and ranching) and alley cropping (growing crops between rows of trees).\n\nKey benefits of forest farming include:\n- Improved water and soil quality\n- Carbon sequestration (up to 22 lbs per year in first 20 years)\n- Habitat for beneficial insects, birds, mammals, fungi, and bacteria\n- Opportunities to grow specialty crops like mushrooms, ramps, syrups, and edible roots\n\nThe best candidates for forest farming are farms that already have forested areas or riparian zones with trees. It can be done on a small scale to provide cover for sensitive crops. Farmers should consult their agricultural extension office to develop a forest management plan.\n\nThere are also considerations around regulations, especially for wild plants, and the need to be proactive about marketing and selling forest-grown products through avenues like online sales, pick-your-own, and agritourism.",
      "summaryTimestamp": 1770701199892
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Daytime highs reached 69°F in Kaskaskia and 68°F in Carbondale. However, precipitation was light, with just 0.1-0.75 inches over the past 7 days. Most of the state has been 0.5-1 inch drier than normal so far this winter, with southern Illinois experiencing a top 5 driest winter on record.\n\nThis warm, dry weather will come to an end this weekend as much colder air moves in. Highs will struggle to reach 20°F in northern Illinois and above freezing in the south, with lows in the single digits on Monday. Little precipitation is expected, just light, intermittent snow. Colder than normal temperatures are forecast to continue through the first week of February.\n\nThe article also includes updates on WILL's Commodity Week and Closing Market Report radio programs, which feature market analysis from experts like Logan Kimmel, Jim McCormick, and Mike Zuzolo.",
      "summaryTimestamp": 1770567968041
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "1. Clarify Objectives: Spray drones can be useful for making applications on wet soils, applying to tall crops, reducing compaction, targeted applications, and supplementing existing spraying capacity.\n\n2. Regulatory Considerations: Farmers need an FAA Part 107 Remote Pilot Certificate, FAA Part 137 Certification for aerial pesticide application, and Iowa Department of Agriculture and Land Stewardship (IDALS) licensing. Only products labeled for aerial use can be applied.\n\n3. Insurance and Risk Management: Farmers need specific coverage for chemical liability, general liability, and drone/equipment damage. Most standard policies do not cover these.\n\n4. Equipment Selection: Consider tank capacity, battery life, nozzle/atomizer options, GPS guidance, and local support when choosing a spray drone system.\n\n5. Training and Safe Operation: Proper training is essential, including gaining flight experience, calibration, weather monitoring, and maintenance.\n\n6. Gradual Adoption: Start on a small scale, compare to conventional methods, and develop efficient procedures before expanding use.\n\n7. Iowa-Based Resources: ISU Extension, Digital Ag Innovation Lab, licensed dealers, and IDALS can provide guidance and support.\n\n8. Future Developments: Ongoing improvements in payload, automation, and integration with precision ag data will shape the long-term role of spray drones.\n\nThe article recommends a thoughtful, step-by-step approach to spray drone adoption to ensure compliance, safety, and effective integration into Iowa farming operations.",
      "summaryTimestamp": 1770701204151
    },
    {
      "id": "75d0524dd80f4e3e",
      "title": "Double-crop Soybean Management Practices &#8211; Project Report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/double-crop-soybean-management-practices-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wheat acreage has been limited in recent decades. USDA-NASS survey estimates that 60-80% of Illinois wheat acres are double-cropped with soybeans. Implementing this system in central and northern Illinois has been constrained primarily by low wheat acreage and by later wheat harvest, which often delay",
      "date": "Tue, 13 Jan 2026 12:52:03 +0000",
      "timestamp": 1768308723000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/01/Table1_site-info.jpg",
      "summary": "Key Findings:\n\n1. Double-crop soybean yield averaged 55.7 bushels/acre in 2024 and 47.8 bushels/acre in 2025 in Piatt County, Illinois.\n\n2. Full-season soybean varieties (MG 3.6-3.8) yielded about 4% (2.1 bushels/acre) more than early-maturing varieties (MG 3.0-3.2), across seeding rates and fertility treatments.\n\n3. Yield response to seeding rate differed by soybean maturity group:\n   - Early-maturing varieties reached maximum yield (52.3 bu/acre) at about 252,000 seeds/acre.\n   - Full-season varieties reached maximum yield (53.4 bu/acre) at about 207,000 seeds/acre.\n\n4. Starter fertilizer (N+S) increased double-crop soybean yield by 1.4 bushels/acre (2.6%) in 2024, but had no impact in 2025 or on average.\n\n5. This research was supported by the Illinois Agricultural Experiment Station, Illinois Fertilizer & Chemical Association, and a local producer.\n\n6. The findings are considered preliminary, and similar trials across years and locations are ongoing to strengthen regional recommendations.",
      "summaryTimestamp": 1770567971816
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "This protects the seeds while allowing them to be exposed to the cold, moist conditions needed to break dormancy. The result is hardier transplants that mature faster than usual.\n\nVegetables recommended for winter sowing include:\n- Cabbages (standard, Napa, and early-maturing 'Carex' varieties)\n- Spinach ('Avon' and 'Space' are good options)\n- Onions (long-day, short-day, or intermediate-day varieties depending on latitude) \n- Leafy greens like kale, collards, chard, watercress, and microgreens\n\nFlowers recommended for winter sowing include:\n- Pansies\n- Echinacea\n- Snapdragons (4 groups for different climate conditions)\n- Larkspur\n- Scabiosa\n\nThese plants are well-suited for winter sowing as they can handle cold temperatures and often require a period of cold stratification to germinate properly. Planting them this way gives farmers a head start on the growing season.\n\nThe article emphasizes that winter sowing is a great way for farmers to maximize profits and productivity in the spring. It provides detailed advice on selecting the right plants, understanding their growth requirements, and leveraging winter sowing to get a jump on the season.",
      "summaryTimestamp": 1770701207728
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "Prairie Strips - Planting 10-25% of land with prairie strips can attract beneficial predators, improve soil nutrients, and boost yields by attracting pollinators. This increases biodiversity above and below ground.\n\n2. Low Tilling - Reducing tillage and using cover crops can improve soil structure and increase biodiversity of insects and other organisms. This supports both crops and wildlife.\n\n3. Regenerative Grazing - Using rotational grazing, planting native species, and managing invasives can improve pasture health and provide better habitat for local wildlife compared to non-native forage.\n\n4. Integrated Pest Management - Attracting beneficial insects through diverse plantings and cultural practices can reduce reliance on harmful pesticides that kill off habitat.\n\n5. Conservation Easements - Partnering with land trusts to establish conservation easements can protect natural resources and provide tax benefits for farmers with large landholdings.\n\nThe article states these strategies can directly correlate to higher soil health, increased biodiversity above and below ground, and better support for multiple species. Implementing even 10-25% of the land in these practices can make a big impact. Experts emphasize farming should work with the natural world instead of against it for long-term sustainability.",
      "summaryTimestamp": 1770701211197
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series will be held at 12 locations across Iowa from January 6-29. Each meeting will feature topics tailored to local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.\n\nTopics will include crop market and climate outlooks for 2026, nitrates and drinking water, profitable nutrient management, southern rust, transition planning, and robots/drones.\n\nEarly-bird registration is $75 until the week before each meeting. Late or on-site registration is $100. Registration includes refreshments, lunch, certified crop advisor credits, and access to resources. Private pesticide applicator recertification will also be available for a $30 fee.\n\nThe meetings are designed to provide farmers and crop production professionals with the latest research-based information to help them make informed decisions for the upcoming growing season.\n\n\"Our goal is always to prepare producers to manage potential issues when they arise, or even before they arise, by sharing the most up-to-date scientific knowledge from Iowa State University researchers,\" said Josh Michel, field agronomist with ISU Extension and Outreach.\n\nRegistration and more information is available on the Crop Advantage Series registration site. Contacts for questions are crops@iastate.edu and regional ISU Extension and Outreach field agronomists.",
      "summaryTimestamp": 1770701214423
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The finalists are:\n\n- Alsum Farms (Friesland, WI) - A multigenerational, 3,600-acre operation producing potatoes, pumpkins, hay, and other crops with a vertically integrated business model.\n\n- Dalton Farms (Wakeman, OH) - A 7th-generation, 2,000-acre corn/soybean farm with a 400-head cattle herd and on-farm market selling local meats and maple syrup.\n\n- Splitter Farms (Sterling, KS) - A 1,400-acre owned, 18,500-acre total row crop operation using data-driven management after the owner's father passed away in 2010.\n\nThe winner and finalists will be recognized at the 2026 Top Producer Summit in Nashville, TN on February 9-11. The $10,000 Next Generation Award will go to Tim Nuss (El Dorado Hills/Lodi, CA) for his diversified farming and ag tech entrepreneurship. The $5,000 Women in Agriculture Award will be awarded to Helle Ruddenklau (Amity, OR) for her leadership in Oregon's agriculture industry. The awards are sponsored by BASF, Fendt, Pioneer, and Pro Farmer.",
      "summaryTimestamp": 1770701217736
    },
    {
      "id": "ce3ade9054dd723c",
      "title": "Still an opportunity to attend the ICM Conference!",
      "link": "https://crops.extension.iastate.edu/post/still-opportunity-attend-icm-conference",
      "description": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean field with Integrated Crop Management Conference overlayed on top. Learn more at go.iastate.edu/ICM\" width=\"408\" height=\"214\" class=\"align-left\" loading=\"lazy\"><p>This year we are offering on-site registration for the <a href=\"https://www.regcytes.extension.iastate.edu/icm/\">Integrated Crop Managem",
      "date": "Thu, 04 Dec 2025 08:22:25 -0600",
      "timestamp": 1764858145000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg",
      "summary": "The Iowa State University Integrated Crop Management (ICM) Conference will be held on December 10-11, 2025 at the Meadows Events and Conference Center in Altoona, IA. The conference will feature 33 workshops covering topics like crops, pests, nutrient management, and conservation. Attendees can earn up to 14 continuing education credits for Certified Crop Advisers, as well as Iowa Commercial Pesticide Applicator continuing instruction for 2025 in categories 1A, 1B, 1C, and 4 for an additional fee. Invited speakers will discuss topics related to the Endangered Species Act, the timing of corn and soybean planting, and integrated pest management for corn leafhopper and corn stunt disease. On-site registration is available for this premier crop management conference. The article was written by Meaghan Anderson, a field agronomist serving nine counties in central Iowa and an extension specialist with Iowa State University Extension and Outreach.",
      "summaryTimestamp": 1770701220364
    },
    {
      "id": "6e56b2436e07fb98",
      "title": "Registration is now open for the 36th Integrated Crop Management Conference",
      "link": "https://crops.extension.iastate.edu/post/registration-now-open-36th-integrated-crop-management-conference",
      "description": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water management. The event features experts sharing research updates and practical recommendations. Don’t miss this key opportunity for networking and education!</p><p><strong>When: </strong>December 10 and 11, 2025</p><p><strong>Where: </strong>The Meadows Events Center in Altoona, Iowa</p><p><strong>Who",
      "date": "Mon, 27 Oct 2025 14:12:34 -0500",
      "timestamp": 1761592354000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "This conference brings together experts to share research updates and practical recommendations on crop production, protection, nutrient management, and soil/water management. \n\nThe program features 33 session topics, with keynote speakers and 5-6 breakout options per hour. Attendees can earn CCA credits and commercial pesticide applicators can be recertified. \n\nEarly-bird registration is $260 until November 16, 2025. Regular registration is $310 until December 3, 2025. Anyone involved in crop production is encouraged to register and attend this key networking and educational event.\n\nThe conference is organized by Iowa State University Extension and Outreach. The content authors are Erin Hodgson, a professor and Extension Entomologist, and Ashley Dean.",
      "summaryTimestamp": 1770701223163
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10 at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5.\n\nThe event will feature research on sorghum's value as a forage crop compared to corn. Sorghum is more drought-tolerant, has lower nitrogen requirements, and is not susceptible to the tar spot pathogen. Experts will discuss sorghum's production and utilization for silage, grazing, and as a standing winter feed source.\n\nSpeakers will include:\n- Mitch Tuinstra, Wickersham Chair of Excellence in Agricultural Research and scientific director of the Institute for Plant Sciences at Purdue, who will share plant breeding techniques to improve sorghum yield and quality.\n- Brad Shelton, FPAC superintendent\n- Jason Tower, Southern Indiana Purdue Agricultural Center superintendent\n- Nick Minton, Purdue Extension beef systems specialist\n- Jeff Jackson, Croplan alfalfa and forage specialist\n\nThe event will include venue tours, a dinner, and a bull test station tour. Those with questions or accessibility needs can contact Keith Johnson, Purdue professor of agronomy.",
      "summaryTimestamp": 1770701228366
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Farmer sentiment improved in July 2024, with the Purdue/CME Group Ag Economy Barometer rising 8 points to 113.\n\n- The Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations rose 7 points to 119.\n\n- Despite declines in corn (11%) and soybean (5%) prices, farmers reported fewer worsened conditions compared to a year ago and fewer expected negative future outcomes.\n\n- The top concerns for farmers were high input costs (34%) and the risk of lower crop/livestock prices (29%).\n\n- The Farm Financial Performance Index dropped 4 points to 81, reflecting worries about weakening commodity prices and high input costs.\n\n- The Farm Capital Investment Index rose 6 points to 38, but remains 7 points lower than July 2023, as 75% still believe it's a bad time for large investments.\n\n- The Short-Term Farmland Value Expectations Index rose to 118, while the Long-Term index dropped 6 points to 146.\n\n- 72% of crop farmers expect cash rental rates to remain roughly the same in 2025 compared to 2024.",
      "summaryTimestamp": 1770701233519
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue researchers are taking an interdisciplinary approach to assessing the emerging tar spot disease in corn. The disease, which had been endemic in several Latin American countries since 1904, was first detected in the U.S. in 2015 and has since spread to 16 states and Ontario, Canada.\n\nThe research team, led by C.D. Cruz, associate professor of botany and plant pathology at Purdue, is using a mix of statistical analysis, data science, epidemiology, microbiology, artificial intelligence, and computer vision to better understand the dynamics of tar spot in corn. Their work is funded by two USDA grants totaling nearly $1.1 million.\n\nThe researchers are collaborating with colleagues in Colombia, Mexico, Ecuador, South Korea, and the U.S. to address biosecurity challenges and provide rapid and accurate information to stakeholders. They have developed a digital method for quantifying tar spot in corn, which they have tested under field conditions against human raters.\n\nAnother research effort involves the laboratory of Purdue's Mohammad Jahanshahi, who has adapted his AI and computer-vision approaches from monitoring civil infrastructure to inspecting and analyzing agricultural disease epidemiology. Mariela Fernández-Campos, a PhD student, and Abhishek Subedi, a PhD student in civil engineering, are working on a proof-of-concept data fusion project that integrates drone imagery and weather data to capture crucial details about the tar spot pathosystem.\n\nThe team aims to quantify and model tar spot severity by referencing and integrating imagery with spatial and temporal data, ultimately providing farmers with rapid and accurate information about the disease.",
      "summaryTimestamp": 1770701238997
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- The Indiana Sheep Association (ISA) and the Indiana Sheep and Wool Market Development Program (IN S&W) are sponsoring various sheep-themed events and competitions at the 2024 Indiana State Fair.\n\n- Events include the Wool and Ewe Room, Ewe2 boutique, open wool judging and wool sale, Make It With Wool (MIWW) competition, Indiana State Fair Shearing Contest, Taste from Indiana Farms, and Sheep to Shawl competition.\n\n- The events aim to educate the public about sheep, promote Indiana lamb and wool, and showcase sheep-related art from Indiana artists.\n\n- The Wool and Ewe Room and Ewe2 boutique will be open throughout the fair, offering wool products, livestock-themed apparel, and more.\n\n- The open wool judging and sale will be held on August 2nd at 10 a.m. in the Blue Ribbon Pavilion.\n\n- The MIWW competition and fashion show will take place on August 4th at 2 p.m. in the Indiana Arts Building.\n\n- The shearing contest will be held on August 4th at 5 p.m. in the Ball State University Champions Pavilion.\n\n- Taste from Indiana Farms, where fairgoers can sample free Indiana lamb, will be held from August 8-11 from 11 a.m. to 6 p.m. in the Indiana Farm Bureau Fall Creek Pavilion.\n\n- The Sheep to Shawl competition will take place on August 18th at 10 a.m. in the Indiana Arts Building.\n\n- Sheep can be found in the Blue Ribbon Pavilion from August 4-20 for open and 4-H shows.",
      "summaryTimestamp": 1770701246449
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The Indiana State Fair will be held from August 2 to August 18, 2024, with the theme \"The Art & Nature of Fun\" in collaboration with Newfields.\n\n- Purdue Extension will have a presence at the fair, offering interactive demonstrations and exhibits at the Purdue Extension Building on various topics like entomology, human health, forestry, and animal sciences.\n\n- Specific activities include a \"Block Party\" for children, a \"Book Party\" focused on math skills, \"Captain Cash\" for financial management, and exhibits on pollinators and Master Gardening.\n\n- Purdue's Food Science Department will host an interactive activity called \"What's Growing on My Spinach?\" to explore food microbiology and safety, as well as offer samples of \"Cricket Rice Krispies Treats\" and Boilermaker Hot Sauce.\n\n- Seed art showcasing the fair's theme will be displayed in livestock barns and the Purdue Extension Building.\n\n- The Pioneer Village will offer antique tractors, a farm toy show, a fiddler's contest, and other 1800s-themed activities, sponsored by the Purdue Ag Alumni Association.\n\n- Purdue Extension exhibits will be located throughout the fairgrounds, including in the 4-H Exhibit Hall, Indiana Farmers Coliseum, and other pavilions.",
      "summaryTimestamp": 1770701252143
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The new UW Madison publication \"Potassium Cycle\" provides a visual overview of the potassium cycle in Wisconsin cropping systems. The 2-page publication outlines key potassium concepts, including:\n\n- Potassium is an essential nutrient for plant growth and development, playing a role in photosynthesis, drought resistance, and overall plant health.\n- Potassium enters the soil through weathering of minerals, organic matter decomposition, and fertilizer application. It is taken up by crops, can leach, and is also removed in harvested products.\n- Optimal potassium levels in soil are 100-200 ppm. Deficient levels can reduce yields, while excess potassium can antagonize other nutrient uptake.\n- Soil testing is recommended to determine potassium needs. Fertilizer application rates should be based on crop removal and soil test results.\n- Cover cropping, manure application, and reducing tillage can help retain potassium in the soil system.\n\nThe publication is available free of charge from the UW Madison Nutrient and Pest Management (NPM) program. Farmers are encouraged to review the resource to better understand the potassium cycle and optimize potassium management for their operations.",
      "summaryTimestamp": 1770701255271
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2023 Wisconsin winter wheat crop is developing 10-14 days ahead of average due to the warm weather. As of mid-April, 80% of the state's winter wheat was in the jointing stage, compared to the typical 50-60% at this time. However, the advanced growth stage increases the risk of frost damage. Farmers are advised to closely monitor their fields and consider frost protection measures if temperatures drop below 24°F. Despite the early progress, overall winter wheat condition in Wisconsin is reported as 72% good to excellent, slightly lower than the 5-year average of 75%. Experts recommend that farmers scout fields regularly, apply fungicides proactively, and stay up-to-date on the latest weather forecasts to manage the 2023 winter wheat crop effectively.",
      "summaryTimestamp": 1770701257584
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n- Soybean plant stands can be reduced early in the season due to abiotic factors (freezing, hail, flooding) or biotic factors (slugs, deer, disease, insects).\n- The optimal plant population for soybeans is 100,000-150,000 plants per acre. Stands below 80,000 plants per acre may warrant replanting.\n- Factors to evaluate include current plant population, growth stage, growing conditions, and expected yield of the current stand vs. a replanted crop.\n- Replanting should be done within 7-10 days of the initial planting to maximize yield potential. Later replanting can result in up to 10% yield reduction.\n- Replanting expenses include seed, fuel, labor, and potential crop insurance implications. Weighing costs vs. expected yield increase is important.\n- Shawn P. Conley, a soybean and small grains specialist at UW-Madison, advises carefully evaluating the field before making a replanting decision.",
      "summaryTimestamp": 1770701260343
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n- 2,4-D may be used for postemergence broadleaf weed control in Enlist E3 soybeans, but there are important considerations for farmers to be aware of.\n- The EPA approved the registration of 2,4-D for use on Enlist E3 soybeans, but this approval expires on December 20, 2023. Farmers need to be aware of this deadline.\n- Rodrigo Werle, a weed scientist and extension specialist at UW-Madison, recommends that farmers consult with their local extension office or chemical dealer to ensure they are using 2,4-D products in compliance with the label and relevant regulations.\n- Werle also advises farmers to be cautious of potential off-target movement of 2,4-D, which can damage nearby susceptible crops. He recommends following all label instructions carefully.\n- The article does not provide any specific data or statistics, but emphasizes the importance of staying informed and compliant when using 2,4-D on Enlist E3 soybeans in 2024.",
      "summaryTimestamp": 1770701263489
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Wisconsin Certified Crop Advisor (CCA) Board election results are as follows:\n\nRob Shields, Matt Brugger, and Chris Bandura have been elected to the Wisconsin CCA Board. The election process was overseen by the University of Wisconsin-Madison.\n\nThe newly elected board members will serve 3-year terms. Their responsibilities will include providing guidance and support to Wisconsin's network of over 1,000 CCAs, who play a crucial role in promoting sustainable agriculture practices.\n\nCCAs are agricultural professionals certified by the American Society of Agronomy to provide expert advice to farmers on topics like nutrient management, pest control, and crop production. There are currently over 13,000 CCAs across the United States and Canada.\n\nThe Wisconsin CCA program is funded in part by the Wisconsin Corn Promotion Board and the Wisconsin Soybean Marketing Board. These organizations represent the state's corn and soybean farmers respectively.",
      "summaryTimestamp": 1770701266532
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 0,
  "updated": "2026-02-10T06:59:14.065Z"
}