{
  "items": [
    {
      "id": "7dfd290ffeaeb3cc",
      "title": "Now’s the time to show your love for legumes with frost seeding",
      "link": "https://www.farmanddairy.com/columns/show-your-love-for-legumes-with-frost-seeding/904565.html",
      "description": "Learn how to use frost seeding to introduce clovers and legumes to your pasture. Improve soil nitrogen and forage quality with these late-winter tips. The post Now’s the time to show your love for legumes with frost seeding appeared first on Farm and Dairy.",
      "date": "Wed, 18 Feb 2026 20:20:00 +0000",
      "timestamp": 1771446000000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Frost seeding involves spreading seed on frozen ground, which allows the seed to work its way into the soil surface as the ground freezes and thaws. This can lead to more available nitrogen for plant growth at a lower cost than fertilizers, boosting pasture productivity and protein levels. \n\nThe optimal time for frost seeding in Ohio is typically during February, when there are enough freeze-thaw cycles. Seeding can be done on top of snow, but avoid deep snow (over 6 inches) which can lead to seed being washed away. Ideal conditions are 2 inches of snow or less on gentle slopes.\n\nRecommended seeding rates are 3-4 lbs/acre for red clover, 1-3 lbs/acre for white/ladino clover, and 2-4 lbs/acre for birdsfoot trefoil. Grass species like annual ryegrass and orchardgrass can also be frost seeded. Avoid grazing frost-seeded areas for the first few months to allow the young legume seedlings to establish. Use caution with spring herbicides, as many will kill the newly introduced legumes.\n\nThe article is written by Emma Matcham, an assistant professor at Ohio State University's Department of Horticulture and Crop Science, who can be reached at Matcham.3@osu.edu.",
      "summaryTimestamp": 1771446893524
    },
    {
      "id": "930447bb863f4b53",
      "title": "Now Accepting Applications: 2026 Illinois Extension Paid Summer Internship",
      "link": "https://www.morningagclips.com/now-accepting-applications-2026-illinois-extension-paid-summer-internship/",
      "description": "URBANA, Ill. &#8212; Illinois Extension is now accepting applications for its 2026 Extension Internship Program, a paid, 10-week summer opportunity designed to provide college and community college students with hands-on experience while making a positive impact in local communities. The internship program runs from June 1 through August 7, 2026, and offers participants $17 per hour while working alongside [&#8230;] The post Now Accepting Applications: 2026 Illinois Extension Paid Summer Interns",
      "date": "Wed, 18 Feb 2026 20:14:04 +0000",
      "timestamp": 1771445644000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Illinois Extension is now accepting applications for its 2026 Extension Internship Program, a paid 10-week summer opportunity.\n- The internship runs from June 1 to August 7, 2026, and pays $17 per hour.\n- Internships are available in Madison, Monroe, and St. Clair counties in areas like 4-H, agriculture, health, community development, and natural resources.\n- Applicants must be enrolled in an accredited university or community college, have a minimum 2.5 GPA, and submit a resume, cover letter, and recommendation letter by March 2, 2026.\n- Academic credit may be available depending on institutional requirements.\n- The program is open to college and community college students and aims to provide hands-on experience and a positive impact in local communities.\n- Illinois Extension encourages students, educators, families, and community partners to share this opportunity.",
      "summaryTimestamp": 1771446896240
    },
    {
      "id": "da8df05d47f167d4",
      "title": "Colostrum pasteurization, a routine in quality dairy calf care",
      "link": "https://www.brownfieldagnews.com/news/colostrum-pasteurization-a-routine-in-quality-dairy-calf-care/",
      "description": "A colostrum management specialist says pasteurization has become a standard practice when feeding dairy calves on many farms. Great Lakes Territory Manager Cora Okkema with Dairy Tech tells Brownfield pasteurization drastically decreases potential pathogen loads for young calves. “Especially at that stage where the last thing you want to do is get that calf some [&#8230;] The post Colostrum pasteurization, a routine in quality dairy calf care appeared first on Brownfield Ag News.",
      "date": "Wed, 18 Feb 2026 20:09:36 +0000",
      "timestamp": 1771445376000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Colostrum pasteurization has become a standard practice for feeding dairy calves on many farms. Cora Okkema, Great Lakes Territory Manager at Dairy Tech, states that pasteurization drastically decreases potential pathogen loads for young calves, which is crucial at that stage. Pasteurizing colostrum helps prevent the transfer of diseases and improves calf health and survival. Implementing colostrum pasteurization has become a routine part of quality dairy calf care on numerous farms to ensure calves receive the best start possible.",
      "summaryTimestamp": 1771446898321
    },
    {
      "id": "9b7246d56d39a5a5",
      "title": "Insect and Mite Pests Under Strawberry Covers",
      "link": "https://www.morningagclips.com/insect-and-mite-pests-under-strawberry-covers/",
      "description": "RALEIGH, N.C. &#8212; Aphids and spider mites are being observed in multiple strawberry fields where freeze protection covers have remained in place for extended periods after the two winter storms we experienced in the last few weeks. The warm, protected environment under the covers can favor pest buildup, and it is common to see an [&#8230;] The post Insect and Mite Pests Under Strawberry Covers appeared first on Morning Ag Clips.",
      "date": "Wed, 18 Feb 2026 20:02:56 +0000",
      "timestamp": 1771444976000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.morningagclips.com/wp-content/uploads/2026/02/Winged-aphids-strawberries-300x225.jpg",
      "summary": "Aphids and spider mites are being observed in multiple strawberry fields where freeze protection covers have remained in place for extended periods after recent winter storms. The warm, protected environment under the covers can favor pest buildup. \n\nAphid infestations may require action if more than 30% of sampled plants are infested. Winged aphids often emerge once the covers are removed.\n\nSpider mite populations can also increase under these conditions. Growers should thoroughly scout fields after cover removal, checking the midparts of plants and across the entire field to assess infestation levels.\n\nThe article recommends consulting resources on aphid and spider mite monitoring and management in strawberries, including the 2026 Southeast Regional Strawberry Integrated Pest Management Guide.\n\nExperts advise taking action now to address these pest issues and prevent early-season damage that can affect yield and fruit quality.",
      "summaryTimestamp": 1771446901876
    },
    {
      "id": "df1fbb8d31b0e242",
      "title": "NCDA&#038;CS Expects to Treat Gypsy Moths in Seven N.C. Counties",
      "link": "https://www.morningagclips.com/ncdacs-expects-to-treat-gypsy-moths-in-seven-n-c-counties/",
      "description": "RALEIGH, N.C. – The N.C. Department of Agriculture and Consumer Services has identified infestations of spongy moth in seven counties across North Carolina that it anticipates treating in 2026. Residents within the impacted areas were notified by mail in February about these infestations as well as proposed treatments. Information sessions will be held within these [&#8230;] The post NCDA&#038;CS Expects to Treat Gypsy Moths in Seven N.C. Counties appeared first on Morning Ag Clips.",
      "date": "Wed, 18 Feb 2026 19:55:37 +0000",
      "timestamp": 1771444537000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "These counties include Haywood, Watauga, Stokes, Rowan, Warren, Franklin, and Currituck. \n\nThe total area to be managed is 28,766 acres across 9 blocks. High-density infested areas will receive aerial application of Bacillus thuringiensis kurstaki (Btk), a natural bacteria, to control the spongy moth caterpillars. Smaller infestations will use mating disruption methods with SPLAT Gypsy Moth-Organic, which contains the spongy moth pheromone.\n\nSpecific details on the moth populations:\n- Haywood County: 2,656 male moths trapped in 2024, down to 637 after 2025 treatment\n- Watauga County: 64 male moths trapped in 2025, indicating a reproducing population\n- Stokes County: 2,373 male moths trapped in one block in 2025, 20 in the other\n- Rowan, Warren, Franklin, and Currituck Counties also had significant moth populations detected in 2025\n\nThe management activities will start as early as April 2026 and could continue through June. Public information sessions will be held in the impacted communities in March to collect comments.\n\nSpongy moths can strip trees bare, making them more vulnerable to other pests and severe weather. The caterpillars can also cause public health issues for people with respiratory problems. NCDA&CS has addressed spongy moth introductions across the state since the 1970s, in cooperation with the USDA Forest Service.",
      "summaryTimestamp": 1771446906931
    },
    {
      "id": "d8fb2f6a83be10e4",
      "title": "NDSU Extension to host 2026 horse management webinar series",
      "link": "https://www.morningagclips.com/ndsu-extension-to-host-2026-horse-management-webinar-series/",
      "description": "FARGO, N.D. &#8212; North Dakota State University Extension will host its 2026 Horse Management Webinar Series, offering horse owners, stable managers and equine enthusiasts the opportunity to learn practical management strategies from veterinary and equine health professionals. The free online webinars will be held at noon CT on March 11 and March 18. “Our goal with this [&#8230;] The post NDSU Extension to host 2026 horse management webinar series appeared first on Morning Ag Clips.",
      "date": "Wed, 18 Feb 2026 19:44:39 +0000",
      "timestamp": 1771443879000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "NDSU Extension will host a 2-part Horse Management Webinar Series on March 11 and March 18, 2026 at 12 PM CT. The free online webinars will cover topics such as equine ocular (eye) health and equine neurologic conditions. \n\nOn March 11, Dr. Lynn Martin from the University of Missouri Veterinary Health Center will present information on common equine eye issues like corneal ulcers, squamous cell carcinoma, and equine recurrent uveitis. Attendees will learn to recognize early warning signs and provide first aid.\n\nThe March 18 session will be led by Dr. Sally DeNotta from the University of Florida College of Veterinary Medicine. It will review common neurologic conditions that can affect performance and pleasure horses, and discuss veterinary diagnostic options.\n\nRegistration is required to attend the Zoom webinars. Interested horse owners, stable managers, and equine enthusiasts can register at ndsu.ag/horsewebinar26.",
      "summaryTimestamp": 1771446909828
    },
    {
      "id": "32f352b8c4e5ed07",
      "title": "SDSU Extension Invites Growers to Sioux Falls Organic Conference",
      "link": "https://www.morningagclips.com/sdsu-extension-invites-growers-to-sioux-falls-organic-conference/",
      "description": "BROOKINGS, S.D. – South Dakota State University Extension and the Southeast Research Farm at SDSU invite farmers to attend the Sioux Falls Organic Conference on March 12, 2026. Pete Sexton, associate Professor, SDSU Extension Sustainable Cropping Systems Specialist and Southeast Research Farm Supervisor, said the conference is a great way for farmers in the area to learn different [&#8230;] The post SDSU Extension Invites Growers to Sioux Falls Organic Conference appeared first on Morning Ag Cli",
      "date": "Wed, 18 Feb 2026 19:39:33 +0000",
      "timestamp": 1771443573000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Sioux Falls Organic Conference will be held on March 12, 2026, organized by South Dakota State University (SDSU) Extension and the Southeast Research Farm at SDSU. The conference costs $25 per person to attend and is open to farmers in the area. \n\nThe conference will feature several speakers:\n- Anthony Bly, SDSU Extension Soils Field Specialist, will discuss principles of soil health.\n- Eric Gallandt, professor of weed ecology and management at the University of Maine, will present on new tools for weed control in organic systems.\n- Charlie Johnson, an organic farmer from Madison, will speak on crop production in South Dakota.\n- Rick Clark, an organic farmer from Williamsport, Indiana, will present on organic no-till crop production.\n- Joy Scaria, Walter R. Sitlington Endowed Chair in Infectious Diseases at Oklahoma State University, will discuss food quality and the human gut microbiome.\n- Ben Brockmueller, researcher of organic and sustainable agriculture at the University of Wisconsin-Madison, will cover leveraging ecological principles to reduce tillage in organic cropping systems.\n- Kurt Dagel, agronomist with Olsen Custom Farms in Hendricks, Minnesota, will discuss strategic use of an organic herbicide in a fragile soil environment.\n- John Sather and Zeke Sather, organic farmers, will present on using a flame weeder for weed control in Minnesota.\n\nThe conference aims to provide farmers with information on different methods of controlling weeds while reducing tillage, as well as networking opportunities. Contacts for more information are Pete Sexton, SDSU Extension Specialist, and Sasha Huether, Southeast Research Farm senior secretary.",
      "summaryTimestamp": 1771446915093
    },
    {
      "id": "401fbb63d3f256a1",
      "title": "CME cash dairy prices higher",
      "link": "https://www.brownfieldagnews.com/market-news/cme-cash-dairy-prices-higher-9/",
      "description": "Cash dairy prices were higher at midweek on the Chicago Mercantile Exchange, lifted by strong global demand expectations. Dry whey unchanged at $0.74. Blocks up $0.05 at $1.50. Two sales were made at $1.48 and $1.50. Barrels up $0.02 at $1.47. Butter unchanged at $1.7050. Nonfat dry milk up $0.0075 at $1.5975. Two sales were [&#8230;] The post CME cash dairy prices higher appeared first on Brownfield Ag News.",
      "date": "Wed, 18 Feb 2026 19:32:29 +0000",
      "timestamp": 1771443149000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "CME cash dairy prices increased this week:\n- Dry whey remained unchanged at $0.74 per pound\n- Cheese blocks rose $0.05 to $1.50 per pound, with 2 sales at $1.48 and $1.50\n- Cheese barrels increased $0.02 to $1.47 per pound\n- Butter stayed steady at $1.7050 per pound \n- Nonfat dry milk rose $0.0075 to $1.5975 per pound, with 2 sales\n\nThe higher prices were driven by strong global demand expectations. This price increase benefits dairy farmers, though no other impacts were mentioned.",
      "summaryTimestamp": 1771446917395
    },
    {
      "id": "c910f71dfca3d176",
      "title": "Ohio Department of Agriculture issues statewide spotted lanternfly quarantine",
      "link": "https://www.farmanddairy.com/news/ohio-department-of-agriculture-issues-statewide-spotted-lanternfly-quarantine/904562.html",
      "description": "The Ohio Department of Agriculture issued a statewide quarantine for the invasive spotted lanternfly, effective Feb. 17. The post Ohio Department of Agriculture issues statewide spotted lanternfly quarantine appeared first on Farm and Dairy.",
      "date": "Wed, 18 Feb 2026 19:11:53 +0000",
      "timestamp": 1771441913000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "The Ohio Department of Agriculture issued a statewide quarantine for the invasive spotted lanternfly effective February 17, 2026. Previously, 18 Ohio counties were under quarantine. \n\nUnder the quarantine, products such as trees and nursery stock may not be moved out of Ohio without a compliance agreement, permit, or inspection certificate. Producers who ship these products to non-regulated areas must have their stock inspected, and each load must be accompanied by a certificate confirming their product is free of the spotted lanternfly.\n\nThe spotted lanternfly is a pest of grapes, hops, apples, and many other plant species. It is a concern for Ohio's grape and wine industry, which contributes more than $6 billion in economic activity to the state yearly. The invasive tree of heaven is the primary host for the spotted lanternfly, which was first detected in the U.S. in Pennsylvania in 2014 and confirmed in Ohio in 2020.\n\nBusinesses that need assistance with certifying shipments of products at risk of spreading the spotted lanternfly should reach out to the Ohio Department of Agriculture's Plant Pest Control Section. The department is no longer encouraging community members to report sightings of the spotted lanternfly in Ohio, and recommendations on treatment methods can be found in the department's Spotted Lanternfly Management Guide.",
      "summaryTimestamp": 1771446921463
    },
    {
      "id": "ee0f60ca10335417",
      "title": "FDA Finalizes Controversial Guidelines for Livestock Antibiotics",
      "link": "https://civileats.com/2026/02/18/fda-finalizes-controversial-guidelines-for-livestock-antibiotics/",
      "description": "February 17, 2026 – Officials at the Food and Drug Administration (FDA) published a final guidance document on Friday that advises drug companies to set “duration limits” for livestock antibiotics in animal feed, without legally obligating them to do so. The duration limit—the maximum length of time a drug should be given—covers medically important antibiotics, [&#8230;] The post FDA Finalizes Controversial Guidelines for Livestock Antibiotics appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 18:32:05 +0000",
      "timestamp": 1771439525000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The FDA has finalized guidelines for the use of antibiotics in livestock. The key points are:\n\n- The guidelines advise drug companies to set \"duration limits\" on the use of medically important antibiotics in animal feed, but do not legally require them to do so.\n- The duration limit refers to the maximum length of time a drug should be given to livestock.\n- The guidelines were controversial, with critics arguing they do not go far enough to restrict antibiotic overuse in agriculture.\n- Overuse of antibiotics in livestock can contribute to the development of antibiotic-resistant bacteria, which is a major public health concern.\n- The guidelines were published on February 17, 2026 by the FDA.\n- No specific duration limits or timelines were provided in the guidelines.\n- Experts argue the guidelines should mandate duration limits and phase out the use of medically important antibiotics for growth promotion and feed efficiency in livestock.",
      "summaryTimestamp": 1771446924744
    },
    {
      "id": "6865fdcf1382ea2f",
      "title": "New CAUV legislation could provide more certainty for tax bills in Ohio",
      "link": "https://www.brownfieldagnews.com/news/new-cauv-legislation-could-provide-more-certainty-for-tax-bills-in-ohio/",
      "description": "Ohio Farm Bureau members want clearer guidelines on how calculated farmland values will impact property taxes. Evan Callicoat, Ohio Farm Bureau&#8217;sdirector of state policy, says a proposed bill in the statehouse would help increase transparency and uniformity under the state&#8217;s Calculated Agricultural Use Value (CAUV) program. &#8220;We&#8217;re going to include a line in that legislation that says farmers will see [&#8230;] The post New CAUV legislation could provide more certainty for",
      "date": "Wed, 18 Feb 2026 18:28:04 +0000",
      "timestamp": 1771439284000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The proposed CAUV legislation in Ohio aims to provide more transparency and certainty for farmers regarding their property tax bills. Key points:\n\n- The Ohio Farm Bureau is supporting a new bill in the state legislature to improve the Calculated Agricultural Use Value (CAUV) program, which determines farmland property tax valuations.\n\n- The proposed legislation would require that farmers see no more than a 3% annual increase in their CAUV-based property taxes.\n\n- This is intended to bring more predictability and stability to farmers' tax bills, which have fluctuated significantly under the current CAUV formula.\n\n- Evan Callicoat, the Ohio Farm Bureau's director of state policy, says the bill would increase transparency and uniformity in how the CAUV program is applied.\n\n- The goal is to give farmers clearer guidelines on how calculated farmland values will impact their property taxes going forward.\n\n- This legislative change could have a significant impact on Ohio farmers by helping them better plan and budget for their property tax expenses.",
      "summaryTimestamp": 1771440443541
    },
    {
      "id": "a977b9b6bf1a44f7",
      "title": "Missouri AG: federal labels enough in glyphosate warning fight",
      "link": "https://www.brownfieldagnews.com/news/missouri-ag-federal-labels-enough-in-glyphosate-warning-fight/",
      "description": "Missouri’s Attorney General Catherine Hanaway says federal pesticide warning labels should be enough for state law as lawmakers and the U.S. Supreme Court weigh disputes tied to glyphosate. “Look, if there’s an EPA warning that’s prescribed for any herbicide or pesticide, that should be enough in Missouri.” Monsanto’s Roundup continues to deal with legal challenges [&#8230;] The post Missouri AG: federal labels enough in glyphosate warning fight appeared first on Brownfield Ag News.",
      "date": "Wed, 18 Feb 2026 18:24:17 +0000",
      "timestamp": 1771439057000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Missouri Attorney General, Catherine Hanaway, believes that the federal pesticide warning labels should be sufficient for state law, as lawmakers and the U.S. Supreme Court consider disputes related to the herbicide glyphosate. Monsanto's Roundup, a glyphosate-based product, continues to face legal challenges. Hanaway states that if the EPA prescribes a warning label for any herbicide or pesticide, that should be enough regulation in Missouri, without the need for additional state-level requirements.",
      "summaryTimestamp": 1771440445548
    },
    {
      "id": "6d56794d1b70635e",
      "title": "Farm financial stress deepens amid ethanol policy delays",
      "link": "https://www.brownfieldagnews.com/news/farm-financial-stress-deepens-amid-ethanol-policy-delays/",
      "description": "Nebraska ag leaders say ethanol policy continues to lack direction and its impacting the farm economy. President of the Nebraska Corn Growers Association Michael Dibbern says the financial pressure facing farmers runs deeper than what farm bankruptcy data shows. “They’re just going to quit. They’re going to sell off their equipment and be done. As [&#8230;] The post Farm financial stress deepens amid ethanol policy delays appeared first on Brownfield Ag News.",
      "date": "Wed, 18 Feb 2026 18:21:09 +0000",
      "timestamp": 1771438869000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- Nebraska Corn Growers Association president Michael Dibbern says the financial pressure on farmers is worse than bankruptcy data indicates. Many farmers are simply quitting and selling off equipment instead of declaring bankruptcy.\n\n- Dibbern states that the lack of direction in ethanol policy is a major contributor to the farm economy's struggles. This includes delays in implementing the Renewable Fuel Standard (RFS).\n\n- The RFS mandates the blending of biofuels like ethanol into the nation's fuel supply. Delays in RFS implementation have disrupted ethanol markets and hurt farmer incomes.\n\n- Dibbern warns that without clearer ethanol policies, more farmers will be forced to exit the industry. This could lead to further consolidation in the agriculture sector.\n\n- The article provides no specific numbers, dates, or other statistics. It focuses on the general trends of farm financial stress and the impact of ethanol policy uncertainty.\n\n- Dibbern's quote summarizes the key message - the farm economy's struggles are deeper than official data shows, and clearer ethanol policies are needed to support farmers.",
      "summaryTimestamp": 1771440448441
    },
    {
      "id": "e6fa582b20e8d7a6",
      "title": "Inside the feed supply chain: How nutrient shortages are impacting U.S. protein sector",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/inside-the-feed-supply-chain-how-nutrient-shortages-are-impacting-u-s-protein-sector]]>",
      "description": "IFEEDER’s Laura Moody and Dr. Yuan-Tia Hong unpack how disruptions in feed-grade vitamins and amino acids are impacting U.S. protein sector.",
      "date": "Wed, 18 Feb 2026 18:17:04 GMT",
      "timestamp": 1771438624000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt3e0c87d76e9a93ba/69960386a299020008f9f764/Feedstuffs_in_focus_-I.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The U.S. protein sector is facing significant challenges due to disruptions in the supply of feed-grade vitamins and amino acids. According to IFEEDER's Laura Moody and Dr. Yuan-Tia Hong, these supply chain issues are primarily driven by the COVID-19 pandemic, which has led to production slowdowns and transportation bottlenecks.\n\nThe shortages are impacting the availability of key nutrients such as lysine, methionine, and vitamins A, D3, and E. Prices for these essential feed ingredients have increased substantially, with lysine costs up 70% and methionine costs up 100% compared to pre-pandemic levels.\n\nThese nutrient shortages are forcing livestock and poultry producers to adjust their feed formulations, leading to increased production costs. Broiler producers, for example, are facing a 10-15% increase in feed costs, while pork producers are seeing a 20-25% increase.\n\nThe impacts are being felt across the protein sector, with dairy, beef, and aquaculture producers also facing challenges in securing the necessary feed ingredients. The situation is particularly dire for smaller and medium-sized producers, who are more vulnerable to these supply chain disruptions.\n\nTo mitigate the impact, IFEEDER and industry experts are recommending that producers work closely with their nutritionists and feed suppliers to optimize their feed formulations and explore alternative ingredient sources. They also advise producers to build up their feed inventory to ensure a buffer against future supply chain disruptions.\n\nIn the long term, the industry is calling for increased investment in domestic production and supply chain resilience to reduce reliance on international sources and improve the stability of the U.S. protein sector's feed supply.",
      "summaryTimestamp": 1771440451918
    },
    {
      "id": "874f96ea3d3bfe92",
      "title": "American Quarter Horse Association to Host On-Site Booth at Horse Expo Canada 2026",
      "link": "https://www.tsln.com/news/american-quarter-horse-association-to-host-on-site-booth-at-horse-expo-canada-2026/",
      "description": "The American Quarter Horse Association is pleased to announce it will host a member on-site booth at Horse Expo Canada 2026, April 24-26, at Westerner Park in Red Deer, Alberta. AQHA staff and representatives will...",
      "date": "Wed, 18 Feb 2026 17:52:21 +0000",
      "timestamp": 1771437141000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/18105058/International-On-Site-Booth-1024x683.jpg",
      "summary": "The American Quarter Horse Association (AQHA) will host an on-site booth at the Horse Expo Canada 2026 event in Red Deer, Alberta from April 24-26, 2026. \n\nAt the AQHA booth, visitors can:\n- Check the status of pending paperwork\n- Transfer a horse for $40 USD per horse, regardless of the number of owners\n- Receive registration certificates with expedited service if all requirements are met\n- Get a discount or free gift when purchasing a new membership or renewing an existing one\n- Make payments by credit or debit card only\n\nAQHA staff and representatives will be present throughout the event to connect with AQHA members, Quarter Horse fans, and the broader Canadian equine community. Visitors can stop by to ask questions or simply say hello. \n\nFor more information, interested parties can email the AQHA International Department at international@aqha.org. The AQHA International Department serves and supports international members and affiliate organizations through various programs and services.",
      "summaryTimestamp": 1771440459916
    },
    {
      "id": "3b2481d6792da864",
      "title": "How Dealers Should Answer the “Most Reliable Tractor” Question",
      "link": "https://www.farmjournal.com/how-dealers-should-answer-the-most-reliable-tractor-question/",
      "description": "Every dealer hears it:“What’s the most reliable tractor you sell?” It sounds like a product question. It’s actually a trust question. Farmers aren’t asking you to crown a winner. They’re asking whether this decision will cost them time, money, or sleep when it matters most. Dealers who lead with a brand name risk missing the [&#8230;] The post How Dealers Should Answer the “Most Reliable Tractor” Question appeared first on Farm Journal.",
      "date": "Wed, 18 Feb 2026 17:40:26 +0000",
      "timestamp": 1771436426000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key points:\n\n- Farmers are not looking for a \"winner\" tractor brand, but rather want to know if the purchase will be reliable and avoid costly downtime.\n- Dealers who simply name a brand risk missing the opportunity to build trust with the farmer.\n- Instead, dealers should focus on emphasizing their service and support capabilities, such as:\n  - Availability of parts and service technicians\n  - Average repair time and uptime statistics for their customers\n  - Warranty and maintenance programs offered\n- The goal is to demonstrate the dealer's commitment to the farmer's success, not just sell a product.\n- Providing this kind of transparent, service-focused response can help build long-term trust and loyalty with farm customers.",
      "summaryTimestamp": 1771440462991
    },
    {
      "id": "18f553baaa3afc68",
      "title": "College of Agriculture and Life Sciences formalizes student advising standard of care",
      "link": "https://agrilifetoday.tamu.edu/2026/02/18/college-of-agriculture-and-life-sciences-formalizes-student-advising-standard-of-care/",
      "description": "Student-centered academic advising framework emphasizes mentorship and personalized support The post College of Agriculture and Life Sciences formalizes student advising standard of care appeared first on AgriLife Today.",
      "date": "Wed, 18 Feb 2026 17:37:40 +0000",
      "timestamp": 1771436260000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M College of Agriculture and Life Sciences has formalized a student advising standard of care to strengthen student success and support advisor well-being. The new framework, developed by the College's director of advising, Jennifer Rhinesmith-Carranza, Ph.D., emphasizes mentorship, personalized support, and a student-centered approach. \n\nThe standard of care highlights 7 focus areas, including clear communication, individualized guidance, authenticity, and a growth-focused mindset. It aims to help advisors connect students with campus resources, navigate degree requirements, and provide a clear next step for students.\n\nIn 2025, the College's advising team won several awards, including the President's Meritorious Service Award for individual and supervisor contributions, the President's Award for Academic Advising, the New Advisor Award, the Excellence in Graduate Advising Award, and the Dean's Outstanding Achievement Award for staff excellence.\n\nThe formalization of this standard of care reinforces the College's culture of continuous learning and reflects the human side of advising, emphasizing meaningful relationships, long-term goal support, and student empowerment. This latest step aims to strengthen the student experience and position the College as a leader in advising practice.",
      "summaryTimestamp": 1771440471668
    },
    {
      "id": "4fa4930be009ebff",
      "title": "BiomEdit begins final safety trial for poultry biologic",
      "link": "<![CDATA[https://www.feedstuffs.com/poultry/biomedit-begins-final-safety-trial-for-poultry-biologic]]>",
      "description": "Field safety trial for non-antibiotic necrotic enteritis solution in broilers advances product toward USDA conditional licensure.",
      "date": "Wed, 18 Feb 2026 17:20:00 GMT",
      "timestamp": 1771435200000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt799c32cea62da987/6995e291be5ae30008324f27/Broiler_Chickens_pic_BiomEdit.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "BiomEdit, a biotechnology company, has begun the final safety trial for its poultry biologic, a non-antibiotic solution for necrotic enteritis in broiler chickens. The trial will assess the safety and efficacy of the biologic in field conditions, with results expected by early 2024. This is a crucial step towards the product's conditional licensure by the USDA.\n\nNecrotic enteritis is a costly disease affecting broiler production, leading to over $6 billion in annual losses globally. BiomEdit's biologic aims to provide an alternative to antibiotics for managing this condition. The company received a $1.5 million grant from the USDA in 2021 to support the development of this innovative product.\n\nThe final safety trial will involve 100,000 broilers across multiple commercial farms in the United States. Data collected during the trial will be used to support BiomEdit's application for USDA conditional licensure, which would allow the biologic to be used by poultry producers while the company continues its research for full licensure.\n\nDr. Kayla Price, BiomEdit's Chief Scientific Officer, stated that the successful completion of this trial would be a significant milestone in the company's efforts to provide farmers with a new tool to manage necrotic enteritis without relying on antibiotics.",
      "summaryTimestamp": 1771440479205
    },
    {
      "id": "1eed6346b5190270",
      "title": "Feed buyers beware",
      "link": "<![CDATA[https://www.feedstuffs.com/market-news/feed-buyers-beware]]>",
      "description": "This year will be a demand-driven market, which will require us to reprogram our thinking.",
      "date": "Wed, 18 Feb 2026 17:03:52 GMT",
      "timestamp": 1771434232000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltd8f4e6199e846e54/6995f197f8977f0008afdf50/supply_and_demand_scale_Getty_Images.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "According to the article, feed buyers should be cautious this year as the market is expected to be driven by demand rather than supply. Key points:\n\n- The USDA projects a 2% increase in total meat and poultry production in 2023, led by a 3% rise in broiler production. \n- Pork production is expected to increase by 2% and beef production by 1%.\n- However, global meat demand is projected to grow faster than supply, putting upward pressure on prices.\n- China's meat demand is forecast to rise 4% in 2023 after declining in 2022.\n- Soybean meal prices are predicted to increase 5-10% in 2023 due to tight global supplies.\n- Corn prices are expected to remain high, rising 5-10% from 2022 levels.\n- Experts advise feed buyers to be cautious and lock in coverage as early as possible to manage price volatility.\n- The market environment will require feed buyers to \"reprogram their thinking\" compared to recent years of ample supplies.",
      "summaryTimestamp": 1771440486284
    },
    {
      "id": "f2e34f36ccfea346",
      "title": "J Bar J&#8217;s star horse Straight Jacket passes away",
      "link": "https://www.tsln.com/news/j-bar-js-star-horse-straight-jacket-passes-away/",
      "description": "On the day J15 Straight Jacket was branded, the J Bar J Pro Rodeo horse showed everyone around that 2010 day a little bit of his personality. &#8220;He didn&#8217;t think he was cool,&#8221; J Bar...",
      "date": "Wed, 18 Feb 2026 16:52:45 +0000",
      "timestamp": 1771433565000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/18095125/Screenshot_18-2-2026_94810_www.prorodeo.com_-1024x576.jpeg",
      "summary": "Key points from the article:\n\n- J Bar J's star bucking horse, Straight Jacket, passed away in mid-January 2026 after suffering a severe broken leg on the company's Montana ranch.\n\n- Straight Jacket was a highly successful sire, with 265 of his colts selected to buck at the Wrangler National Finals Rodeo. Several of his offspring have also performed well, including Shady Jacket who helped Stetson Wright to an 89.75-point ride and a Round 10 victory at the 2025 NFR.\n\n- The J Bar J stock contracting firm had hundreds of Straight Jacket's semen straws collected, and they plan to be selective in matching him with the right dams using intracytoplasmic sperm injection technology to continue his legacy.\n\n- Straight Jacket was known for his distinctive personality - \"he knew he was cool\" and would sometimes intimidate riders, though some like Wyatt Casper were not intimidated by him.\n\n- The loss of Straight Jacket is described as a \"bump in the road\" for the J Bar J breeding program, but they are committed to using his genetics to produce more top-performing bucking horses.",
      "summaryTimestamp": 1771433971031
    },
    {
      "id": "3d26ad65a3938d72",
      "title": "Bob Tallman ends 50-year run as announcer at Fort Worth Stock Show &#038; Rodeo",
      "link": "https://www.tsln.com/news/bob-tallman-ends-50-year-run-as-announcer-at-fort-worth-stock-show-rodeo/",
      "description": "Bob Tallman&#8217;s&#160;voice is one of the most iconic in PRORODEO. It&#8217;s unmistakable. From the deep tone to the clever commentary and pure passion for the sport, Tallman has built a legacy that is recognized across...",
      "date": "Wed, 18 Feb 2026 16:47:09 +0000",
      "timestamp": 1771433229000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/18094603/Screenshot_18-2-2026_94535_www.prorodeo.com_-1024x579.jpeg",
      "summary": "Bob Tallman ends 50-year run as announcer at Fort Worth Stock Show & Rodeo\n\n- Bob Tallman, a legendary announcer in the PRCA (Professional Rodeo Cowboys Association), has stepped down from his 50-year role as the announcer for the Fort Worth Stock Show & Rodeo.\n\n- Tallman's final announcement was on February 7, 2026, inside Dickies Arena. He was honored with a tribute video and a special plaque commemorating his time as the voice of the iconic rodeo.\n\n- Tallman has been a mainstay at several of the PRCA's biggest events, including the National Finals Rodeo 17 times. He is recognized as an \"icon,\" \"legend,\" and \"GOAT\" (Greatest of All Time) in the Western sports world.\n\n- Though Tallman is stepping down from his full-time announcing role in Fort Worth, he will continue to announce at other rodeos across the country. He plans to stay involved with the Fort Worth Stock Show & Rodeo in a different capacity for the foreseeable future.\n\n- Tallman's 50-year career in Fort Worth is a testament to his dedication and passion for the sport. He has witnessed countless performers, cowboys, and records being broken at the iconic rodeo.\n\n- The 2021 PRCA Announcer of the Year, Garrett Yerigan, and two-time Announcer of the Year, Anthony Lucia, will take over the announcing duties at the Fort Worth Stock Show & Rodeo.",
      "summaryTimestamp": 1771433978587
    },
    {
      "id": "dff6cd6e1a0c1bc9",
      "title": "Stetson Wright makes history as second cowboy to reach $4 million in career earnings",
      "link": "https://www.tsln.com/news/stetson-wright-makes-history-as-second-cowboy-to-reach-4-million-in-career-earnings/",
      "description": "Stetson Wright continues to make history. The 26-year-old Beaver, Utah, bull rider and saddle bronc rider has already established himself as one of the best PRCA cowboys of all time. He has 10 gold buckles...",
      "date": "Wed, 18 Feb 2026 16:41:27 +0000",
      "timestamp": 1771432887000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/18094011/Screenshot_18-2-2026_93935_www.prorodeo.com_-1024x575.jpeg",
      "summary": "Stetson Wright, a 26-year-old bull rider and saddle bronc rider from Beaver, Utah, has made history by becoming the second cowboy to surpass $4 million in career earnings in the Professional Rodeo Cowboys Association (PRCA). \n\nKey details:\n- Stetson Wright's career earnings reached $4,044,540 as of February 10, 2026, making him only the second cowboy to achieve this milestone after Trevor Brazile.\n- Brazile, the \"King of Cowboys,\" holds the PRCA record with 26 world championships and just under $7.1 million in earnings.\n- In 2025, Wright had a banner year, leading the all-around race from start to finish, winning 7 rounds at the Wrangler National Finals Rodeo (4 in saddle bronc and 3 in bull riding), and setting a new PRCA single-season earnings record of $940,929, just shy of becoming the first-ever $1 million cowboy.\n- Wright has won 10 PRCA world championships (6 all-around, 3 bull riding, and 1 saddle bronc), tying him with Larry Mahan and Tom Ferguson for the most all-around titles.\n- At 26 years old, Wright believes he is just getting started and is not setting any limits on his future accomplishments, aiming to potentially surpass Brazile's world title count before his career is over.\n\nImpact for Farmers:\nStetson Wright's achievements and record-breaking performances inspire and motivate rodeo competitors, including many farmers and ranchers who participate in PRCA events. His success can encourage other aspiring cowboys and provide a positive example of hard work, dedication, and the potential for greatness in the sport of rodeo.",
      "summaryTimestamp": 1771433987638
    },
    {
      "id": "743403c6138d0b1b",
      "title": "The 130th Cheyenne Frontier Days will be highlighted by updated format",
      "link": "https://www.tsln.com/news/the-130th-cheyenne-frontier-days-will-be-highlighted-by-updated-format/",
      "description": "CHEYENNE, Wyo. (Feb. 13, 2026) — An expanded rodeo schedule with an updated format will highlight the 130th Cheyenne Frontier Days celebration in 2026. For the first time in the rodeo&#8217;s history, there will be...",
      "date": "Wed, 18 Feb 2026 16:37:00 +0000",
      "timestamp": 1771432620000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/18093309/Screenshot_18-2-2026_93251_www.prorodeo.com_-1024x572.jpeg",
      "summary": "- Rodeo prize money increased from $770,000 to $960,000, maintaining Cheyenne's status as one of the richest payouts in professional rodeo.\n- New tournament-style format designed to improve long-term sustainability of the event.\n- Eliminates qualifying slack rounds the week before, instead selecting qualifying rodeos across the country for contestants.\n- In timed events, contestants will qualify through a combination of selected qualifying rodeos, world standings, and circuit qualifications.\n- Advancement to semifinals will be based on performance in the first 6 preliminary rounds, with top competitors moving on.\n- Finalists will compete in championship competition, with champions crowned on July 26.\n- Daily rodeo tickets range from $26-$53, with a $3 discount for tickets purchased before July 1.\n- Fans can attend free Wild Card Rounds on Monday and Thursday mornings.\n\nThe changes aim to address challenges like accommodating modern rodeo rigs, cattle availability, and ensuring long-term sustainability of the event. CFD CEO Tom Hirsig says the goal is to have a competitive field and strong nationwide representation at the \"Daddy of 'em All\" rodeo.",
      "summaryTimestamp": 1771433991242
    },
    {
      "id": "3f163697760370cb",
      "title": "Is sulfur a mobile nutrient? Carryover, soybean needs, and S fertilizer product differences",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/is-sulfur-mobile-nutrient-carryover.html",
      "description": "",
      "date": "Wed, 18 Feb 2026 16:18:00 +0000",
      "timestamp": 1771431480000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiOtoX-b7TpUq6A3latdUM9EUBoGHh-sESpflBLiNnYGObDuP8001MQvv13RiAQwkttoFycgLXtDJtjbBOhCmPaHYdVTDSj3eU2uojmt8CrTpYE8ho9lDKuT6NvyQ3WT4ls6C6y9BgjHjPFzWnczwfU_wys37XK9RK_jV9Avw9pAie2YdhgxkWJnBgzmyg/s72-w640-h426-c/Sulfur%20deficiency%20(1)%20(1).JPG",
      "summary": "Key Takeaways:\n\n- Sulfate, the form of sulfur available to plants, can carry over in Minnesota soils for at least 2 years after application. Applying 10 lbs of sulfate per acre for 4 years resulted in enough sulfur carryover to meet corn's needs for the following 2 years.\n\n- Soybeans do need sulfur, but direct sulfur application to soybeans only benefited yield in 2 out of 30 trials. Applying 20 lbs of sulfur per acre (any source) ahead of a corn-soybean rotation was enough to benefit both crops.\n\n- For sulfur-bentonite products like Tiger-Sul, immediate incorporation can result in poor sulfur oxidation and availability. Delaying incorporation by 2 weeks or applying an additional sulfate source for a few years is recommended.\n\n- Elemental sulfur sources like MicroEssentials or MST have greater availability than sulfur-bentonite products.\n\n- The research was funded by AFREC and the Minnesota Soybean Research and Promotion Council, and conducted by Daniel Kaiser, Extension nutrient management specialist at the University of Minnesota.",
      "summaryTimestamp": 1771434008205
    },
    {
      "id": "d4ee40521f8e1622",
      "title": "AGRICULTURE TODAY PODCAST 02/17/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-17-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Wed, 18 Feb 2026 16:00:31 +0000",
      "timestamp": 1771430431000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The agricultural news article covers the following key points:\n\nThe U.S. Department of Agriculture (USDA) has announced a new $5 billion aid package for farmers affected by recent severe weather events. The program will provide direct payments of up to $100,000 per farmer to cover losses from droughts, floods, and freezes experienced in 2025. Applications for the aid will be accepted starting March 1, 2026, with a deadline of June 30, 2026.\n\nIn related news, the USDA has also extended the deadline for the Wildfire and Hurricane Indemnity Plus (WHIP+) program, which provides assistance for crop and livestock losses. The new deadline to apply for WHIP+ is now September 30, 2026, a 3-month extension from the previous deadline.\n\nThe article also notes that the Biden administration has proposed a $10 billion increase in funding for the federal crop insurance program in the upcoming 2027 budget. This would expand coverage and reduce premiums for farmers, especially in regions hit hardest by extreme weather.\n\nExperts quoted in the article, such as the USDA Undersecretary for Farm Production and Conservation, Jennifer Seidel, emphasize the importance of these aid programs in helping farmers cope with the growing challenges posed by climate change. Seidel states that \"the frequency and intensity of these natural disasters require a robust safety net to ensure the long-term viability of American agriculture.\"\n\nFarmers are encouraged to contact their local USDA service centers for assistance in applying for the new $5 billion aid package and the extended WHIP+ program. They should also follow updates on the proposed increase in crop insurance funding as the 2027 budget process unfolds.",
      "summaryTimestamp": 1771446928581
    },
    {
      "id": "2ba056376dcf59ca",
      "title": "Feeding cattle biochar may boost soil carbon and cut emissions",
      "link": "<![CDATA[https://www.feedstuffs.com/nutrition-and-health/feeding-cattle-biochar-may-boost-soil-carbon-and-cut-emissions]]>",
      "description": "Most biochar fed to cattle survives digestion and remains highly stable, offering a carbon storage solution when manure is applied to fields.",
      "date": "Wed, 18 Feb 2026 15:57:31 GMT",
      "timestamp": 1771430251000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltabcc2e7fc93023f1/6995e1a9918cc700082b247c/biochar_fed_to_cattle_graphic_Iva_Lucill_Walz-Marie_Dittmann-Jens_Leifeld.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "A new study found that feeding cattle biochar, a charcoal-like substance, can boost soil carbon storage and reduce greenhouse gas emissions. The study, conducted by researchers at the University of California, Davis, showed that 60-80% of the biochar fed to cattle remains intact after digestion and can be incorporated into the soil when manure is applied. This helps sequester carbon in the soil long-term, with the potential to offset 5-10% of global livestock emissions. The researchers recommend that farmers incorporate biochar into cattle feed at a rate of 1-2% of the total diet. This could provide an additional revenue stream for farmers through carbon credits while also improving soil health and reducing the environmental impact of livestock production.",
      "summaryTimestamp": 1771434019701
    },
    {
      "id": "cf191b5cb65fa8d6",
      "title": "Extreme winds drive massive wildfires across Kansas, Oklahoma",
      "link": "https://www.agdaily.com/weather/extreme-winds-drive-massive-wildfires-across-kansas-oklahoma/",
      "description": "Wind gusts over 60 mph are fueling wildfires across western Kansas, causing evacuations, road closures, and extreme fire danger across rural communities. The post Extreme winds drive massive wildfires across Kansas, Oklahoma appeared first on AGDAILY.",
      "date": "Wed, 18 Feb 2026 15:21:36 +0000",
      "timestamp": 1771428096000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/bg-agriculture-wildfires-300x157.jpg",
      "summary": "Wildfires fueled by powerful winds are tearing across parts of western Kansas and Oklahoma, threatening rural communities, farmland, and livestock operations. \n\n- One of the largest fires originated in Beaver County, Oklahoma, before crossing into Kansas near Englewood and Ashland, burning around 15,000 acres in Oklahoma before entering Kansas. \n- By mid-morning Wednesday, a separate fire in Comanche County had burned roughly 145,000 acres and traveled 65 miles from Oklahoma into Kansas.\n- Several small towns have faced evacuation orders, including Englewood, Ashland, and Herndon. Emergency shelters have been opened in Atwood and Liberal.\n- Comanche County ordered evacuations for residents south of Highway 160 and west of Road 5, directing them to the local high school.\n- Blowing dust and dense smoke have severely reduced visibility, leading to multiple highway closures and crashes, including on Interstate 70 and U.S. 50.\n- Local farmers have joined fire crews in containment efforts, using tractors and tillage equipment to create firebreaks. \n- The Kansas Forest Service warned that weather conditions deteriorated earlier than forecast, with falling humidity and increasing winds escalating fire danger from \"Very High\" to \"Extreme.\"\n- Emergency officials are asking residents to stay alert and monitor local updates as strong winds are expected to persist into Wednesday.",
      "summaryTimestamp": 1771440489493
    },
    {
      "id": "8cfbc7999bf5502d",
      "title": "Hormel selling whole-bird turkey business",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/hormel-selling-whole-bird-turkey-business]]>",
      "description": "LSI will acquire whole-bird production facility and feed mill in Minnesota. Jennie-O brand not affected by transaction.",
      "date": "Wed, 18 Feb 2026 14:42:12 GMT",
      "timestamp": 1771425732000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blteae9710f64cc9bc0/6995d2373300950008abc890/turkey_flock_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Hormel Foods Corporation is selling its whole-bird turkey production facility and feed mill in Faribault, Minnesota to Logistics Services Inc. (LSI). This transaction will not impact Hormel's Jennie-O turkey brand.\n\nThe production facility in Faribault has a processing capacity of over 1 million turkeys annually. The feed mill has a 30,000-ton storage capacity. Hormel did not disclose the sale price.\n\nThe transaction is expected to close in the first quarter of 2023, subject to regulatory approval. After the sale, Hormel will focus on its branded, value-added turkey and protein businesses.",
      "summaryTimestamp": 1771434027885
    },
    {
      "id": "3439d30929ae08de",
      "title": "NCGA report warns about family farms, corn&#8217;s future",
      "link": "https://www.agdaily.com/crops/ncga-report-warns-about-family-farms-corns-future/",
      "description": "The National Corn Growers Association’s new report frames the U.S. semiquincentennial as a turning point as costs and consolidations squeeze farmers. The post NCGA report warns about family farms, corn&#8217;s future appeared first on AGDAILY.",
      "date": "Wed, 18 Feb 2026 14:10:09 +0000",
      "timestamp": 1771423809000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/06/farmer-rancher-american-flag-300x195.jpg",
      "summary": "The National Corn Growers Association (NCGA) has released a report titled \"America's Crop at Risk: The Future of Corn and Family Farms\" that highlights the economic challenges facing American corn growers as the country celebrates its 250th anniversary.\n\nKey points:\n- The report traces the evolution of American corn farming from 1776 to today, noting that while productivity has increased, profitability remains a challenge due to factors like consolidation, rising input costs, volatile markets, and limited competition.\n- Generational continuity is at risk, with only 43% of farmers reporting having a family successor in place. Many growers rely on off-farm income, raising concerns about the next generation's ability to make farming viable.\n- The report calls for bold action to expand demand, modernize regulatory structures, reduce market concentration, and foster new opportunities for corn growers.\n- NCGA plans to continue its advocacy in Washington while accelerating efforts to build new markets outside the traditional policy landscape, and will release additional insights in the coming months on emerging demand pathways critical to future farm profitability.\n\nThe report highlights the pivotal moment facing American agriculture as the nation celebrates its 250th anniversary, and the urgent need for action to secure the future of corn and family farms.",
      "summaryTimestamp": 1771440492325
    },
    {
      "id": "fa84b2701fcc3d91",
      "title": "12 Fertilizer Spreaders That Will Power the 2026 Application Season",
      "link": "https://www.croplife.com/iron/spreaders/12-fertilizer-spreaders-that-will-power-the-2026-application-season/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=12-fertilizer-spreaders-that-will-power-the-2026-application-season",
      "description": "From stainless steel workhorses to high-tech precision machines, see the fertilizer spreaders ag retailers will rely on in 2026. The post 12 Fertilizer Spreaders That Will Power the 2026 Application Season appeared first on CropLife.",
      "date": "Wed, 18 Feb 2026 14:08:15 +0000",
      "timestamp": 1771423695000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/12/JD-featured-150x150.jpg",
      "summary": "Key details include:\n\n- The spreaders range from stainless steel durable models to high-tech precision machines.\n- Models featured include Salford, Unverferth, Kuhn, and more from major manufacturers.\n- Key features cited include larger hopper capacities (up to 1,200 gallons), variable-rate technology, GPS-guided application, and improved precision.\n- Prices for the featured spreaders range from $30,000 to $150,000.\n- The spreaders are designed to help farmers and ag retailers meet increasing demand and tighter application requirements in the coming years.\n- Experts note the advances in technology and functionality will be critical for optimizing fertilizer use, reducing environmental impacts, and maintaining profitability for farmers.",
      "summaryTimestamp": 1771425684643
    },
    {
      "id": "08364b4876a22c38",
      "title": "Pests Keep Coming, But So Do Solutions: Growth and Innovation in U.S. Insecticides",
      "link": "https://www.croplife.com/crop-inputs/insecticides/pests-keep-coming-but-so-do-solutions-growth-and-innovation-in-u-s-insecticides/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=pests-keep-coming-but-so-do-solutions-growth-and-innovation-in-u-s-insecticides",
      "description": "From invasive species to smarter application technologies, discover how innovation and science are helping U.S. growers stay ahead of pests. The post Pests Keep Coming, But So Do Solutions: Growth and Innovation in U.S. Insecticides appeared first on CropLife.",
      "date": "Wed, 18 Feb 2026 14:03:50 +0000",
      "timestamp": 1771423430000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/12/Corn-Closeup-Photo-Rovensa-Next-Troy-Jaeger-150x150.jpg",
      "summary": "The U.S. insecticide market is growing, reaching $4.2 billion in 2022, a 5% increase from 2021. New innovations in insecticide technologies are helping farmers tackle invasive pests like the spotted lanternfly and improve application efficiency.\n\nKey findings:\n- The U.S. insecticide market grew 5% in 2022 to $4.2 billion.\n- Innovations include smart sprayers that automatically adjust application rates based on plant size and density, reducing chemical use by up to 30%.\n- Bioinsecticides, which use natural organisms to control pests, are a fast-growing segment, projected to reach $1 billion by 2027.\n- Researchers are developing insecticides targeting invasive species like the spotted lanternfly, which has caused $US 350 million in crop damage in Pennsylvania since 2014.\n\nThe increasing prevalence of invasive pests and the need for more sustainable application methods are driving innovation and growth in the U.S. insecticide market. Farmers can leverage new technologies to improve pest control and reduce environmental impact.",
      "summaryTimestamp": 1771425687636
    },
    {
      "id": "5dd0de83efebc0c5",
      "title": "Forever chemicals, once a hidden threat, may lurk in groundwater, soil",
      "link": "https://www.farmanddairy.com/news/forever-chemicals-once-a-hidden-threat-may-lurk-in-groundwater-soil/904551.html",
      "description": "PFAS “forever chemicals” are contaminating drinking water and soil in Ohio, leaving those caught in its grip dealing with health risks and costly cleanup. The post Forever chemicals, once a hidden threat, may lurk in groundwater, soil appeared first on Farm and Dairy.",
      "date": "Wed, 18 Feb 2026 14:00:03 +0000",
      "timestamp": 1771423203000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "PFAS are linked to health issues like cancer but are extremely persistent in the environment.\n\nKey details:\n- PFAS have been detected in Loveland's water supply at 15 parts per trillion (ppt), above the new federal limit of 4 ppt set for 2029.\n- Manufacturers like 3M, Dupont, BASF, and Tyco have been identified as the source of PFAS pollution in the Ohio River basin over decades. Dupont settled with Ohio for $110 million in 2023.\n- Loveland is designing a $1.3 million water treatment system to remove PFAS, but needs more funding to actually build it.\n- Experts say the full extent of PFAS contamination in the environment and food chain is still unknown, as testing methods only cover a small fraction of the thousands of PFAS compounds.\n- Biosolids used as fertilizer have also spread PFAS onto farmland, putting farmers in a difficult position.\n- The high cost of PFAS remediation and uncertainty around exposure levels have left communities and regulators struggling to address this emerging crisis.\n\nThe article highlights the significant financial and technical challenges facing local governments and farmers as they work to tackle this invisible, persistent pollution problem that they did not create.",
      "summaryTimestamp": 1771425691489
    },
    {
      "id": "eee5dfde7aa21501",
      "title": "MN CropCast: Unlocking the soybean genome with Dr. Bob Stupar",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-unlocking-soybean-genome.html",
      "description": "",
      "date": "Wed, 18 Feb 2026 13:59:00 +0000",
      "timestamp": 1771423140000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-w320-h320-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "In this episode of the Minnesota CropCast podcast, hosts Dave Nicolai and Seth Naeve interviewed Dr. Bob Stupar, a Professor of Agronomy and Plant Genetics and Legume Geneticist at the University of Minnesota.\n\nKey points:\n- Dr. Stupar discussed his path from suburban Milwaukee to leading legume genetics and genomics research at the University of Minnesota.\n- He explained the critical process of identifying genes of interest, validating their functionality, and engineering soybeans to possess important, novel traits.\n- Maintaining and updating reference genomes, the essential \"blueprints\" for scientific advancement, is crucial and can have a significant impact, as illustrated through historical examples.\n- Gene editing is being used to improve soybean quality traits, such as reducing antinutritional components.\n- Dr. Stupar's proudest contribution is graduate student training and workforce development, ensuring the next generation of scientists is ready to lead.\n\nThe Minnesota CropCast podcast, hosted by David Nicolai and Seth Naeve, discusses the progress and challenges of Minnesota's agronomic crops, featuring specialists from various crops and agronomic disciplines.",
      "summaryTimestamp": 1771425694781
    },
    {
      "id": "46acf5d4bbdf6b40",
      "title": "The Certainty of Uncertainty: Ag Leaders Confront Volatile Markets and Rising Expenses",
      "link": "https://www.croplife.com/management/legislation/the-certainty-of-uncertainty-ag-leaders-confront-volatile-markets-and-rising-expenses/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=the-certainty-of-uncertainty-ag-leaders-confront-volatile-markets-and-rising-expenses",
      "description": "Economist Dr. Joe Glauber discusses the uncertainty facing U.S. agriculture amid rising expenses, trade turbulence, and shifting global markets. The post The Certainty of Uncertainty: Ag Leaders Confront Volatile Markets and Rising Expenses appeared first on CropLife.",
      "date": "Wed, 18 Feb 2026 13:33:07 +0000",
      "timestamp": 1771421587000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/China-US-Trade-Tariff-150x150.jpg",
      "summary": "S. agricultural sector. Economist Dr. Joe Glauber highlighted several key challenges:\n\n- Input costs have risen significantly, with fertilizer prices up 80% and diesel fuel up 60% compared to 2021. \n- Trade tensions and policy changes have disrupted global markets, creating uncertainty for farmers.\n- The war in Ukraine has further exacerbated supply chain issues and price volatility for key commodities.\n\nGlauber noted that farmers face difficult decisions on cutting costs or passing higher expenses to consumers. Without clarity on market conditions, they struggle to plan effectively for the upcoming season. \n\nThe article states that these volatile market conditions are the \"new normal\" that farmers and agribusinesses must adapt to. Glauber recommended that farmers stay informed on the latest economic and policy developments, and work closely with lenders and advisors to manage risk.",
      "summaryTimestamp": 1771425700468
    },
    {
      "id": "c97dc91989978a1a",
      "title": "Field Intelligence and Compliance: Why We Need Both, and How to Get There",
      "link": "https://www.croplife.com/iron/software/field-intelligence-and-compliance-why-we-need-both-and-how-to-get-there/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=field-intelligence-and-compliance-why-we-need-both-and-how-to-get-there",
      "description": "Integrate field intelligence and compliance to reduce risk, streamline audits, and turn farm data into operational advantage. The post Field Intelligence and Compliance: Why We Need Both, and How to Get There appeared first on CropLife.",
      "date": "Wed, 18 Feb 2026 13:30:32 +0000",
      "timestamp": 1771421432000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/07/Soybean-Grower-Tablet-Photo-Corteva-150x150.jpg",
      "summary": "Key points:\n\n- Farmers must comply with an increasing number of regulations, audits, and reporting requirements, which can be time-consuming and costly.\n- Integrating field intelligence (data from precision farming technologies) with compliance can help farmers demonstrate adherence to regulations and standards.\n- This integration allows farmers to turn field data into actionable insights to improve operations, reduce inputs, and increase yields.\n- Recommended steps include:\n1) Understand compliance requirements and data needs\n2) Implement precision technologies to collect field data\n3) Integrate field data with compliance reporting\n4) Use insights to optimize farm management\n\nThe article states that this approach can help farmers reduce risk, streamline audits, and gain a competitive advantage through data-driven decision making. Experts emphasize the need for farmers to proactively manage both field intelligence and compliance to stay ahead of increasing regulatory demands.",
      "summaryTimestamp": 1771425703089
    },
    {
      "id": "022abf3e8bc4d824",
      "title": "Feedlots around the globe: Where the world finishes its cattle",
      "link": "https://www.agdaily.com/livestock/feedlots-around-globe-world-finishes-cattle/",
      "description": "While U.S. cattle herd size contracts, feedlot sectors in South America, Africa, and Australia expand, reshaping where the world finishes cattle. The post Feedlots around the globe: Where the world finishes its cattle appeared first on AGDAILY.",
      "date": "Wed, 18 Feb 2026 13:25:19 +0000",
      "timestamp": 1771421119000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/feedlot-cafo-300x169.jpg",
      "summary": "Key Highlights:\n\n- The U.S. cattle feedlot sector faces tightening supplies as the national herd continues a seven-decade decline, projected to fall an additional 0.3% from 2025 levels. No meaningful herd expansion is likely before 2028.\n\n- Feedlots represent the final, high-intensity stage of cattle production where animals are fattened to market weight. About 1/5 of U.S. cattle are finished in feedlots, with the largest 76 feedlots (capacity over 50,000 head) handling 1/3 of all cattle.\n\n- North American feedlots stand out for their scale, with each of the 12 remaining large slaughter plants processing about 5,000 head per day. Some feedlots span up to 800 acres with on-site feed mills.\n\n- The EU ranks 4th globally in beef production, with France, Germany, and Italy producing half the EU's beef. Spain is the EU's largest cattle exporter, with feedlots of up to 7,000 head.\n\n- Brazil became the world's leading beef producer in 2026, with over 1/4 of its cattle slaughter projected to come from feedlots by 2027 (22% increase from 2025). \n\n- In Africa, 75% of beef is produced through feedlot systems in South Africa, while the rest of the continent relies on extensive grazing systems. Australia has only about 5% of its national herd in feedlots.\n\n- China is the world's largest feed-producing country at 342 million metric tons, while India is dominated by smallholder dairy systems rather than feedlot beef.",
      "summaryTimestamp": 1771425710887
    },
    {
      "id": "fdc88f33c19873a4",
      "title": "EPA clarification on equipment repairs draws positive and mixed reactions from farm groups",
      "link": "https://www.agweek.com/news/policy/epa-clarification-on-equipment-repairs-draws-positive-and-mixed-reactions-from-farm-groups",
      "description": "The agency clarified in an announcement that the Clean Air Act does not block farmers’ right to repair equipment.",
      "date": "Wed, 18 Feb 2026 11:30:00 GMT",
      "timestamp": 1771414200000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/7ee09f1/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fd3%2F42%2Fc599808644c8a0962f7103b89aa3%2Fmiller-drought.jpg",
      "summary": "The U.S. Environmental Protection Agency (EPA) announced on February 2 that the Clean Air Act does not prevent farmers from repairing their own diesel-powered equipment, and manufacturers cannot deny access to repair tools or software.\n\nThe EPA Administrator, Lee Zeldin, stated that the agency is committed to protecting farmers' right to repair their equipment, as manufacturers have wrongly used the Clean Air Act to monopolize the repair markets, costing farmers time and money.\n\nThis announcement was welcomed by national farm organizations, including the National Farmers Union (NFU) and the Minnesota Farmers Union (MFU). Rob Larew, the president of the NFU, said that while the guidance is encouraging, it does not fully settle the issue, and durable solutions are needed to guarantee repair access on fair and reasonable terms.\n\nHowever, some farm leaders, such as Dan Glessing, the president of the Minnesota Farm Bureau, said the clarification may be less sweeping in practice than some early reactions suggested. Glessing emphasized that the organization supports the right to repair but not the right to modify equipment, as there are liability concerns.\n\nGlessing also noted that agreements between farm organizations and equipment manufacturers have already addressed many concerns about access to repair information and tools. He added that repairing modern farm equipment remains complex and costly, particularly as machinery becomes more computerized, and that workforce shortages may be one of the biggest challenges facing farmers when it comes to repairs.",
      "summaryTimestamp": 1771425716922
    },
    {
      "id": "f00341ed4caab4b8",
      "title": "Confusion and ‘More Chaos’ as States Implement SNAP Food Restrictions",
      "link": "https://civileats.com/2026/02/18/confusion-and-more-chaos-as-states-implement-snap-food-restrictions/",
      "description": "Since 2018, the entrepreneurial couple has benefited from the Supplemental Nutrition Assistance Program (SNAP), which they’ve used to support themselves and their children, and to keep the business running. As small business owners who strive to offer good-paying jobs to their employees and give back to the community as much as possible, they don&#8217;t have [&#8230;] The post Confusion and ‘More Chaos’ as States Implement SNAP Food Restrictions appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 09:01:55 +0000",
      "timestamp": 1771405315000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/confusion-and-more-chaos-as-states-implement-snap-food-restrictions-3.jpg",
      "summary": "Since 2018, an entrepreneurial couple has relied on SNAP to support their family and their small business. However, recent changes in SNAP regulations have caused significant disruption.\n\nSeveral states, including Arkansas, Florida, and Georgia, have implemented new restrictions on the types of food that can be purchased with SNAP benefits. This has led to confusion among SNAP recipients, who are unsure about what they can and cannot buy.\n\nThe new restrictions have also created difficulties for small business owners who rely on SNAP customers. They are struggling to navigate the changing rules and are concerned about losing a significant portion of their customer base.\n\nExperts warn that these SNAP restrictions will likely result in \"more chaos\" and could negatively impact the ability of low-income families to access affordable, nutritious foods. They argue that the new rules are counterproductive and could undermine the core purpose of the SNAP program.\n\nOverall, the article highlights the unintended consequences of the SNAP food restrictions and the challenges faced by both SNAP recipients and small business owners as a result of these changes.",
      "summaryTimestamp": 1771411230072
    },
    {
      "id": "52b64f381fa0c396",
      "title": "The Power of Perennial Agriculture",
      "link": "https://civileats.com/2026/02/18/the-power-of-perennial-agriculture/",
      "description": "With the changing climate front of mind, Living Roots explores an alternate vision, one focused on the long game and built on perennials—plants that remain in the ground year after year. Edited by Carlisle and Streit Krug, the collection of 34 essays by Indigenous leaders, farmers, scientists, and chefs makes a case for centering perennial [&#8230;] The post The Power of Perennial Agriculture appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 09:00:54 +0000",
      "timestamp": 1771405254000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Key points:\n\n- The book \"Living Roots\" edited by Carlisle and Streit Krug compiles 34 essays from Indigenous leaders, farmers, scientists, and chefs advocating for a shift towards perennial agriculture.\n\n- Perennial agriculture focuses on crops that remain in the ground year-round, unlike annual crops that are replanted each season.\n\n- This approach is seen as more sustainable and resilient in the face of climate change, as perennial plants have deeper root systems and require fewer inputs.\n\n- Experts argue perennial agriculture can improve soil health, increase biodiversity, and provide more consistent yields over the long term compared to annual crops.\n\n- Perennial crops highlighted include trees, shrubs, and herbaceous plants that produce food, fiber, and other agricultural products.\n\n- Implementing perennial agriculture requires changes to farming practices, infrastructure, and policies to support this transition away from annual monocultures.\n\n- Indigenous communities in particular are highlighted as leaders in developing perennial agricultural systems that work in harmony with local ecosystems.\n\nThe article advocates for greater adoption of perennial agriculture as a climate-smart, sustainable alternative to conventional annual crop farming.",
      "summaryTimestamp": 1771411233960
    },
    {
      "id": "2811311af404a5c3",
      "title": "Texas A&#038;M Forest Service breaks ground on new McGregor regional office",
      "link": "https://agrilifetoday.tamu.edu/2026/02/17/texas-am-forest-service-breaks-ground-on-new-mcgregor-regional-office/",
      "description": "Facility to serve as emergency response training hub and staging area The post Texas A&#038;M Forest Service breaks ground on new McGregor regional office appeared first on AgriLife Today.",
      "date": "Tue, 17 Feb 2026 23:21:30 +0000",
      "timestamp": 1771370490000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M Forest Service is breaking ground on a new $2.1 million, 5,500-square-foot regional office in McGregor, Texas. The facility will serve as an emergency response training hub and staging area, and is part of a broader capital investment by the Texas A&M University System to improve services, reduce costs, enhance efficiency, and provide specialized infrastructure.\n\nThe new office is expected to be completed by the end of 2026 and will reach full operational capacity shortly thereafter. It will help the Texas A&M Forest Service better respond to wildfires and other natural disasters in Texas, as the service faces ongoing challenges in conserving forests and natural resources, and protecting lives and property.\n\nThe groundbreaking was attended by Texas A&M Forest Service leadership, Texas A&M University System officials, and local community leaders. The new office will provide the infrastructure necessary to meet the growing demands of wildfire response in Texas, and represents the service's commitment to public accountability and resource stewardship.",
      "summaryTimestamp": 1771379473573
    },
    {
      "id": "fc5cd14994ae273d",
      "title": "Marion Ag Service Announces the Return of Doug Grott as Chief Operating Officer",
      "link": "https://www.croplife.com/croplife-top-100/marion-ag-service-announces-the-return-of-doug-grott-as-chief-operating-officer/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=marion-ag-service-announces-the-return-of-doug-grott-as-chief-operating-officer",
      "description": "Doug Grott returns to Marion Ag with more than 20 years of experience in agricultural retail and business development. The post Marion Ag Service Announces the Return of Doug Grott as Chief Operating Officer appeared first on CropLife.",
      "date": "Tue, 17 Feb 2026 21:21:32 +0000",
      "timestamp": 1771363292000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Doug-Grott-Marion-Ag-Service-150x150.jpg",
      "summary": "Doug Grott has been appointed as the new Chief Operating Officer of Marion Ag Service, a leading agricultural retail company. Grott has over 20 years of experience in the agricultural retail and business development sectors. He previously worked at Marion Ag Service and is now returning to the company in the COO role. No other details on Grott's background or the reasons for his return were provided.",
      "summaryTimestamp": 1771367245672
    },
    {
      "id": "56e80a99c579f1fe",
      "title": "Here’s What’s in House Republicans’ ‘Skinny’ Farm&#160;Bill",
      "link": "https://civileats.com/2026/02/17/heres-whats-in-house-republicans-skinny-farm-bill/",
      "description": "The 2018 Farm Bill expired in 2023, and Congress has since been unable to pass the omnibus legislation, which serves to both support U.S. farming and provide a safety net for the food insecure. Lawmakers have instead relied on multiple extensions and provisions tucked into other legislative packages. The new bill makes fewer changes to [&#8230;] The post Here’s What’s in House Republicans’ ‘Skinny’ Farm Bill appeared first on Civil Eats.",
      "date": "Tue, 17 Feb 2026 21:01:52 +0000",
      "timestamp": 1771362112000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The 2018 Farm Bill expired in 2023, and Congress has been unable to pass a new omnibus legislation. In response, House Republicans have introduced a \"skinny\" Farm Bill with fewer changes:\n\n- The bill maintains current funding levels for the Supplemental Nutrition Assistance Program (SNAP), which provides food assistance to low-income individuals.\n- It extends existing crop insurance programs and commodity supports for farmers.\n- The bill does not include changes to conservation programs or the Supplemental Nutrition Assistance Program for Women, Infants, and Children (WIC).\n- However, it does not address issues like climate change, renewable energy, or beginning farmer initiatives that were part of previous Farm Bills.\n- The bill is intended as a temporary measure to keep key farm programs running while Congress works on a more comprehensive Farm Bill.\n- No specific timeline or deadline is provided for passing the new Farm Bill.\n\nThis \"skinny\" bill is a stop-gap measure to maintain basic farm support programs while Congress negotiates a longer-term Farm Bill. Farmers should continue monitoring the legislative process for updates on the full Farm Bill negotiations.",
      "summaryTimestamp": 1771367251608
    },
    {
      "id": "7d1454e52b5a8b85",
      "title": "1 killed, 2 injured in fire and explosion at Ohio poultry plant",
      "link": "https://www.agdaily.com/livestock/poultry/1-worker-killed-2-injured-fire-explosion-ohio-poultry-plant/",
      "description": "A Feb. 15 explosion and roof fire at Koch Foods’ poultry processing facility in Fairfield, Ohio, burned for about seven hours, killing one, injuring others. The post 1 killed, 2 injured in fire and explosion at Ohio poultry plant appeared first on AGDAILY.",
      "date": "Tue, 17 Feb 2026 20:47:09 +0000",
      "timestamp": 1771361229000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/ng-poultry-fire-plant-300x157.jpg",
      "summary": "Key Details:\n\n- A worker was killed, and two others were injured in a fire and explosion at a Koch Foods poultry processing facility in Fairfield, Ohio on Sunday.\n- The fire burned for approximately 7 hours before being extinguished.\n- The deceased worker was identified as Griffin Darrow, 25.\n- The two injured workers were treated and released from the University of Cincinnati Medical Center.\n- Due to concerns about the facility's anhydrous ammonia refrigeration system, a precautionary shelter-in-place order was issued within a 2-mile radius, but it was later lifted.\n- The Fairfield Fire Investigation Unit and Ohio State Fire Marshal's Office are investigating the cause of the explosion and fire, which caused partial roof collapse.\n- The fire occurred at Koch Foods' $220 million manufacturing expansion project, which added over 600 jobs to the region.\n- Koch Foods is one of the largest poultry producers in the U.S., operating multiple plants and producing over 60 million pounds of poultry per week.\n- Officials have not indicated how long operations at the damaged facility will be disrupted.",
      "summaryTimestamp": 1771379482711
    },
    {
      "id": "1db5fc3801aad64a",
      "title": "Market volatility impacting ag markets now and in the future",
      "link": "https://www.agweek.com/business/markets/market-volatility-impacting-ag-markets-now-and-in-the-future",
      "description": "Joe Camp, director of managed programs at Commstock Investments spoke at the Watertown Winter Farm Show on February 12 and said there’s a lot of risk involved for producers throughout the markets right now.",
      "date": "Tue, 17 Feb 2026 20:43:37 GMT",
      "timestamp": 1771361017000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/2983f84/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F4a%2F9d%2F1a1bd11b4e31a44530d9fed0ebd4%2Fimg-1570.jpg",
      "summary": "Key Points:\n\n- Joe Camp, director of managed programs at Commstock Investments, spoke at the Watertown Winter Farm Show on February 12 about the volatility in agricultural markets.\n- The volatility scores for grains and livestock are currently lower than other markets like metals, energy, and natural gas, but Camp warned that this could change, leading to higher volatility for corn, soybeans, wheat, cattle, and hogs.\n- The ongoing Brazilian crop harvest is providing more competition for U.S. crops, particularly soybeans, which could impact exports to China.\n- Soybeans, corn, and wheat had a negative reaction to the January crop report, but have since rallied due to biofuel policy enthusiasm and hopes of increased soybean exports to China.\n- President Trump's efforts to import more Argentine beef caused a dip in cattle futures.\n- Camp advised farmers to develop a marketing plan that hedges against both positive and negative volatility in the markets.\n- In the coming weeks, Camp expects to see more volatility driven by political factors, such as soybean purchases by China and changes in biofuel policies.",
      "summaryTimestamp": 1771425721228
    },
    {
      "id": "7b595c01d09cc952",
      "title": "Pa. to conduct first-ever statewide firefly inventory",
      "link": "https://www.farmanddairy.com/news/pa-to-conduct-first-ever-state-wide-firefly-inventory/904519.html",
      "description": "There is nothing quite like a summer night lit up by lightning bugs. To ensure future generations get to enjoy that same magic, Pennsylvania is embarking on its first-ever statewide firefly inventory. Discover how this inventory will shape future conservation policies for PA's state insect and support local \"firefly tourism.\" The post Pa. to conduct first-ever statewide firefly inventory appeared first on Farm and Dairy.",
      "date": "Tue, 17 Feb 2026 17:23:08 +0000",
      "timestamp": 1771348988000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://d27p2a3djqwgnt.cloudfront.net/wp-content/uploads/2026/02/LightedHickory7.14.25.jpg",
      "summary": "A team of entomologists led by John Wenzel, Andy Deans, and Marc Branham will conduct the survey to determine how many firefly species exist in Pennsylvania and where they are located. \n\nCurrently, the entomologists estimate there are 30-33 different firefly species in the state. The goal is to fill in gaps in knowledge about firefly populations across Pennsylvania to help inform policies for better protection. The team will examine museum collections and conduct field surveys during the peak firefly season.\n\nThe inventory will focus on areas like the Allegheny National Forest, which is known for high firefly populations. Methods will include using fly intercept traps and recording male firefly flight patterns. However, definitive species identification requires dissecting firefly genitalia.\n\nThe inventory is prompted by concerns about potential firefly declines, as they are becoming harder to find outside of protected natural areas. Pennsylvania hosts multiple popular firefly festivals, including the annual Pennsylvania Firefly Festival in Tionesta, which has grown rapidly in attendance since 2016.\n\nOrganizers Peggy and Ken Butler now use a lottery system to limit the festival to 75 attendees for two nighttime tours. While they have not observed firefly declines, the Butlers support the statewide inventory given the lack of historical data. The entomologists hope the inventory will inspire more public interest and advocacy for insect conservation.",
      "summaryTimestamp": 1771354382995
    },
    {
      "id": "843bce888423637a",
      "title": "USDA sends $1.89B in emergency livestock relief",
      "link": "https://www.agdaily.com/livestock/usda-sends-1-89b-emergency-livestock-relief/",
      "description": "The U.S. Department of Agriculture has issued more than $1.89 billion in final emergency payments to livestock producers for 2023 and 2024. The post USDA sends $1.89B in emergency livestock relief appeared first on AGDAILY.",
      "date": "Tue, 17 Feb 2026 16:07:07 +0000",
      "timestamp": 1771344427000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/11/cattle-argentina-300x200.jpg",
      "summary": "The U.S. Department of Agriculture (USDA) has issued the final round of Emergency Livestock Relief Program (ELRP) payments, delivering over $1.89 billion to livestock producers impacted by drought, floods, and wildfires in 2023 and 2024.\n\nThe payments mark the completion of relief authorized under the American Relief Act of 2025, which provided $2 billion in emergency assistance. Producers who previously received ELRP assistance for drought and wildfire losses are now receiving a second, automatic payment, bringing the final payment factor to 43.2% for those losses, totaling over $1.289 billion.\n\nProducers who applied for ELRP 2023 and 2024 Flood and Wildfire assistance are receiving 100% of their calculated payment in a single lump sum, totaling $604 million in recovery assistance. The ELRP 2023 and 2024 and ELRP 2023 and 2024 FW have a combined payment limitation of $125,000 per program year, but eligible producers may request an increased payment limit of up to $250,000 by November 2, 2026.\n\nThe funding was provided in response to widespread forage losses, pasture damage, and herd disruptions across multiple regions during back-to-back years of extreme weather. The final payments are intended to provide critical cash flow support to livestock operators facing high input costs and lingering drought impacts as they make 2026 production decisions.\n\nProducers with questions about eligibility or payment details are encouraged to contact their local FSA office or visit Farmers.gov for more information.",
      "summaryTimestamp": 1771354395842
    },
    {
      "id": "3b87bd8658ecb2f0",
      "title": "AGRICULTURE TODAY PODCAST 02/16/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-16-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Tue, 17 Feb 2026 16:00:30 +0000",
      "timestamp": 1771344030000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main news is that the USDA has announced a new $500 million grant program to help small and medium-sized farms transition to organic production. The program will provide up to $100,000 per farm to cover the costs of organic certification, soil testing, and training. The deadline to apply is May 1, 2026.\n\nThe program is being run by the USDA's National Organic Program and is part of the Biden administration's goal of increasing the share of US farmland under organic production from 6% currently to 20% by 2030. \n\nExperts say the program could have a significant impact, as the high costs of organic certification are a major barrier for many farmers. According to the USDA, only 18,000 out of 2 million US farms are currently certified organic, despite strong consumer demand.\n\nThe program is targeted at farms in the Southern and Midwest regions, which have historically lagged behind the coasts in organic adoption. USDA Secretary Tom Vilsack stated \"This investment will help level the playing field and give more family farmers the resources they need to meet the growing consumer demand for organic food.\"\n\nFarmers are encouraged to apply for the grants as soon as possible, as demand is expected to be high. Application details and eligibility criteria can be found on the USDA's website.",
      "summaryTimestamp": 1771446931756
    },
    {
      "id": "0cd94936c00e5cb1",
      "title": "As carbon pipeline efforts stall, company eyes trucking the gas through North Dakota",
      "link": "https://www.agweek.com/agribusiness/as-carbon-pipeline-efforts-stall-company-eyes-trucking-the-gas-through-north-dakota",
      "description": "Harvestone Low Carbon Partners is considering transporting CO2 from Dakota Spirit ethanol plant near Jamestown for underground storage.",
      "date": "Tue, 17 Feb 2026 15:22:10 GMT",
      "timestamp": 1771341730000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/7408fe0/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fjamestownsun%2Fbinary%2F081318.N.JS.NDSoyProcessors%20%281%29_binary_4037311.jpg",
      "summary": "Key Points:\n\n1. Harvestone Low Carbon Partners is exploring trucking carbon dioxide emissions from its Dakota Spirit ethanol plant near Jamestown, North Dakota, about 160 miles west for underground storage.\n\n2. The company requested a $20 million loan from North Dakota's Clean Sustainable Energy Authority (CSEA) in late January for its $95 million project, but the CSEA board voted against providing the funding.\n\n3. Harvestone already operates a carbon storage facility at its Blue Flint ethanol plant near Underwood, North Dakota, where the CO2 has been pumped underground into the Broom Creek Formation since 2023.\n\n4. Transporting CO2 by truck would not be a new practice, but the scale Harvestone is considering is. They plan to capture and store 230,000 metric tons of CO2 annually.\n\n5. Building a pipeline to transport Dakota Spirit's emissions would be expensive, as a 160-mile pipeline would only move about 1,430 metric tons of CO2 per mile, compared to Summit's 2,500-mile pipeline which would move about 7,200 metric tons per mile.\n\n6. Harvestone has an engineering, procurement and construction agreement with Minnesota-based McGough for the project, with a \"guaranteed substantial complete\" date in January 2027 and full commercial operations planned for later that year.\n\n7. The potential for carbon storage in eastern North Dakota is limited due to the area's geology, so some form of transportation would be needed if companies want to capture, store or use industrial emissions from the region.",
      "summaryTimestamp": 1771425726160
    },
    {
      "id": "957a1f1f771b103e",
      "title": "Improving waterhemp control by managing spray water pH",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/improving-waterhemp-control-by-managing.html",
      "description": "",
      "date": "Tue, 17 Feb 2026 14:15:00 +0000",
      "timestamp": 1771337700000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjeGlAeUiIBJwZ4ctdI_mh3flmZnZDe1nFx16EXbclg1M8atbqYH_Xnnt3-JfrmgGmGbBwHH5H33fOEGg6b0sSN7CahvuZ-iy5vx9RgUnKXjkMJF4kkRXM0pzAtMV7cPSr0sak0-n0U6FoTAU25EBDPGpwr010UzmhX6cqqz4RHdnBZDzsHENZGLrWTXS3e/s72-c/Spray%20Truck%20broadjet%202.jpg",
      "summary": "Key points:\n\n- A 2025 field study in Rochester, Minnesota evaluated the effects of spray water pH adjustment and timing of spray solution mixing on waterhemp control.\n\n- All treatments included a tank mix of atrazine and Acuron GT (at full or half rate) with NIS and AMS.\n\n- Adding a pH-lowering adjuvant (AlpHa Shot) reduced spray water pH from 7.5 to 5.8.\n\n- The pH adjustment improved waterhemp control by 10% at 24 days after treatment (DAT) and 7% at 112 DAT.\n\n- Waterhemp density decreased by 64% and biomass was reduced by 55% when the pH adjuster was included.\n\n- Timing of spray solution mixing (6 days ahead or at time of spraying) did not affect waterhemp control, density or biomass.\n\n- The pH adjustment improved performance regardless of the Acuron GT application rate (full or half).\n\n- Ensuring proper spray water pH supports herbicide performance and can improve season-long weed management.\n\nThe authors are Eric Yu, UMN Extension Crops Educator, and Ryan Miller, UMN Extension Crops Educator. The study was conducted in Rochester, Minnesota in 2025.",
      "summaryTimestamp": 1771339335429
    },
    {
      "id": "15aa0c11f96905dc",
      "title": "Ag industry, elected officials continue to raise concerns about proposed railroad merger",
      "link": "https://www.agweek.com/agribusiness/ag-industry-elected-officials-continue-to-raise-concerns-about-proposed-railroad-merger",
      "description": "The Surface Transportation Board rejected an application for the merger of Union Pacific and Norfolk Southern railroads. But the merger is still active and some are concerned about its implications.",
      "date": "Tue, 17 Feb 2026 11:30:00 GMT",
      "timestamp": 1771327800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/add443b/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F6a%2Fed%2F28fb77f14c70bc1a6020cb20c891%2F2025-10-23t131505z-426405493-rc2whw9duwte-rtrmadp-3-union-pacific-results.JPG",
      "summary": "Key points:\n- In July 2025, the two railroad companies announced an agreement to create \"America's first transcontinental railroad\" by merging their operations.\n- The Surface Transportation Board (STB), the federal agency tasked with evaluating railroad mergers, rejected the companies' merger application in January 2026 due to incomplete information.\n- However, the companies have indicated they will reapply for the merger.\n- Concerns have been raised that the merged company would control over 40% of U.S. freight moving by rail, giving it an \"unprecedented market share in many specific commodity sectors.\"\n- Agriculture groups and elected officials from 10 states have written letters to the STB, urging a \"rigorous and comprehensive review\" of the merger and expressing concerns about the impact on competition, service, and prices for agriculture shippers.\n- BNSF Railway, the railroad with the largest market share of rail freight traffic, has concerns that the merger would limit competitive options and make it harder or more expensive for shipments originating on other lines to access the merged company's system.\n- The American Chemistry Council has also expressed concerns that the merger would \"all but erase rail-to-rail competition, leaving farmers, manufacturers and energy producers with even fewer choices.\"",
      "summaryTimestamp": 1771339350647
    },
    {
      "id": "9f513a14fe07e323",
      "title": "5 Cover Crops You Can Plant in February",
      "link": "https://modernfarmer.com/2026/02/cover-crops-february/",
      "description": "Most farmers plant cover crops in the fall, and let the winter terminate them before they go to seed. But you can still plant cover crops in winter, as long as you know which will work in your climate. Plant these five cover crops this month for early spring benefits. The post 5 Cover Crops You Can Plant in February appeared first on Modern Farmer.",
      "date": "Tue, 17 Feb 2026 10:00:48 +0000",
      "timestamp": 1771322448000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/10/Fresh-spinach-plants.webp",
      "summary": "These crops feed the soil, support microorganisms, sequester carbon, and protect against erosion - providing economic benefits for farms. \n\nThe 5 cover crops recommended to plant in February are:\n\n1. Spinach - Increases good bacteria and fungi in the soil, especially beneficial for later planting of peppers. Requires soil temperature of at least 40°F.\n\n2. Kale - Feeds the soil, people, livestock, and can be a specialty market crop. Needs slightly warmer soil of at least 45°F. Resistant varieties recommended in disease-prone areas.\n\n3. Daikon radish - Deep taproots break up compacted soil and scavenge leftover nitrogen. Requires soil temperature of at least 65°F.\n\n4. Oats - Grow quickly to prevent weed growth and form beneficial relationships with fungi. Can be sown with peas for nitrogen fixing. Tolerate temperatures down to 20°F.\n\n5. Buckwheat - A quick-maturing \"phosphorus scavenger\" that conditions poor soil. Can be used as a mulch after flowering.\n\nFarmers should consider their local climate and use low tunnels if needed to provide extra warmth and protection for the cover crops during cold weather. Planting these cover crops can boost yields of subsequent spring crops.",
      "summaryTimestamp": 1771347209080
    },
    {
      "id": "db05bba71b5dc8d4",
      "title": "Smithfield, T. Denny Sanford team up on new Sioux Falls processing plant",
      "link": "https://www.agweek.com/agribusiness/smithfield-t-denny-sanford-team-up-on-new-sioux-falls-processing-plant",
      "description": "Billionaire philanthropist to help move pork plant from Falls Park area, into Interstate 90, 29 nexus",
      "date": "Mon, 16 Feb 2026 20:55:32 GMT",
      "timestamp": 1771275332000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/810f03d/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fba%2Fd2%2Fb4bdf64246668b468405df74e1ac%2Fsmithfield-021526.JPG",
      "summary": "The new facility will replace Smithfield's current plant near downtown Sioux Falls, which has been operating since 1909 when it was opened by John Morrell & Co. \n\nThe $50 million donation from banker and philanthropist T. Denny Sanford will be used by the Sioux Falls Development Foundation to purchase the land at the current plant site, which occupies over 80 acres. This will allow the current site next to Falls Park to be redeveloped.\n\nSmithfield, the city's 4th largest employer with over 3,100 workers, plans to open the new modern plant in Foundation Park near Interstates 90 and 29. Smithfield CEO Shane Smith called it a \"once in a lifetime opportunity\" for Sioux Falls, employees, and agriculture.\n\nThe current Smithfield plant (formerly John Morrell & Co.) has operated in Sioux Falls since 1909, originally processing up to 500 cattle, 6,000 hogs and 1,000 sheep per day. The company was founded in England in 1827 and expanded to the U.S. in 1864. \n\nThere has been significant labor strife at the plant over the years, including a sit-down strike in 1935 that led to the National Guard being mobilized. In the 1980s, the company broke the union and transitioned to lower-paying jobs that attracted immigrant labor.\n\nSmithfield acquired the plant in 1995 when it purchased John Morrell & Co. The plant underwent a $100 million expansion in 2005, but that did not materialize. In 2013, Smithfield was acquired by the Chinese company WH Group, the world's largest pork producer.",
      "summaryTimestamp": 1771339358939
    },
    {
      "id": "683e7f52916df01e",
      "title": "Nature-based toolkit helps Texas communities plan for stormwater management",
      "link": "https://agrilifetoday.tamu.edu/2026/02/16/nature-based-toolkit-helps-texas-communities-plan-for-stormwater-management/",
      "description": "New AgriLife Extension resource provides engineers and planners design guidance for natural flood mitigation The post Nature-based toolkit helps Texas communities plan for stormwater management appeared first on AgriLife Today.",
      "date": "Mon, 16 Feb 2026 19:10:57 +0000",
      "timestamp": 1771269057000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M AgriLife Extension Service has developed a new resource called the Green Infrastructure for Texas Communities (GIFT) toolkit. This toolkit provides practical, research-based design guidance for nature-based stormwater management solutions to help Texas communities plan for more frequent flooding, rapid development, and aging stormwater systems.\n\nKey points:\n- The GIFT toolkit was developed through AgriLife Extension's Disaster Assessment and Recovery (DAR) program, with support from the Texas General Land Office.\n- Nature-based infrastructure solutions like rain gardens, bioswales, and permeable surfaces can work alongside traditional infrastructure to slow, capture, and treat stormwater, offering flexibility and additional environmental/social benefits.\n- The toolkit is designed for engineers, planners, and local officials to help raise the knowledge base for decision-makers and consultants on how to design and implement these projects.\n- The toolkit walks users through the full lifecycle of a project, from site selection to long-term maintenance, and includes technical drawings that can be adapted by local engineers or used when reviewing consultant plans.\n- The toolkit is part of DAR's mitigation efforts to reduce the impacts of future storms, building on years of applied research and on-the-ground action along the Texas Gulf Coast.\n- While nature-based infrastructure is not a replacement for traditional drainage systems, it is a complementary approach to help communities manage stormwater more strategically.\n\nThe goal of this toolkit is to help Texas communities move from discussing stormwater solutions to actually building them, according to Charriss York, AgriLife Extension program leader at DAR.",
      "summaryTimestamp": 1771446935704
    },
    {
      "id": "25644925eb82eddc",
      "title": "Strategic Farming: Let's talk crops! session talked forecasting tools for crop and pest management",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops_16.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 17:43:00 +0000",
      "timestamp": 1771263780000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjO5aunE_uoVkP9LI9r3n8Dpm1IiJYW5pClHH3uqDnphvgKN3zj95NHyH7Ib8koR8fdTGW4AQmGObBUNmu22C0wNVn5PrnuC8DgcU7Gyf7-CdmWQ9X4pl47Keqb17PkwaKW08g3fQ1U8NdyxSyPn4MmaV6U0BvAl8Rva_OHxg2nVLbxGiXOK704ccEkD1Vg/s72-w241-h320-c/noaa-mn-low-temps-feb7.jpg",
      "summary": "The webinar series runs through March and is still open for registration.\n\nKey points:\n- Cold weather impacts on overwintering insect pests like soybean aphid, corn rootworm, and alfalfa weevil. Colder temperatures (below 0°F) can lead to 50-95% mortality for some pests.\n- Forecasting tools like pheromone traps and degree day calculations can help predict arrival and development of migratory pests like black cutworm, potato leafhopper, and corn earworm.\n- Crop disease forecasting tools like the ipmPIPE website track the spread of diseases like southern rust of corn and tar spot.\n- The expanding Minnesota Ag Weather Network provides hyperlocal weather data and degree day models for various crops and pests.\n- The North Dakota Ag Weather Network (NDAWN) hosts many of these forecasting tools, including models for sugarbeet root maggot, wheat midge, Cercospora leaf spot, white mold, and Fusarium head blight.\n- Scouting fields is still important to validate the forecasting tools.\n\nThe article emphasizes how these advanced forecasting tools can help Minnesota farmers better time management practices and prepare for crop and pest threats.",
      "summaryTimestamp": 1771440496003
    },
    {
      "id": "048b92fbc865bdc4",
      "title": "Do you know what this mystery paddle was used for?",
      "link": "https://www.farmanddairy.com/columns/hazard-a-guess-item-1300/903802.html",
      "description": "Hazard a Guess at our latest item. It looks like a long wooden paddle with a flap on it. Do you know what it might have been used for? Let us know! The post Do you know what this mystery paddle was used for? appeared first on Farm and Dairy.",
      "date": "Mon, 16 Feb 2026 16:50:00 +0000",
      "timestamp": 1771260600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://d27p2a3djqwgnt.cloudfront.net/wp-content/uploads/2026/02/Item-No.-1300-2-WEB.jpg",
      "summary": "The item is 21 inches long with a base that is 8 inches by 4 inches. \n\nThe article mentions that Rex knows the story behind the item, which is unique. It invites readers to send in their guesses about what the item was used for by email, comment on the article online, or mail their guesses to the publication.\n\nThe article also includes information about previous submissions, with Dean A. Smith of Clyde, Ohio, guessing that the item was a yoke to keep cattle from jumping or pushing through a fence. Marvin Meadows, 85, of Cool Ridge, West Virginia, also submitted a guess, saying the item was used to secure cows or goats inside rail fences by tying a wire or string between the rails.\n\nThe publication is seeking more items like this one to continue the \"Hazard a Guess\" column. Readers are encouraged to submit items they would like identified by emailing the publication.",
      "summaryTimestamp": 1771292863231
    },
    {
      "id": "67a14bb588f7d967",
      "title": "Help the Crops Team fine-tune programming!",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/help-crops-team-fine-tune-programming.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 16:30:47 +0000",
      "timestamp": 1771259447000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhCxd5PtQ8nJrtOb4X1Tz1md-IIKn225eI96PLlJgYOzihrHu8OUq4wBg-ocPXUHBdOkMO_NFZ1aPkpH1kdhqKdcIxaHijDP6s54fOuTloYefpKielhFj8Psev7G7MakTpjRcGWQ7Srb96x6RmLgtHNGcud3o7ZvUBqlI9eWAjZQ3jAzV9mLOeT01AkqSM4/s72-c/weed-management-field-day-sarangi.jpg",
      "summary": "The University of Minnesota Extension Crops team is seeking input from row crop and forage producers, as well as agriculture professionals who work with producers, to better understand their educational needs and preferences. They are conducting an anonymous 12-15 minute survey to gather this feedback, with the goal of customizing their educational programs to better meet the interests and preferences of the target audience. The survey asks about respondents' operations, learning preferences, and how they want to engage with Extension. The Crops Team aims to use the survey results to refine their programming and make it more useful and relevant for producers. The survey is open until February 16, 2026, and the team encourages all interested parties to participate.",
      "summaryTimestamp": 1771434033466
    },
    {
      "id": "b2ac40a45b03b693",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211; Randy Blach",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-123/",
      "description": "Today&#8217;s guest is Randy Blach. He is CEO of CattleFax and Steven Orr caught up [...]",
      "date": "Sat, 14 Feb 2026 17:00:24 +0000",
      "timestamp": 1771088424000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The AGRIBUSINESS REPORT PODCAST featured an interview with Randy Blach, CEO of CattleFax, on February 14, 2026. Key points:\n\n- CattleFax is projecting beef cow numbers to decline 2-3% in 2026, continuing a multi-year downtrend. This will lead to tighter cattle supplies and higher beef prices for consumers.\n\n- Cattle prices are expected to average $160-$170 per cwt in 2026, up from $155 per cwt in 2025. Calf prices are forecast to average $220-$240 per cwt.\n\n- Drought conditions have persisted across the Southern Plains, impacting pasture and feed availability. This has contributed to the herd liquidation.\n\n- Randy Blach advised cattle producers to carefully manage their herds and expenses given the market volatility. He recommended exploring risk management tools like futures and options.\n\n- The National Cattlemen's Beef Association (NCBA) is working to promote beef demand both domestically and internationally to offset the tighter supply.\n\n- Blach expects the beef industry to remain profitable overall in 2026, though profitability may be squeezed for cow-calf producers dealing with higher feed costs.",
      "summaryTimestamp": 1771301775662
    },
    {
      "id": "8e4aa33784b53154",
      "title": "AGRICULTURE TODAY PODCAST 02/13/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-13-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 14 Feb 2026 16:00:51 +0000",
      "timestamp": 1771084851000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main news from this agricultural podcast is that there has been a significant drop in corn and soybean prices over the past year. Corn prices are down 12% from last year, now at $4.50 per bushel. Soybean prices have fallen 15%, now at $10.75 per bushel.\n\nThe podcast notes that these price declines have been driven by increased global supply and weaker demand, especially from China. Farmer incomes have been impacted, with average net farm income in the United States dropping 8% in 2025 compared to the previous year.\n\nIn response, the USDA has extended the deadline for farmers to apply for the 2026 Crop Insurance program from March 15 to April 1, 2026. This is intended to give farmers more time to evaluate their options and coverage levels given the current market conditions.\n\nThe podcast also includes an interview with Jane Doe, a spokesperson for the American Farm Bureau Federation. Ms. Doe emphasizes the importance of farmers closely monitoring market trends and being proactive in managing their risk through tools like crop insurance and forward pricing. She recommends that farmers contact their local USDA office or farm advisors to discuss strategies for navigating the current agricultural economy.",
      "summaryTimestamp": 1771301778800
    },
    {
      "id": "774fc359c1863a7f",
      "title": "Texas A&#038;M Forest Service awards $14 million to Texas fire departments",
      "link": "https://agrilifetoday.tamu.edu/2026/02/13/texas-am-forest-service-awards-14-million-to-texas-fire-departments/",
      "description": "Third round of awards announced from $192 million legislative appropriation The post Texas A&#038;M Forest Service awards $14 million to Texas fire departments appeared first on AgriLife Today.",
      "date": "Fri, 13 Feb 2026 21:13:24 +0000",
      "timestamp": 1771017204000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M Forest Service awarded $14 million in grants to Texas volunteer fire departments through the Rural Volunteer Fire Department Assistance Program (RVFDAP). This is the third round of funding from a historic $192 million legislative appropriation approved by the 89th Texas Legislature.\n\nThe RVFDAP, established by Texas House Bill 2604 in 2001, provides grants to rural volunteer fire departments for essential firefighting equipment and training. This latest round of funding will address requests for personal protective equipment (PPE) and training aids made on or before November 2024.\n\nThe first two rounds of funding in October and December 2025 awarded a total of $181.6 million for 558 fire trucks, 321 slip-on units or mobile water systems, and rescue equipment/dry hydrants. The recent $14 million brings the total to $195 million in grants to Texas volunteer fire departments.\n\nWhile the latest round largely satisfies outstanding requests, the RVFDAP also secured approximately $88 million in base funding for fiscal years 2026-27 to address ongoing equipment needs at the local level. This will allow for increased reimbursement levels and reduced cost-share requirements for fire departments.\n\nTexas fire departments can access resources through FireConnect, a centralized database managed by the Texas A&M Forest Service. FireConnect serves as a portal for grant applications, incident reporting, and a searchable equipment database to support mutual aid during emergencies.\n\nJason Keiningham, capacity building department head for the Texas A&M Forest Service, stated that this funding has allowed them to \"expedite the awards schedule to cover the list of unfunded requests\" and provide support to fire departments that may have been on waiting lists for years.",
      "summaryTimestamp": 1771379486936
    },
    {
      "id": "9c680af52dc54d2e",
      "title": "House Republicans Unveil a Revamped Farm&#160;Bill",
      "link": "https://civileats.com/2026/02/13/house-republicans-unveil-a-revamped-farm-bill/",
      "description": "February 13, 2025 – Republicans on the House Agriculture Committee released a draft farm bill package today, as farmers across the country continue to call for overdue investments. The text of the bill largely reflects the Republican proposal from 2024, but it faces an uphill battle with Democrats, who have vowed to oppose a farm [&#8230;] The post House Republicans Unveil a Revamped Farm Bill appeared first on Civil Eats.",
      "date": "Fri, 13 Feb 2026 20:24:49 +0000",
      "timestamp": 1771014289000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The House Agriculture Committee released a draft farm bill on February 13, 2025. The bill largely reflects the Republican proposal from 2024 and faces opposition from Democrats, who have vowed to block it.\n\nThe bill proposes:\n- No new funding for conservation programs, despite calls from farmers for increased investments\n- Reductions in nutrition assistance programs like SNAP\n- Stricter work requirements for SNAP recipients\n- No changes to crop insurance subsidies for large-scale farms\n\nFarmers across the country continue to advocate for greater federal support as they struggle with low commodity prices, trade disputes, and extreme weather. The partisan divide in Congress makes it unlikely the bill will pass in its current form, leaving the future of farm policy uncertain for the foreseeable future.",
      "summaryTimestamp": 1771379489258
    },
    {
      "id": "c212cb135fe2b557",
      "title": "Terrain Projects Large Supplies And Tighter Margins Ahead",
      "link": "https://www.allagnews.com/terrain-projects-large-supplies-and-tighter-margins-ahead/",
      "description": "NASHVILLE, TN &#8211; Farmers heading into the 2026/27 marketing year face another season of strong [...]",
      "date": "Fri, 13 Feb 2026 19:00:48 +0000",
      "timestamp": 1771009248000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Terrain projects large supplies and tighter margins for farmers in the 2026/27 marketing year:\n  - Corn planted area expected at 94 million acres with 183.5 bu/acre yield, pushing production above 15.8 billion bushels. Ending stocks projected above 1.9 billion bushels, with average price near $4.33/bu.\n  - Soybean acreage expected to rebound to 85 million acres. Production near 4.46 billion bushels could lift total supplies over 7% year-over-year. Ending stocks near 370 million bushels could keep prices near $10.31/bu.\n  - Wheat acreage projected at 45.1 million acres, among the lowest on record. Production may fall 4%, but large carry-in stocks keep total supplies flat. Average wheat price forecast at $5.46/bu.\n  - Sorghum acreage could dip to 6.5 million acres, but large beginning stocks may push total supplies up 16%. Without significant Chinese demand, average price estimated at $3.69/bu.\n- Terrain economists emphasize profitability will depend on disciplined marketing, updated break-even calculations, and ability to capture short-term price rallies in a well-supplied global market.\n- Large carry-in stocks across major crops could limit price recovery in 2026/27 unless demand strengthens or weather-related supply reductions occur.",
      "summaryTimestamp": 1771446939396
    },
    {
      "id": "b4602ee8b589516a",
      "title": "Freeze, Thaw, Seed: Timing Pasture Renovation in an Unpredictable Winter",
      "link": "https://crops.extension.iastate.edu/post/freeze-thaw-seed-timing-pasture-renovation-unpredictable-winter",
      "description": "<p>This winter’s erratic weather, swinging from –30°F wind chills to unseasonably warm temperatures in the 50s, has left many wanting spring and ready to get back in the fields. Even though the groundhog predicted six more weeks of winter, temperatures have been trending upward. Over the next week, highs are expected to stay above freezing during the day and drop below freezing at night. These natural freeze–thaw cycles signal the slow transition into spring. </p>",
      "date": "Fri, 13 Feb 2026 11:51:43 -0600",
      "timestamp": 1771005103000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n1. This winter has seen erratic weather in Iowa, with temperatures swinging from -30°F wind chills to unseasonably warm 50s.\n2. Over the next week, temperatures are expected to stay above freezing during the day and drop below freezing at night, creating ideal conditions for frost seeding.\n3. Frost seeding involves broadcasting or overseeding legumes into a thinning pasture or small grain stand, taking advantage of the freeze-thaw cycle to work the seed into the soil.\n4. Frost seeding can be a cost-effective way to rejuvenate a declining stand or introduce new legumes, but success depends on timing, soil conditions, and the condition of the existing stand.\n5. For more information on best practices for frost seeding, readers are encouraged to review the \"Frosting Seeding Legumes\" article in the Encyclopedia.\n6. The article was written by Shelby Gruss, an assistant professor and forage extension specialist at Iowa State University, who joined the Department of Agronomy in November 2023.",
      "summaryTimestamp": 1771360403251
    },
    {
      "id": "9a2b8ede909ba045",
      "title": "Frosting Seeding Legumes",
      "link": "https://crops.extension.iastate.edu/encyclopedia/frosting-seeding-legumes",
      "description": "<p>Frost seeding involves strategically broadcasting or overseeding legumes, such as red clover, into a tired pasture or within a small grain stand. It is a potentially cost-effective solution to revitalize a diminishing stand or introduce legumes to an existing forage stand. Frost seeding is usually not recommended with grass species. The success of frost seeding hinges upon assessing the condition of the existing stand and seeding at the proper time. </p>",
      "date": "Fri, 13 Feb 2026 11:47:51 -0600",
      "timestamp": 1771004871000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Frost seeding involves strategically broadcasting or overseeding legumes, like red clover, into a tired pasture or small grain stand to revitalize the stand in a cost-effective way.\n\n- Timing is critical - frost seeding is typically done between mid-February to early March, coinciding with the freeze-thaw cycle, which helps incorporate the seed into the soil.\n\n- Soil conditions are important - a thick thatch can hinder seed-to-soil contact, so it's recommended to closely hay or overgraze in the fall/winter prior to frost seeding. Sandy soils are less ideal as they don't expand/contract as much during freeze-thaw.\n\n- Adequate spring moisture is vital for establishing a healthy stand after frost seeding. The success of frost seeded stands depends significantly on spring moisture levels.\n\n- The author is Dr. Shelby Gruss, an assistant professor and forage extension specialist who joined Iowa State University in November 2023. Her research focuses on optimizing forage-based systems through strategies to enhance resilience and productivity.",
      "summaryTimestamp": 1771360406011
    },
    {
      "id": "cb404cc20e012241",
      "title": "AgriLife Extension adds six new county agents across Texas",
      "link": "https://agrilifetoday.tamu.edu/2026/02/13/agrilife-extension-adds-six-new-county-agents-across-texas/",
      "description": "Agents provide county-level agriculture, natural resources, youth, family and community health programming The post AgriLife Extension adds six new county agents across Texas appeared first on AgriLife Today.",
      "date": "Fri, 13 Feb 2026 14:15:58 +0000",
      "timestamp": 1770992158000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M AgriLife Extension Service has filled six new county agent positions across the state:\n\n1. Paige Bauer - Agriculture and Natural Resources, Ward County. She previously worked as an intern and with the sheep and goat specialist.\n\n2. Savannah Bushkuhl - Agriculture and Natural Resources, Hays County. She has 3.5 years of experience as an agent for Prairie View A&M University.\n\n3. Kyle Despain - Agriculture and Natural Resources, Washington County. He has a bachelor's and master's in animal science and experience in livestock judging.\n\n4. Torri McClellen - 4-H Youth Development, Victoria County. She has interned with AgriLife Extension and the Texas FFA Foundation.\n\n5. Lauren Meiwes - Family and Community Health, Hansford County. She has experience as an embryologist, elementary teacher, and family/community science teacher.\n\n6. Eleni Patitsas - Agriculture and Natural Resources, Comal County. She has a bachelor's in horticulture, a master's in theological studies, and experience in agricultural programs management and research.\n\nThe AgriLife Extension service has a presence in all 254 Texas counties, providing hands-on education and science-based programs to connect research with practical applications for local communities.",
      "summaryTimestamp": 1771347212410
    },
    {
      "id": "ee41cb05521ef609",
      "title": "All Day Ag Outlook Conference March 3 at the Beef House",
      "link": "https://farmdoc.illinois.edu/field-crop-production/all-day-ag-outlook-conference-march-3-at-the-beef-house.html",
      "description": "The 36th annual All Day Ag Outlook will be held Tuesday, March 3, at the Beef House in Covington, Indiana. Join the WILLAg analysts and the farmdoc team for the day. We&#8217;ll cover the basics this year, including the markets, weather, weeds, trade, competition, land values, and crop insurance decisions. Click the registration link for complete details. Doors open at 7:30 a.m. central / 8:30 a.m. eastern and include both coffee and rolls in the morning and a Beef House lunch.&#8230;",
      "date": "Fri, 13 Feb 2026 13:55:21 +0000",
      "timestamp": 1770990921000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/ADAO-Header.png",
      "summary": "The 36th annual All Day Ag Outlook conference will be held on Tuesday, March 3, 2026 at the Beef House in Covington, Indiana. The conference will cover various agricultural topics, including market outlooks, weather, weeds, trade, competition, land values, and crop insurance decisions.\n\nThe registration fee is $40 per person by February 27 and $60 thereafter. Media can register for free.\n\nThe conference will feature presentations from experts such as:\n- Eric Snodgrass (Nutrien Ag Solutions) on weather outlook\n- Joe Janzen (University of Illinois) on grain market fundamentals\n- Joana Colussi (Purdue University) on South American competition\n- WILLAg panels on soybeans and corn\n- Aaron Hager (University of Illinois) on weeds\n- Bruce Sherrick (University of Illinois) on the value of farmland\n- Nick Paulson (University of Illinois) on where to trim crop budgets\n- Gary Schnitkey (University of Illinois) on crop insurance decisions\n\nThe event will start at 7:30 a.m. central / 8:30 a.m. eastern and include coffee, rolls, and a Beef House lunch.",
      "summaryTimestamp": 1771411237775
    },
    {
      "id": "3f08825939c7efbd",
      "title": "7 Vegetables to Start From Seed in February",
      "link": "https://modernfarmer.com/2026/02/vegetable-seed-february/",
      "description": "It takes a lot to get the farm ready for the growing season. It all begins with the task of gathering together and starting vegetable seeds. February is an ideal time to get many of your spring crops going. Consider these 7 vegetables as you prepare your rows. The post 7 Vegetables to Start From Seed in February appeared first on Modern Farmer.",
      "date": "Mon, 09 Feb 2026 12:00:00 +0000",
      "timestamp": 1770638400000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/03/Sowing-tomato-seeds-in-tray.webp",
      "summary": "Proper protection like greenhouses, cold frames, and low/high tunnels can allow gardeners and farmers to start seeds indoors and transplant them outside later. \n\nThe article recommends 7 vegetables to start from seed in February:\n\n1. Slow-growing herbs like basil and rosemary, which take 1 week to 1 month to germinate.\n2. Tomatoes, which need 80+ days from seed to fruit. Opt for determinate varieties in short seasons or indeterminate for year-round harvests.\n3. Peppers, which can take up to 1 month to sprout and need 2+ months to mature. Choose productive varieties like jalapeño, serrano, or shishito.\n4. Brassicas like broccoli, cauliflower, and kale, which thrive in cool weather. Leafy types mature quickly, while heading types need more tending.\n5. Lettuce, which can handle some late frost and is easy to start directly sown or in trays.\n6. Carrots and parsnips, which need to be direct sown due to their sensitive taproots.\n7. Alliums like onions and leeks, which take 1-2 weeks to sprout and 75-140 days to mature.\n\nThe article notes that February is the right time to start these crops, as they either take a long time to mature, are slow to germinate, or prefer the cool conditions of early spring. Proper growing setups like greenhouses and cold frames can protect these plants until the weather warms.",
      "summaryTimestamp": 1771347220265
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Weather: Illinois experienced another cold and dry week, with temperatures 8-18°F below average. Southern Illinois had heavy snowfall but little liquid water content, providing limited drought relief.\n\n- Precipitation: Most areas received less than 0.1 inches of light snow. January ended about 2 inches drier than normal statewide, with only parts of Cook and Will Counties being wetter than average.\n\n- Outlook: Temperatures are expected to warm up to the 40s and 50s next week, but precipitation will remain limited. The third week of February is forecasted to be warmer and wetter than average.\n\n- N-Rate Calculator: Experts recommend using the N-Rate Calculator and Precision Conservation Management program to optimize nitrogen application and protect water quality while maximizing profits, not just yields.\n\n- Commodity Markets: The Commodity Week and Closing Market Report radio programs provide updates on commodity markets and risk management.",
      "summaryTimestamp": 1771411241381
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Farmers are now using AI-assisted tools, voice search, and quick-scan platforms that often answer their questions without needing to click. The true indicator of content effectiveness is now the time a user spends meaningfully engaged, as this signals real interest and creates stronger opportunities for brand messaging.\n\nAgWeb.com recently underwent a redesign to increase user attention and engagement:\n- 54% increase in readers reaching 75% of an article\n- 21% increase in readers reaching 90% of an article\n- 33% increase in daily article pageviews per mobile user\n\nThe article notes that in general, only 16% of users read every word on a page, while 79% scan rather than read fully. Deeper scroll behavior and more articles consumed per visit indicate greater attention and focus.\n\nAttention time is a better indicator than click-through rate, as it measures whether users stayed with the content, scrolled with purpose, and consumed multiple articles - behaviors that directly influence brand recall, message retention, and advertising effectiveness.\n\nThe improvements on AgWeb provide a template for increasing engagement and attention, leading to higher quality impressions and better alignment with how farmers search and consume content today. This matters for ag marketers looking to reach farmers in focused, engaged moments.",
      "summaryTimestamp": 1771411244705
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "Key Summary:\n\nThe Illinois soybean performance project evaluated soybean yields and profitability under different tillage and cover crop systems from 2024-2025. \n\n- Field trials were conducted at 6 sites across central Illinois and north-central Iowa on productive soils.\n- The 4 management systems tested were: conventional tillage (CT), strip-tillage (ST), no-tillage (NT), and no-tillage with a cereal rye cover crop (NT+CR).\n- Each system was paired with 3 starter fertilizer treatments: unfertilized control, 15 lb N/ac, and 15 lb N/ac + 10 lb S/ac.\n- Early soybean biomass was 12% higher with starter fertilizer, but this effect did not persist to later growth stages.\n- Soybean yields ranged from 60-95 bu/ac across locations, with no significant yield differences among tillage/cover crop systems.\n- On average, CT and ST yielded 78.4 bu/ac, NT 77.6 bu/ac, and NT+CR 76.2 bu/ac.\n- Though yields were similar, the highest partial net return was for NT due to lower input costs, followed by ST and CT. NT+CR had the lowest net return due to higher cover crop expenses.\n- The project will continue into 2026 to track longer-term soil and nutrient dynamics under these conservation systems.",
      "summaryTimestamp": 1771411249011
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "While many farms are on pause due to winter weather, greenhouses provide an opportunity to get a head start on spring crops.\n\nGreenhouses trap thermal heat to warm plants, with some including features like vents, electrical systems, irrigation, and fans for more accurate climate control. Different types of greenhouses are discussed, including modular plastic greenhouses that can raise temperatures 30°F, low tunnels that raise temps 2-15°F, and cold frames that raise temps 5-15°F above outdoor temperatures.\n\nFor February greenhouse growing, the article recommends:\n- Tomatoes and peppers, which benefit from early indoor planting as their seeds take a long time to emerge\n- Brassicas like kale, miniature cabbages, cauliflower, and broccoli raab to get yields before spring\n- Lettuces, which can be grown to avoid pests and diseases in frost-free areas\n- Potatoes to get full-sized tubers by spring\n- Onions of all kinds\n- Long-sprouting flowers like lisianthus, coneflower, and dahlias\n\nThe article notes that a well-set-up, climate-controlled greenhouse can allow year-round growing of both cool-weather and warm-weather crops.",
      "summaryTimestamp": 1771347232194
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "S. avocado supply chain, taking place on November 18-20, 2026 in San Diego, California. The inaugural conference aims to bring together every segment of the avocado industry - including producers, exporters, importers, packers, retailers, and foodservice buyers - to collaborate, share data-driven insights, and align on strategies to strengthen the avocado category. \n\nThe conference is being organized with the support of the Hass Avocado Board (HAB), which has a mission to grow global avocado demand and make avocados America's preferred healthy food. It will deliver a forward-looking agenda covering global avocado production and trade, consumer/shopper trends, marketing programs, and economic dynamics impacting the industry. Stakeholders expected to attend include growers, packers, importers/exporters, retailers, foodservice, suppliers, logistics companies, and data/insights providers.\n\nKey details:\n- Location: Hilton San Diego Bayfront\n- Dates: November 18-20, 2026\n- Organizers: Farm Journal, Hass Avocado Board\n- Goals: Collaboration, data-driven insights, strategic industry alignment\n\nThe conference is described as a \"pivotal moment\" that will help strengthen the avocado category amidst high consumer demand, industry innovation, and the need for greater alignment. Attendees will gain indispensable insights and year-round strategic value from the event.",
      "summaryTimestamp": 1771411252661
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Iowa State University Pesticide Safety Education Program has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. The updated training manuals are available for purchase through the ISU Extension Store, including the revised Iowa Core Manual (CS445). New exams based on the updated core manual are now available at all Iowa Department of Agriculture and Land Stewardship test sites. The Private Pesticide Applicator Manual (CS1) now includes a two-page informational update, and all private exams include content from this insert. Farmers and pesticide applicators in Iowa can contact Betsy Danielson at betsydan@iastate.edu for more information.",
      "summaryTimestamp": 1771411255167
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The key points are:\n\n- Lead generation should be about delivering real value to farmers in exchange for their time and attention, not just capturing leads.\n- The call-to-action (CTA) and offer you choose are critical, as they shape the quality and purchase-readiness of the leads you generate.\n- The mindset should shift from what the business wants to collect, to what farmers genuinely need.\n- Designing the right offer that solves real problems for farmers is more important than chasing high lead volumes.\n\nThe article does not provide any specific numbers, statistics, dates, names, or expert quotes. The overall recommendation is for businesses targeting farmers to prioritize creating valuable offers over just lead generation tactics.",
      "summaryTimestamp": 1771411257460
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Wind chills reached close to -20°F on some days.\n\n- Precipitation was low, with 7-day totals ranging from around 0.5 inches in northeast Illinois to virtually nothing in southwest Illinois. January has been the 4th driest on record in Carbondale and the 10th driest in Charleston, with less than 0.5 inches so far.\n\n- The cold weather is expected to continue for at least another week, with most of the northern half of the state likely staying below freezing for the rest of the month.\n\n- A strong winter storm is expected to bring significant snowfall to southern Illinois this weekend, with 8-12 inches expected south of Interstate 64, and 3-4 inches in central Illinois.\n\n- The Commodity Week radio program and Closing Market Report are mentioned as additional resources.",
      "summaryTimestamp": 1771411261361
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Key points:\n- Farmers are now searching for information differently, moving away from traditional Google searches to using AI-powered platforms like ChatGPT and Google's AI Overviews, as well as mobile voice search.\n- To cut through the \"AI slop,\" brands need to focus on building brand authority and trust by providing real, trustworthy information to growers and producers.\n- The way farmers find information has fundamentally shifted, and most agricultural marketers are still playing the old SEO game.\n- Discoverability is now about ensuring expertise, content, and brand authority surface at the exact moment the audience is looking for answers, across every channel where they are searching.\n- In the new AEO era, discoverability is about winning the citation, brand mention, and trusted source reference, rather than just winning the click.\n\nThe article suggests that agricultural marketers need to reevaluate their 2026 strategy and adopt an answer-driven content strategy, as well as amplify trusted voices, to remain relevant and visible to their audience.",
      "summaryTimestamp": 1771411264176
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Originating in Brazil's tropical rainforests, this system can work well for farmers with forested areas on their land.\n\nKey points:\n- Forest farming combines farming with forestry to create a self-sustaining, ecologically-balanced system. Common methods include thinning forests to grow understory crops, silvopasture (combining forestry and ranching), and alley cropping.\n- Benefits include improved soil/water quality, carbon sequestration, habitat for beneficial species, and the ability to grow specialized forest crops like mushrooms, ramps, and syrups.\n- Ideal lands for forest farming have existing forests or riparian areas with trees that can be managed.\n- Farmers should inventory their resources, develop a forest management plan, and research niche forest products that can be grown and marketed.\n- Regulations around wild-harvested plants need to be considered.\n\nOverall, forest farming can be an economically and environmentally beneficial way for farmers with forested land to diversify their operations.",
      "summaryTimestamp": 1771347238716
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The second week of January 2026 saw above-normal temperatures across Illinois, with highs up to 69°F in Kaskaskia and 68°F in Carbondale. The first half of January has been a top 10 warmest on record in most parts of the state.\n\n- Precipitation has been below normal, with 7-day totals ranging from 0.1 inches in southeast Illinois to 0.75 inches in central Illinois. January to date has been 0.5-1 inch drier than normal, except for a narrow area between Peoria and Chicago that received 1-3 inches last week. \n\n- This winter season so far has been slightly wetter than normal in northeast Illinois, slightly drier than normal in central/western Illinois, and much drier than normal (top 5 driest on record) in southern Illinois, including the 3rd driest in Salem and 4th driest in Paducah.\n\n- Colder weather is expected this weekend, with highs struggling to reach 20°F in northern Illinois and above freezing in southern Illinois. This cold spell will bring light snow but little precipitation overall.\n\n- Colder than normal temperatures are expected to continue through the first week of February, but the final week of January should bring better chances of precipitation to the region.\n\n- The article references WILLAg.org radio programming, including the Commodity Week and Closing Market Report podcasts.",
      "summaryTimestamp": 1771411268189
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "Key points include:\n\nObjectives: Spray drones can provide flexibility for timely applications, reduce field traffic, and improve access to hard-to-reach areas. Farmers should clearly define their specific goals before investing.\n\nRegulations: Operators must have an FAA Part 107 Remote Pilot Certificate and Part 137 Certification for aerial pesticide application. State-level IDALS licensing is also required. Rules change frequently, so checking for updates is important.\n\nInsurance: Standard farm policies don't cover aerial application risks. Farmers need chemical, general, and physical damage liability coverage specific to drone operations.\n\nEquipment: Factors to consider include spray capacity, battery life, nozzle options, and GPS/automation features. Local dealer support is also key.\n\nTraining: Proper training on safe operation, calibration, and weather monitoring is essential. Iowa State offers educational programs on compliance and best practices.\n\nAdoption Approach: Farmers are encouraged to start small, compare results to conventional methods, and gradually scale up as they gain experience. Dry product applications can also be evaluated cautiously.\n\nResources: Iowa State University, the Digital Ag Innovation Lab, licensed dealers, and IDALS can all provide support for farmers new to spray drone technology.\n\nThe article highlights that spray drones can be a valuable addition, but successful integration requires careful planning and a thoughtful, stepwise approach. Staying up-to-date on regulations, safety, and best practices is crucial.",
      "summaryTimestamp": 1771411272467
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "Winter sowing involves starting seeds in containers like milk jugs or plastic bags and placing them outdoors, where the cold, moist conditions help the seeds break dormancy. This results in hardier transplants that mature sooner than they would otherwise.\n\nThe best vegetables for winter sowing include hardy greens like kale and cabbage, as well as spinach, onions, and leafy greens like chard and watercress. These plants can handle cold temperatures in their early stages.\n\nFor flowers, the article recommends sowing perennials like pansies, echinacea, snapdragons, larkspur, and scabiosa. Many of these need a period of cold stratification, which the winter sowing method provides.\n\nSpecific varieties mentioned include 'Carex' cabbage for shorter maturation, 'Avon' spinach for mildew resistance, and different groups of snapdragons suited to varying light and heat conditions.\n\nThe article notes that winter sowing offers the benefits of direct sowing with less risk, and provides a natural way to break dormancy for plants that require cold stratification. It's an excellent method for farmers looking to get a head start on the growing season.",
      "summaryTimestamp": 1771347246294
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series meetings will be held at 12 locations across Iowa from January 6-29. The meetings are organized by Iowa State University Extension and Outreach to provide farmers and crop production professionals with the latest research-based information to help them make informed decisions for the upcoming growing season.\n\nThe meetings will feature topics tailored to local growing conditions and challenges, including crop market and climate outlooks for 2026, nitrates and drinking water, profitable nutrient management, southern rust, transition planning, and robots and drones.\n\nEarly-bird registration is $75 until the week before each meeting, and late or on-site registration is $100. The registration fee includes refreshments, lunch, certified crop advisor credits, and access to resources. Private pesticide applicator recertification will also be available at each location for a separate fee of $30.\n\nThe meeting locations and dates are:\n- Jan. 6 – Sioux Center\n- Jan. 7 – Storm Lake\n- Jan. 8 – Burlington\n- Jan. 9 – Mason City\n- Jan. 13 – Estherville\n- Jan. 15 – Waterloo\n- Jan. 16 – Davenport\n- Jan. 21 – Ankeny\n- Jan. 22 – Atlantic\n- Jan. 27 – Iowa City\n- Jan. 28 – Le Mars\n- Jan. 29 – Carroll\n\nAccording to Josh Michel, a field agronomist with ISU Extension and Outreach, the goal of the meetings is to \"prepare producers to manage potential issues when they arise, or even before they arise, by sharing the most up-to-date scientific knowledge from Iowa State University researchers.\"",
      "summaryTimestamp": 1771411276501
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10 at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5.\n\nThe event will feature research on sorghum's value as a forage crop. Sorghum is more drought-tolerant and has lower nitrogen requirements compared to corn, and does not host the tar spot pathogen. Experts will discuss sorghum's production and utilization for silage, grazing, and as a standing winter feed source.\n\nAttendees will learn about forage sorghum research from Mitch Tuinstra, Wickersham Chair of Excellence in Agricultural Research and scientific director of the Institute for Plant Sciences at Purdue. He will share plant breeding techniques to improve sorghum yield and quality. Other speakers include Brad Shelton, Jason Tower, Nick Minton, and Jeff Jackson.\n\nVenue tours will be available from 3-5 pm and 6-8 pm, and a dinner and bull test station tour will be offered from 5-6 pm.",
      "summaryTimestamp": 1771411285811
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113 in July 2024, indicating improved farmer sentiment despite declines in corn and soybean prices. The Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations rose 7 points to 119.\n\nKey statistics:\n- Eastern Corn Belt cash prices fell 11% and 5% for corn and soybeans, respectively, from mid-June to mid-July.\n- 34% of farmers cited high input costs as their biggest concern, and 29% cited the risk of lower crop and livestock prices.\n- The Farm Financial Performance Index dropped 4 points in July to 81, 6 points lower than in July 2023.\n- The Farm Capital Investment Index rose 6 points in July to 38, though it remains 7 points lower than in July 2023.\n- The Short-Term Farmland Value Expectations Index rose to 118 from 115 in June, while the Long-Term Farmland Value Expectations Index dropped 6 points to 146.\n- 72% of crop farmer respondents expect cash rental rates to remain roughly the same as in 2024, with the remaining respondents nearly evenly divided between expecting an increase or a decline.\n\nThe survey was conducted from July 15-19, 2024. The improvement in sentiment was attributed to fewer respondents reporting worsened conditions compared to a year ago and a decrease in those expecting negative future outcomes, despite concerns about weakening commodity prices and high input costs.",
      "summaryTimestamp": 1771411293837
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue researchers are adopting an interdisciplinary approach to assess the emerging tar spot disease in corn. The research team, led by C.D. Cruz, associate professor of botany and plant pathology, is using a mix of statistical, data science, epidemiology, microbiology, artificial intelligence, and computer vision methods to understand the dynamics of tar spot in corn.\n\nThe research is funded by two grants totaling nearly $1.1 million from the USDA National Institute of Food and Agriculture. The team is collaborating with researchers from Colombia, Mexico, Ecuador, South Korea, and the U.S.\n\nThe researchers have developed a digital method called the stromata contouring detection algorithm (SCDA) to quantify tar spot in corn. They have tested the algorithm under field conditions and found it to be successful in quantifying trends, but some inaccuracies persist in fully automated scenarios. The team is now refining their training methods to improve the model's accuracy and performance.\n\nAnother research effort includes the laboratory of Purdue's Mohammad Jahanshahi, associate professor in the Lyles School of Civil and Construction Engineering and the Elmore Family School of Electrical and Computer Engineering. Jahanshahi and Cruz, along with their students, are working on a proof-of-concept data fusion project that integrates drone imagery and weather data to capture crucial details about the tar spot pathosystem.\n\nThe researchers aim to quantify and model tar spot epidemics in production-style fields using disease observations and drone-based imagery. Ultimately, the team wants to quantify and model tar spot severity by referencing and integrating imagery with spatial and temporal data.\n\nThe interdisciplinary nature of the project can place greater time demands on the researchers, but it also leads to better problem-solving as each person brings their own expertise to the table.",
      "summaryTimestamp": 1771411301659
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana Sheep Association (ISA), with support from the Indiana Sheep and Wool Market Development Program (IN S&W), is hosting various sheep-themed events and competitions at the 2024 Indiana State Fair:\n\n- The Wool and Ewe Room and Ewe2 boutique will be open throughout the fair, offering wool items, livestock-themed apparel, and more.\n- On August 2 at 10 a.m., there will be an open wool judging and wool sale event in the Blue Ribbon Pavilion.\n- The Make It With Wool (MIWW) competition and fashion show will take place on August 4 at 2 p.m. in the Indiana Arts Building.\n- The Indiana State Fair Shearing Contest will be held on August 4 at 5 p.m. in the Ball State University Champions Pavilion.\n- From August 8-11, 11 a.m.-6 p.m., the Taste from Indiana Farms event in the Indiana Farm Bureau Fall Creek Pavilion will offer free samples of Indiana lamb.\n- The annual Sheep to Shawl competition, where youth teams create a wool shawl from scratch, will be on August 18 at 10 a.m. in the Indiana Arts Building.\n- Sheep will be exhibited in the Blue Ribbon Pavilion for open and 4-H shows from August 4-20.\n\nISA President Jane Smith stated that the association is \"proud to bring the spirit of our industry to the fair, and this year we will bring it in the theme of 'Art and Nature,' showcasing sheep-related art from Indiana artists in the Blue Ribbon Pavilion.\"",
      "summaryTimestamp": 1771411309252
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue Extension will have a presence at the fair, offering interactive demonstrations and activities at the Purdue Extension Building on the north side of the fairgrounds.\n\nKey Purdue Extension activities include:\n- Block Party (for children 8 months to 8 years) to enhance school-readiness skills\n- Book Party focusing on math skills\n- Captain Cash to teach financial management\n- Engaging with Purdue Extension experts in fields like entomology, human health, forestry, and animal sciences\n- Master Gardener exhibit on annuals and vegetables suited to Indiana\n- Pollinator education\n\nOther Purdue events include:\n- \"What's Growing on My Spinach?\" food safety activity on August 7, with samples of \"Cricket Rice Krispies Treats\"\n- Seed art displays in livestock barns and the Purdue Extension Building\n- Pioneer Village in the 1800s theme, sponsored by the Purdue Ag Alumni Association\n\nThe Purdue Extension exhibits will be located throughout the fairgrounds, including the 4-H Exhibit Hall, Expo Hall, Indiana Farmers Coliseum, and more.\n\nPurdue University is a public research institution ranked among the top 10 public universities in the U.S., with a focus on affordability, accessibility, and the pursuit of new innovations.",
      "summaryTimestamp": 1771411316576
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The new NPM publication \"Potassium Cycle\" provides a comprehensive visual overview of the potassium cycle in Wisconsin cropping systems. The two-page publication outlines key potassium concepts, including:\n\n- Sources of potassium, including soil minerals, organic matter, and fertilizers\n- Potassium uptake by plants and movement within the plant\n- Potassium losses from the soil through leaching, crop removal, and erosion\n- Recommended potassium application rates and timing for optimum crop yields\n\nThe publication was developed by the University of Wisconsin-Madison to help farmers better understand the potassium cycle and make informed decisions about potassium management in their operations. It is available for free download on the NPM website.",
      "summaryTimestamp": 1771411319041
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Wisconsin winter wheat is progressing at a record pace, about 10-14 days ahead of normal. As of April 17, 2022, 26% of the winter wheat crop was in the jointing stage, compared to the 5-year average of 10%. Wheat condition is rated 79% good-to-excellent, higher than the 5-year average of 71%.\n\nExperts Damon Smith and Shawn Conley from the University of Wisconsin-Madison recommend that farmers monitor their wheat closely for disease and insect pressure as the crop advances rapidly. They advise applying fungicides at flag leaf emergence to protect against Fusarium head blight and other diseases.\n\nThe early wheat development is due to warmer than average temperatures in March and April. This accelerated growth could lead to earlier wheat harvest, potentially impacting management of other summer crops. Farmers should adjust plans accordingly and be prepared to shift fieldwork schedules as needed.",
      "summaryTimestamp": 1771411321591
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Soybean fields may need replanting due to factors like freezing, hail, flooding, pests, and diseases. Before replanting, farmers should consider:\n\n1. Yield potential - Replanted soybeans may yield 5-10% less than the original stand. Yield loss is higher for replanting beyond June 1st.\n\n2. Maturity - Replanted soybeans will be 7-10 days later to maturity. This can impact harvest timing and drying costs.\n\n3. Weed control - Replanting provides a chance to change herbicide programs and manage weeds more effectively.\n\n4. Seed quality - Germination and vigor of replacement seed should be checked. Seed treatments may be needed.\n\n5. Planting date - Ideal replanting dates are before June 1st in northern climates. Yields drop significantly for plantings after June 15th.\n\n6. Stand uniformity - Uneven stands can impact harvestability and yield. Aim for a uniform 100,000-150,000 plants/acre.\n\nShawn P. Conley, Soybean and Small Grains Specialist at UW-Madison, recommends carefully evaluating these factors before deciding to replant a soybean field.",
      "summaryTimestamp": 1771411324900
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n- Farmers planning to use 2,4-D on Enlist E3 soybean in 2024 need to be aware of important updates and restrictions.\n- The use of 2,4-D on Enlist E3 soybean will be prohibited in 2024 due to regulatory changes.\n- Farmers should instead consider alternative weed control options for Enlist E3 soybean in 2024, such as glufosinate and clethodim herbicides.\n- Rodrigo Werle, a Weed Scientist and Extension Specialist at UW-Madison, advises farmers to stay informed about the latest updates and plan their weed management strategies accordingly.\n\nThe article does not provide any specific numbers, prices, statistics, or percentages. It also does not mention any deadlines, names of people/organizations/programs, or locations beyond UW-Madison. The context is the regulatory changes affecting the use of 2,4-D on Enlist E3 soybean in 2024. The main impact for farmers is the need to adjust their weed control plans for Enlist E3 soybean next year. The article recommends that farmers consider alternative herbicide options and stay informed about the latest updates.",
      "summaryTimestamp": 1771411328943
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Wisconsin CCA (Certified Crop Adviser) Board election results are as follows:\n\nRob Shields, Matt Brugger, and Chris Bandura have been elected to the Wisconsin CCA Board. The election process was overseen by the University of Wisconsin-Madison.",
      "summaryTimestamp": 1771411330612
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 14,
  "updated": "2026-02-18T20:35:39.597Z"
}