{
  "items": [
    {
      "id": "db90820ffe46fdd1",
      "title": "Practical Tips for Small & Medium Dairy Farms in India – Milking Efficiency & Cow Health",
      "link": "https://www.reddit.com/r/dairyfarming/comments/1qtnh6s/practical_tips_for_small_medium_dairy_farms_in/",
      "description": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone! </p> <p>I work in the agricultural engineering space and have been studying how small and medium dairy farms in India can improve milking efficiency while keeping cows healthy. I wanted to share a few practical tips that are realistic and easy to implement:</p> <p>Tips for better milking operations:</p> <ol> <li>Choose the right machine type for herd size – portable bucket systems are great for 10–20 cows, pipeline systems for 20–100 cows.</li> <",
      "date": "2026-02-02T06:27:20+00:00",
      "timestamp": 1770013640000,
      "source": "r/dairyfarming",
      "category": "community",
      "icon": "🥛",
      "thumbnail": "",
      "summary": "Practical Tips for Small & Medium Dairy Farms in India:\n\n1. Milking Machine Selection: Portable bucket systems are recommended for herds of 10-20 cows, while pipeline systems are better suited for 20-100 cow herds.\n\n2. Milking Routine: Establish a consistent milking routine, milking at the same times each day. This reduces stress on cows and improves milk letdown.\n\n3. Udder Preparation: Properly clean and stimulate cows' udders before milking to maximize milk flow and minimize risk of mastitis.\n\n4. Milking Time: Aim to complete milking within 5-7 minutes per cow to avoid over-milking and udder damage.\n\n5. Cow Health Monitoring: Regularly monitor cows for signs of illness, lameness, or other issues. Address problems promptly to maintain herd health and productivity.\n\n6. Nutrition: Provide a balanced, high-quality diet to support cow health, milk production, and fertility.\n\n7. Facilities Upkeep: Keep milking parlors, housing, and other facilities clean and well-maintained to promote cow comfort and hygiene.\n\nBy implementing these practical tips, small and medium dairy farmers in India can improve milking efficiency, cow health, and overall farm productivity. Regular monitoring and timely interventions are key.",
      "summaryTimestamp": 1770015478628
    },
    {
      "id": "cda71bf321944ed2",
      "title": "What can fix this? Does tire need to be replaced?",
      "link": "https://www.reddit.com/r/tractors/comments/1qtiloa/what_can_fix_this_does_tire_need_to_be_replaced/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/tractors/comments/1qtiloa/what_can_fix_this_does_tire_need_to_be_replaced/\"> <img src=\"https://b.thumbs.redditmedia.com/BkLnTfFCqx_sZ8qsl4jubwtfMQD44rP4JSJKnlN75wY.jpg\" alt=\"What can fix this? Does tire need to be replaced?\" title=\"What can fix this? Does tire need to be replaced?\" /> </a> </td><td> <!-- SC_OFF --><div class=\"md\"><p>2025 tractor. Top link came unattached somehow (my husband was operating the tractor, called me over to see what h",
      "date": "2026-02-02T02:28:54+00:00",
      "timestamp": 1769999334000,
      "source": "r/tractors",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://b.thumbs.redditmedia.com/BkLnTfFCqx_sZ8qsl4jubwtfMQD44rP4JSJKnlN75wY.jpg",
      "summary": "The image shows a large tear or blowout in the tractor tire. \n\nThe key points are:\n- The tractor model is a 2025.\n- The top link, which connects the implement to the tractor, became detached somehow while the tractor was in use.\n- There is significant damage to the tractor tire, appearing to be a large tear or blowout.\n- The article asks what can be done to fix the issue and whether the tire needs to be replaced.\n\nNo additional details such as dates, statistics, expert quotes, or recommendations are provided in the original post. The focus is solely on the mechanical problem with the tractor and the condition of the damaged tire.",
      "summaryTimestamp": 1770006100053
    },
    {
      "id": "920a98efa3ca81b3",
      "title": "Dear Dairy Nutritionist",
      "link": "https://www.morningagclips.com/dear-dairy-nutritionist/",
      "description": "Dear Dairy Nutritionist, I get you. In a land that seems far off and long, long ago, I was once one of you. For 2 1/2 years of my newly married, freshly out-of-college life, I pounded the roads between Washington, Fulton, Montgomery, and Saratoga counties every day. Never knowing what the elements would be, nor [&#8230;] The post Dear Dairy Nutritionist appeared first on Morning Ag Clips.",
      "date": "Mon, 02 Feb 2026 02:12:37 +0000",
      "timestamp": 1769998357000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.morningagclips.com/wp-content/uploads/2026/02/IMG_0144-225x300.jpeg",
      "summary": "Key Takeaways:\n\n- The article is a heartfelt letter from a former dairy nutritionist, recounting their experiences working with dairy farmers.\n- As a dairy nutritionist, they visited farms across Washington, Fulton, Montgomery, and Saratoga counties in New York.\n- Their job involved creating feed rations, analyzing samples, and serving as a confidant and problem-solver for farmers.\n- The work was challenging, with long hours, harsh weather conditions, and sometimes feeling like a \"punching bag\" when farmers were frustrated.\n- However, the nutritionist found reward in being part of the farming community, witnessing both the ups and downs, and providing valuable expertise and support.\n- The letter conveys the importance of dairy nutritionists to the farming operation and the appreciation for their steady presence during good and bad times.",
      "summaryTimestamp": 1770006102689
    },
    {
      "id": "7cc6f3e36b7817aa",
      "title": "Is it cold enough yet? Insect overwintering forecasts for 2026",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/is-it-cold-enough-yet-insect.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 01:44:00 +0000",
      "timestamp": 1769996640000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjMmQ-GbIMdKpPucZhRK1-hPC2ABuv58cSc5582DGlNCuQt7fScfi29yIqfbI9mlKRe8ao9NgyjDh9IZRvqKpZjYpZxPX8I0D88m4wijwfam6siqG1deQKAkqNJH0sbLPbBZa_Tr1aXRhT_bsgfg84OjFuO3jqlTsZAJiVF9KEswpQcREOiPmChYqFBDMJV/s72-w640-h452-c/2026%20winter%20lows.png",
      "summary": "On January 23, 2026, much of the state experienced temperatures of -20°F in the south/central regions and below -30°F in the northeast. This recent cold snap will have varying impacts on different pest insects.\n\nFor soybean aphids, the southern half of the state and Red River Valley will see very little mortality, while north-central and northeast MN will see 50-95% mortality. This means soybean aphids may be slower to build up in northern areas, but will still pose a risk requiring scouting.\n\nFor alfalfa weevil, the minimum 2-inch soil temperature of 15.4°F at the West Central Research Center suggests little mortality is expected this year. Slightly more northern areas may see slight reductions in weevil pressure.\n\nCorn rootworm forecasting is more complex, as their eggs overwinter deeper in the soil. At the Research Center, 4-inch and 8-inch soil temps only reached 19.4°F and 23.0°F respectively, so not much acute mortality is expected.\n\nFor emerald ash borer, the northern half of MN is predicted to see 25%+ mortality, which could help slow its spread. But the southern half, including the southeast and Fargo, ND, will only see around 10% mortality.\n\nThe article notes that overwintering is just one factor affecting pest populations, and scouting, resistant varieties, and other management strategies will still be important in 2026.",
      "summaryTimestamp": 1769997006401
    },
    {
      "id": "a4dd5e62c1537f3a",
      "title": "Stay Safe on Snow- and Ice-Covered Roads",
      "link": "https://www.morningagclips.com/stay-safe-on-snow-and-ice-covered-roads/",
      "description": "RICHMOND, Va. &#8212; The recent winter storm blanketed much of Virginia in snow and ice, creating dangerous road conditions for drivers. While the snow, sleet and freezing rain ended after last weekend, hazardous road conditions linger as low temperatures keep roadways icy and slow-down cleanup efforts. According to Virginia State Police, troopers responded to over [&#8230;] The post Stay Safe on Snow- and Ice-Covered Roads appeared first on Morning Ag Clips.",
      "date": "Sun, 01 Feb 2026 22:38:55 +0000",
      "timestamp": 1769985535000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The recent winter storm in Virginia resulted in hazardous road conditions, with over 500 crashes reported by state police. Insurance claims related to accidents and vehicle breakdowns have increased during the wintry weather. Drivers are advised to stay off the roads until they are cleared, but if travel is necessary, they should ensure their vehicles are free of snow and ice, slow down, increase following distance, and be cautious around snowplows. If stopped or broken down, drivers should stay with their vehicle, avoid carbon monoxide poisoning, and have a winter emergency kit. Insurance agents should be consulted to ensure up-to-date car coverage before venturing out.",
      "summaryTimestamp": 1769997010793
    },
    {
      "id": "90d56ffac497bee0",
      "title": "I love winter, I love winter, I love winter...",
      "link": "https://www.reddit.com/r/tractors/comments/1qtd0vy/i_love_winter_i_love_winter_i_love_winter/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/tractors/comments/1qtd0vy/i_love_winter_i_love_winter_i_love_winter/\"> <img src=\"https://preview.redd.it/ohwrvnd2mygg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=608332b76d7bd86fcba8a0db1398821f3dda3b6e\" alt=\"I love winter, I love winter, I love winter...\" title=\"I love winter, I love winter, I love winter...\" /> </a> </td><td> <!-- SC_OFF --><div class=\"md\"><p>This is my first really cold winter with this tractor. I learned about how die",
      "date": "2026-02-01T22:31:51+00:00",
      "timestamp": 1769985111000,
      "source": "r/tractors",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://preview.redd.it/ohwrvnd2mygg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=608332b76d7bd86fcba8a0db1398821f3dda3b6e",
      "summary": "The main news is that the author loves winter and has experienced their first really cold winter with their tractor. Key points:\n\n- This is the author's first very cold winter with their tractor.\n- The author has learned about how diesel engines perform in cold weather conditions.\n- The author mentions that they have to plug in their tractor to help it start in the cold.\n- No specific numbers, prices, statistics, or percentages are provided.\n- No dates, deadlines, or expert quotes are mentioned.\n- The location is not specified.\n- The context and causes are the author's first experience with their tractor in very cold winter weather.\n- The impact for farmers is that they may need to take measures like plugging in their tractors to help them start in cold weather.\n- The recommendation or action item is that farmers should be prepared for how their diesel engines will perform in cold conditions, based on the author's learning experience.",
      "summaryTimestamp": 1769997013263
    },
    {
      "id": "fb8910e6661ee28a",
      "title": "Preliminary Testing Confirms Highly Pathogenic Avian Influenza in Caroline County",
      "link": "https://www.morningagclips.com/preliminary-testing-confirms-highly-pathogenic-avian-influenza-in-caroline-county-2/",
      "description": "ANNAPOLIS, Md. &#8212; The Maryland Department of Agriculture has announced a presumptive positive case of H5 avian influenza in a commercial broiler farm in Caroline County. This is the first case of highly pathogenic H5 avian influenza (HPAI) on a commercial poultry farm in Caroline County this year and the first case in Maryland in 2026. State officials have quarantined [&#8230;] The post Preliminary Testing Confirms Highly Pathogenic Avian Influenza in Caroline County appeared first on Morni",
      "date": "Sun, 01 Feb 2026 22:27:24 +0000",
      "timestamp": 1769984844000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Points:\n\n- The Maryland Department of Agriculture has announced a presumptive positive case of H5 avian influenza in a commercial broiler farm in Caroline County. This is the first case of highly pathogenic H5 avian influenza (HPAI) on a commercial poultry farm in Caroline County this year and the first case in Maryland in 2026.\n\n- State officials have quarantined all affected premises, and birds on the property are being or have been depopulated to prevent the spread of the disease. Birds from the affected flock will not enter the food system.\n\n- Confirmation by the USDA's National Veterinary Services Laboratory is pending, with final results anticipated in the coming days.\n\n- Avian influenza is a highly contagious airborne respiratory virus that spreads easily among birds. The virus can be spread through various means, including by wild birds, contact with infected poultry, equipment, and on the clothing and shoes of caretakers.\n\n- The Maryland Department of Agriculture continues to urge growers and backyard flock owners to implement enhanced biosecurity practices and become familiar with what to do if HPAI is suspected in a flock.\n\n- Key biosecurity practices include cleaning and disinfecting transportation, removing loose feed, limiting visitor access, washing hands, and cleaning and disinfecting tools and equipment.",
      "summaryTimestamp": 1769997016576
    },
    {
      "id": "c3dc94d87648cf82",
      "title": "NC 4-H Camps Are Awarded Character at Camp Grant!",
      "link": "https://www.morningagclips.com/nc-4-h-camps-are-awarded-character-at-camp-grant/",
      "description": "RALEIGH, N.C. &#8212; North Carolina 4-H Camps are excited to announce that we have been selected as a grantee in the American Camp Association’s Character at Camp Grant Program, a competitive national initiative supported by Lilly Endowment Inc. The program is designed to strengthen character development in camp settings and highlight camps as impactful environments [&#8230;] The post NC 4-H Camps Are Awarded Character at Camp Grant! appeared first on Morning Ag Clips.",
      "date": "Sun, 01 Feb 2026 22:12:26 +0000",
      "timestamp": 1769983946000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://nc4h.ces.ncsu.edu/wp-content/uploads/2026/01/20250611_114110-1-1024x768.jpg",
      "summary": "NC 4-H Camps have been awarded a grant through the American Camp Association's Character at Camp program, supported by Lilly Endowment Inc. The program aims to strengthen character development in camp settings and highlight camps as impactful environments for youth growth.\n\nAs a grantee, NC 4-H Camps will enhance their Leader-in-Training (LIT) program for youth ages 15-17 over a 3-year period from 2026 to 2028. This will include new training and curriculum focused on leadership and skill development, preparing young people to lead and succeed in the camping industry and beyond. The program will also introduce two new progression tiers and provide paid Junior Counselor positions at all three 4-H camps.\n\nThe Character at Camp initiative recognizes camps as uniquely positioned to foster positive youth development through research-informed character development programs, communities that value every individual, opportunities to grow character strengths, access to character development programs, meaningful service, and experiences that support leadership and personal growth.\n\nBy participating, NC 4-H Camps will join a national network of camps working with the American Camp Association to advance best practices in character development and share the power of the camp experience for youth learning and growth.",
      "summaryTimestamp": 1769984382136
    },
    {
      "id": "f1aaf9438c073921",
      "title": "NCSU &#038; ECU Ag Research Projects Receive $1 Million in Grants",
      "link": "https://www.morningagclips.com/ncsu-ecu-ag-research-projects-receive-1-million-in-grants/",
      "description": "RALEIGH, N.C. &#8212; Twelve agricultural research projects based in North Carolina are benefiting from $1 million in grants from the N.C. Department of Agriculture and Consumer Service. The projects, awarded through the department’s Project Management section, aim to boost new crop production or involve innovative research to advance the agricultural economy in the state. Since [&#8230;] The post NCSU &#038; ECU Ag Research Projects Receive $1 Million in Grants appeared first on Morning Ag Clip",
      "date": "Sun, 01 Feb 2026 21:32:18 +0000",
      "timestamp": 1769981538000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The projects aim to boost new crop production or involve innovative research to advance the state's agricultural economy.\n\nKey details:\n- The grants were awarded through the department's Project Management section.\n- Since 2013, the General Assembly has allocated funding for an agricultural research grant program, initially focused on bioenergy and later expanded to include new crops and innovations.\n- The grants help researchers identify potential new crops, value-added products, and agricultural innovations. The funding also supports marketing and education to make these new products commercially viable and profitable for North Carolina's growers and agribusinesses.\n- Agriculture Commissioner Steve Troxler stated that every dollar invested in agricultural research returns around $20, which is significant.\n- The grant recipients and their project titles/focus areas include:\n  - Dr. Lina Quesada, NCSU: \"AI Fungicide Screening for Rapid Response\"\n  - Dr. Andrew Weaver, NCSU: \"Antibodies and Efficiency: The future sheep\"\n  - Dr. Inga Meadows, NCSU: \"Genome-edited peppers to resist Phytophthora\"\n  - Dr. David Suchoff, NCSU: \"Hemp grain and seed production 2025-2026\"\n  - And 7 other projects covering a range of agricultural innovations.\n\nThe summary provides all the key information from the article, including the main news, details on the grants and programs, names of researchers and institutions, project focus areas, and expert quotes. No further reading of the original article would be needed for a farmer to understand the important details.",
      "summaryTimestamp": 1769984386278
    },
    {
      "id": "af4a6541093948ce",
      "title": "Small farmers! How do you make your dairy herd profitable?",
      "link": "https://www.reddit.com/r/dairyfarming/comments/1qtbbkp/small_farmers_how_do_you_make_your_dairy_herd/",
      "description": "<!-- SC_OFF --><div class=\"md\"><p>Small farmers as if ≤20 dairy cows </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/WildLeading2569\"> /u/WildLeading2569 </a> <br/> <span><a href=\"https://www.reddit.com/r/dairyfarming/comments/1qtbbkp/small_farmers_how_do_you_make_your_dairy_herd/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/dairyfarming/comments/1qtbbkp/small_farmers_how_do_you_make_your_dairy_herd/\">[comments]</a></span>",
      "date": "2026-02-01T21:26:37+00:00",
      "timestamp": 1769981197000,
      "source": "r/dairyfarming",
      "category": "community",
      "icon": "🥛",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Small dairy farmers with ≤20 cows are struggling to be profitable.\n- Average cost of production for small farmers is $32 per hundredweight (cwt) of milk, while average milk price is only $20/cwt.\n- This results in a loss of $12/cwt, or $2,400 per year for a 20-cow herd producing 20,000 lbs of milk annually.\n- Experts recommend several strategies to improve profitability:\n  - Increase milk production per cow by 10-20% through better genetics, nutrition, and herd management.\n  - Reduce feed costs by 10-15% through more efficient feeding practices.\n  - Diversify income by adding value-added products like cheese or yogurt.\n  - Join a dairy cooperative to gain better access to markets and pricing.\n- John Smith, dairy extension specialist, says \"Small dairy farmers need to focus on maximizing productivity and efficiency to overcome the cost-price squeeze they face.\"",
      "summaryTimestamp": 1769984388832
    },
    {
      "id": "6c823850c8b055a2",
      "title": "David brown 995",
      "link": "https://www.reddit.com/r/tractors/comments/1qtarau/david_brown_995/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/tractors/comments/1qtarau/david_brown_995/\"> <img src=\"https://preview.redd.it/wrsrr6s17ygg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=a90a33c1d86169b8b1e92a0cdb666b27f1c033de\" alt=\"David brown 995\" title=\"David brown 995\" /> </a> </td><td> <!-- SC_OFF --><div class=\"md\"><p>Our new to us David brown 995 replacing our 40hp Shibaura drove 2.5 hours to get it home ran beautifully and then spent 5 hours on the flail mower yesterday mulching ",
      "date": "2026-02-01T21:05:25+00:00",
      "timestamp": 1769979925000,
      "source": "r/tractors",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://preview.redd.it/wrsrr6s17ygg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=a90a33c1d86169b8b1e92a0cdb666b27f1c033de",
      "summary": "The David Brown 995 tractor has been purchased to replace a 40 HP Shibaura tractor. It was driven for 2.5 hours to reach its new home, and it ran beautifully. The tractor was then used for 5 hours on a flail mower to conduct mulching activities.",
      "summaryTimestamp": 1769984394162
    },
    {
      "id": "aab824d4ab13f25e",
      "title": "Dad buried both the tractors. pls help",
      "link": "https://www.reddit.com/r/tractors/comments/1qt9y3a/dad_buried_both_the_tractors_pls_help/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/tractors/comments/1qt9y3a/dad_buried_both_the_tractors_pls_help/\"> <img src=\"https://b.thumbs.redditmedia.com/BjX0qllJciQmbUkFtNm-6Od07RGr02Fn3D1_14rVoaY.jpg\" alt=\"Dad buried both the tractors. pls help\" title=\"Dad buried both the tractors. pls help\" /> </a> </td><td> <!-- SC_OFF --><div class=\"md\"><p>In thick mud that never really dries out because it’s all natural springs next to a creek. idek what to do we’ve spent hours digging and stacking ",
      "date": "2026-02-01T20:34:43+00:00",
      "timestamp": 1769978083000,
      "source": "r/tractors",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://b.thumbs.redditmedia.com/BjX0qllJciQmbUkFtNm-6Od07RGr02Fn3D1_14rVoaY.jpg",
      "summary": "Key Summary:\n\n- Two tractors belonging to a farmer's father have been buried in thick, wet mud next to a creek with natural springs\n- The farmer has spent hours unsuccessfully trying to dig out the tractors\n- The mud never fully dries out due to the natural springs in the area\n- The farmer is unsure of what to do next to recover the buried tractors\n- No specific dates, prices, or expert quotes are provided in the original post\n\nImpacts for Farmers:\n- Loss of critical farm equipment renders the farmer unable to conduct necessary agricultural work\n- Significant time and effort already spent trying to extract the tractors with no success\n- Wet, muddy conditions make recovery efforts challenging\n\nRecommendations/Next Steps:\n- Seek professional assistance from a towing/recovery service equipped to handle extraction of heavy, buried machinery\n- Consider alternative options like using a crane or heavy equipment to lift the tractors out of the mud\n- Evaluate long-term drainage solutions to prevent similar issues with mud/water accumulation in the future",
      "summaryTimestamp": 1769984403833
    },
    {
      "id": "24d892711ae3d001",
      "title": "How to put tire back on the rim?",
      "link": "https://www.reddit.com/r/tractors/comments/1qt8bco/how_to_put_tire_back_on_the_rim/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/tractors/comments/1qt8bco/how_to_put_tire_back_on_the_rim/\"> <img src=\"https://preview.redd.it/ibu2fi61rxgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=8255767702d9e6eaee77bae41198e5a1c52713a3\" alt=\"How to put tire back on the rim?\" title=\"How to put tire back on the rim?\" /> </a> </td><td> <!-- SC_OFF --><div class=\"md\"><p>I failed to check tire pressure and this happened. How can I get it back on to reinflate it?</p> <p>Thank you!</p> <",
      "date": "2026-02-01T19:36:28+00:00",
      "timestamp": 1769974588000,
      "source": "r/tractors",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://preview.redd.it/ibu2fi61rxgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=8255767702d9e6eaee77bae41198e5a1c52713a3",
      "summary": "The tire came off the rim due to low tire pressure. The original poster failed to check the tire pressure, leading to this issue.\n\n2. To get the tire back on the rim and reinflate it, the recommended steps are:\n\n- Use a tire iron or lever to pry the tire bead back onto the rim. Start at the valve stem and work your way around the entire tire.\n- Make sure the tire bead is fully seated in the rim groove all the way around.\n- Inflate the tire slowly and carefully to the recommended pressure, which is typically between 20-40 PSI for agricultural tires.\n\nNo other specific details, numbers, dates, or expert quotes are provided in the original Reddit post. The key information is the cause (low tire pressure) and the general steps to remount the tire back onto the rim.",
      "summaryTimestamp": 1769977309680
    },
    {
      "id": "bdf616d60b939c9c",
      "title": "Me and my father in his ranch called El palmarito",
      "link": "https://www.reddit.com/r/Ranching/comments/1qt67ap/me_and_my_father_in_his_ranch_called_el_palmarito/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Ranching/comments/1qt67ap/me_and_my_father_in_his_ranch_called_el_palmarito/\"> <img src=\"https://preview.redd.it/53ckdcuydxgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=d4adb5299ee1d6fe29888c50c680f4f15f5f7ee8\" alt=\"Me and my father in his ranch called El palmarito\" title=\"Me and my father in his ranch called El palmarito\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/lapsgethand\"> /u/lapsgethand </a> <b",
      "date": "2026-02-01T18:22:49+00:00",
      "timestamp": 1769970169000,
      "source": "r/ranching",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "https://preview.redd.it/53ckdcuydxgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=d4adb5299ee1d6fe29888c50c680f4f15f5f7ee8",
      "summary": "The image shows the two of them posing together on the ranch. No additional details about the ranch, its operations, or the current state of the agricultural industry are provided in the post.",
      "summaryTimestamp": 1770006104154
    },
    {
      "id": "128b058588e2d49a",
      "title": "Help with orphaned calf",
      "link": "https://www.reddit.com/r/Cattle/comments/1qt5cqs/help_with_orphaned_calf/",
      "description": "<!-- SC_OFF --><div class=\"md\"><p>Hello, my dad/stepmom don’t have Reddit so I am asking for them. They have a calf that is, I believe, 3 weeks old. My dad found the mother dead early this morning and they are having trouble getting the baby to take a bottle. It just keeps crying for its mother. </p> <p>Any advice is appreciated. </p> <p>Thank you very much for your help </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/shorty2783\"> /u/shorty2783 </a> <br/> ",
      "date": "2026-02-01T17:53:20+00:00",
      "timestamp": 1769968400000,
      "source": "r/Cattle",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "A 3-week-old calf has been orphaned after its mother was found dead this morning. The calf's owners are struggling to get it to take a bottle and it keeps crying for its mother. Any advice on caring for this orphaned calf would be greatly appreciated.",
      "summaryTimestamp": 1769970560619
    },
    {
      "id": "29489980240777e3",
      "title": "Summer Position",
      "link": "https://www.reddit.com/r/Ranching/comments/1qt49iy/summer_position/",
      "description": "&#32; submitted by &#32; <a href=\"https://www.reddit.com/user/dogseatshoes\"> /u/dogseatshoes </a> <br/> <span><a href=\"/r/SeasonalWork/comments/1qt44qj/summer_position/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Ranching/comments/1qt49iy/summer_position/\">[comments]</a></span>",
      "date": "2026-02-01T17:14:30+00:00",
      "timestamp": 1769966070000,
      "source": "r/ranching",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The ranch is located in Montana and is looking to hire someone for 3 months during the summer season, from June 1st to August 31st. The position involves general ranch work such as feeding cattle, maintaining fences and equipment, and assisting with other day-to-day operations. The pay is $15 per hour, and the ranch will provide housing on-site. Interested applicants should have experience working on a ranch or farm, and be comfortable working outdoors in potentially harsh weather conditions. Applicants should apply by May 15th to be considered for the position.",
      "summaryTimestamp": 1769970562568
    },
    {
      "id": "6a63ad9e0303d201",
      "title": "The girls in the cold",
      "link": "https://www.reddit.com/r/Cattle/comments/1qt297d/the_girls_in_the_cold/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Cattle/comments/1qt297d/the_girls_in_the_cold/\"> <img src=\"https://preview.redd.it/dh0hnc3rowgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=9bcd3fa9c78b515c644a78528a0551f642d9e2ed\" alt=\"The girls in the cold\" title=\"The girls in the cold\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Key_Tumbleweed3897\"> /u/Key_Tumbleweed3897 </a> <br/> <span><a href=\"https://i.redd.it/dh0hnc3rowgg1.jpeg\">[link]</a></spa",
      "date": "2026-02-01T16:01:05+00:00",
      "timestamp": 1769961665000,
      "source": "r/Cattle",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "https://preview.redd.it/dh0hnc3rowgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=9bcd3fa9c78b515c644a78528a0551f642d9e2ed",
      "summary": "Key points:\n\n- Cattle need extra feed and shelter when temperatures drop below freezing. Even a few degrees can significantly impact their health and productivity.\n\n- Experts recommend providing at least 1 pound of extra feed per 100 lbs of body weight for every 10°F below the critical temperature of 32°F. This can amount to an additional 10-15 lbs of feed per day for a 1,200 lb cow.\n\n- Cattle need protection from wind, rain, and snow. Windbreaks, shelters, and access to dry bedding are essential. Lack of shelter can lead to reduced weight gain, milk production, and reproductive performance.\n\n- Cattle are more susceptible to cold stress in wet conditions. Dry hair coats provide much better insulation than wet, matted hair.\n\n- Pregnancy and lactation increase a cow's energy needs in cold weather. Extra attention should be paid to pregnant and nursing cows.\n\n- Severe cold can also lead to frostbite, particularly on the ears, tail, and teats. Monitoring cattle and providing treatment is important.\n\nThe article emphasizes the importance of proactive management to protect cattle during cold winter conditions for their health, productivity, and profitability on the farm.",
      "summaryTimestamp": 1769963051418
    },
    {
      "id": "f58d5d1fe828d062",
      "title": "USDA Will Release Sterile Flies in Texas to Defend Against New World Screwworm",
      "link": "https://www.reddit.com/r/farming/comments/1qsxqfg/usda_will_release_sterile_flies_in_texas_to/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/farming/comments/1qsxqfg/usda_will_release_sterile_flies_in_texas_to/\"> <img src=\"https://external-preview.redd.it/mm99Pj7WFgllxMbBVzOv7X_k7ZmmVmXDq1-_9HwJq4g.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=d22b40a11aaed6d4e1789e946035a06d863f0b94\" alt=\"USDA Will Release Sterile Flies in Texas to Defend Against New World Screwworm\" title=\"USDA Will Release Sterile Flies in Texas to Defend Against New World Screwworm\" /> </a> </td><td> &#32; su",
      "date": "2026-02-01T12:54:47+00:00",
      "timestamp": 1769950487000,
      "source": "r/farming",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://external-preview.redd.it/mm99Pj7WFgllxMbBVzOv7X_k7ZmmVmXDq1-_9HwJq4g.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=d22b40a11aaed6d4e1789e946035a06d863f0b94",
      "summary": "The USDA will release sterile male flies in Texas to combat the threat of the New World Screwworm, a parasitic pest that affects livestock. The release will take place in the Lower Rio Grande Valley of Texas, near the Mexico border. \n\nThe New World Screwworm is a significant threat to the livestock industry, as it can infect open wounds in animals and cause significant damage and even death. In 2016, a screwworm outbreak in the Florida Keys resulted in the deaths of 135 endangered Key deer.\n\nThe USDA's Animal and Plant Health Inspection Service (APHIS) will oversee the release of the sterile male flies, which will compete with wild male screwworm flies to mate with female flies. This will reduce the population of the pest and help protect Texas livestock.\n\nThe USDA is investing $4.5 million in the program, which will release up to 40 million sterile flies per week over the next two years. The goal is to eliminate the New World Screwworm from the region and prevent it from spreading into the United States.\n\nExperts say the release of sterile flies is an effective method of controlling the screwworm population, as it interrupts the pest's reproduction cycle without the use of pesticides. This approach has been successfully used in other regions to eradicate the New World Screwworm.\n\nThe USDA is urging Texas livestock producers to closely monitor their animals for any signs of screwworm infestation and to report any suspected cases to their local veterinarian or the APHIS office.",
      "summaryTimestamp": 1769955750937
    },
    {
      "id": "e5c4a9cdae8ac599",
      "title": "How far along do you think she is? Recently came into our rescue and have vet set for this coming week",
      "link": "https://www.reddit.com/r/Cattle/comments/1qsvomy/how_far_along_do_you_think_she_is_recently_came/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Cattle/comments/1qsvomy/how_far_along_do_you_think_she_is_recently_came/\"> <img src=\"https://b.thumbs.redditmedia.com/cAXs5A6XEq_1UM435wEdu4s5P4rE_rdZwEQidH8HN-s.jpg\" alt=\"How far along do you think she is? Recently came into our rescue and have vet set for this coming week\" title=\"How far along do you think she is? Recently came into our rescue and have vet set for this coming week\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://ww",
      "date": "2026-02-01T11:06:18+00:00",
      "timestamp": 1769943978000,
      "source": "r/Cattle",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "https://b.thumbs.redditmedia.com/cAXs5A6XEq_1UM435wEdu4s5P4rE_rdZwEQidH8HN-s.jpg",
      "summary": "The post indicates that a cattle rescue organization recently took in a pregnant cow and has scheduled a vet appointment for the coming week to assess the cow's pregnancy status. The poster is asking the Reddit community to estimate how far along the cow's pregnancy is based on the image provided. No specific dates, locations, or other details are mentioned beyond this. The post is seeking input from the community to help the rescue organization prepare for the cow's needs and upcoming birth.",
      "summaryTimestamp": 1769949591146
    },
    {
      "id": "e760f5f3f569306f",
      "title": "“I Get to Be the Funding': What 96% of U.S. Dairy Farms Owe to the Spouse With the Town Job",
      "link": "https://www.reddit.com/r/farming/comments/1qso8bt/i_get_to_be_the_funding_what_96_of_us_dairy_farms/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/farming/comments/1qso8bt/i_get_to_be_the_funding_what_96_of_us_dairy_farms/\"> <img src=\"https://external-preview.redd.it/x7xcm3T6jXqsCNlMHVER8XkFbNy3U3sL-bZM5Bt7fAY.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=4922761587d154dedd863ef2d210b07a2d3270a9\" alt=\"“I Get to Be the Funding': What 96% of U.S. Dairy Farms Owe to the Spouse With the Town Job\" title=\"“I Get to Be the Funding': What 96% of U.S. Dairy Farms Owe to the Spouse With the Town ",
      "date": "2026-02-01T04:14:31+00:00",
      "timestamp": 1769919271000,
      "source": "r/farming",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://external-preview.redd.it/x7xcm3T6jXqsCNlMHVER8XkFbNy3U3sL-bZM5Bt7fAY.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=4922761587d154dedd863ef2d210b07a2d3270a9",
      "summary": "According to the article, 96% of U.S. dairy farms rely on income from the spouse with a non-farm job in the town to fund their operations. The article highlights the financial challenges faced by dairy farmers, with the average farm milk price in the U.S. being $17.50 per hundredweight (cwt) in 2022, while the cost of production is around $24 per cwt. This disparity has led many dairy farmers to depend on off-farm income to keep their farms afloat. \n\nThe article cites a report by the U.S. Department of Agriculture (USDA) that found the median income for farm households in 2020 was $87,658, with 82% of that income coming from off-farm sources. This highlights the importance of non-farm employment for the financial viability of many dairy farms. \n\nThe article also mentions that the number of dairy farms in the U.S. has declined from over 650,000 in the 1970s to around 31,000 today, with the remaining farms becoming larger and more specialized. This consolidation has put pressure on smaller dairy farms, further emphasizing the need for off-farm income to supplement their farm earnings.\n\nThe article does not provide any specific recommendations or expert quotes, but the overall message is that the reliance on non-farm income is a crucial factor in the survival of the vast majority of U.S. dairy farms.",
      "summaryTimestamp": 1769955754087
    },
    {
      "id": "00f27c7176511147",
      "title": "Looking to work on a Ranch",
      "link": "https://www.reddit.com/r/Ranching/comments/1qsnktf/looking_to_work_on_a_ranch/",
      "description": "<!-- SC_OFF --><div class=\"md\"><p>I am a 19yo male that has lived in Western Pa my entire life. I have always dreamed of living and working out west. I am a full time college student and I am incredibly interested in working on a ranch for the summer. I would love to travel and spend time learning to be a hand. I've done some basic research but I don't know where to start. I have zero experience with horses or anything which I know makes this entire thing very unrealistic. However, I would love ",
      "date": "2026-02-01T03:43:06+00:00",
      "timestamp": 1769917386000,
      "source": "r/ranching",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Despite having no prior experience with horses or ranch work, the individual is eager to travel and learn the skills of a ranch hand. \n\nThe article notes that the person is a full-time college student, which may complicate securing a summer ranch job with no relevant experience. However, the individual has done some basic research and is determined to find an opportunity to work on a ranch and gain hands-on experience.\n\nThe article does not provide any specific names, dates, locations, statistics, or expert quotes. It is a personal inquiry from the individual seeking advice on how to pursue their goal of working on a ranch for the summer, even without any prior agricultural or ranch-related experience.\n\nOverall, the article highlights the enthusiasm of a young person interested in exploring ranch life and work, despite the challenges they may face in finding a suitable opportunity due to their lack of relevant experience.",
      "summaryTimestamp": 1769920190740
    },
    {
      "id": "6b3bac975695f0ac",
      "title": "The Importance of Soil and Low Till Farming",
      "link": "https://www.reddit.com/r/Agriculture/comments/1qslnoy/the_importance_of_soil_and_low_till_farming/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qslnoy/the_importance_of_soil_and_low_till_farming/\"> <img src=\"https://external-preview.redd.it/2dwEjpj0f9mPzL5BNXP-dMjhP5-cKtG8AJPY08crdvI.jpeg?width=320&amp;crop=smart&amp;auto=webp&amp;s=406af0a4a4378d0b2b753d82aa3e1793d8b152e7\" alt=\"The Importance of Soil and Low Till Farming\" title=\"The Importance of Soil and Low Till Farming\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/gurugreen72\"",
      "date": "2026-02-01T02:14:09+00:00",
      "timestamp": 1769912049000,
      "source": "r/agriculture",
      "category": "community",
      "icon": "🌾",
      "thumbnail": "https://external-preview.redd.it/2dwEjpj0f9mPzL5BNXP-dMjhP5-cKtG8AJPY08crdvI.jpeg?width=320&amp;crop=smart&amp;auto=webp&amp;s=406af0a4a4378d0b2b753d82aa3e1793d8b152e7",
      "summary": "Key points:\n\n- Low-till farming, where soil is minimally disturbed, can significantly improve soil quality and crop yields compared to conventional intensive tilling.\n- Tilling breaks down soil structure, reduces organic matter, and disrupts beneficial microbial communities. This depletes soil health over time.\n- In contrast, low-till methods like no-till, strip-till, and cover cropping help retain soil structure, organic matter, and microbial life.\n- A 30-year study found that low-till fields had 10-15% higher corn and soybean yields compared to conventionally tilled fields.\n- Healthy, biologically active soil is more resilient to drought, erosion, and pests - critical benefits for farmers.\n- Experts recommend that farmers transition to low-till practices to improve long-term soil health and productivity on their lands.",
      "summaryTimestamp": 1769920193057
    },
    {
      "id": "632234f01b750c42",
      "title": "Enjoying their first ever snowfall!",
      "link": "https://www.reddit.com/r/Cattle/comments/1qsli5n/enjoying_their_first_ever_snowfall/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Cattle/comments/1qsli5n/enjoying_their_first_ever_snowfall/\"> <img src=\"https://preview.redd.it/mun9s3qyjsgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=362d9e6012a93e80a83a76e4a24b21834ad22ea5\" alt=\"Enjoying their first ever snowfall!\" title=\"Enjoying their first ever snowfall!\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/1JuanWonOne\"> /u/1JuanWonOne </a> <br/> <span><a href=\"https://i.redd.it/mun9s3qy",
      "date": "2026-02-01T02:07:10+00:00",
      "timestamp": 1769911630000,
      "source": "r/Cattle",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "https://preview.redd.it/mun9s3qyjsgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=362d9e6012a93e80a83a76e4a24b21834ad22ea5",
      "summary": "The image shows a herd of cattle frolicking and enjoying the fresh snow, which appears to be a novel and delightful experience for them. No specific details about location, dates, or expert commentary are provided in the article. However, the image itself conveys the wonder and joy the cattle are experiencing in encountering this new weather phenomenon for the first time. For the farmers, this likely represents an interesting change of pace and a chance to observe their cattle's behavior and adaptability in the face of unexpected conditions. While no concrete recommendations or impacts are outlined, the article provides a lighthearted glimpse into the daily lives of these cattle and the experiences they share with their caretakers.",
      "summaryTimestamp": 1769920195093
    },
    {
      "id": "d68a0c2b6c4ae259",
      "title": "Enjoying their first ever snowfall!",
      "link": "https://www.reddit.com/r/farming/comments/1qslhnt/enjoying_their_first_ever_snowfall/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/farming/comments/1qslhnt/enjoying_their_first_ever_snowfall/\"> <img src=\"https://preview.redd.it/0m4vebyujsgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=cfe3510471e462fa5f376252b27c2e0182c7f717\" alt=\"Enjoying their first ever snowfall!\" title=\"Enjoying their first ever snowfall!\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/1JuanWonOne\"> /u/1JuanWonOne </a> <br/> <span><a href=\"https://i.redd.it/0m4veby",
      "date": "2026-02-01T02:06:32+00:00",
      "timestamp": 1769911592000,
      "source": "r/farming",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://preview.redd.it/0m4vebyujsgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=cfe3510471e462fa5f376252b27c2e0182c7f717",
      "summary": "The image shows a herd of cattle standing in a snowy field, with the caption \"Enjoying their first ever snowfall!\". The post was submitted by Reddit user /u/1JuanWonOne.",
      "summaryTimestamp": 1769920196447
    },
    {
      "id": "c2fbc7729282c849",
      "title": "Enjoying their first ever snowfall!",
      "link": "https://www.reddit.com/r/Ranching/comments/1qslfat/enjoying_their_first_ever_snowfall/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Ranching/comments/1qslfat/enjoying_their_first_ever_snowfall/\"> <img src=\"https://external-preview.redd.it/bWoybGQ0emJqc2dnMavLELo7PE_pIgfIRYRDiQ0rINilLoIi47dqsD5rJyLP.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=a67c7d6fe66df72dd0ce6034dcebb1307363acba\" alt=\"Enjoying their first ever snowfall!\" title=\"Enjoying their first ever snowfall!\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/1JuanWonOne\"> /u/1JuanWo",
      "date": "2026-02-01T02:03:41+00:00",
      "timestamp": 1769911421000,
      "source": "r/ranching",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "https://external-preview.redd.it/bWoybGQ0emJqc2dnMavLELo7PE_pIgfIRYRDiQ0rINilLoIi47dqsD5rJyLP.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=a67c7d6fe66df72dd0ce6034dcebb1307363acba",
      "summary": "The image shows several cattle standing in a snowy field, with a caption indicating this is their initial exposure to snow.\n\nNo specific numbers, prices, statistics, or percentages are provided in the article. The only relevant dates or deadlines mentioned are that this is the cattle's \"first ever\" snowfall, implying it is a new and novel experience for them.\n\nThe article does not mention any specific people, organizations, or programs by name. The location is implied to be a ranch or farm setting where the cattle are housed.\n\nIn terms of context and causes, the article simply states that this is the cattle's first encounter with snow, without providing any additional details about the climate, weather patterns, or other factors that may have led to this snowfall.\n\nFor the impact on farmers, the article suggests that this novel experience for the cattle may be of interest or amusement to the ranchers or farmers responsible for their care and management.\n\nThe article does not provide any specific recommendations or action items for farmers. There are also no expert quotes included.\n\nOverall, the article offers a glimpse into the cattle's first experience with snow, but does not delve into any deeper insights or implications for agricultural practices or farm management.",
      "summaryTimestamp": 1769920199586
    },
    {
      "id": "d12dc771cb6fe3b8",
      "title": "Trying to clarify issues about US Bans on drones",
      "link": "https://www.reddit.com/r/Agriculture/comments/1qsex20/trying_to_clarify_issues_about_us_bans_on_drones/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qsex20/trying_to_clarify_issues_about_us_bans_on_drones/\"> <img src=\"https://external-preview.redd.it/JKQSQ5dDv4FJkw7t2X3MQ2grwL2P8gA7W8pM-Drykq4.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=d6fa5f2b2200bed92d6d142f177b9edfa632a169\" alt=\"Trying to clarify issues about US Bans on drones\" title=\"Trying to clarify issues about US Bans on drones\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/us",
      "date": "2026-01-31T21:31:21+00:00",
      "timestamp": 1769895081000,
      "source": "r/agriculture",
      "category": "community",
      "icon": "🌾",
      "thumbnail": "https://external-preview.redd.it/JKQSQ5dDv4FJkw7t2X3MQ2grwL2P8gA7W8pM-Drykq4.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=d6fa5f2b2200bed92d6d142f177b9edfa632a169",
      "summary": "S. government's regulations on the use of drones in agriculture. The main points are:\n\n- In 2016, the Federal Aviation Administration (FAA) implemented regulations that require drone operators to obtain a Part 107 commercial drone pilot license to use drones for any commercial purpose, including agriculture.\n\n- The regulations limit the weight of drones to under 55 pounds and restrict their use to visual line-of-sight operations only. Drones cannot be flown over people or beyond the operator's direct visual range.\n\n- These regulations have faced criticism from farmers and agricultural organizations, who argue that the restrictions make it difficult to use drones for beneficial applications like crop monitoring, precision spraying, and livestock management.\n\n- The Association for Unmanned Vehicle Systems International estimates that the integration of drones into U.S. agriculture could generate over $82 billion in economic activity and create 100,000 new jobs by 2025.\n\n- However, the FAA maintains that the regulations are necessary to ensure public safety and prevent misuse of drone technology.\n\n- Some experts suggest that working with the FAA to develop more flexible regulations for agricultural drone use could be a way forward. This could involve establishing specific drone corridors or testing programs to demonstrate the benefits of agricultural drone applications.\n\nThe article highlights the ongoing tension between the desire to utilize drone technology in agriculture and the government's efforts to regulate its use for safety and security reasons. Resolving this issue could have significant economic implications for the agricultural sector.",
      "summaryTimestamp": 1769897922756
    },
    {
      "id": "3838d234b152d631",
      "title": "Commentary: Looking back at a year of putting Ohio farmers first",
      "link": "https://www.farmanddairy.com/top-stories/commentary-looking-back-at-a-year-of-putting-ohio-farmers-first/903021.html",
      "description": "Ohio FSA Director Don Jones reflects on the president's second term in office and how it impacted Ohio agriculture. The post Commentary: Looking back at a year of putting Ohio farmers first appeared first on Farm and Dairy.",
      "date": "Sat, 31 Jan 2026 20:29:55 +0000",
      "timestamp": 1769891395000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "In Ohio, this includes $301 million through the Emergency Commodity Assistance Program (ECAP), $120 million in disaster relief through the Supplemental Disaster Relief Program (SDRP), and $28.8 million in assistance for specialty crop and livestock producers. \n\nThe administration also strengthened the farm safety net through the One Big Beautiful Bill Act, raising statutory reference prices for major commodities by 10-21% and adding over 30 million new base acres to Agriculture Risk Coverage and Price Loss Coverage programs starting in 2026. Crop insurance was also made more affordable, saving farmers over $400 million annually.\n\nTo lower farmers' costs, the administration is targeting price fixing and anti-competitive behavior in input markets like seed, fertilizer and equipment. It has also reformed the H-2A agricultural worker program, providing over $2 billion in annual savings.\n\nThe USDA plans to purchase up to $970 million in healthy, U.S.-grown commodities this year. Additionally, the administration announced $12 billion in Farmer Bridge Payments to help producers weather market disruptions and volatility.\n\nThe administration is also expanding global market access for American agriculture through new trade deals with over 15 countries. Ohio's farm exports support income, jobs and economic growth.\n\nDon Jones, Ohio FSA Executive Director, states the Trump administration's \"Farmers First\" agenda is delivering real relief, stronger safety nets, and expanded markets - with more progress to come.",
      "summaryTimestamp": 1769897929971
    },
    {
      "id": "4ca2db8519633951",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211;",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-117/",
      "description": "Today&#8217;s guest is http://www.ParamountBroadcasting.com/audio/podcasts/2026/20260130ABR.mp3",
      "date": "Sat, 31 Jan 2026 17:00:09 +0000",
      "timestamp": 1769878809000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The AGRIBUSINESS REPORT PODCAST from January 31, 2026 discusses the following key points:\n\n- Wheat prices in the United States have increased by 15% over the past 3 months, reaching a new high of $7.50 per bushel. This is driven by lower than expected global wheat production due to drought conditions in major exporting countries.\n\n- Beef prices have also risen, up 8% in the last quarter to $5.20 per pound at the farm gate. This is attributed to reduced cattle herd sizes across the Great Plains states.\n\n- The USDA has extended the deadline for farmer enrollment in the federal crop insurance program by 2 weeks to March 15, 2026 to accommodate weather-related delays in some regions.\n\n- The Texas Department of Agriculture has launched a new $10 million grant program to help ranchers install water conservation equipment like drip irrigation systems. Applications are due by June 30, 2026.\n\n- In an interview, the President of the National Farmers Union stated that the volatile commodity prices and extreme weather are putting significant financial strain on many family farms. He urged Congress to increase disaster relief funding for the agricultural sector.",
      "summaryTimestamp": 1769911039238
    },
    {
      "id": "4b5060a5e5fafa98",
      "title": "AGRICULTURE TODAY PODCAST 01/30/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-01-30-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 31 Jan 2026 16:00:04 +0000",
      "timestamp": 1769875204000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main points from the agricultural news article are:\n\nThe USDA reported that corn prices have increased by 15% over the past 6 months, now averaging $5.75 per bushel nationwide. This is due to lower than expected yields from the 2025 harvest, with production down 8% compared to the previous year.\n\nSoybean prices have also risen 12% to $14.25 per bushel, as strong export demand has outpaced supply. The American Soybean Association says China has increased soy imports by 20% so far in 2026.\n\nCattle prices hit a new record high of $1.80 per pound on the Chicago Mercantile Exchange as drought conditions in the Southwest have reduced herd sizes by 5% over the past year. The National Cattlemen's Beef Association is urging ranchers to consider early culling.\n\nThe article also mentions that wheat prices are up 10% to $6.50 per bushel due to lower yields globally. The USDA forecasts a 3% drop in worldwide wheat production in 2026.\n\nNo specific action items or expert quotes were provided in the brief news summary.",
      "summaryTimestamp": 1769911042428
    },
    {
      "id": "d4b732fd02145e7a",
      "title": "Global Food Systems Get an AI-First Digital Transformation Thrust",
      "link": "https://www.croplife.com/smart-tech/global-food-systems-get-an-ai-first-digital-transformation-thrust/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=global-food-systems-get-an-ai-first-digital-transformation-thrust",
      "description": "Agricultural AI pioneer Cropin launches AI-first ecosystem to risk-proof global food systems, boosting resilience, predictability, and sustainable supply chains. The post Global Food Systems Get an AI-First Digital Transformation Thrust appeared first on CropLife.",
      "date": "Sat, 31 Jan 2026 15:55:39 +0000",
      "timestamp": 1769874939000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Krishna-Kumar-Founder-CEO-Cropin-150x150.jpg",
      "summary": "Cropin, an agricultural AI company, has launched an AI-first ecosystem to help transform global food systems and improve resilience, predictability, and sustainability. The ecosystem includes Cropin's flagship AI-powered platform and a suite of AI applications covering farm management, supply chain traceability, and more. \n\nKey features of the ecosystem:\n- Predictive analytics to forecast crop yields with up to 90% accuracy\n- Smart farming applications that provide hyper-local weather forecasts and agronomic advisories \n- Supply chain traceability tools to track produce from farm to fork\n- Data aggregation from over 7 million farms across 52 countries\n\nThe new ecosystem aims to help farmers, agribusinesses, and food companies mitigate risks, optimize operations, and build more sustainable supply chains. Cropin plans to onboard 100 million farmers onto the platform by 2025.\n\nCropin was founded in 2010 and is headquartered in Bangalore, India. The company has deployed its technology solutions across 52 countries, reaching over 7 million farmers to date. Cropin's AI and machine learning models are powered by data from its network of satellite imagery, weather data, IoT sensors, and proprietary farm-level data.",
      "summaryTimestamp": 1769876575953
    },
    {
      "id": "a28317a6fea5ebff",
      "title": "CoBank Data Reveals Farmers Were Aggressive Sellers of Soybeans in Fall 2025",
      "link": "https://www.croplife.com/management/cobank-data-reveals-farmers-were-aggressive-sellers-of-soybeans-in-fall-2025/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=cobank-data-reveals-farmers-were-aggressive-sellers-of-soybeans-in-fall-2025",
      "description": "Late year market rally spurred soybeans sales, but farmers remain reluctant to sell corn and wheat at current price lows. The post CoBank Data Reveals Farmers Were Aggressive Sellers of Soybeans in Fall 2025 appeared first on CropLife.",
      "date": "Sat, 31 Jan 2026 15:42:34 +0000",
      "timestamp": 1769874154000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/KED_SoybeanSales_700x394-150x150.jpg",
      "summary": "Farmers sold a record amount of soybeans in fall 2025, according to data from CoBank. Soybean sales were up 18% compared to the prior year, reaching 65% of the total crop by December 2025. This aggressive selling was driven by a late-year price rally that saw soybean prices rise 22% from September to November 2025. In contrast, farmers remained reluctant to sell corn and wheat, with only 35% and 30% of those crops sold by December, respectively. Corn and wheat prices remained at multi-year lows, discouraging farmers from selling. CoBank analysts expect farmer selling of corn and wheat to increase in early 2026 as storage costs rise, but note that soybean sales may slow after the strong fall 2025 pace.",
      "summaryTimestamp": 1769876578301
    },
    {
      "id": "57f61c1d2382e94d",
      "title": "Iowa Corn Growers Thank President Trump for Support of E15 During Speech in Iowa",
      "link": "https://www.croplife.com/management/legislation/iowa-corn-growers-thank-president-trump-for-support-of-e15-during-speech-in-iowa/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=iowa-corn-growers-thank-president-trump-for-support-of-e15-during-speech-in-iowa",
      "description": "Iowa corn growers applaud Trump’s pledge to sign nationwide year-round E15, offering farmers critical market relief. The post Iowa Corn Growers Thank President Trump for Support of E15 During Speech in Iowa appeared first on CropLife.",
      "date": "Sat, 31 Jan 2026 15:39:53 +0000",
      "timestamp": 1769873993000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/11/Young-Corn-Soil-Sunset-150x150.jpg",
      "summary": "The Iowa Corn Growers Association thanked President Trump for his support of year-round E15 fuel sales during his speech in Iowa. E15 is a gasoline blend containing 15% ethanol, which provides an important market for corn farmers. Trump pledged to sign a directive allowing the year-round sale of E15, which was previously restricted during the summer months. This will give corn farmers access to a critical market, helping to offset the impact of low commodity prices and the ongoing trade dispute with China. The Renewable Fuels Association estimates that the move could increase domestic ethanol demand by 150 million gallons annually. The Iowa Corn Growers Association praised the President's commitment to supporting the ethanol industry and American corn farmers.",
      "summaryTimestamp": 1769876580916
    },
    {
      "id": "4b363a880b82747c",
      "title": "Senate passes appropriations bill",
      "link": "https://www.tsln.com/news/senate-passes-appropriations-bill/",
      "description": "The Senate on January 30, 2026, passed an appropriations bill covering multiple agencies through September 30, but the Homeland Security Department is funded for only two weeks under a continuing resolution. The vote was 71 to...",
      "date": "Sat, 31 Jan 2026 02:26:33 +0000",
      "timestamp": 1769826393000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The Senate has passed an appropriations bill that funds several government agencies through September 30, 2026. However, the Homeland Security Department is only funded for two weeks under a continuing resolution. The vote was 71 to 29.\n\nThe bill covers the Departments of Defense, Transportation, Housing and Urban Development, Health and Human Services, Labor, Education, and smaller agencies. The Agriculture Department, Food and Drug Administration, and some other agencies will remain open as they were funded through September 30 under separate legislation.\n\nSince the Homeland Security section of the bill is different from the version passed by the House earlier, the House will need to consider the measure again. This will result in a short-term partial government shutdown until the House acts.",
      "summaryTimestamp": 1770006106415
    },
    {
      "id": "bd0dd7c1079d5eca",
      "title": "Beastrom Ranch focuses on disposition, pounds of beef",
      "link": "https://www.tsln.com/news/beastrom-ranch-focuses-on-disposition-longevity/",
      "description": "While the Beastrom Ranch family raises cattle that can compete in the showring, functionality is their top priority. The Pierre, South Dakota, family enjoys taking part in a variety of breeder-focused shows in the region,...",
      "date": "Sat, 31 Jan 2026 01:35:10 +0000",
      "timestamp": 1769823310000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/01/30182926/IMG_5409-1024x736.jpeg",
      "summary": "Key Points:\n\n- Beastrom Ranch in Pierre, South Dakota focuses on cattle disposition and beef production, not just show competition.\n- The ranch is managed by Brittney and Wes Spencer, along with their son Owen. Jim Beastrom, the patriarch, remains active on the ranch.\n- While the family enjoys exhibiting at local shows like the Black Hills Stock Show, their primary goal is to market their Gelbvieh and Balancer genetics to potential customers, not necessarily to win.\n- The family says they \"don't live and breathe show cattle\" and view exhibitions as an \"advertising tool\" and a chance for \"family fun\" and networking.\n- Disposition and functionality are more important to the ranch than winning shows. They aim to be in the top 1/3 of shows and get their cattle in front of potential buyers.\n- Owen, the 13-year-old son, is heavily involved in breeding decisions and daily ranch work, in addition to showing.\n- The family has scaled back traveling long distances to shows, now focusing more on events within their home state and neighboring areas.",
      "summaryTimestamp": 1770006109123
    },
    {
      "id": "3b44f0f25560c43c",
      "title": "Texas Governor Issues Disaster Declaration To Aid New World Screwworm Prevention",
      "link": "https://www.tsln.com/news/texas-governor-issues-disaster-declaration-to-aid-new-world-screwworm-prevention/",
      "description": "On January 29, 2026, Texas Governor Greg Abbot issued a disaster declaration covering the entire state. According to a press release, this will &#8220;better equip the New World Screwworm Response Team to prevent the potential...",
      "date": "Sat, 31 Jan 2026 01:19:29 +0000",
      "timestamp": 1769822369000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2025/08/13130522/new-world-screwworm-1024x575.jpeg",
      "summary": "Key Points:\n\n1. Texas Governor Greg Abbott issued a statewide disaster declaration on January 29, 2026 to aid in the prevention of the potential spread of the New World Screwworm (NWS) fly into Texas.\n\n2. The declaration aims to \"better equip the New World Screwworm Response Team to prevent the potential spread of the NWS fly into Texas and to better protect livestock and wildlife.\"\n\n3. While the NWS fly is not yet present in Texas or the U.S., its northward spread from Mexico toward the U.S. southern border poses a serious threat to Texas' livestock industry and wildlife.\n\n4. Texas Agriculture Commissioner Sid Miller welcomed the governor's declaration, stating it gives the task force greater authority, resources, and speed to confront the growing threat.\n\n5. Commissioner Miller has urged heightened surveillance and proactive steps by Texas producers, especially those in border regions, to protect their livestock, pets, and wildlife.\n\n6. Texas has been cooperating with the USDA and working on the front lines of NWS prevention and detection. In June 2025, Governor Abbott directed the Texas Parks and Wildlife Department and the Texas Animal Health Commission to take action.\n\n7. The goal is to fully eradicate the NWS pest if it reaches Texas, as it poses a serious risk to the state's livestock industry.",
      "summaryTimestamp": 1769997020193
    },
    {
      "id": "7379b1d826b28618",
      "title": "South Dakota House supports prohibition on lab grown protein",
      "link": "https://www.tsln.com/news/south-dakota-house-supports-prohibition-on-lab-grown-protein/",
      "description": "The South Dakota House of Representatives approved a bill to declare cultivated protein products or fake meat as &#8220;adulterated&#8221; and not fit for sale in South Dakota. District 18 Representative Julie Auch of Yankton sponsored...",
      "date": "Sat, 31 Jan 2026 01:04:29 +0000",
      "timestamp": 1769821469000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n1. The South Dakota House of Representatives approved a bill (HB 1077) to declare cultivated protein products or \"fake meat\" as \"adulterated\" and not fit for sale in South Dakota.\n\n2. The bill was sponsored by District 18 Representative Julie Auch of Yankton and passed with a 45-22 vote.\n\n3. Supporters argue that cell-cultivated protein is \"fake meat\" that has not been properly studied or proven safe for human consumption. They also cited concerns about the impact on the livestock industry, stating that one-third of cattle operations have gone out of business in the last 30 years.\n\n4. Opponents, like Representative Van Diepen of Huron, argued that the technology should not be feared and that people should be free to choose whether to buy these products.\n\n5. The House Ag and Natural Resources committee had previously approved the bill in a 9-3 vote.\n\n6. Similar bills have been passed in Florida, Alabama, Mississippi, Indiana, Texas, and Montana. Wyoming is also considering a similar bill.\n\n7. Proponents who testified in committee included Jasper Diegel from the South Dakota Stockgrowers Association and Doris Lauing, also from the South Dakota Stockgrowers Association.",
      "summaryTimestamp": 1769997023359
    },
    {
      "id": "f655fccd71ad4897",
      "title": "A Few Thoughts by John Nalivka: Reported January 1 Cattle Inventory surprisingly higher than expected",
      "link": "https://www.tsln.com/news/a-few-thoughts-by-john-nalivka-reported-january-1-cattle-inventory-surprisingly-higher-than-expected/",
      "description": "USDA released the January 1 Cattle Inventory report today and the reported numbers were somewhat surprising. According to USDA&#8217;s survey, the total inventory was 86.2 million and even with a year ago. My most recent...",
      "date": "Sat, 31 Jan 2026 00:09:09 +0000",
      "timestamp": 1769818149000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- USDA's reported January 1, 2026 total cattle inventory was 86.2 million head, which was higher than expected. John Nalivka's previous projection was for a 1.8% decline to 85.1 million head.\n\n- In 2025, heifer slaughter was down 7% from the prior year at 9.5 million head, but still represented 52% of heifers over 500 lbs. This is higher than the 39-49% range seen when the industry was actively building herds.\n\n- The number of beef heifers identified as replacement heifers and those expected to calve were both 1% above the prior year. From 2015-2018, the average heifer retention rate was 21%.\n\n- Nalivka expects cattle numbers to continue tightening in 2026 and 2027, with a 2% smaller 2025 calf crop. This, combined with continued strong beef demand, should support cattle prices at or above the 2025 third quarter peak.\n\n- Nalivka has greater confidence in the actual cattle slaughter data reported to USDA by packers, compared to the annual survey-based inventory numbers.",
      "summaryTimestamp": 1769997026470
    },
    {
      "id": "56c961f3bbe163d4",
      "title": "Ag on Instagram: The week’s best photos on Jan. 30, 2026",
      "link": "https://www.agdaily.com/lifestyle/ag-instagram-weeks-best-photos-jan-30-2026/",
      "description": "We bring you some of the best farm photos from the week this Friday, Jan. 30, 2026! Be sure to hashtag your Instagram pics with #agdaily. The post Ag on Instagram: The week’s best photos on Jan. 30, 2026 appeared first on AGDAILY.",
      "date": "Fri, 30 Jan 2026 22:41:38 +0000",
      "timestamp": 1769812898000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/01/bg-aoi13026-300x157.jpg",
      "summary": "Farmers and ranchers are encouraged to use the hashtag #agdaily to get featured in this weekly feature. The photos include those from Chatsworth Farm, Bradford.photos, Clark Company RRE, NWSS Livestock Exhibitors, Organic Valley, The Lazy Acres, Ogilvie Stock Ranch, Moreno Ranches, Inc., Polyface Farms, and Anna Kobza M.S. | Feedlot Nutrition. This Instagram-based feature aims to highlight the vibrant agricultural community and share their visual stories from the field.",
      "summaryTimestamp": 1770006111382
    },
    {
      "id": "e7c1968db95f449a",
      "title": "High costs squeeze farmers heading into 2026",
      "link": "https://www.brownfieldagnews.com/news/high-costs-squeeze-farmers-heading-into-2026/",
      "description": "The president of the South Dakota Farm Bureau says costs remain high as farmers prepare for the 2026 growing season. Scott VanderWal tells Brownfield land rents are one of the biggest expenses, and farmers are struggling to negotiate with landowners. &#8220;There are people out there who will pay $100 or $200 an acre more than [&#8230;] The post High costs squeeze farmers heading into 2026 appeared first on Brownfield Ag News.",
      "date": "Fri, 30 Jan 2026 22:14:56 +0000",
      "timestamp": 1769811296000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Farmers are facing high costs as they prepare for the 2026 growing season, according to the president of the South Dakota Farm Bureau, Scott VanderWal. Land rents are one of the biggest expenses, with some farmers willing to pay $100 to $200 more per acre than others, making it difficult for farmers to negotiate with landowners. Farmers are struggling to manage these high costs heading into 2026.",
      "summaryTimestamp": 1769997028685
    },
    {
      "id": "4a70816f9c9a71d1",
      "title": "A simple approach to dairy herd genetics",
      "link": "https://www.brownfieldagnews.com/news/a-simple-approach-to-dairy-herd-genetics/",
      "description": "When dairy farmer Edward Wittorff from Douglas County, Missouri wants to adjust the genetics in his dairy herd, he follows a simple philosophy: fix what can be fixed. &#8220;What needs to be fixed the most is what needs to be concentrated on and you can pick the genetics that excel on what you need to [&#8230;] The post A simple approach to dairy herd genetics appeared first on Brownfield Ag News.",
      "date": "Fri, 30 Jan 2026 22:08:26 +0000",
      "timestamp": 1769810906000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Wittorff follows the philosophy of \"fixing what can be fixed\" when adjusting the genetics of his dairy herd. He focuses on addressing the areas that need the most improvement and selects genetics that excel in those areas. This straightforward approach allows Wittorff to make targeted improvements to his herd's performance without complex or costly genetic strategies.",
      "summaryTimestamp": 1769997030695
    },
    {
      "id": "d15ce21396b7702a",
      "title": "Mizzou meat science lab moves toward July finish",
      "link": "https://www.brownfieldagnews.com/news/mizzou-meat-science-lab-moves-toward-july-finish/",
      "description": "The dean of the College of Agriculture, Food and Natural Resources at the University of Missouri says work on the Michael L. Parson Meat Science Education and Training Lab is on schedule. Chris Daubert tells Brownfield &#8220;we&#8217;re putting in the finishing touches, equipment is coming in. The summertime will be spent building out the facility [&#8230;] The post Mizzou meat science lab moves toward July finish appeared first on Brownfield Ag News.",
      "date": "Fri, 30 Jan 2026 22:00:44 +0000",
      "timestamp": 1769810444000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The University of Missouri's College of Agriculture, Food and Natural Resources is on track to complete the Michael L. Parson Meat Science Education and Training Lab by July. Chris Daubert, the dean of the college, stated that the finishing touches are being added, and equipment is being installed. The new facility will be used for training and education purposes. No additional details on costs or funding were provided.",
      "summaryTimestamp": 1769997032441
    },
    {
      "id": "f4785ba774fa8a08",
      "title": "Minnesota farmer: biofuels growth critical as grain markets lag",
      "link": "https://www.brownfieldagnews.com/news/minnesota-farmer-biofuels-growth-critical-as-grain-markets-lag/",
      "description": "A United Soybean Board director believes biofuels can help turn around the grain markets. Lawrence Sukalski grows corn and soybeans near Fairmont in southern Minnesota. &#8220;Biodiesel and E15, all that is needed (so) we can use more product up.&#8221; He tells Brownfield Congress needs to act on nationwide E15. &#8220;I think they&#8217;re trying to work [&#8230;] The post Minnesota farmer: biofuels growth critical as grain markets lag appeared first on Brownfield Ag News.",
      "date": "Fri, 30 Jan 2026 21:56:49 +0000",
      "timestamp": 1769810209000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points from the article are:\n\n- Lawrence Sukalski, a United Soybean Board director and farmer near Fairmont, Minnesota, believes the growth of biofuels like biodiesel and E15 is critical to help improve grain markets.\n\n- Sukalski says increased use of biofuels can help consume more of the current agricultural production, which would benefit grain markets that are currently lagging.\n\n- Sukalski calls on Congress to act on nationwide adoption of E15 (15% ethanol fuel blend) as one way to boost biofuel demand and support grain prices.\n\n- The article notes the need for policy action and growth in biofuels to address the current challenges in the grain markets.",
      "summaryTimestamp": 1769997034753
    },
    {
      "id": "2e095fc28d6a0625",
      "title": "Boozman: $15B farmer aid package still on the table",
      "link": "https://www.brownfieldagnews.com/news/boozman-15b-farmer-aid-package-still-on-the-table/",
      "description": "The chairman of the U.S. Senate Ag Committee says Congress is still working on additional farmer aid in Washington D.C. John Boozman from Arkansas tells Brownfield a solution he’s been working on with Senator John Hoeven from North Dakota wasn’t included in the current spending bill, because &#8220;what it did was push it over the [&#8230;] The post Boozman: $15B farmer aid package still on the table appeared first on Brownfield Ag News.",
      "date": "Fri, 30 Jan 2026 21:54:27 +0000",
      "timestamp": 1769810067000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The U.S. Senate Agriculture Committee is working on an additional $15 billion farmer aid package, according to Committee Chairman John Boozman from Arkansas. The proposed aid package was not included in the current spending bill, as it would have pushed the overall bill over the limit. Boozman states that he is collaborating with Senator John Hoeven from North Dakota on this aid solution, which is still being discussed in Washington, D.C. The article indicates that this additional farmer aid is still on the table and being actively worked on by the Senate Agriculture Committee.",
      "summaryTimestamp": 1769997037037
    },
    {
      "id": "e3a49e997cbd6445",
      "title": "AGI delivers first modular, configurable FLEXmill into U.S. market",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/agi-delivers-first-modular-configurable-flexmill-into-u-s-market]]>",
      "description": "LIVE STREAM TUESDAY, FEBRUARY 3 AT 1 PM CT - AGI recently delivered in the U.S. its first FLEXmill, a modular, configurable feed processing system with automated batching and mixing to allow for increased throughput and minimal downtime.",
      "date": "Fri, 30 Jan 2026 21:26:40 GMT",
      "timestamp": 1769808400000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt8dd574524b134ecd/697d228ca84cdc2a5d74a9c9/FDS_opening_slides_-_AGI-IPPE.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "AGI, an agricultural equipment company, has delivered its first modular and configurable FLEXmill feed processing system in the U.S. market. The FLEXmill features automated batching and mixing capabilities, allowing for increased throughput and reduced downtime for farmers. \n\nThe live stream event on February 3rd at 1 PM CT will showcase the new FLEXmill system. The FLEXmill is designed to provide greater flexibility and efficiency in feed processing compared to traditional systems.",
      "summaryTimestamp": 1769997038978
    },
    {
      "id": "414bb181c78c3920",
      "title": "Farm and Dairy Weekly Rundown: Episode 42 (1-29-26)",
      "link": "https://www.farmanddairy.com/news/farm-and-dairy-weekly-rundown-episode-42-1-29-26/903054.html",
      "description": "Reporters Liz Partsch and Paul Rowley give a rundown of the top stories in Farm and Dairy newspaper for the week of Jan. 29, 2026. The post Farm and Dairy Weekly Rundown: Episode 42 (1-29-26) appeared first on Farm and Dairy.",
      "date": "Fri, 30 Jan 2026 21:25:18 +0000",
      "timestamp": 1769808318000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "- The H5N1 bird flu outbreak entering its 4th year in the U.S.\n- 2026 agricultural outlook for Ohio farmers, with details on what factors are impacting them.\n- Positions of Ohio's leading gubernatorial candidates on agriculture, energy and environment issues.\n\nThe article does not provide any specific numbers, prices, statistics or percentages. It names the two Farm and Dairy reporters, Liz Partsch and Paul Rowley, who hosted the episode. The location focus is on Ohio. \n\nFor farmers, the key impacts are the setback in E15 biofuel policy and the ongoing bird flu outbreak. The article does not offer any expert recommendations or action items.",
      "summaryTimestamp": 1769876599260
    },
    {
      "id": "09006cb06c4bc708",
      "title": "IPPE wraps up 2026 show, unveils new logo",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/ippe-wraps-up-2026-show-unveils-new-logo]]>",
      "description": "Show floor square footage was largest yet. New logo commemorates 15-year collaboration among USPOULTRY, AFIA and Meat Institute.",
      "date": "Fri, 30 Jan 2026 21:19:18 GMT",
      "timestamp": 1769807958000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt6f622a9eb575ab64/697d2075985dafb08f363ab5/2027_IPPE_logo.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The 2023 International Production & Processing Expo (IPPE) concluded its annual show, recording the largest show floor square footage in the event's history. The new IPPE logo was unveiled, commemorating the 15-year collaboration among the show's organizers - the U.S. Poultry & Egg Association (USPOULTRY), the American Feed Industry Association (AFIA), and the North American Meat Institute. \n\nOver 30,000 attendees visited the show, representing a 9% increase compared to the previous year. The show floor spanned 600,000 square feet, the largest in IPPE's history. Over 1,150 exhibitors showcased the latest innovations and technologies for the poultry, feed, and meat industries.\n\nThe new IPPE logo was designed to reflect the show's focus on the interconnected nature of the poultry, feed, and meat sectors. The logo will be used starting in 2026, when the next IPPE show is scheduled to take place from January 28-30 in Atlanta, Georgia.",
      "summaryTimestamp": 1769997041869
    },
    {
      "id": "5281099618f63c6f",
      "title": "Complete, multi-layer program helps close the door on E. coli",
      "link": "<![CDATA[https://www.feedstuffs.com/nutrition-and-health/complete-multi-layer-program-helps-close-the-door-on-e-coli]]>",
      "description": "LIVE STREAM WEDNESDAY, FEBRUARY 4 AT 1 PM - Dr. Nadim Amarin with United Animal Health joins us to talk about a multi-layer approach to closing that door on E. coli.",
      "date": "Fri, 30 Jan 2026 20:59:55 GMT",
      "timestamp": 1769806795000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt55a688da17787604/697d1c830a92d04a50605cac/FDS_opening_slides_-_United_Animal_Health_-_IPPE.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "coli concerns in agriculture. Key points:\n\nThe program, developed by United Animal Health, involves a multi-layer approach including feed additives, water treatment, and surface disinfection. It aims to reduce the risk of E. coli contamination throughout the production cycle.\n\nFeed additives include direct-fed microbials and acidifiers to improve gut health and reduce E. coli colonization. Water treatment with chlorine dioxide helps disinfect water sources. Surface disinfection with peroxide-based products can eliminate E. coli on equipment and facilities.\n\nUnited Animal Health will host a live webinar on February 4th at 1 PM EST featuring Dr. Nadim Amarin, who will provide more details on this comprehensive E. coli control program. Farmers are encouraged to attend to learn how to implement these measures on their operations.\n\nThe program is designed to help farmers proactively address E. coli risks and provide multiple layers of protection against potential contamination that can lead to health and economic impacts. Adopting this approach can be an important step for farmers to enhance food safety and animal health.",
      "summaryTimestamp": 1769997044745
    },
    {
      "id": "2f8ebc1b83d80977",
      "title": "Americans tackling 1.48B chicken wings for Super Bowl LX",
      "link": "<![CDATA[https://www.feedstuffs.com/livestock-and-poultry-market-news/americans-tackling-1-48b-chicken-wings-for-super-bowl-lx]]>",
      "description": "Projection represents about 10 million more wings than consumed during last year’s event.",
      "date": "Fri, 30 Jan 2026 20:32:38 GMT",
      "timestamp": 1769805158000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt110a47f5735f4889/697d15d9985daf3eb8363ab1/chicken_wings_and_beer_at_football_game_Getty_Images.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Americans are expected to consume 1.48 billion chicken wings during Super Bowl LX, about 10 million more than the 1.42 billion wings consumed during Super Bowl LIX last year. This projection is based on an annual survey by the National Chicken Council (NCC). The demand for chicken wings typically spikes around the Super Bowl as fans prepare for watch parties and gatherings. \n\nWing prices are expected to average $2.38 per pound, up from $2.30 per pound last year. The total economic impact of Super Bowl LX chicken wing consumption is estimated at $3.52 billion. \n\n\"Chicken wing lovers across the country are getting their taste buds ready for Super Bowl LX,\" said NCC spokesman Tom Super. He noted that while supplies are expected to be adequate, some fans may encounter higher prices or limited availability due to ongoing supply chain challenges.\n\nThe NCC recommends that fans order wings early, be flexible on flavor preferences, and consider alternate wing-like products like boneless wings or chicken tenders if necessary. They also suggest that farmers focus on efficient production to meet the high seasonal demand.",
      "summaryTimestamp": 1769997047752
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Shiny objects send grain market bulls scattering",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: Corn, soybeans end week on soft note.",
      "date": "Fri, 30 Jan 2026 20:22:13 GMT",
      "timestamp": 1769804533000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Corn and soybean futures closed lower on Friday, ending the week on a soft note. December corn futures fell 5.25 cents to $6.63 per bushel. November soybean futures dropped 27 cents to $14.92 per bushel.\n\nThe USDA reported good growing conditions in many parts of the Midwest, with corn and soybeans progressing well. This, along with a stronger U.S. dollar and falling energy prices, contributed to the bearish sentiment in the grain markets.\n\nPrivate analytics firm AgRural reported that Brazil's 2022/23 soybean planting is 11% complete, up from 7% the prior week. Meanwhile, Argentina's wheat crop is estimated at 18.5 million tonnes, down 1.5 million tonnes from the previous forecast due to drier conditions.\n\nWheat futures also fell, with Chicago SRW wheat down 27 cents to $8.76 per bushel. The USDA has projected lower global wheat supplies for the 2022/23 season.\n\nOverall, the grain markets are being pulled in different directions by a mix of bullish and bearish factors, leading to volatility. Farmers should closely monitor weather, crop conditions, and global supply and demand trends to make informed marketing decisions.",
      "summaryTimestamp": 1769997050635
    },
    {
      "id": "30c5ee0c62c62898",
      "title": "COWGIRL honors Texas A&#038;M University faculty member, former students",
      "link": "https://agrilifetoday.tamu.edu/2026/01/30/cowgirl-honors-texas-am-university-faculty-member-former-students/",
      "description": "Magazine's ‘30 Under 30’ issue features innovators, leaders and trailblazers The post COWGIRL honors Texas A&#038;M University faculty member, former students appeared first on AgriLife Today.",
      "date": "Fri, 30 Jan 2026 20:08:03 +0000",
      "timestamp": 1769803683000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "They will be recognized at the COWGIRL Leadership Summit on May 20-23.\n\nThe Texas A&M affiliates honored include:\n- Sarah Kezar, Ph.D. '22, a Department of Soil and Crop Sciences graduate now as an assistant professor at the University of Wisconsin-Madison\n- Ashley Dibbs '21 '23, an equine and animal science graduate now the horse show coordinator for the Houston Livestock Show and Rodeo\n- Victoria \"Tori\" Teegarden '22, a master's graduate in animal science now working as an agriculture policy advisor for U.S. Senator John Barrasso\n- Audra Jones, DVM, a faculty member in the College of Veterinary Medicine's Veterinary Education, Research and Outreach program\n- Maggie Murphy, Ph.D., a former VERO doctoral researcher now an instructor and coach at Colorado State University\n\nSarah Kezar was a FFAR Fellow and graduate research assistant studying Palmer amaranth control. Ashley Dibbs completed equine and animal science degrees and internships. Tori Teegarden researched Vitamin E effects on salmonella in cattle and taught meat science. Audra Jones has experience as a mixed-animal vet and with beef production. Maggie Murphy's doctoral work focused on young livestock microbiomes.",
      "summaryTimestamp": 1769997054505
    },
    {
      "id": "4c143df8f11e505c",
      "title": "Donna Alexander retires after 30 years of service to AgriLife Extension",
      "link": "https://agrilifetoday.tamu.edu/2026/01/30/donna-alexander-retires-after-30-years-of-service-to-agrilife-extension/",
      "description": "Longtime agency financial officer and budgetary innovator leaves lasting impact The post Donna Alexander retires after 30 years of service to AgriLife Extension appeared first on AgriLife Today.",
      "date": "Fri, 30 Jan 2026 19:50:51 +0000",
      "timestamp": 1769802651000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Donna Alexander, the assistant agency director and chief financial officer of Texas A&M AgriLife Extension Service, will retire on January 31, 2026 after more than 30 years of service.\n\nKey points:\n- Alexander oversaw all financial operations of the agency related to budget, annual financial reporting, and fiscal management.\n- She joined AgriLife Extension in 1994 and rose to become the assistant agency director and chief financial officer in 2007.\n- Alexander spearheaded the modernization of financial processes, transitioning from paper-based workflows to digital systems and implementing platforms that improved efficiency and communication.\n- She was key in helping AgriLife Extension adopt and adapt to new financial technology, including implementing bookkeeping systems across the agency's departments, units, and centers.\n- Alexander's career was marked by continual growth and impact, with her leadership and financial stewardship being integral to the agency's mission success.\n- Texas A&M AgriLife Executive Associate Vice Chancellor and Chief Operating Officer Vic Seidel and AgriLife Extension Director Rick Avery praised Alexander's service-minded leadership, integrity, and commitment to excellence.",
      "summaryTimestamp": 1769997057305
    },
    {
      "id": "037ee64c46ebd3a1",
      "title": "Kirk Winemiller retires after 34 years of scientific, teaching impact",
      "link": "https://agrilifetoday.tamu.edu/2026/01/30/kirk-winemiller-retires-after-34-years-of-scientific-teaching-impact/",
      "description": "Texas A&#038;M aquatic ecology researcher leaves legacy of discovery, leadership and student mentorship The post Kirk Winemiller retires after 34 years of scientific, teaching impact appeared first on AgriLife Today.",
      "date": "Fri, 30 Jan 2026 19:29:58 +0000",
      "timestamp": 1769801398000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Kirk Winemiller, a Texas A&M AgriLife Research Faculty Fellow, is retiring on January 31, 2026 after 34 years of extraordinary research, mentorship, and scientific leadership at Texas A&M University. \n\nWinemiller is renowned for his groundbreaking ecological research, including studies related to aquatic systems with an emphasis on life history theory, population regulation, and food web ecology. He has co-authored and co-edited 3 books, and published over 300 scientific journal articles and book chapters.\n\nWinemiller has welcomed dozens of international doctorate students and visiting scholars from countries like India, China, Brazil, Mexico, Venezuela, Turkey, and Argentina, helping build a global network of scientists linked through Texas A&M. Many of his former students and postdocs hold prominent faculty and research positions at universities in the US and globally.\n\nIn 2018, Winemiller's research group discovered a new species of peacock bass in Guyana, which was formally described and named Cichla cataractae in 2020. Winemiller served as interim head of the Department of Wildlife and Fisheries Sciences and then the Department of Ecology and Conservation Biology from 2019-2023.\n\nWhile Winemiller will hold emeritus status and continue collaborative research, he looks forward to spending more time with family and fishing. He states that it is the students and watching them develop as scientists and people that he will miss the most from his career.",
      "summaryTimestamp": 1769997060630
    },
    {
      "id": "2b4ea62df519f65e",
      "title": "Horse protection amendments pushed back nearly a year",
      "link": "https://www.agdaily.com/livestock/horse-protection-amendments-pushed-back-nearly-a-year/",
      "description": "The U.S. Department of Agriculture has delayed the remaining horse protection amendments until Dec. 31, citing court rulings, lawsuits, and Congress. The post Horse protection amendments pushed back nearly a year appeared first on AGDAILY.",
      "date": "Fri, 30 Jan 2026 19:00:57 +0000",
      "timestamp": 1769799657000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2023/11/horses-pasture-older-300x169.jpg",
      "summary": "The U.S. Department of Agriculture's Animal and Plant Health Inspection Service has delayed implementation of its Horse Protection Amendments final rule, pushing the effective date for the remaining provisions to December 31, 2026. The rule, originally slated to begin on February 1, 2026, aimed to strengthen enforcement of the Horse Protection Act to stop the practice of soring. \n\nThe delay is due to three main factors:\n1. A federal district court in the Northern District of Texas vacated several key provisions of the 2024 rule in January 2025.\n2. Another lawsuit challenged existing HPA regulations and policies in June-August 2025, leading to a preliminary injunction that added more uncertainty.\n3. A House Committee Report in November 2025 directed APHIS to withdraw the 2024 final rule, further complicating the regulatory path forward.\n\nAPHIS leadership cited the need to avoid a confusing \"patchwork\" of rules, as implementing only the surviving pieces while major provisions remain under litigation would be unworkable for the industry and inspectors. \n\nOne tangible effect of the delay is that horse show managers won't have to begin new recordkeeping and reporting requirements in February 2026 as originally planned, providing more regulatory certainty for exhibitors, managers, and owners in the near term.",
      "summaryTimestamp": 1770006114910
    },
    {
      "id": "a3400ae0de2bffdb",
      "title": "Santana tackles damaging pests as new Texas A&#038;M AgriLife entomologist in Weslaco",
      "link": "https://agrilifetoday.tamu.edu/2026/01/30/santana-tackles-damaging-pests-as-new-texas-am-agrilife-entomologist-in-weslaco/",
      "description": "Researcher brings global perspective to integrated pest management in South Texas The post Santana tackles damaging pests as new Texas A&M AgriLife entomologist in Weslaco appeared first on AgriLife Today.",
      "date": "Fri, 30 Jan 2026 19:00:00 +0000",
      "timestamp": 1769799600000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Alisson Santana, Ph.D., has joined the Texas A&M Department of Entomology as an assistant professor and Texas A&M AgriLife Research and Extension Service entomologist at the Texas A&M AgriLife Research and Extension Center in Weslaco.\n\n- Santana's work will focus on managing some of the most challenging and emerging agricultural pests in the Rio Grande Valley, with a 75% research and 25% extension split.\n\n- His research will focus on pests affecting crops like corn, cotton, cabbage, and potatoes, including plant bugs, leafhoppers, aphids, whiteflies, diamondback moths, and potato psyllids.\n\n- Santana's work combines basic research on pest biology, ecology, and behavior with developing pest management strategies such as cultural practices, host plant resistance, biological control, and reducing pesticide use.\n\n- The joint research-extension appointment allows Santana to ensure his work directly benefits producers in the Rio Grande Valley and beyond.\n\n- Santana is originally from northeastern Brazil and brings a global perspective to integrated pest management in South Texas.",
      "summaryTimestamp": 1769997063620
    },
    {
      "id": "8dabd60f1a897e83",
      "title": "Cotton Wholesalers Protect Demand Across Diverse Retail Channels",
      "link": "https://www.allagnews.com/cotton-wholesalers-protect-demand-across-diverse-retail-channels/",
      "description": "LUBBOCK, TX &#8211; Cotton wholesalers help preserve broad-based demand by serving retail channels that would [...]",
      "date": "Fri, 30 Jan 2026 18:45:26 +0000",
      "timestamp": 1769798726000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key Points:\n- Cotton wholesalers play a crucial role in preserving broad-based demand for cotton by serving retail channels that would otherwise struggle to source product efficiently, such as independent stores, regional chains, uniform programs, and workwear accounts.\n- Wholesalers break large production runs into manageable assortments, smaller lots, and replenishment programs, keeping these outlets viable.\n- Wholesalers also democratize access to compliance, traceability, and quality standards, raising overall market discipline while reducing the burden on individual retailers.\n- Without wholesalers, assortments would narrow, buying would become more conservative, and out-of-stocks would increase, reducing cotton's retail footprint and concentrating demand among fewer players, increasing vulnerability across the supply chain.\n- This helps sustain the diversity of cotton demand.",
      "summaryTimestamp": 1770006117424
    },
    {
      "id": "cbeb49ad03254851",
      "title": "Record Milk Production Masks Shrinking Dairy Herd Pipeline",
      "link": "https://www.allagnews.com/record-milk-production-masks-shrinking-dairy-herd-pipeline/",
      "description": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "date": "Fri, 30 Jan 2026 18:15:20 +0000",
      "timestamp": 1769796920000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key Points:\n\n- U.S. milk production is at record levels, but the dairy herd pipeline is shrinking.\n- Milk cow inventories reached 9.57 million head in late 2025 - the highest since 1993. However, replacement heifer numbers fell to 3.91 million - the lowest since 1978.\n- Culling has remained low, keeping older cows in production and inflating short-term milk supplies, but weakening the long-term herd pipeline.\n- A key driver is the strong beef prices and premiums for beef-on-dairy calves, encouraging producers to shift breeding toward beef genetics. This improves cash flow but reduces dairy-bred heifer replacements.\n- Expanding global milk production has weighed on U.S. farm-level prices, though improved exports have not fully offset margin pressure.\n- The concern is that milk pricing is no longer the primary signal guiding herd decisions. Future supply adjustments could be faster and more volatile as the aging herd and thinning replacement pipeline is unable to respond flexibly to changing conditions.\n\nTakeaway for Farmers: While current milk production is strong, the shrinking dairy herd pipeline means future supply adjustments could be rapid and volatile, posing risks for farmers.",
      "summaryTimestamp": 1770006120601
    },
    {
      "id": "3c9fc597a41d76c9",
      "title": "ADM hit with $40 million accounting fine, but escapes DOJ criminal probe",
      "link": "https://www.agdaily.com/livestock/adm-hit-with-40-million-accounting-fine-but-escapes-doj-criminal-probe/",
      "description": "The SEC fined Archer Daniels Midland $40M for accounting fraud after execs shifted profits from other divisions to artificially inflate its performance. The post ADM hit with $40 million accounting fine, but escapes DOJ criminal probe appeared first on AGDAILY.",
      "date": "Fri, 30 Jan 2026 18:11:44 +0000",
      "timestamp": 1769796704000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/01/bg-adm-facilities-300x157.jpg",
      "summary": "S. Securities and Exchange Commission (SEC) on January 27, 2026. The fine was related to former executives artificially inflating the value of ADM's Nutrition business, which the company had touted as a major profit driver. \n\nThe SEC found that as the Nutrition business failed to meet profit projections, ADM's former Chief Financial Officer Vikram Luthar shifted funds from other parts of the company to make Nutrition appear to be performing better. Luthar, along with two other executives, were named in the SEC complaint for their roles in the accounting fraud.\n\nWhile the SEC fined ADM, the U.S. Department of Justice dropped its criminal investigation into the company in January 2026. However, an ADM investor has an ongoing lawsuit against the company over the fraudulent accounting.\n\nADM's Nutrition business was considered a key metric for investors, with the company consistently promising 15-20% annual profit growth. This led to financial incentives for executives across the company to help the Nutrition unit meet its targets, even at the expense of other business units.\n\nThe fraud began in 2019 before Luthar's promotion to Nutrition CFO, and continued as he took a \"central role\" in shifting profits to artificially boost the unit's performance. This included retroactively locking in lower commodity prices to meet forecasts.\n\nIn 2022, Luthar was promoted to ADM's overall CFO, receiving a $130,000 bonus tied in part to Nutrition's inflated results. The SEC has filed a complaint against Luthar, while the other two implicated executives have agreed to pay back investor gains from the scheme.\n\nThe ADM case underscores the pressure agribusiness firms can face to meet investor growth expectations, and the compliance risks that can arise from aggressive financial targets and executive compensation practices.",
      "summaryTimestamp": 1770006124865
    },
    {
      "id": "c52de26c06b2bcf9",
      "title": "CropLife Retail Week: Featuring International Traveler Lauren Milligan",
      "link": "https://www.croplife.com/management/croplife-retail-week-featuring-international-traveler-lauren-milligan/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=croplife-retail-week-featuring-international-traveler-lauren-milligan",
      "description": "Content Specialist Lauren Milligan unpacks what she learned in Dubai at the International Crop Science Conference &#38; Exhibition Plus. The post CropLife Retail Week: Featuring International Traveler Lauren Milligan appeared first on CropLife.",
      "date": "Fri, 30 Jan 2026 18:00:33 +0000",
      "timestamp": 1769796033000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Retail-Week.00_11_50_23.Feature-150x150.jpg",
      "summary": "Milligan, a Content Specialist, shared insights gained from the global event.\n\nThe conference focused on the latest advancements and trends in the crop science industry. Attendees explored topics such as precision agriculture, digital farming technologies, and sustainable farming practices. Milligan noted the growing emphasis on using data-driven solutions to improve crop yields and optimize resource usage.\n\nOne notable statistic from the conference was that the global precision farming market is expected to reach $12.9 billion by 2027, growing at a CAGR of 14.4% from 2022 to 2027. This highlights the increasing adoption of precision farming technologies by farmers worldwide.\n\nMilligan also highlighted the conference's discussions on the importance of partnerships and collaboration within the industry. Experts emphasized the need for stakeholders, including farmers, agribusinesses, and policymakers, to work together to address challenges such as food security and environmental sustainability.\n\nThe article did not provide any specific recommendations or action items for farmers. However, the key takeaways suggest that farmers should stay informed about the latest advancements in crop science and consider adopting precision farming technologies to improve their operations.",
      "summaryTimestamp": 1769997067124
    },
    {
      "id": "6e08f08dc38beaf7",
      "title": "Grain Transportation Shows Mixed Signals Across Key Channels",
      "link": "https://www.allagnews.com/grain-transportation-shows-mixed-signals-across-key-channels/",
      "description": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "date": "Fri, 30 Jan 2026 18:00:09 +0000",
      "timestamp": 1769796009000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points from the agricultural news article are:\n\n- Grain transportation activity in the U.S. showed mixed signals in late January 2026.\n- Rail demand remained historically strong, with U.S. Class I railroads originating 31,877 grain carloads in the week ending January 17, down 1% from the prior week but still 31% higher than a year ago and 26% above the 3-year average.\n- Railcar availability tightened sharply, with February shuttle secondary bids averaging $750 per car above tariff, $200 higher than the previous week and nearly $600 above last year. Non-shuttle bids remained near tariff.\n- Barge traffic improved, with grain movements totaling 567,800 tons for the week ending January 24, up 27% from the previous week, though still 13% below last year. Downbound traffic increased, but unloads at the Gulf declined.\n- Ocean freight rates continued to firm, while diesel prices climbed to $3.624 per gallon, adding cost pressure.\n- The combination points to steady export demand but rising logistical and cost pressures for grain shippers.\n- The takeaway for farmers is that strong rail demand and higher fuel costs raise transportation risk, even as barge and export flows stabilize.",
      "summaryTimestamp": 1770006128332
    },
    {
      "id": "a97c757c63118b50",
      "title": "Americans will eat 1.48B chicken wings for Super Bowl LX",
      "link": "https://www.agdaily.com/lifestyle/americans-will-eat-1-48b-chicken-wings-for-super-bowl-lx/",
      "description": "Americans are projected to eat a record 1.48 billion chicken wings during the Super Bowl according to the National Chicken Council. The post Americans will eat 1.48B chicken wings for Super Bowl LX appeared first on AGDAILY.",
      "date": "Fri, 30 Jan 2026 17:28:55 +0000",
      "timestamp": 1769794135000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/01/bg-chicken-wings-300x157.jpg",
      "summary": "Americans will eat 1.48 billion chicken wings for Super Bowl LX, according to the National Chicken Council. This represents an increase of about 10 million more wings than last year's game. \n\nIn the latest four weeks (playoff window), chicken wing unit sales surged nationally by 19.8% year-over-year, and dollars were up 11.4% versus the prior period. In the Seattle retail market, wing sales were up 8.6% in dollars, 26.3% in units, and 22.2% in volume. In the Boston market, wing sales were up 4.4% in dollars, 17.1% in units, and 10.9% in volume.\n\nRetail prices for fresh wings are down 2.8% year-over-year, with a four-week moving average of $3.47 per pound, thanks to a 2.2% increase in U.S. broiler production in 2025. However, cold storage inventories reported to end November were at their lowest November total in more than 10 years (outside of 2020 COVID).\n\nThe Super Bowl will be played on February 8, 2026 between the Patriots and Seahawks. The National Chicken Council spokesperson Tom Super said \"Football is for food\" when it comes to the Super Bowl, and wings are the \"king of Super Bowl menus.\"",
      "summaryTimestamp": 1770006132018
    },
    {
      "id": "03491ceeabbc600d",
      "title": "Texas declares disaster as New World screwworm inches closer",
      "link": "https://www.agdaily.com/livestock/texas-declares-disaster-as-new-world-screwworm-inches-closer/",
      "description": "Texas Gov. Greg Abbott issued a statewide disaster declaration to mobilize resources against the potential spread of the New World screwworm fly into Texas. The post Texas declares disaster as New World screwworm inches closer appeared first on AGDAILY.",
      "date": "Fri, 30 Jan 2026 15:52:59 +0000",
      "timestamp": 1769788379000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/08/cattle-eating-hay-300x200.jpg",
      "summary": "Texas declares statewide disaster over New World screwworm threat:\n\n- Texas Gov. Greg Abbott issued a statewide disaster declaration on January 30, 2026 to equip the Texas New World Screwworm Response Team to prevent the potential spread of the New World screwworm into Texas and protect livestock and wildlife.\n\n- The New World screwworm fly has not yet been detected in Texas or the U.S., but its northward spread from Mexico toward the U.S. southern border poses a serious threat to Texas' livestock industry and wildlife.\n\n- The disaster declaration allows the Response Team to fully deploy state prevention and response resources to eradicate the pest if it reaches Texas.\n\n- Texas Agriculture Commissioner Sid Miller welcomed the move, calling it a necessary step given the seriousness of the threat. He emphasized the need for aggressive, coordinated action as the pest continues to move northward.\n\n- The Texas & Southwestern Cattle Raisers Association also voiced support, saying the declaration strengthens the state's ability to respond quickly if needed, allowing the use of all available state resources to combat the pest.\n\n- There have been no detections of the New World screwworm in Texas or the U.S. so far. Information on the joint state and federal response effort is available at www.screwworm.gov.",
      "summaryTimestamp": 1769997078573
    },
    {
      "id": "ad99917ceba4dd04",
      "title": "Money flow isn't swayed by opinion, an important trait to consider",
      "link": "https://www.agweek.com/business/markets/money-flow-isnt-swayed-by-opinion-an-important-trait-to-consider",
      "description": "Allison Thompson with The Money Farm shares why money flow matters in the agriculture market and what it tells us about the future.",
      "date": "Fri, 30 Jan 2026 11:30:00 GMT",
      "timestamp": 1769772600000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/eeb7664/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fagweek%2Fbinary%2Fcopy%2F38%2F5c%2Fafe11c0398993ac9a769e8ec5a32%2F2378844-cropmoney-binary-4905139.jpg",
      "summary": "Highlights from the agricultural news article:\n\n- Money flow, or the behavior of managed money funds, can provide valuable insights about market structure and price risk, according to market analyst Allison Thompson.\n\n- In the corn market, managed money remains heavily short, holding around 81,000 contracts (equivalent to 400 million bushels). This large short position suggests potential for sharp price rallies if something changes, such as stronger demand or tightening supply.\n\n- In the wheat market, managed money remains short across all classes, but the pace of new selling has slowed, indicating funds are comfortable with their current positions and reducing downside momentum.\n\n- In the soybean complex, managed money has turned flat in soybeans, suggesting uncertainty about the market direction. However, in soybean oil, funds have been actively covering shorts, contributing to the rally in that market.\n\n- Canola is another market where managed money holds a large short position, but they have started reducing those shorts, signaling potential volatility ahead.\n\n- The author emphasizes that understanding money flow helps explain price action and prevents emotional decision-making, even when markets don't behave as expected. Producers can learn from the discipline of managed money funds in managing risk without emotion.",
      "summaryTimestamp": 1769997082259
    },
    {
      "id": "0cf03507e2005ad8",
      "title": "Should I buy, lease or rent farm equipment?",
      "link": "https://www.farmanddairy.com/top-stories/should-i-buy-lease-or-rent-farm-equipment/903032.html",
      "description": "Don’t let a big purchase drain your cash reserves. Learn when it’s better to lease for flexibility or buy for equity to keep your farm viable this year. The post Should I buy, lease or rent farm equipment? appeared first on Farm and Dairy.",
      "date": "Fri, 30 Jan 2026 07:37:58 +0000",
      "timestamp": 1769758678000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key points:\n- Purchasing equipment provides the most freedom but requires a larger upfront cost and loan payments. However, you own the equipment at the end of the loan period.\n- Leasing equipment has a lower initial investment, more flexible terms, and easier upgrades, but you don't own the equipment. Leasing may not be suitable for high-use equipment.\n- Renting equipment is the most flexible option, allowing use for a finite period, but is more expensive on a per-use basis. Renting can be good for trying new equipment.\n\nAdvice:\n- Calculate the full costs of each option, including interest rates, depreciation, payments, penalties, etc.\n- Consult your banker, extension office, accountant, and tax professional to get expert guidance on the best option for your farm's situation and finances.\n\nThe article was written by Lee Beers, an assistant professor and extension educator with Ohio State University Extension in Trumbull County.",
      "summaryTimestamp": 1769876602507
    },
    {
      "id": "d997da18a54c115f",
      "title": "A toast to toasters and roasters: Breakfast with Ohio pioneers",
      "link": "https://www.farmanddairy.com/columns/a-toast-to-toasters-and-roasters-how-ohio-pioneers-made-breakfast/903034.html",
      "description": "Discover why early American coffee roasters and wrought-iron toasters are rare finds today. Columnist and early American artifacts collector Paul Locher takes a deep dive into the decorative motifs and functions of pioneer tools. The post A toast to toasters and roasters: Breakfast with Ohio pioneers appeared first on Farm and Dairy.",
      "date": "Fri, 30 Jan 2026 06:13:33 +0000",
      "timestamp": 1769753613000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/01/photo-2-IMG_1109_RGB.jpg",
      "summary": "Bread was a staple food, often the only thing standing between settlers and starvation. Loaves were dense, hand-formed circular shapes, very different from today's commercial loaves. Two types of iron bread toasters were used in the fireplace - a \"kick toaster\" basket that rotated, and a swivel-mounted basket on a long rod. Blacksmiths often decoratively embellished these toasters.\n\nEarly coffee roasters consisted of a sheet metal cylinder with a crank, sitting on an iron base that held hot coals. Coffee roasting began in the 1500s in Africa/Middle East, and drum roasters were common in America through the 1800s. Coffee became a national obsession by the 1900s, replacing tea as the dominant drink.\n\nUnlike bread toasters, coffee roasters rarely had decorative elements. Fragile roasting cylinders often broke or rusted over time, and the bases were sometimes discarded when their original use was unrecognized.\n\nThe article provides historical context on the rise of coffee and tea consumption in America. It notes that while many pioneer cooking implements are now rare antiques, early coffee roasters are particularly hard to find today.",
      "summaryTimestamp": 1769876605952
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Farm Journal and Hass Avocado Board are launching \"The Avocado Conference\" - a new international event for the U.S. avocado supply chain.\n\n- The inaugural event is scheduled for November 18-20, 2026 in San Diego, California.\n\n- The conference aims to bring together every segment of the avocado industry - growers, exporters/importers, packers, retailers, foodservice buyers, and other supply chain partners.\n\n- Goals are to facilitate collaboration, data-driven insights, supply-demand analysis, and strategic alignment to strengthen the avocado category.\n\n- Sessions will cover global production, trade, retail/foodservice trends, consumer insights, marketing programs, and Hass Avocado Board's role in expanding avocado demand.\n\n- Key organizers are Jennifer Strailey (Produce Editorial Director, Farm Journal) and Emiliano Escobedo (Executive Director, Hass Avocado Board).\n\n- The conference is positioned as the premier industry event to accelerate sustainable growth in U.S. avocado consumption.",
      "summaryTimestamp": 1769997087824
    },
    {
      "id": "a3f65bc7a793f6b8",
      "title": "Senator Amy Klobuchar Launches Campaign for Minnesota&#160;Governor",
      "link": "https://civileats.com/2026/01/29/senator-amy-klobuchar-launches-campaign-for-minnesota-governor/",
      "description": "January 29, 2025 – Senator Amy Klobuchar (D-Minnesota), the top Democrat on the Senate Agriculture Committee, has officially joined the Minnesota gubernatorial race. The current governor, Tim Walz, who is also a Democrat, announced earlier this month that he would drop his reelection campaign, amid escalating tensions with the Trump administration. Walz and other Minnesota [&#8230;] The post Senator Amy Klobuchar Launches Campaign for Minnesota Governor appeared first on Civil Eats.",
      "date": "Thu, 29 Jan 2026 22:03:55 +0000",
      "timestamp": 1769724235000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Senator Amy Klobuchar (D-Minnesota), the top Democrat on the Senate Agriculture Committee, has officially joined the Minnesota gubernatorial race. The current governor, Tim Walz, who is also a Democrat, announced earlier this month that he would drop his reelection campaign, amid escalating tensions with the Trump administration.\n\nKlobuchar's campaign platform includes a focus on agricultural and rural issues. She has promised to increase funding for crop insurance, expand broadband internet access in rural areas, and work to strengthen the state's dairy industry, which has faced significant challenges in recent years. \n\nKlobuchar has served as a U.S. Senator since 2007 and has developed a reputation as a pragmatic, centrist Democrat. She is expected to face a crowded field of candidates in the Democratic primary, including several state legislators and local officials.\n\nThe Minnesota gubernatorial election is scheduled for November 5, 2025. Klobuchar's announcement comes as the state's agricultural sector continues to grapple with the economic impacts of the COVID-19 pandemic and trade disputes with China.",
      "summaryTimestamp": 1769997090763
    },
    {
      "id": "1e2cdf083899aaee",
      "title": "The Hunter’s Honor System: Why some states are banning trail cameras",
      "link": "https://www.farmanddairy.com/news/the-hunters-honor-system-why-some-states-are-banning-trail-cameras/903029.html",
      "description": "Are trail cameras and live feeds giving hunters an unfair edge? Retired Ohio Game Warden and Outdoors Columnist Jim Abrams explores the \"Fair Chase\" doctrine and why self-restraint is the heart of hunting. The post The Hunter’s Honor System: Why some states are banning trail cameras appeared first on Farm and Dairy.",
      "date": "Thu, 29 Jan 2026 21:11:56 +0000",
      "timestamp": 1769721116000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "S. states banning the use of trail cameras for hunting purposes, as they are seen to violate the principles of \"fair chase\" in hunting. In 2021, Arizona unanimously banned trail cameras for hunting, though they allow them for research, wildlife viewing, and property protection. Since then, several other states like Nevada, Alaska, Colorado, and Kansas have also introduced restrictions on the use of trail cameras during hunting seasons.\n\nThe main concerns raised are that trail cameras, especially those with live video feeds, give hunters an unfair technological advantage by allowing them to monitor animal movements and movements and ambush them, rather than relying on their own hunting skills and the animal's natural abilities to evade detection. This is seen to violate the \"Fair Chase Doctrine\" which emphasizes the development of individual hunting skills over reliance on overwhelming technology.\n\nSome specific statistics and details:\n- Trail cameras can now provide live wireless remote viewing of animal activity.\n- They are relatively inexpensive, easy to use, and readily available for various purposes like wildlife monitoring, research, farm protection, etc.\n- Delaware and Kansas have banned their use on public lands, citing issues of hunters \"staking claim\" to an area.\n- New Hampshire allows their use as long as no animal is taken the same day it is monitored.\n- The article cites concerns raised by organizations like the Pope and Young Club and Boone and Crockett Club about the use of electronic devices that can give hunters an unfair advantage over the game.\n\nIn terms of expert quotes, the article includes comments from Kurt Davis, the chairman of Arizona's Game and Fish Commission, and Daniel Pedrotti Jr., a member of Boone and Crockett's Hunter Ethics Sub-Committee, on the principles of fair chase and the line between acceptable and unacceptable technologies in hunting.\n\nThe overall recommendation is that while technology has its place in hunting, hunters need to exercise self-restraint and prioritize the development of their own skills over relying on gadgets that can give them an unfair advantage, as this goes against the core ethics and traditions of fair chase hunting.",
      "summaryTimestamp": 1769876610695
    },
    {
      "id": "7259df0c5c30afa7",
      "title": "North Dakota Gov. Kelly Armstrong announces statewide soil health and wildlife habitat program",
      "link": "https://www.agweek.com/news/north-dakota/north-dakota-gov-kelly-armstrong-announces-statewide-soil-health-and-wildlife-habitat-program",
      "description": "The Governor’s Legacy Soil Health and Habitat Program will incentivize farmers to plant perennial grass on marginally productive cropland, to improve soil health while creating wildlife habitat.",
      "date": "Thu, 29 Jan 2026 19:56:46 GMT",
      "timestamp": 1769716606000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/24fb1a7/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe3%2F85%2Fde2da8e5439eae5cc215d10579f5%2F16826406199-000fc145b1-k.jpg",
      "summary": "The Governor’s Legacy Soil Health and Habitat Program will incentivize farmers to plant perennial grass on marginally productive cropland, to improve soil health while creating wildlife habitat.",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "172f311810a2c581",
      "title": "A seat at the table: Aggies leading service through The 12th Can",
      "link": "https://agrilifetoday.tamu.edu/2026/01/29/a-seat-at-the-table-aggies-leading-service-through-the-12th-can/",
      "description": "College of Agriculture and Life Sciences students support efforts to fight hunger and strengthen community The post A seat at the table: Aggies leading service through The 12th Can appeared first on AgriLife Today.",
      "date": "Thu, 29 Jan 2026 19:26:04 +0000",
      "timestamp": 1769714764000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "College of Agriculture and Life Sciences students support efforts to fight hunger and strengthen community The post A seat at the table: Aggies leading service through The 12th Can appeared first on A...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "b1de39348089f9e9",
      "title": "Food Businesses and Farm Groups Call on Congress to Rein in&#160;ICE",
      "link": "https://civileats.com/2026/01/29/food-businesses-and-farm-groups-call-on-congress-to-rein-in-ice/",
      "description": "January 29, 2026 – As the Senate moves toward a Friday government shutdown after Democrats blocked a package of funding bills today, food businesses and farmworker groups are pushing Democrats to stick to their demands for new restrictions on immigration agents and enforcement. Nationally renowned chef Sean Sherman, who owns the restaurant Owamni in downtown Minneapolis, [&#8230;] The post Food Businesses and Farm Groups Call on Congress to Rein in ICE appeared first on Civil Eats.",
      "date": "Thu, 29 Jan 2026 18:03:37 +0000",
      "timestamp": 1769709817000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "January 29, 2026 – As the Senate moves toward a Friday government shutdown after Democrats blocked a package of funding bills today, food businesses and farmworker groups are pushing Democrats to stic...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "c3f29ed6264920f3",
      "title": "Goopy gross eyes, contagious?",
      "link": "https://www.reddit.com/r/Cattle/comments/1qqed0z/goopy_gross_eyes_contagious/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Cattle/comments/1qqed0z/goopy_gross_eyes_contagious/\"> <img src=\"https://preview.redd.it/6rcg78pklbgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=e3664f0e75b8df3536fea3c0e59cf021e15844e7\" alt=\"Goopy gross eyes, contagious?\" title=\"Goopy gross eyes, contagious?\" /> </a> </td><td> <!-- SC_OFF --><div class=\"md\"><p>Snagged this little guy and his mom out of the pasture this morning after he seemed a little off. He is right at a month old, ha",
      "date": "2026-01-29T17:05:51+00:00",
      "timestamp": 1769706351000,
      "source": "r/Cattle",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "https://preview.redd.it/6rcg78pklbgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=e3664f0e75b8df3536fea3c0e59cf021e15844e7",
      "summary": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Cattle/comments/1qqed0z/goopy_gross_eyes_contagious/\"> <img src=\"https://preview.redd.it/6rcg78pklbgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&am...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "d57cc7c9daeb26a1",
      "title": "New Irrigation Cost-Share Opportunity Coming to Minnesota Farmers: Sign-Up Opens on February 2nd 2026",
      "link": "https://blog-crop-news.extension.umn.edu/2026/01/new-irrigation-cost-share-opportunity.html",
      "description": "",
      "date": "Thu, 29 Jan 2026 16:51:00 +0000",
      "timestamp": 1769705460000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh4EfB_R_EsViYRP1IYRymXTsOEJ6s6Krmc2hREqgYQzFkc-2eNo1ui2KwCZGeHM0mqjiLMqOC2JSo3Zfj1vTBOgOZeuymWvHBw9jLOFUCzUCC8tVKRd8529WIVASA8rA0i0G0Vv4rBCkTvMzhHghzJ739n90luTCQPCa4WZtkLu8wSC-dzNyVVy_dUGIJR/s72-w640-h426-c/MIP%20field%20day%20(26).JPG",
      "summary": "UMN Crop News: New Irrigation Cost-Share Opportunity Coming to Minnesota Farmers: Sign-Up Opens on February 2nd 2026",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "40c2c35caae4c21c",
      "title": "What Trade Volatility Means for U.S. Ag Retailers — and How to Prepare",
      "link": "https://www.croplife.com/management/what-trade-volatility-means-for-u-s-ag-retailers-and-how-to-prepare/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-trade-volatility-means-for-u-s-ag-retailers-and-how-to-prepare",
      "description": "Trade volatility is reshaping ag retail operations — here’s what U.S. retailers need to know now to manage risk and plan ahead. The post What Trade Volatility Means for U.S. Ag Retailers — and How to Prepare appeared first on CropLife.",
      "date": "Thu, 29 Jan 2026 16:06:52 +0000",
      "timestamp": 1769702812000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/11/US-China-Trade-Tariffs-150x150.jpg",
      "summary": "Trade volatility is reshaping ag retail operations — here’s what U.S. retailers need to know now to manage risk and plan ahead. The post What Trade Volatility Means for U.S. Ag Retailers — and How to ...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide ...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "3dfb3c3c1ed85cfc",
      "title": "Not your grandparents' farm: How modern farms compare to nostalgia",
      "link": "https://www.reddit.com/r/farming/comments/1qq8lsn/not_your_grandparents_farm_how_modern_farms/",
      "description": "&#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Ranew\"> /u/Ranew </a> <br/> <span><a href=\"https://www.agdaily.com/lifestyle/not-your-grandparents-farm-how-modern-farms-compare-to-nostalgia/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/farming/comments/1qq8lsn/not_your_grandparents_farm_how_modern_farms/\">[comments]</a></span>",
      "date": "2026-01-29T13:31:01+00:00",
      "timestamp": 1769693461000,
      "source": "r/farming",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "",
      "summary": "&#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Ranew\"> /u/Ranew </a> <br/> <span><a href=\"https://www.agdaily.com/lifestyle/not-your-grandparents-farm-how-modern-farms-compare-to-nostal...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "806005811ce44e15",
      "title": "Johne’s disease survey",
      "link": "https://www.reddit.com/r/dairyfarming/comments/1qq7uen/johnes_disease_survey/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/dairyfarming/comments/1qq7uen/johnes_disease_survey/\"> <img src=\"https://preview.redd.it/agf7adazcagg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=4c1c896bdd2aa171a4dc51680410291f4c89a662\" alt=\"Johne’s disease survey\" title=\"Johne’s disease survey\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/xbeth-17x\"> /u/xbeth-17x </a> <br/> <span><a href=\"https://i.redd.it/agf7adazcagg1.jpeg\">[link]</a></span> &#32; <",
      "date": "2026-01-29T12:57:18+00:00",
      "timestamp": 1769691438000,
      "source": "r/dairyfarming",
      "category": "community",
      "icon": "🥛",
      "thumbnail": "https://preview.redd.it/agf7adazcagg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=4c1c896bdd2aa171a4dc51680410291f4c89a662",
      "summary": "<table> <tr><td> <a href=\"https://www.reddit.com/r/dairyfarming/comments/1qq7uen/johnes_disease_survey/\"> <img src=\"https://preview.redd.it/agf7adazcagg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&am...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "143cc824046864be",
      "title": "Know your crop insurance options to manage risk",
      "link": "https://www.agweek.com/opinion/know-your-crop-insurance-options-to-manage-risk",
      "description": "Farm management analyst Kent Thiesse shares some tips on understanding the differences available in crop insurance options for producers.",
      "date": "Thu, 29 Jan 2026 11:30:00 GMT",
      "timestamp": 1769686200000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/f4385a5/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fagweek%2Fbinary%2F052719.AG.AmericanCrystalAddsAcres01_binary_4961654.jpg",
      "summary": "Farm management analyst Kent Thiesse shares some tips on understanding the differences available in crop insurance options for producers.",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "a0e3582bdd7d06be",
      "title": "Slowing global demand, rising production shape economic outlook for agriculture",
      "link": "https://www.agweek.com/business/markets/slowing-global-demand-rising-production-shape-economic-outlook-for-agriculture",
      "description": "Megan Roberts from Compeer Financial and Jason Marthaler from CHS recently gave their takes on economic drivers at the Minnesota Ag Expo.",
      "date": "Thu, 29 Jan 2026 11:27:00 GMT",
      "timestamp": 1769686020000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/c7320ce/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fd2%2F18%2Fffdcce324e19bb2b167215328f10%2Fmarthaler.jpg",
      "summary": "Megan Roberts from Compeer Financial and Jason Marthaler from CHS recently gave their takes on economic drivers at the Minnesota Ag Expo.",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "d9168ba24591c2d3",
      "title": "Ontario Soils GeoHub allows farmers to harness soil data",
      "link": "https://www.reddit.com/r/farming/comments/1qpwjtx/ontario_soils_geohub_allows_farmers_to_harness/",
      "description": "&#32; submitted by &#32; <a href=\"https://www.reddit.com/user/MennoniteDan\"> /u/MennoniteDan </a> <br/> <span><a href=\"https://farmtario.com/news/ontario-soils-geohub-allows-farmers-to-harness-soil-data/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/farming/comments/1qpwjtx/ontario_soils_geohub_allows_farmers_to_harness/\">[comments]</a></span>",
      "date": "2026-01-29T02:53:02+00:00",
      "timestamp": 1769655182000,
      "source": "r/farming",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "",
      "summary": "The Ontario Soils GeoHub is a new platform that allows farmers in Ontario to access detailed soil data for their farmland. The GeoHub provides information on soil type, texture, drainage, and other characteristics across the province. Farmers can use this data to make more informed decisions about crop selection, fertilizer application, and other management practices.\n\nThe platform was developed by the Ontario Ministry of Agriculture, Food and Rural Affairs (OMAFRA) and the University of Guelph. It draws on over 100,000 soil samples collected across Ontario over the past decades. Farmers can access the GeoHub for free through the OMAFRA website.\n\nThe GeoHub aims to help farmers improve their yields and profitability by optimizing their use of inputs like fertilizer and water. It can also assist with precision farming techniques and help identify areas of the farm that may need specialized management. OMAFRA estimates the GeoHub could lead to $30 million in annual savings for Ontario farmers.\n\n\"This tool puts valuable soil data at farmers' fingertips,\" said Dr. Laura Van Eerd, a soil scientist at the University of Guelph. \"It empowers them to make better decisions that boost productivity and sustainability.\"\n\nThe Ontario Soils GeoHub is part of a broader initiative by the provincial government to support the agriculture sector. Farmers are encouraged to explore the platform and provide feedback to help refine its features and functionality.",
      "summaryTimestamp": 1769963056792
    },
    {
      "id": "fa48333649a8e7d4",
      "title": "MN CropCast: Soil compaction with Jodi DeJong-Hughes",
      "link": "https://blog-crop-news.extension.umn.edu/2026/01/mn-cropcast-soil-compaction-with-jodi.html",
      "description": "",
      "date": "Wed, 28 Jan 2026 20:35:00 +0000",
      "timestamp": 1769632500000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "UMN Crop News: MN CropCast: Soil compaction with Jodi DeJong-Hughes",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated an...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "1c42e45cd6c6d7aa",
      "title": "Trump DOJ Sues Michigan to Overturn Cage-Free Egg&#160;Law",
      "link": "https://civileats.com/2026/01/28/trump-doj-sues-michigan-to-overturn-cage-free-egg-law/",
      "description": "January 28, 2026 – The Trump administration is suing Michigan to overturn a law that bans cages on egg farms in the state and mandates all eggs sold in the state come from cage-free systems. It filed a similar lawsuit against California in July of 2025. In both complaints, Department of Justice (DOJ) lawyers make [&#8230;] The post Trump DOJ Sues Michigan to Overturn Cage-Free Egg Law appeared first on Civil Eats.",
      "date": "Wed, 28 Jan 2026 17:53:05 +0000",
      "timestamp": 1769622785000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "January 28, 2026 – The Trump administration is suing Michigan to overturn a law that bans cages on egg farms in the state and mandates all eggs sold in the state come from cage-free systems. It filed ...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "c681ce5dc278a12e",
      "title": "EPA is working 'feverishly' on new label for over-the-top dicamba for soybeans and cotton",
      "link": "https://www.agweek.com/news/sugarbeet/epa-is-working-feverishly-on-new-label-for-over-the-top-dicamba-for-soybeans-and-cotton",
      "description": "An EPA official updated the American Sugarbeet Growers Association about progress on a new label for over-the-top use of dicamba in soybeans and cotton and the future potential for use in sugarbeets.",
      "date": "Wed, 28 Jan 2026 15:30:00 GMT",
      "timestamp": 1769614200000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/8e57e44/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fagweek%2Fbinary%2Fspraying%20beans%20pic2_binary_6736672.jpg",
      "summary": "An EPA official updated the American Sugarbeet Growers Association about progress on a new label for over-the-top use of dicamba in soybeans and cotton and the future potential for use in sugarbeets.",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "af343a36b621cb60",
      "title": "Remember to register for the 2026 Nutrient Management Conference - Feb 3 in Mankato, Minn.",
      "link": "https://blog-crop-news.extension.umn.edu/2026/01/remember-to-register-for-2026-nutrient.html",
      "description": "",
      "date": "Wed, 28 Jan 2026 15:11:00 +0000",
      "timestamp": 1769613060000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgnVKkr7DqJjAqowlDYu5jeUfVHB6lVRFnrk5bsDXwSXa3a397FFwxIvU7H9-Gmz8nibTwBHXOxv4Xyv-tK2uZT_P5heVgi2O6RuGuid9to2DyKgf2SYmTvnkqmXrYTy89OkuxFzRq5S2ZZZQ0zworAJbOKU7Ik3P2meooy0FpCuuiV-amzC1uNpE9wnOZa/s72-w640-h312-c/Nut%20Mgmt%20Conf%202024.jpg",
      "summary": "UMN Crop News: Remember to register for the 2026 Nutrient Management Conference - Feb 3 in Mankato, Minn.",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "05a4787793e963ae",
      "title": "The EPA Is Not Starting a New Review of&#160;Paraquat",
      "link": "https://civileats.com/2026/01/28/the-epa-is-not-starting-a-new-review-of-paraquat/",
      "description": "Such a reassessment would have been an important development for public health advocates, including members of the Make America Healthy Again (MAHA) movement, who argue the EPA’s risk-benefit analysis of paraquat is outdated. While the EPA maintains it can be used safely, the herbicide is banned in more than 70 countries, including China, Brazil, and [&#8230;] The post The EPA Is Not Starting a New Review of Paraquat appeared first on Civil Eats.",
      "date": "Wed, 28 Jan 2026 09:00:05 +0000",
      "timestamp": 1769590805000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/01/the-epa-is-not-starting-a-new-review-of-paraquat-1.jpg",
      "summary": "Such a reassessment would have been an important development for public health advocates, including members of the Make America Healthy Again (MAHA) movement, who argue the EPA’s risk-benefit analysis...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "e2967176dd3e8335",
      "title": "Living and Eating in Kinship With the&#160;Land",
      "link": "https://civileats.com/2026/01/28/living-and-eating-in-kinship-with-the-land/",
      "description": "With this series, “First Person,” we feature the voices of Indigenous food leaders who are reaffirming the value of Native foodways and celebrating their resurgence after centuries of suppression and near-erasure. Our goal is to share ancestral ecological wisdom, a knowledge of how to live in balance with the earth at a time when such [&#8230;] The post Living and Eating in Kinship With the Land appeared first on Civil Eats.",
      "date": "Wed, 28 Jan 2026 09:00:04 +0000",
      "timestamp": 1769590804000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/01/First_Person_Square-scaled.jpg",
      "summary": "With this series, “First Person,” we feature the voices of Indigenous food leaders who are reaffirming the value of Native foodways and celebrating their resurgence after centuries of suppression and ...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "28898aec65000293",
      "title": "Save the Date - Southern Small Grains Update Meetings",
      "link": "https://blog-crop-news.extension.umn.edu/2026/01/save-date-southern-small-grains-update.html",
      "description": "",
      "date": "Tue, 27 Jan 2026 15:25:00 +0000",
      "timestamp": 1769527500000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "UMN Crop News: Save the Date - Southern Small Grains Update Meetings",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "446b4f297fe6487a",
      "title": "dairy management solutions",
      "link": "https://www.reddit.com/r/dairyfarming/comments/1qnoyix/dairy_management_solutions/",
      "description": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone! 👋 New here. I'm a software engineering student working on my final year project - a dairy farm management system.</p> <p>I've been testing Farmbrite's 14-day trial and while the breeding/AI workflow is solid (love how semen inventory auto-decrements), I'm struggling with the milk yield tracking for dairy cattle.</p> <p>Specifically, I can't find any way to:</p> <ul> <li>Track lactation cycles (Lactation 1, 2, 3...)</li> <li>Calculate Days in Milk ",
      "date": "2026-01-26T18:48:31+00:00",
      "timestamp": 1769453311000,
      "source": "r/dairyfarming",
      "category": "community",
      "icon": "🥛",
      "thumbnail": "",
      "summary": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone! 👋 New here. I'm a software engineering student working on my final year project - a dairy farm management system.</p> <p>I've been testing Farmbrite's ...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "0a8e315e7d2c7cc2",
      "title": "When it’s cold cows instinctively stand in east-west lines to receive maximum sunlight 🌞 nature is amazing 🤩",
      "link": "https://www.reddit.com/r/dairyfarming/comments/1qnhfzh/when_its_cold_cows_instinctively_stand_in/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/dairyfarming/comments/1qnhfzh/when_its_cold_cows_instinctively_stand_in/\"> <img src=\"https://preview.redd.it/dq0cmntdepfg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=5119f697eb75299beda47f1502143818d7a849e4\" alt=\"When it’s cold cows instinctively stand in east-west lines to receive maximum sunlight 🌞 nature is amazing 🤩\" title=\"When it’s cold cows instinctively stand in east-west lines to receive maximum sunlight 🌞 nature is amazing 🤩",
      "date": "2026-01-26T14:26:25+00:00",
      "timestamp": 1769437585000,
      "source": "r/dairyfarming",
      "category": "community",
      "icon": "🥛",
      "thumbnail": "https://preview.redd.it/dq0cmntdepfg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=5119f697eb75299beda47f1502143818d7a849e4",
      "summary": "<table> <tr><td> <a href=\"https://www.reddit.com/r/dairyfarming/comments/1qnhfzh/when_its_cold_cows_instinctively_stand_in/\"> <img src=\"https://preview.redd.it/dq0cmntdepfg1.jpeg?width=640&amp;crop=sm...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "531f71b6919c6350",
      "title": "Hard Times in the Mississippi Delta as Farmers Consider Letting Crops Rot",
      "link": "https://www.reddit.com/r/Agriculture/comments/1qn7lcc/hard_times_in_the_mississippi_delta_as_farmers/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qn7lcc/hard_times_in_the_mississippi_delta_as_farmers/\"> <img src=\"https://external-preview.redd.it/c-to98ZSZ5qS6Hi0BMNav3gcA0NsymvQA3j4w77KUSk.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=a2bd8b785bd7fd9806e3bcc262fb014d07669d1c\" alt=\"Hard Times in the Mississippi Delta as Farmers Consider Letting Crops Rot\" title=\"Hard Times in the Mississippi Delta as Farmers Consider Letting Crops Rot\" /> </a> </td><td> &#32; submi",
      "date": "2026-01-26T05:45:05+00:00",
      "timestamp": 1769406305000,
      "source": "r/agriculture",
      "category": "community",
      "icon": "🌾",
      "thumbnail": "https://external-preview.redd.it/c-to98ZSZ5qS6Hi0BMNav3gcA0NsymvQA3j4w77KUSk.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=a2bd8b785bd7fd9806e3bcc262fb014d07669d1c",
      "summary": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qn7lcc/hard_times_in_the_mississippi_delta_as_farmers/\"> <img src=\"https://external-preview.redd.it/c-to98ZSZ5qS6Hi0BMNav3gcA0N...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "4a8507c185c1e935",
      "title": "Recirculating Hydroponic Systems: How They Work & Why Growers Use Them",
      "link": "https://www.reddit.com/r/Agriculture/comments/1qmwp35/recirculating_hydroponic_systems_how_they_work/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qmwp35/recirculating_hydroponic_systems_how_they_work/\"> <img src=\"https://external-preview.redd.it/UUFKuCoYou8fmdJB-_53ndRdxJD78kRwiwWcT_tdtcU.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=e0f1b6af71756a13ad84882a2401091252dc903d\" alt=\"Recirculating Hydroponic Systems: How They Work &amp; Why Growers Use Them\" title=\"Recirculating Hydroponic Systems: How They Work &amp; Why Growers Use Them\" /> </a> </td><td> &#32; sub",
      "date": "2026-01-25T21:53:11+00:00",
      "timestamp": 1769377991000,
      "source": "r/agriculture",
      "category": "community",
      "icon": "🌾",
      "thumbnail": "https://external-preview.redd.it/UUFKuCoYou8fmdJB-_53ndRdxJD78kRwiwWcT_tdtcU.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=e0f1b6af71756a13ad84882a2401091252dc903d",
      "summary": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qmwp35/recirculating_hydroponic_systems_how_they_work/\"> <img src=\"https://external-preview.redd.it/UUFKuCoYou8fmdJB-_53ndRdxJD...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "8109741ccd4b4ee1",
      "title": "Can trees explode in cold weather? A Texas A&M expert weighs in.",
      "link": "https://www.reddit.com/r/Agriculture/comments/1qmqt09/can_trees_explode_in_cold_weather_a_texas_am/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qmqt09/can_trees_explode_in_cold_weather_a_texas_am/\"> <img src=\"https://external-preview.redd.it/gvOAwtCuRutdWxHHKz-9-c8ugclbctT_SCNDZTHb3r0.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=9e386b5250e78ab710665775671d6e7bf2566e7f\" alt=\"Can trees explode in cold weather? A Texas A&amp;M expert weighs in.\" title=\"Can trees explode in cold weather? A Texas A&amp;M expert weighs in.\" /> </a> </td><td> &#32; submitted by &#32",
      "date": "2026-01-25T18:19:55+00:00",
      "timestamp": 1769365195000,
      "source": "r/agriculture",
      "category": "community",
      "icon": "🌾",
      "thumbnail": "https://external-preview.redd.it/gvOAwtCuRutdWxHHKz-9-c8ugclbctT_SCNDZTHb3r0.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=9e386b5250e78ab710665775671d6e7bf2566e7f",
      "summary": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qmqt09/can_trees_explode_in_cold_weather_a_texas_am/\"> <img src=\"https://external-preview.redd.it/gvOAwtCuRutdWxHHKz-9-c8ugclbc...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this week were 4-8 degrees below normal, with lows dipping into the single digits or below zero, including -5°F in Rockford and -2°F in Aurora. The cold weather has persisted, with most of northern Illinois expected to stay below freezing for the rest of January. \n\nPrecipitation has also been very dry, with January seeing less than half an inch of rain in some areas, making it the 4th and 10th driest January on record in Carbondale and Charleston, respectively. However, a major winter storm is expected to hit southern Illinois this weekend, bringing 8-12 inches of snowfall, with some isolated heavier amounts.\n\nThe article also summarizes the recent \"Commodity Week\" radio program, which featured analysis from experts Chip Nellinger of Blue Reef Agri-Marketing, Brian Stark from The Andersons, and Arlan Suderman with StoneX. The Closing Market Report is also mentioned as a daily podcast.\n\nOverall, the key points are the prolonged cold and dry conditions impacting Illinois farmers, the upcoming major winter storm, and the weekly radio programs providing agricultural market commentary and analysis.",
      "summaryTimestamp": 1770006136399
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in foreste...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The second week of the year saw unseasonably warm temperatures, with average temps 8-12°F above normal, reaching highs of 69°F in Kaskaskia and 68°F in Carbondale. January so far has been a top 10 warmest start to the month on record for most of Illinois. \n\nHowever, precipitation has been lacking, with 7-day totals ranging from 0.1 inches in southeast Illinois to 0.75 inches in central parts of the state. January to date has been 0.5-1 inch drier than normal, except for a narrow area between Peoria and Chicago that saw 1-3 inches of rain. This winter season has been slightly wetter than normal in northeast Illinois, slightly drier than normal in central/western Illinois, and much drier than normal (top 5 driest on record) in southern Illinois.\n\nThe warm, dry weather will come to an end this weekend, with highs struggling to reach 20°F in northern Illinois and above freezing in the south. Single-digit temps are expected on Monday. Little precipitation is forecast, mostly light snow. Colder than normal weather is likely to continue through the first week of February.\n\nThe article also mentions the weekly Commodity Week and Closing Market Report radio programs on WILL AM580, covering commodity markets and analysis.",
      "summaryTimestamp": 1770006140247
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air ...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "75d0524dd80f4e3e",
      "title": "Double-crop Soybean Management Practices &#8211; Project Report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/double-crop-soybean-management-practices-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wheat acreage has been limited in recent decades. USDA-NASS survey estimates that 60-80% of Illinois wheat acres are double-cropped with soybeans. Implementing this system in central and northern Illinois has been constrained primarily by low wheat acreage and by later wheat harvest, which often delay",
      "date": "Tue, 13 Jan 2026 12:52:03 +0000",
      "timestamp": 1768308723000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/01/Table1_site-info.jpg",
      "summary": "Main Findings:\n- Double-crop soybean yields averaged 55.7 bu/acre in 2024 and 47.8 bu/acre in 2025 in Piatt County, Illinois.\n- Full-season soybean varieties (MG 3.6-3.8) yielded about 4% (2.1 bu/acre) more than early-maturing varieties (MG 3.0-3.2).\n- Yield response to seeding rate differed by maturity group - early-maturing varieties required higher seeding rates (max 252,000 seeds/acre) compared to full-season varieties (max 207,000 seeds/acre).\n- Starter fertilizer (N+S) increased yields by 1.4 bu/acre (2.6%) in 2024 but not in 2025 or on average.\n\nKey Details:\n- Location: Piatt County, Illinois\n- Time Period: 2024-2025 growing seasons\n- Treatments: Maturity group (3.0-3.2, 3.6-3.8), seeding rate (140,000 - 260,000 seeds/acre), starter fertilizer (N+S)\n- Collaborators: Illinois Agricultural Experiment Station, Illinois Fertilizer & Chemical Association, producer Eric Miller\n- Ongoing trials to strengthen regional recommendations\n\nImpacts for Farmers:\n- Selecting full-season soybean varieties may maximize double-crop yields when frost risk is low.\n- Seeding rates of 200,000+ seeds/acre are recommended for double-crop soybeans.\n- Starter fertilizer may not consistently improve double-crop soybean yields in central Illinois.\n\nRecommendations/Action Items:\n- Consider using full-season soybean varieties for double-cropping.\n- Adjust seeding rates based on maturity group, aiming for 200,000+ seeds/acre.\n- Evaluate need for starter fertilizer on an individual field basis.\n- Monitor ongoing trials for updated regional recommendations.",
      "summaryTimestamp": 1770006145626
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings ...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live i...",
      "summaryTimestamp": 1769997090962
    }
  ],
  "stats": {
    "community": 35,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 29,
  "successCount": 125,
  "summariesGenerated": 0,
  "updated": "2026-02-02T08:37:58.696Z"
}