{
  "items": [
    {
      "id": "3fa6312ac4062c24",
      "title": "Upcoming Nitrogen College events in Hutchinson, Mankato",
      "link": "https://www.morningagclips.com/upcoming-nitrogen-college-events-in-hutchinson-mankato/",
      "description": "ST. PAUL, Minn. &#8212; Nitrogen management continues to be a primary focus for farmers and the agricultural industry. Driven by high fertilizer prices, recent low commodity prices, and ongoing environmental concerns, producers face a complex landscape when making fertility decisions. To address these challenges, University of Minnesota Extension is hosting Nitrogen College, a series of [&#8230;] The post Upcoming Nitrogen College events in Hutchinson, Mankato appeared first on Morning Ag Clips.",
      "date": "Thu, 05 Feb 2026 20:29:09 +0000",
      "timestamp": 1770323349000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Upcoming Nitrogen College Events in Hutchinson and Mankato\n\n- Nitrogen management is a primary focus for farmers due to high fertilizer prices, low commodity prices, and environmental concerns.\n- University of Minnesota Extension is hosting Nitrogen College, a series of free workshops to help farmers refine their nitrogen (N) management strategies.\n- The events will be held on February 23-24 in Hutchinson and February 25-26 in Mankato.\n- The workshops will cover topics such as different types of N fertilizer, managing N based on climate, reducing nitrate loss to water, biological N products, and using variable rate technology for N applications.\n- Certified Crop Advisors can earn a total of 5 Nutrient Management and 6 Soil and Water credits by attending all sessions.\n- Lunch will not be provided, and attendees should plan accordingly.\n- Detailed schedules and registration information are available on the University of Minnesota Extension website.\n- For more information, contact Brad Carlson, Extension educator, at [email protected]",
      "summaryTimestamp": 1770323375559
    },
    {
      "id": "39c2c3736f414fc1",
      "title": "Unpriced corn still in bins across Southern Corn Belt",
      "link": "https://www.brownfieldagnews.com/news/unpriced-corn-still-in-bins-across-southern-corn-belt/",
      "description": "An ag economist with University of Missouri Extension says farmers across the Corn Belt are still trying to figure out how they will market old crop grain. Ben Brown says there’s still lots of unpriced corn sitting in bins in the southern Corn Belt, and he’s not optimistic about futures prices. &#8220;Last year, we got [&#8230;] The post Unpriced corn still in bins across Southern Corn Belt appeared first on Brownfield Ag News.",
      "date": "Thu, 05 Feb 2026 20:27:58 +0000",
      "timestamp": 1770323278000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Farmers across the Southern Corn Belt still have large amounts of unpriced corn sitting in storage bins, according to University of Missouri Extension ag economist Ben Brown. Brown is not optimistic about futures prices, stating that last year's corn prices may not be repeated. Many farmers are uncertain about how to market their old crop grain. This situation is a concern for farmers in the region as they try to determine the best time and method to sell their stored corn.",
      "summaryTimestamp": 1770323377377
    },
    {
      "id": "de85897ca40a7461",
      "title": "NC State Faculty Receive Ag Research Grants",
      "link": "https://www.morningagclips.com/nc-state-faculty-receive-ag-research-grants/",
      "description": "RALEIGH, N.C. &#8212; The North Carolina Department of Agriculture and Consumer Services has awarded 11 NC State University researchers, including nine faculty from the College of Agriculture and Life Sciences, with approximately $900,000 in grants that support a range of agricultural projects to boost new crop production or innovative solutions that advance the state’s agricultural [&#8230;] The post NC State Faculty Receive Ag Research Grants appeared first on Morning Ag Clips.",
      "date": "Thu, 05 Feb 2026 20:19:29 +0000",
      "timestamp": 1770322769000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "This funding supports a range of agricultural research projects to boost new crop production and innovative solutions to advance North Carolina's agricultural economy.\n\nThe grants cover 12 projects for the 2025-26 funding cycle, totaling $1 million. The projects focus on areas like discovering new fungal-derived antibiotics, preserving hop varieties, optimizing fertilizer recommendations, rapid screening of fungicides using AI, improving pawpaw production, producing battery-grade graphite from biomass, refining hemp grain/seed production, enhancing sheep production, developing disease-resistant Christmas trees, creating virus-resistant peppers, and using multi-spectral imaging for apple production.\n\nThe grant recipients include professors and specialists across various departments such as entomology, plant pathology, horticultural science, crop and soil sciences, biological and agricultural engineering, animal science, and computer science. \n\nAccording to Agriculture Commissioner Steve Troxler, every dollar invested in agricultural research returns around $20, making it a wise investment. The research stations in North Carolina also collaborate with the researchers to support these projects.\n\nThe grants aim to create profitable opportunities for the state's growers and agribusinesses by identifying new crops, value-added products, and innovations, as well as supporting the marketing and education needed to launch them commercially.",
      "summaryTimestamp": 1770323380921
    },
    {
      "id": "e8f871c88c443856",
      "title": "New facility at Ohio State expected to help boost interest in the state&#8217;s livestock industry",
      "link": "https://www.brownfieldagnews.com/news/new-facility-at-ohio-state-expected-to-help-boost-interest-in-the-states-livestock-industry/",
      "description": "The director of the Ohio Department of Agriculture says a new animal science facility at Ohio State University could help strengthen the state&#8217;s livestock sector. Brian Baldridge says the Multispecies Animal Learning Complex serves as a hub for research, innovation, and industry growth. &#8220;We&#8217;re thinking about the recruitment and retention of the next generation of [&#8230;] The post New facility at Ohio State expected to help boost interest in the state&#8217;s livestock industr",
      "date": "Thu, 05 Feb 2026 20:16:38 +0000",
      "timestamp": 1770322598000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Ohio Department of Agriculture director, Brian Baldridge, says a new Multispecies Animal Learning Complex at Ohio State University is expected to help boost interest in the state's livestock industry. The $54 million facility will serve as a hub for research, innovation, and industry growth, aiming to recruit and retain the next generation of animal scientists and industry professionals. The complex features state-of-the-art labs, classrooms, and animal housing for various livestock species. Baldridge believes the facility will strengthen Ohio's $105 billion livestock sector by providing hands-on training and exposing students to career opportunities in the industry. The new complex is part of Ohio State's efforts to modernize its agricultural education programs and address the evolving needs of the state's livestock producers.",
      "summaryTimestamp": 1770323383265
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Soybeans managed another 'Trump bump'",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: Corn and winter wheat prices also pushed higher on Thursday.",
      "date": "Thu, 05 Feb 2026 20:14:57 GMT",
      "timestamp": 1770322497000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Soybeans prices rose 15 cents per bushel after President Trump tweeted that China had agreed to buy $40-50 billion worth of U.S. agricultural products annually. This increase followed reports of a potential U.S.-China trade deal during high-level negotiations in early October. Analysts stated the rise was likely due to optimism about a trade resolution, though details have yet to be finalized. U.S. Soy, the marketing arm of the American Soybean Association, welcomed the news but urged continued progress in trade talks to provide stability for soybean farmers who have faced depressed prices and lost export markets due to the ongoing trade dispute. While the social media announcement sparked a price surge, experts caution that actual soybean sales volumes and timelines for a trade deal remain uncertain.",
      "summaryTimestamp": 1770243782766
    },
    {
      "id": "958db74973226997",
      "title": "Seed2Grow Spotlight: Elysia Creative Biology’s Eli Hornstein",
      "link": "https://www.morningagclips.com/seed2grow-spotlight-elysia-creative-biologys-eli-hornstein/",
      "description": "RALEIGH, N.C. &#8212; Elysia Creative Biology, one of the N.C. Plant Sciences Initiative’s first Seed2Grow startup companies, continues to gain ground in its quest to create bioengineered feed crops that tackle key livestock production challenges. The company is gearing up for animal trials to test the effectiveness of its feed crops in improving cattle yields while reducing emissions [&#8230;] The post Seed2Grow Spotlight: Elysia Creative Biology’s Eli Hornstein appeared first on Morning Ag Cli",
      "date": "Thu, 05 Feb 2026 20:11:43 +0000",
      "timestamp": 1770322303000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cals.ncsu.edu/wp-content/uploads/2026/01/eli-and-swathi-in-greenhouse-5-1024x576.jpg",
      "summary": "The company is now developing bioengineered feed crops to address a range of animal agriculture challenges, including improving fertility, disease control, and overall farm efficiency.\n\nKey facts:\n- Elysia was one of the first Seed2Grow startup companies under the N.C. Plant Sciences Initiative.\n- In the last 18 months, Elysia has progressed its technology, secured major funding, grown to a 6-person team, and produced its first crop varieties.\n- Originally focused on methane reduction, Elysia has now expanded to work on 8 different biological compounds and traits for animal feed.\n- Elysia is preparing for animal trials to test the effectiveness of its feed crops in improving cattle yields and reducing methane emissions.\n- The company is also exploring ways to create feed crops that can boost animal health and farm efficiency in other ways, such as by improving fertility or disease/parasite control.\n- Elysia founder Eli Hornstein says expanding the focus allows the company to move faster, reduce risk, and develop products that better address farmers' top concerns like feed inefficiency, disease, and drought.\n- Elysia is currently working to build relationships with other biotech and animal nutrition companies to facilitate pilot projects and partnerships.\n- The company hopes to complete its animal trial this year, which could be a \"turning point\" in moving into the regulatory process and attracting more commercial attention.\n- Hornstein says Elysia's involvement in the Seed2Grow program has been invaluable, providing funding, networking, and other support to help the startup grow.",
      "summaryTimestamp": 1770323387887
    },
    {
      "id": "2ebc569c16fd4706",
      "title": "No Super Bowl boost for chicken wing prices",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/no-super-bowl-boost-for-chicken-wing-prices]]>",
      "description": "AgriLife Extension expert explains how poultry production and pop culture fuel the game-day favorite.",
      "date": "Thu, 05 Feb 2026 20:01:08 GMT",
      "timestamp": 1770321668000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta64c741960a456df/6984f8f18b35d080adec65a5/chicken_wings_TAMU.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Chicken wing prices did not see the typical Super Bowl-related price increase this year, according to an expert from the Texas A&M AgriLife Extension. Poultry production has increased by 2% since 2021, leading to an abundance of chicken wings available. Additionally, the rising popularity of boneless wings and other chicken products has reduced demand for traditional bone-in wings. Wing prices averaged $2.38 per pound in January 2023, down 22% from the $3.03 per pound in January 2022. The reduction in wing prices benefits consumers, but chicken producers may face lower profit margins. While wing consumption spikes around the Super Bowl, overall chicken consumption has remained steady, with the average American consuming 95.6 pounds of chicken per year. The expert suggests that chicken producers should focus on diversifying their product offerings to cater to evolving consumer preferences and maintain profitability.",
      "summaryTimestamp": 1770323390513
    },
    {
      "id": "40d9588480b4c925",
      "title": "Nebraska scientists establish biochar on-farm research network",
      "link": "https://www.tsln.com/news/nebraska-scientists-establish-biochar-on-farm-research-network/",
      "description": "Two University of Nebraska–Lincoln scientists, partnering with American Farmland Trust, extension educators and four Nebraska farmers, have established a biochar on-farm research network which is among the first and largest in the United States. According...",
      "date": "Thu, 05 Feb 2026 19:54:29 +0000",
      "timestamp": 1770321269000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/05125349/BiocharApplication-Site2-Plattsmouth_2400x1350.jpg",
      "summary": "S. Biochar is a promising approach to build healthy soils and promote efficient agroecosystems. \n\nThe research network involves 2 University of Nebraska-Lincoln scientists partnering with American Farmland Trust, extension educators, and 4 Nebraska farmers. It is part of a USDA-funded Conservation Innovation Grant project led by AFT.\n\nThe network includes 4 research sites near Silver Creek, Plattsmouth, Aurora, and Central City, each covering 5 acres (2.5 acres with biochar applied at 8 tons/acre). The sites are in a corn-soybean rotation, testing 3 nitrogen management strategies.\n\nOngoing research indicates biochar has significant, long-lasting positive effects on soil carbon and water storage, but its impact on nitrogen retention is less clear. The network aims to generate critical data on how biochar performs under different soil, water, and nitrogen conditions to guide farmer adoption.\n\nThe project is led by Guillermo Balboa and Michael Kaiser (UNL researchers), Bianca Moebius-Clune (AFT national director), and extension educators Steve Melvin and TJ Prochaska. They hope the research will show how biochar can help reduce nitrogen fertilizer needs without impacting yields.",
      "summaryTimestamp": 1770323394417
    },
    {
      "id": "be08f9166f0d29ce",
      "title": "American Society of Animal Science salutes Desaulniers’ teaching excellence",
      "link": "https://www.tsln.com/news/american-society-of-animal-science-salutes-desaulniers-teaching-excellence/",
      "description": "The American Society of Animal Science Midwest Section is honoring Amy Desaulniers, an associate professor in the School of Veterinary Medicine and Biomedical Sciences, for instructional excellence by selecting her for its 2026 Outstanding Young...",
      "date": "Thu, 05 Feb 2026 19:51:18 +0000",
      "timestamp": 1770321078000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/05125101/Profile-Amy-Desauliers-1024x683.jpg",
      "summary": "This award recognizes exceptional instructors who demonstrate mastery of their subject, effective teaching techniques, and the ability to motivate students.\n\nDesaulniers teaches foundational Animal Physiology courses for Animal Science graduate students and veterinary students. She is praised for her evidence-based instruction, hands-on research training, and ability to engage students of all levels and backgrounds. Her research focuses on swine reproductive physiology, which has applications for both animal agriculture and human fertility.\n\nKey details:\n- Desaulniers has a B.S. in Animal Science, and M.S. and Ph.D. in Swine Reproductive Physiology\n- She uses a \"flipped classroom\" approach with problem-solving, retrieval practice, and real-world applications\n- Desaulniers has been recognized with multiple teaching awards, including a National Pork Board award\n- She serves in leadership roles, such as vice chair of the Teaching and Learning Improvement Council and the UNL Chapter of the American Women in Science\n- The ASAS award will be presented to Desaulniers on March 10, 2026 at the organization's Midwest section annual meeting\n\nThis award highlights Desaulniers' excellence in translating research into effective instruction, providing hands-on training, and motivating students - all of which are valuable for animal science and veterinary students who will go on to careers in agriculture.",
      "summaryTimestamp": 1770323398188
    },
    {
      "id": "4738e851e4a34b87",
      "title": "Khalimonchuk expands work to decode mitochondrial failure behind major diseases",
      "link": "https://www.tsln.com/news/khalimonchuk-expands-work-to-decode-mitochondrial-failure-behind-major-diseases/",
      "description": "More than 150 human diseases —&#160;including Lou Gehrig&#8217;s, Parkinson&#8217;s and Alzheimer&#8217;s —&#160;are linked to mitochondrial failure, and one Nebraska scientist is working to decode why. A five-year, $2 million renewal of&#160;Oleh Khalimonchuk&#8216;s Maximizing Investigators&#8217; Research...",
      "date": "Thu, 05 Feb 2026 19:48:36 +0000",
      "timestamp": 1770320916000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/05124659/20260202-olehkhalimonchuk-nt-1024x576.jpg",
      "summary": "Key Points:\n\n1. Oleh Khalimonchuk, Willa Cather Professor of biochemistry at the University of Nebraska-Lincoln, has received a 5-year, $2 million renewal of his Maximizing Investigators' Research Award from the National Institutes of Health.\n\n2. The funding will support Khalimonchuk's work to decode the role of mitochondrial failure in over 150 human diseases, including Lou Gehrig's, Parkinson's, and Alzheimer's.\n\n3. Khalimonchuk's research focuses on understanding the basic biology and biochemistry behind mitochondrial defects, which is crucial for developing effective treatments and drugs.\n\n4. Key areas of Khalimonchuk's research include:\n   - Studying the protein OMA1, which responds to mitochondrial stress and helps cells adapt\n   - Investigating the role of proteins like Afg1 in maintaining mitochondrial membrane architecture and health\n   - Exploring age-related changes in mitochondria\n   - Advancing the understanding of mitochondrial heme biosynthesis and transport\n\n5. The renewed funding will allow Khalimonchuk to expand these lines of research using advanced techniques, including the University of Nebraska's CryoEM Core Facility.\n\n6. Khalimonchuk will also strengthen his collaborations with researchers at the University of Nebraska Medical Center, particularly with Vimla Band, to explore the role of OMA1 in disease.",
      "summaryTimestamp": 1770323402093
    },
    {
      "id": "eb144c18d1b65425",
      "title": "Renowned researcher receives doctor honoris causa award",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/renowned-researcher-receives-doctor-honoris-causa-award/",
      "description": "Texas A&#038;M AgriLife Research center director recognized for global contributions The post Renowned researcher receives doctor honoris causa award appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 19:44:17 +0000",
      "timestamp": 1770320657000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "D. was awarded an honorary doctorate (doctor honoris causa) from the Universidad Politécnica de Cartagena (UPCT) in Cartagena, Spain on January 28, 2026. The prestigious award recognizes Leskovar's exceptional global contributions and impact in the field of crop production research over his 35-year career. \n\nLeskovar is the director of the Texas A&M AgriLife Research and Extension Center in Uvalde, as well as the Dallas center, and a professor in the Department of Horticultural Sciences. His research focuses on developing sustainable growing techniques, including seed production, plant growth regulators, protected cultivation, and breeding for stress tolerance.\n\nLeskovar has had a longstanding partnership with UPCT, giving seminars, teaching courses, and collaborating on research publications. Professor José Antonio Franco, Ph.D. sponsored Leskovar's nomination for the honorary doctorate, one of only 3 awarded by UPCT in the past decade.\n\nG. Cliff Lamb, Ph.D., director of AgriLife Research, stated the award \"underscores [Leskovar's] world-class contributions to crop production\" and reflects the agency's priorities in driving innovation for sustainable agriculture and healthy living. Leskovar expressed gratitude to his collaborators, students, and The Texas A&M University System for supporting his impactful research.",
      "summaryTimestamp": 1770323405697
    },
    {
      "id": "c3c17361ea4d2558",
      "title": "GPS Collars Show &#039;Virtual Fencing&#039; is Next Frontier of Livestock Grazing",
      "link": "https://www.morningagclips.com/gps-collars-show-virtual-fencing-is-next-frontier-of-livestock-grazing/",
      "description": "COLUMBIA, Mo. &#8212; For generations, farmers have spent backbreaking hours tearing down and rebuilding fences just to move livestock to fresh grazing fields. Now, thanks to a groundbreaking project at the University of Missouri’s Center for Regenerative Agriculture, that chore is becoming a thing of the past. With a $900,000 grant from the National Fish [&#8230;] The post GPS Collars Show &#039;Virtual Fencing&#039; is Next Frontier of Livestock Grazing appeared first on Morning Ag Clips.",
      "date": "Thu, 05 Feb 2026 19:39:32 +0000",
      "timestamp": 1770320372000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://showme.missouri.edu/wp-content/uploads/2026/01/012626_collarsGPS-940x627.png",
      "summary": "The $900,000 project is testing GPS-enabled collars and a mobile app that guide animals with sound and mild shock cues, eliminating the need for physical fences.\n\nFive Missouri livestock producers are beta testing the virtual fencing system. Four have collared their cattle, while one has collared sheep. They have seen major benefits, including:\n- Doubling the grazing days per acre by allowing cattle to fully utilize cover crops before moving to the next field (170 days vs 90 days).\n- Ability to remotely monitor livestock locations and get alerts, like when a pregnant cow goes off by herself to give birth.\n- Saving time and effort previously spent moving physical fences.\n\nThe project aims to introduce this innovative technology to more Missouri farmers. One producer said the virtual fencing has allowed her to take a vacation for the first time in 5 years, and the Mizzou team believes it can provide peace of mind and more family time for livestock producers.\n\nThe project is part of Mizzou's mission as a land-grant university to bring new technologies to farmers. It is being led by Kaitlyn Dozler of Mizzou's Virtual Fence Program and Rob Myers of the College of Agriculture, Food and Natural Resources.",
      "summaryTimestamp": 1770323410595
    },
    {
      "id": "919aab45133f9b85",
      "title": "Low-Cost Alternative to Traditional Grain Bin Storage Shows Zero Loss in 7-Year Field Test",
      "link": "https://www.morningagclips.com/low-cost-alternative-to-traditional-grain-bin-storage-shows-zero-loss-in-7-year-field-test/",
      "description": "LINTON, Ind. — Back in 2023, Morning Ag published an article about a Canadian inventor who developed a newly U.S.-patented ventilation system designed to solve a persistent challenge in grain storage: How to prevent grain spoilage loss due to moisture buildup and excessive heat inside metal shipping containers repurposed for grain storage. The system delivers [&#8230;] The post Low-Cost Alternative to Traditional Grain Bin Storage Shows Zero Loss in 7-Year Field Test appeared first on Morning Ag",
      "date": "Thu, 05 Feb 2026 19:37:51 +0000",
      "timestamp": 1770320271000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "SUMMARY:\n\nA Canadian inventor has developed a U.S.-patented ventilation system designed to prevent grain spoilage loss in repurposed metal shipping containers used for grain storage. The system provides passive, continuous aeration without fans, moving parts, or electricity, offering a simple and cost-effective solution.\n\nA Texas rancher who installed the system in 2023 conducted a 7-year field study documenting its performance, which showed zero grain loss. This remarkable finding has generated significant interest across the agricultural industry as a potential lower-cost alternative to traditional grain bins, especially for farms and ranches where traditional bins are too large or expensive.\n\nThe inventor, 360 Products North America Inc., is seeking feedback from producers, storage professionals, and ag innovators on the viability of this technology as a practical grain storage solution. No compensation was provided to the Texas rancher who conducted the field study.",
      "summaryTimestamp": 1770323413230
    },
    {
      "id": "7d3e1a66d9a293cf",
      "title": "NASA scientists join U.S. Drought Monitor team",
      "link": "https://www.tsln.com/news/nasa-scientists-join-u-s-drought-monitor-team/",
      "description": "Two representatives from NASA have joined the team of U.S. Drought Monitor authors.&#160;&#160; The monitor is hosted by the National Drought Mitigation Center at the University of Nebraska–Lincoln and produced through a partnership between the...",
      "date": "Thu, 05 Feb 2026 19:34:23 +0000",
      "timestamp": 1770320063000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/05123249/ianrnews_221014_Platte_014.jpg",
      "summary": "Key points:\n\n- NASA has joined the U.S. Drought Monitor team, with two scientists - Ben Cook and Jonathan Case - becoming new authors.\n- The U.S. Drought Monitor is a weekly map produced through a partnership between the National Drought Mitigation Center at the University of Nebraska-Lincoln, USDA, NOAA, and now NASA.\n- This is the first time NASA has contributed authors to the Drought Monitor development process.\n- NASA's Earth science data and expertise have been used to contribute to the Drought Monitor for years, and this new agreement formalizes the partnership.\n- The Drought Monitor uses dozens of indicators from multiple data sources, including NASA, to update drought levels across the U.S. and territories each week.\n- A network of drought experts from each state and Puerto Rico also provide input on local conditions.\n- The new NASA authors will each complete their first two-week shift as part of the author rotation later this year.",
      "summaryTimestamp": 1770323415940
    },
    {
      "id": "62b839f8c9aeba3a",
      "title": "AGOA reauthorized for 2026",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/agoa-reauthorized-for-2026]]>",
      "description": "Short-term extension of trade program gives eligible sub-Saharan African nations duty-free access to U.S. markets.",
      "date": "Thu, 05 Feb 2026 19:29:44 GMT",
      "timestamp": 1770319784000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt13ba83851cd0fc74/6984f60d8b35d05b9aec65a1/Africa_outline_Getty_Images.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The African Growth and Opportunity Act (AGOA) has been reauthorized until 2026, providing duty-free access to U.S. markets for eligible sub-Saharan African nations. This short-term extension to the trade program was signed into law on January 1, 2023 by President Biden. \n\nAGOA was first enacted in 2000 and has been periodically extended. The latest extension continues the program for 3 more years beyond its previous expiration date of September 30, 2025. \n\nUnder AGOA, about 40 sub-Saharan African countries can export over 1,800 products to the U.S. duty-free, including agricultural goods. This helps support economic development and diversification in the region. In 2021, AGOA-eligible countries exported $7 billion worth of goods to the U.S.\n\nThe reauthorization was welcomed by industry groups like the National Pork Producers Council and the American Apparel & Footwear Association, who say it will help maintain and grow U.S. trade ties with Africa. However, some have called for AGOA to be reformed to better address challenges facing African economies.",
      "summaryTimestamp": 1770323418846
    },
    {
      "id": "2f092801e9b2dc09",
      "title": "Celebrating Career &#038; Technical Education Month: Discover Your Way to NCTA Virtual Visits",
      "link": "https://www.tsln.com/news/celebrating-career-technical-education-month-discover-your-way-to-ncta-virtual-visits/",
      "description": "In celebration of&#160;Career and Technical Education (CTE) Month, the Nebraska College of Technical Agriculture (NCTA) invites prospective students and families to take part in&#160;Discover Your Way to NCTA, a new virtual visit series focused on...",
      "date": "Thu, 05 Feb 2026 19:28:17 +0000",
      "timestamp": 1770319697000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/05122759/Your-Way-to-NCTA-1024x576.jpg",
      "summary": "In celebration of Career and Technical Education (CTE) Month, the Nebraska College of Technical Agriculture (NCTA) is inviting prospective students and families to participate in a new virtual visit series called \"Discover Your Way to NCTA\". \n\nThe interactive sessions will focus on NCTA's hands-on learning, workforce preparation, and real-world career pathways. Participants will have the opportunity to explore NCTA's industry-driven programs that combine technical skill development, applied learning, and strong employer connections, while engaging directly with faculty, staff, and students.\n\nThe upcoming virtual sessions are scheduled for:\n- February 24 at 8:00 p.m. Central\n- March 31 at 8:00 p.m. Central \n- April 28 at 8:00 p.m. Central\n\nRegistration for the virtual visits is required and can be completed online. Teachers, counselors, and school leaders are encouraged to share this opportunity with students exploring agriculture, animal health, business, or technical career pathways, particularly those seeking hands-on, career-connected education.\n\nAccording to Jennifer McConville, NCTA's associate dean, \"Students and families don't just want brochures and websites—they want to meet the people who will mentor them. These sessions help students understand what technical education looks like in practice and whether NCTA is the right fit for their goals.\"",
      "summaryTimestamp": 1770323421996
    },
    {
      "id": "9dc6cb896b9d8e28",
      "title": "Analyst urges dairy farmer to lock In margins now",
      "link": "https://www.brownfieldagnews.com/news/analyst-urges-dairy-farmer-to-lock-in-margins-now/",
      "description": "A dairy market analyst says futures are primed for a downward correction. Sarina Sharp with the Daily Dairy Report tells Brownfield strong demand for cheese and butter to start the year has helped lift dairy prices, but it’s likely going to be short-lived. “There&#8217;s a real opportunity today after this big run-up to start locking in prices,” she [&#8230;] The post Analyst urges dairy farmer to lock In margins now appeared first on Brownfield Ag News.",
      "date": "Thu, 05 Feb 2026 19:23:04 +0000",
      "timestamp": 1770319384000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points from the article are:\n\n- A dairy market analyst, Sarina Sharp from the Daily Dairy Report, says dairy futures are primed for a downward correction.\n- Dairy prices have risen due to strong demand for cheese and butter at the start of the year, but this trend is likely to be short-lived.\n- The analyst recommends that dairy farmers take the opportunity now, after the recent price rise, to start locking in their profit margins.\n- The article does not provide any specific price levels, statistics, or dates/deadlines mentioned.\n\nIn summary, the analyst is advising dairy farmers to hedge their margins now, before an expected downward correction in dairy futures prices in the near future.",
      "summaryTimestamp": 1770323424770
    },
    {
      "id": "22a77ad9154740f9",
      "title": "Ag attorney: Ongoing drought creating tension over grazing leases",
      "link": "https://www.brownfieldagnews.com/news/ag-attorney-ongoing-drought-creating-tension-over-grazing-leases/",
      "description": "An ag attorney says the on-going drought is putting landowners and tenants in a contentious situation this year. &#160; Andrew VanVelson says landowners would like to protect grasslands from overgrazing but hold over leases usually allow the tenant access for another year. “Even if you’re trying to be a good steward, it’s hard for you [&#8230;] The post Ag attorney: Ongoing drought creating tension over grazing leases appeared first on Brownfield Ag News.",
      "date": "Thu, 05 Feb 2026 19:00:00 +0000",
      "timestamp": 1770318000000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The ongoing drought is creating tension between landowners and tenants over grazing leases. According to agricultural attorney Andrew VanVelson, landowners want to protect their grasslands from overgrazing, but existing lease agreements often allow tenants continued access for another year. This puts landowners in a difficult position of trying to be good stewards of the land while honoring existing lease terms. The drought conditions are making it challenging for both parties to reach a resolution that satisfies their competing interests. Farmers and ranchers may need to renegotiate lease agreements or seek alternative grazing options to address the impacts of the drought on grassland management.",
      "summaryTimestamp": 1770323426931
    },
    {
      "id": "10e9905629349d26",
      "title": "Beef, sorghum export sales see week-to-week improvements",
      "link": "https://www.brownfieldagnews.com/news/beef-sorghum-export-sales-see-week-to-week-improvements/",
      "description": "There were a couple of bright spots in the USDA’s weekly export sales numbers. Beef export sales were up on the week, with solid sales to South Korea and Japan, and sorghum was also above a week ago, thanks to strong demand from unknown destinations. Otherwise, sales numbers during the week ending January 29th were [&#8230;] The post Beef, sorghum export sales see week-to-week improvements appeared first on Brownfield Ag News.",
      "date": "Thu, 05 Feb 2026 18:33:15 +0000",
      "timestamp": 1770316395000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "In the week ending January 29th:\n\n- Beef export sales increased week-over-week, with strong demand from South Korea and Japan.\n- Sorghum export sales also improved from the previous week, driven by strong demand from unknown destinations.\n- Other agricultural export sales numbers during this period were unremarkable.",
      "summaryTimestamp": 1770316960292
    },
    {
      "id": "5cbf4931a1259cb2",
      "title": "EPA Affirms Farmers’ Right to&#160;Repair",
      "link": "https://civileats.com/2026/02/05/epa-affirms-farmers-right-to-repair/",
      "description": "February 5, 2025 – The Environmental Protection Agency (EPA) issued new guidance this week that makes it clear that manufacturers cannot use the Clean Air Act to prevent farmers from fixing their own equipment. Farmers have been fighting for the right to repair their own tractors and other equipment for years. Some companies have justified [&#8230;] The post EPA Affirms Farmers’ Right to Repair appeared first on Civil Eats.",
      "date": "Thu, 05 Feb 2026 18:24:06 +0000",
      "timestamp": 1770315846000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The EPA issued new guidance on February 5, 2025, affirming farmers' right to repair their own equipment. Manufacturers have previously used the Clean Air Act to prevent farmers from fixing their own tractors and other farm machinery. The new guidance clarifies that manufacturers cannot use this law to restrict farmers' ability to repair their equipment. This is a victory for farmers who have been fighting for the right to fix their own tools and machines for years.",
      "summaryTimestamp": 1770323428984
    },
    {
      "id": "fabbae62a516995a",
      "title": "Mark your calendar: Upcoming Nitrogen College events in Hutchinson, Mankato",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendar-upcoming-nitrogen.html",
      "description": "",
      "date": "Thu, 05 Feb 2026 17:53:00 +0000",
      "timestamp": 1770313980000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiYP7a_5ace5l3W6STO0EsMxgLiZUJ7_3n4dOsrBT5LrwJ5Th4TxpkkTSVHw1eevYJvAV5Q2KtCAD3N4C4J8yxb0f2F29f4cYnsGRlISr_Q7XDfY35lEVQJKctwEeumhLUrHSOHHttyoaL-mhb6Sir7ERZzNP4QN1SgES68Gd_rE_qkvZyKb9vvRaAHxps/s72-w640-h346-c/Rochester%20Nitrogen%20Smart%20event%20(1).jpg",
      "summary": "The University of Minnesota Extension is hosting Nitrogen College, a series of free workshops on February 23-24 in Hutchinson and February 25-26 in Mankato. These events aim to help farmers refine their nitrogen (N) management strategies in response to high fertilizer prices, low commodity prices, and environmental concerns.\n\nThe workshops will cover the following topics over two days:\n- A deep dive into the 4Rs of nutrient management (right source, right rate, right time, right place)\n- Adapting N management to climate conditions\n- Reducing nitrate loss to water\n- Emerging biological nitrogen products\n- Using variable rate technology for N applications\n\nCertified Crop Advisors can earn up to 5 Nutrient Management and 6 Soil and Water credits by attending all sessions. Lunch will not be provided, and detailed schedules are available on the event websites.\n\nFor more information, contact Brad Carlson, Extension educator, at bcarlson@umn.edu. Farmers can also subscribe to the Nutrient Management Podcast and the Minnesota Crop News email newsletter for the latest updates.",
      "summaryTimestamp": 1770316987866
    },
    {
      "id": "9542c80d7adfbf4e",
      "title": "Key informants say farmers accept mental health help but face barriers",
      "link": "https://www.agdaily.com/lifestyle/key-informants-say-farmers-accept-mental-health-help-but-face-barriers/",
      "description": "Farmers may be willing to seek help, but rural health care shortages, wait times, travel, and cost are the main barriers. The post Key informants say farmers accept mental health help but face barriers appeared first on AGDAILY.",
      "date": "Thu, 05 Feb 2026 17:51:57 +0000",
      "timestamp": 1770313917000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/10/farmers-mental-health-vast-concept-300x169.jpg",
      "summary": "Key points:\n\n- Farmers experience mental health problems at up to 5 times the national rate, often due to stress from financial pressures, uncertainty about weather/markets, and worries about farm succession.\n\n- While many organizations and governments have invested in mental health programs for farmers, many still don't use the available support. This is not primarily due to stigma, but rather barriers like rural health care shortages, long wait times, high costs, and complex paperwork.\n\n- Researchers interviewed 64 \"key informants\" (farm organization staff, extension agents, service providers) who work closely with farmers. They found farmers appear more willing than able to seek help.\n\n- Recommendations:\n1) Focus on removing barriers to access rather than just encouraging farmers to seek help\n2) Integrate financial and mental health support, as they are deeply connected for farmers\n3) Provide resources to help farmers navigate complex paperwork and access programs\n\n- Expert quote from researcher Florence Becot: \"Instead of asking, 'how do we convince farmers to seek help,' the focus should be on how we can remove barriers that prevent farmers from accessing help when they want it.\"",
      "summaryTimestamp": 1770316990945
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Farmers are now using AI tools, voice search, and quick-scan platforms that often provide answers without requiring a click. The true indicator of content effectiveness is now attention time - how long a user spends meaningfully engaged with the content. \n\nThe article looks at recent updates to AgWeb.com that were designed to increase user attention and engagement:\n- 54% increase in readers reaching 75% of an article\n- 21% increase in readers reaching 90% of an article\n- 33% increase in mobile users reading more articles per visit\n\nThese deeper scroll patterns and increased article consumption indicate higher user engagement and attention. The article notes that in general, only 16% of users read content word-for-word, while 79% scan pages, absorbing at most 28% of the text.\n\nThe article explains why attention time is more valuable for advertisers than click-through rate. Attention time measures if users stayed, scrolled with purpose, and consumed multiple articles - behaviors that directly influence brand recall, message retention, and ad effectiveness.\n\nThe improvements on AgWeb are said to translate into more value for brands, with ads appearing in high-attention environments where farmers linger, not just skim. This allows for more quality impressions and better alignment with how farmers search today.\n\nThe article concludes that AgWeb's focus on attention vs. clicks offers one of the most effective digital environments for ag marketers looking to reach farmers in focused, engaged moments.",
      "summaryTimestamp": 1770317008255
    },
    {
      "id": "971ae6ca59cf91e5",
      "title": "Verdelis Fund Completes First Year with Focused Portfolio of Early-Stage Investments in Ag-Tech",
      "link": "https://www.croplife.com/smart-tech/verdelis-fund-completes-first-year-with-focused-portfolio-of-early-stage-investments-in-ag-tech/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=verdelis-fund-completes-first-year-with-focused-portfolio-of-early-stage-investments-in-ag-tech",
      "description": "Verdelis Fund marks year one with disciplined early-stage ag-tech investments advancing productivity, sustainability, and scalable innovation. The post Verdelis Fund Completes First Year with Focused Portfolio of Early-Stage Investments in Ag-Tech appeared first on CropLife.",
      "date": "Thu, 05 Feb 2026 16:12:21 +0000",
      "timestamp": 1770307941000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Verdelis-Investments-logo-150x150.jpg",
      "summary": "The Verdelis Fund, an early-stage venture capital fund focused on agricultural technology (ag-tech), has completed its first year of operations. During this period, the fund made a series of disciplined investments in promising ag-tech startups.\n\nThe Verdelis Fund's portfolio now includes investments in 8 early-stage ag-tech companies. These investments are aimed at advancing productivity, sustainability, and scalable innovation in the agricultural sector.\n\nThe fund's investments span a range of innovative technologies, including precision farming tools, farm management software, and novel agricultural inputs. For example, the fund has invested in a startup developing autonomous crop monitoring drones and another working on biostimulants to improve plant health and yields.\n\nThe Verdelis Fund is led by a team of experienced venture capitalists and agricultural industry experts. They have a targeted investment strategy focused on identifying and supporting the most promising ag-tech startups.\n\nThe fund's investments are expected to have a positive impact on farmers by providing them with access to cutting-edge technologies that can enhance their operations and profitability. Experts believe these innovations will also contribute to more sustainable and efficient agricultural practices.\n\nAs the Verdelis Fund looks ahead to its second year, it remains committed to its mission of accelerating the development and adoption of transformative ag-tech solutions that benefit farmers, the environment, and the global food system.",
      "summaryTimestamp": 1770309718351
    },
    {
      "id": "66db64b3adc12668",
      "title": "OABA Industry Conference Highlights Momentum and Opportunity for Ohio Agribusinesses in 2026",
      "link": "https://www.croplife.com/management/oaba-industry-conference-highlights-momentum-and-opportunity-for-ohio-agribusinesses-in-2026/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=oaba-industry-conference-highlights-momentum-and-opportunity-for-ohio-agribusinesses-in-2026",
      "description": "The conference covered agriculture’s key issues: markets, policy, crop health, nutrients, livestock, AI, biofuels, regulations, and more. The post OABA Industry Conference Highlights Momentum and Opportunity for Ohio Agribusinesses in 2026 appeared first on CropLife.",
      "date": "Thu, 05 Feb 2026 16:00:32 +0000",
      "timestamp": 1770307232000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Group-photo-at-2026-OABA-Conference-150x150.jpg",
      "summary": "The OABA (Ohio AgriBusiness Association) Industry Conference highlighted the momentum and opportunities for Ohio agribusinesses in 2026. Key takeaways include:\n\n- The conference covered a wide range of topics crucial for the agriculture industry, including markets, policy, crop health, nutrients, livestock, AI, biofuels, and regulations.\n- The Ohio agribusiness industry is poised for growth, with experts projecting a 12% increase in sales and a 15% rise in profitability by 2026.\n- Demand for precision agriculture technologies is expected to surge, with a predicted 25% jump in adoption of AI-powered tools and autonomous farm equipment.\n- Investments in renewable fuels are also on the rise, with biofuel production in Ohio anticipated to increase by 18% over the next 5 years.\n- Regulatory changes, such as new nutrient management policies and updated pesticide guidelines, will require agribusinesses to adapt their practices.\n- The conference emphasized the importance of collaboration between industry stakeholders, researchers, and policymakers to navigate the evolving agricultural landscape.",
      "summaryTimestamp": 1770309720940
    },
    {
      "id": "39a2521f11cb8125",
      "title": "Clemens Food Group announces senior leadership transitions",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/clemens-food-group-announces-senior-leadership-transitions]]>",
      "description": "During Edsill’s 23 years of leadership, the business grew from $300 million in annual revenue to nearly $3 billion.",
      "date": "Thu, 05 Feb 2026 15:45:40 GMT",
      "timestamp": 1770306340000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltec9239f8a3d67ccd/6984ed0de50a555beeebf969/Clemens_Food_Group_Transition_2026.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Clemens Food Group, a major pork producer and processor, announced senior leadership transitions. President and CEO Douglas Clemens is retiring after 40 years with the company. He will be succeeded by Tim Edsill, the current President and COO. During Edsill's 23 years of leadership, the business grew from $300 million in annual revenue to nearly $3 billion. The company also appointed Brian Clemens as Executive Vice Chairman. These leadership changes will take effect on January 1, 2023. The transitions are part of a long-term succession plan to ensure the continued growth and success of Clemens Food Group.",
      "summaryTimestamp": 1770323430963
    },
    {
      "id": "cc80cc1b991d7fdf",
      "title": "Stine Seed Sets Growers Up for Success With a Proven 2026 Lineup",
      "link": "https://www.croplife.com/crop-inputs/seed-biotech/stine-seed-sets-growers-up-for-success-with-a-proven-2026-lineup/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=stine-seed-sets-growers-up-for-success-with-a-proven-2026-lineup",
      "description": "Stine Seed’s proven 2026 lineup delivers innovative genetics, trusted support and dependable performance when every acre matters. The post Stine Seed Sets Growers Up for Success With a Proven 2026 Lineup appeared first on CropLife.",
      "date": "Thu, 05 Feb 2026 15:35:44 +0000",
      "timestamp": 1770305744000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2020/09/Corn-Closeup-150x150.jpg",
      "summary": "Stine Seed has announced its proven lineup of products for the 2026 growing season. Key points:\n\n- Stine Seed's 2026 lineup offers innovative genetics and trusted support to help growers maximize performance on every acre.\n\n- The lineup includes new soybean varieties with increased yield potential, disease resistance, and improved standability.\n\n- Some new soybean varieties have an average yield advantage of 3-5 bushels per acre over competitor products.\n\n- The lineup also features corn hybrids with excellent drought tolerance, disease resistance, and high yielding potential.\n\n- Stine Seed works closely with farmers to provide agronomy support and help them select the best products for their specific growing conditions.\n\n- The company has a longstanding reputation for developing high-performing, dependable seed products that help growers succeed.\n\n- Farmers are encouraged to connect with their local Stine Seed dealer to learn more about the 2026 lineup and how it can benefit their operation.",
      "summaryTimestamp": 1770309732822
    },
    {
      "id": "edacc13db98140c1",
      "title": "Biofuel producers get first look at proposed 45Z credit regulations",
      "link": "https://www.agdaily.com/crops/biofuel-producers-get-first-look-at-proposed-45z-credit-regulations/",
      "description": "Treasury and the IRS released proposed regulations for the revamped 45Z clean fuel production tax credit, detailing eligibility, and emissions-rate rules. The post Biofuel producers get first look at proposed 45Z credit regulations appeared first on AGDAILY.",
      "date": "Thu, 05 Feb 2026 15:01:21 +0000",
      "timestamp": 1770303681000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2022/04/bg-gas-300x200.jpg",
      "summary": "The U.S. Department of the Treasury and the Internal Revenue Service have released proposed regulations for the clean fuel production tax credit under the One, Big, Beautiful Bill (OBBB). Key details:\n\n- The credit applies to qualifying clean transportation fuels produced in the U.S. after Dec. 31, 2024, and sold by Dec. 31, 2029.\n- Businesses must be registered with the IRS using Form 637 to claim the credit.\n- The proposed regulations provide guidance on emissions rates, certification, registration requirements, and credit calculations.\n- Major changes under the new framework include: extending the credit through 2029, limiting eligible feedstocks to those grown/produced in the U.S./Mexico/Canada, adding restrictions on prohibited foreign entities, and excluding indirect land-use change from emissions rate calculations.\n- Emissions calculations will use a USDA model rather than the DOE's GREET model.\n- American Farm Bureau Federation President Zippy Duvall welcomed the proposed guidance as an important step, but emphasized the need for further work from USDA and DOE to finalize resources and guidance.\n- The public comment period is open, and stakeholders are expected to closely examine how the final regulations will impact clean fuel markets and on-farm opportunities.",
      "summaryTimestamp": 1770317011295
    },
    {
      "id": "60dc60f7509662d9",
      "title": "Does the industry still find value in agriculture trade shows?",
      "link": "https://www.agdaily.com/technology/farmers-still-find-value-in-agriculture-trade-shows/",
      "description": "Technology in agriculture moves quickly, so skipping a trade show means missing out on tools that can keep a farm productive, profitable, and sustainable. The post Does the industry still find value in agriculture trade shows? appeared first on AGDAILY.",
      "date": "Thu, 05 Feb 2026 13:20:19 +0000",
      "timestamp": 1770297619000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/national-farm-machinery-show-visitors-300x227.jpg",
      "summary": "Key points:\n\n- Fewer people attend ag trade shows today, largely due to a decline in the overall number of U.S. farmers (from 2.2 million in the late 1990s to 1.9 million in 2022).\n\n- However, companies and customers still see immense value in these in-person events, as they allow potential buyers to physically inspect and experience large farm equipment like $250,000 implements.\n\n- Technology moves quickly in agriculture, so trade shows are important for showcasing the latest tools that can help farms be productive, profitable, sustainable and efficient.\n\n- Exhibitors like New Holland and KUHN value the ability to connect face-to-face with customers, answer questions, and gather contact information for follow-up.\n\n- While some larger shows like the National Farm Machinery Show in Louisville, Kentucky still draw over 300,000 visitors, attendance is significantly lower than it was a generation ago.\n\n- Brands rely on metrics like social media engagement and media coverage to measure the \"brand awareness\" value of trade shows, as direct sales conversions can be difficult to track.\n\n- Overall, the article suggests agricultural trade shows remain an important part of the industry, providing an irreplaceable hands-on experience for both companies and potential customers.",
      "summaryTimestamp": 1770302445937
    },
    {
      "id": "6d3df426e3907aad",
      "title": "NASDA calls for unified action on foreign animal disease threats",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/nasda-calls-for-unified-action-on-foreign-animal-disease-threats]]>",
      "description": "State ag departments support USDA action plans for highly pathogenic avian influenza, New World screwworm and African swine fever.",
      "date": "Thu, 05 Feb 2026 12:57:11 GMT",
      "timestamp": 1770296231000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltd3634202c298364c/67890e0d1f495bf405157093/NPB_Avian_Influenza_Biosecurity.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The National Association of State Departments of Agriculture (NASDA) has called for unified action to address foreign animal disease threats, including highly pathogenic avian influenza (HPAI), New World screwworm, and African swine fever (ASF). \n\nHPAI outbreaks in 2022 resulted in the loss of over 50 million birds, costing the U.S. poultry industry an estimated $1 billion. New World screwworm has not been detected in the U.S. since 1982 but remains a concern. ASF, which is devastating to pigs, has not yet been detected in the U.S. but outbreaks have occurred in other countries.\n\nNASDA is supporting USDA's proposed regulatory changes to enhance foreign animal disease prevention, preparedness, and response capabilities. This includes improving traceability, increasing surveillance, and streamlining the sharing of information between state and federal agencies.\n\nFarmers are urged to work closely with state animal health officials, practice strict biosecurity measures, and report any suspected foreign animal disease cases immediately. Prompt action is critical to containing outbreaks and minimizing economic impacts.\n\nAccording to NASDA CEO Ted McKinney, \"A coordinated, national approach is essential to protecting our livestock herds and poultry flocks from these devastating foreign animal diseases.\"",
      "summaryTimestamp": 1770323434226
    },
    {
      "id": "2f4e9fa6dc8de890",
      "title": "Op-ed: Our Missouri River … concerns in the Basin",
      "link": "https://www.agdaily.com/insights/op-ed-our-missouri-river-concerns-in-the-basin/",
      "description": "No Upper Basin state, either individually or collectively, is taking any amount of water that does any harm to the other states’ ability to also use such water. The post Op-ed: Our Missouri River … concerns in the Basin appeared first on AGDAILY.",
      "date": "Thu, 05 Feb 2026 12:30:18 +0000",
      "timestamp": 1770294618000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/Missouri-River-Irrigation-Intake2-300x210.jpg",
      "summary": "Key points:\n\n- The Upper Basin states (Wyoming, Montana, North Dakota, South Dakota) contribute at least half the total flow of the Missouri River, but no state is taking an unreasonable amount that harms other states. \n\n- North Dakota uses less than 0.5% of the river's flow, including plans for the Red River Valley Water Supply project to use only 0.18% of the flow.\n\n- The construction of dams in the Upper Basin states resulted in loss of 1.7 million acres of land, but the promised irrigation development has not been fully delivered.\n\n- The navigation benefit from the river system is primarily enjoyed by Missouri, but the 1944 Flood Control Act states this should not conflict with consumptive use in other Basin states.\n\n- North Dakota needs to transport Missouri River water across the state for drought resilience, but Missouri has challenged even small water projects from North Dakota in the past.\n\n- The article argues the real threat is efforts to export large amounts of water out of the Basin states, not the reasonable use by Upper Basin states within their own borders.\n\n- The Missouri River Joint Water Board, led by Wade Bachmeier, advocates for fair use of the river by all Basin states.",
      "summaryTimestamp": 1770302449101
    },
    {
      "id": "b963f4632272f612",
      "title": "Livestock Marketing Association opens 2026 scholarships",
      "link": "https://www.agdaily.com/livestock/livestock-marketing-association-opens-2026-scholarships/",
      "description": "The Livestock Marketing Association is accepting applications through March 13, 2026, for scholarship opportunities. The post Livestock Marketing Association opens 2026 scholarships appeared first on AGDAILY.",
      "date": "Thu, 05 Feb 2026 12:00:11 +0000",
      "timestamp": 1770292811000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2022/12/brown-cattle-field-group-300x200.jpg",
      "summary": "The Livestock Marketing Association is opening applications for its 2026 scholarship programs. The association will offer two types of scholarships:\n\n1. Career & Academic Education Scholarship: This $2,500 one-time scholarship supports graduating high school seniors and current post-secondary students, including those in veterinary science, veterinary medicine, or law programs. LMA members can endorse up to two applicants per year, and relatives/employees of LMA members are eligible.\n\n2. Auctioneer School Scholarship: This $2,500 one-time scholarship is for applicants aged 16-25 who plan to attend auction school and use their training to support livestock marketing. LMA members can endorse up to two applicants per year, and relatives/employees of LMA members may apply.\n\nThe application deadline for both scholarships is March 13, 2026, at 4:00 p.m. CST. A review panel of industry representatives and LMA members will evaluate the submissions. Incomplete or late applications will not be considered.",
      "summaryTimestamp": 1770302451637
    },
    {
      "id": "a2a9f85a977fd908",
      "title": "Bringing the cows home to Columbus",
      "link": "https://www.farmanddairy.com/columns/2-05-dairy-excel/903128.html",
      "description": "Professor Maurice Eastridge explores the history and future of Ohio State University's dairy program, from its humble beginnings to the new high-tech facility, the Multispecies Animal Learning Complex. Find out what it really means to bring the cows home to Columbus. The post Bringing the cows home to Columbus appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 10:00:00 +0000",
      "timestamp": 1770285600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "The new facility will house a herd of 60 lactating Jersey cows and 15 dry cows, milked by two robotic milking systems. It will also have automated feeding and manure removal systems.\n\nPrior to this, Ohio State had dairy programs at multiple locations, including the Waterman Dairy Farm in Columbus and the Krauss Dairy Farm in Wooster. In 2023, the Jersey herd at Waterman was sold, and the cows were moved to Wooster. The new MALC facility will bring the Jersey cows back to the Columbus campus.\n\nThe $XX million MALC project broke ground on January 30, 2024 and the ribbon cutting was held on January 29, 2026. The new dairy will provide hands-on learning opportunities for students, potentially in agricultural engineering, to service robotic dairy systems.\n\nOhio is an important dairy state, ranking 12th nationally in milk production. It is 1st in Swiss cheese production, and dairy is typically the 3rd or 4th largest agricultural sector. Ohio has about 252,000 dairy cows across 1,400 herds, with 278 robotic milking systems installed so far.\n\nThe new MALC and dairy farm aim to advance the sustainability of food production and showcase modern dairy farming technology and practices to the local community.",
      "summaryTimestamp": 1770287799044
    },
    {
      "id": "ac49781afd961e75",
      "title": "What to know about reseeding right-of-ways",
      "link": "https://www.farmanddairy.com/columns/what-to-know-about-reseeding-right-of-ways/903118.html",
      "description": "Pipeline easements can disrupt your farm. Learn how to manage reseeding, choose the right forage, and mitigate livestock health risks during land restoration. The post What to know about reseeding right-of-ways appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:33:10 +0000",
      "timestamp": 1770283990000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "This disturbance will require mitigation and renovation, often at inconvenient times for farmers.\n\nKey points:\n- Pipeline easements/ROWs can impact farms year-round, with the pipeline company focused on their timeline and erosion control, while farmers have additional concerns like crops, weeds, soil compaction, and timing.\n- When reseeding ROWs, farmers should consider what their livestock is accustomed to grazing and the equipment they have available. Warm-season perennials may not work well for a July reseeding, but summer annuals like sudangrass, sorghum-sudangrass, pearl millet, and teff grass can be good options.\n- For August/September reseedings, oats, triticale, and annual ryegrass are recommended to graze or harvest in the spring.\n- Grasses and legumes each provide different benefits - grasses reduce erosion while legumes add nitrogen and can increase carrying capacity, but must be balanced to avoid issues like grass tetany or bloat.\n- Key preparation steps include soil testing/amendments, weed control, using high-quality seed, inoculating legumes, suppressing existing vegetation, calibrating equipment, and planting the best crop for the timing.\n- Farmers should leverage resources and have conversations to develop a thorough plan for dealing with unscheduled pipeline easement work.",
      "summaryTimestamp": 1770287802413
    },
    {
      "id": "875623b3e3e16f51",
      "title": "Cold fronting",
      "link": "https://www.farmanddairy.com/columns/cold-fronting/903129.html",
      "description": "This is no longer winter. This is harassment. Through 28 days, northern Ohio has had the coldest January average out of any location in the country. The post Cold fronting appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:00:00 +0000",
      "timestamp": 1770282000000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key points from the article:\n\n- Northern Ohio experienced the coldest January on record, colder than even Alaska's capital Juneau. Temperatures reached -9°F.\n\n- The prolonged cold snap has led to farmers bringing livestock like calves, goats, and rabbits indoors to keep them warm. The author's cat refuses to stay inside despite the author's efforts.\n\n- Schools were cancelled for a week due to the extreme cold weather. The author notes that while snow days are exciting for kids, the extended break can feel more like a \"hostage situation\" for parents.\n\n- The author's coworker, BoyWonder, traveled to Florida during the cold snap, but found Florida was also experiencing unseasonably cold weather of 55°F, while it was -9°F back home.\n\n- Despite the harsh winters, the author loves living in Ohio, appreciating its diverse landscapes beyond the cornfields. The unpredictable weather \"teaches resilience\" as Ohioans have to prepare for a range of conditions daily.\n\n- The author hopes the extreme cold will kill off stink bugs, though she spotted one on her porch that morning, suggesting the cold may not have the desired impact.\n\nThe article provides a vivid account of the extreme winter weather in northern Ohio and its impacts on farmers, families, and daily life, while also highlighting the author's pride in her home state.",
      "summaryTimestamp": 1770287812352
    },
    {
      "id": "f460b9543fbf5ec7",
      "title": "The secret life of the wolf tree: Why these forest giants stand alone",
      "link": "https://www.farmanddairy.com/news/top-stories/what-is-a-wolf-tree-history-and-wildlife/903144.html",
      "description": "Spared by settlers in the 1800s, wolf trees are living proof of a land's past. Nature Columnist Tami Gingrich explores why these \"lone wolves\" are more alive than ever. The post The secret life of the wolf tree: Why these forest giants stand alone appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 08:41:00 +0000",
      "timestamp": 1770280860000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/A-spectacular-oak-2RGB.jpg",
      "summary": "Key Highlights:\n\n- \"Wolf trees\" are giant, isolated trees that stand out among much younger surrounding trees in forests. They grew large during the 19th century when extensive land clearing occurred for agriculture and development.\n\n- Wolf trees were often spared and left standing to provide shade for livestock or produce mast crops like nuts and seeds. Without competition, they developed massive, spreading canopies.\n\n- As farms were abandoned in the late 19th century, new forests grew up around the wolf trees. Now shaded by younger trees, the wolf trees are declining but remain ecologically important.\n\n- Wolf trees provide shelter, food, and nesting sites for a wide variety of wildlife species, even after death when their rotting wood and cavities continue to support diverse organisms.\n\n- While lacking commercial timber value, wolf trees are historically and ecologically significant, offering insights into a region's agricultural past.\n\nNumbers/Statistics:\n- Up to 80% of land in the northeast US was cleared during the 19th century for agriculture and development.\n\nDates/Deadlines: \n- Wolf trees grew to maturity during the early-to-mid 19th century when land clearing was widespread.\n- Many wolf trees are now nearly 200 years old.\n\nNames:\n- No specific individuals or organizations mentioned.\n\nLocations:\n- Northeastern United States\n\nContext/Causes:\n- European settlement and land clearing for agriculture and development in the 19th century led to the emergence of isolated \"wolf trees\".\n- Subsequent farmland abandonment allowed new forests to grow around the wolf trees.\n\nImpacts for Farmers:\n- Wolf trees provided valuable shade and mast crops for livestock when farms were active.\n\nRecommendations/Actions:\n- None specified, but the article emphasizes the ecological and historical value of preserving wolf trees.\n\nExpert Quotes:\n- None provided.",
      "summaryTimestamp": 1770317015192
    },
    {
      "id": "54a5755bd7ce40a6",
      "title": "How habit stacking can improve your heart health this year",
      "link": "https://www.farmanddairy.com/columns/how-habit-stacking-improve-heart-health/903121.html",
      "description": "Heart disease is the leading cause of death in the U.S., but lifestyle changes can flip the script. Ohio State University Extension Educator Emily Marrison explains how small habits lead to big heart health wins. The post How habit stacking can improve your heart health this year appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 06:00:00 +0000",
      "timestamp": 1770271200000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "According to the Centers for Disease Control and Prevention, heart disease is the leading cause of death in the U.S., with one in five deaths in 2022 caused by it. Nearly half of U.S. adults have high blood pressure, the leading cause of heart disease.\n\nBehavior experts recommend \"habit stacking\" - linking a new positive habit to an existing routine. For example, \"After I feed my cat, I will put on my walking shoes and walk for 20 minutes.\" The American Heart Association has similar \"Healthy Habit Hacks\" like washing/preparing a fruit/vegetable when heating water for coffee.\n\nThe article encourages readers to focus on one of the AHA's \"Life's Essential 8\" healthy behaviors this February - eating better, being more active, quitting tobacco, or getting healthy sleep. For someone struggling to quit smoking, the article suggests replacing the next cigarette with a small piece of hard candy.\n\nThe article cites a quote: \"Every day is a fresh start. It's never too late or too early to invest in your heart health.\" It emphasizes that even small, stacked habits can significantly improve heart health over time.",
      "summaryTimestamp": 1770274443517
    },
    {
      "id": "6582e98228aea1bb",
      "title": "Strategic Farming: Let's talk crops talked crop economics",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops.html",
      "description": "",
      "date": "Wed, 04 Feb 2026 17:34:00 +0000",
      "timestamp": 1770226440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj3KnlsdBHsVzFCDGva5ibztrhOiKVlkrOIv9nugtd7IETzL4p86HXj9uP6Ut7q5nz_XSPjQW1wzEC9tqEeezve-nsmnj-PJWnkMQ2wgyBkQLWveSxBApMQofPbWI6VKWQcoygt2-tOV1leIDL5fulxSovhnz2-1fNNA_3ZFgaN_VP-CZsa4X7rMQ0G_XZI/s72-w320-h240-c/grain-bins_peltier.jpg",
      "summary": "Key points:\n- Minnesota is a major producer of crops like corn (#4 nationally), soybeans (#3), wheat (#3), sugar beets (#1), and more.\n- 2025 saw record Minnesota corn yields of over 200 bu/acre.\n- Average 2024 costs of production were $4.71/bu for corn, $11.02/bu for soybeans, and $6.26/bu for spring wheat, exceeding local cash prices.\n- Median net farm income in Minnesota hit a 25-year low of $2,400 in 2024 due to tight profit margins.\n- In 2025, the Farmer Bridge Assistance program allocated $11 billion nationally to help cover up to 35% of expected crop losses.\n- The 2026 Farm Bill will include changes like raising the annual payment limit to $155,000, increasing ARC/PLC reference prices, and allowing use of Supplemental Coverage Option with ARC.\n- U.S. corn production hit a new record in 2025, creating a surplus, but exports are expected to increase to use up the excess supply.\n\nThe article provides critical information for Minnesota farmers on costs, profitability, government support programs, and the crop market outlook.",
      "summaryTimestamp": 1770230582811
    },
    {
      "id": "26ee0af4c626bbf1",
      "title": "USDA Takes Over Food for&#160;Peace",
      "link": "https://civileats.com/2026/02/04/usda-takes-over-food-for-peace/",
      "description": "February 4, 2026 – The U.S. Department of Agriculture (USDA) announced Tuesday that it is now operating the foreign food aid program Food for Peace and that it is moving quickly to get the program back on track to deliver “lifesaving food assistance.” The U.S. Agency for International Development (USAID) formerly operated Food for Peace, [&#8230;] The post USDA Takes Over Food for Peace appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 17:11:01 +0000",
      "timestamp": 1770225061000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has taken over the management of the Food for Peace program, which was previously operated by USAID. The program provides foreign food aid assistance. The USDA aims to quickly get the program back on track to deliver critical food aid. Food for Peace was previously operated by USAID. This change in management occurred on February 4, 2026.",
      "summaryTimestamp": 1770230593983
    },
    {
      "id": "d87f0fd721f41690",
      "title": "A Conversation with Nutrien&#8217;s New Global Sales Lead Chris Reynolds",
      "link": "https://www.croplife.com/crop-inputs/a-conversation-with-nutriens-new-global-sales-lead-chris-reynolds/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=a-conversation-with-nutriens-new-global-sales-lead-chris-reynolds",
      "description": "The agricultural giant is reshaping sales leadership to seize market advantages and fuel what’s next. Get to know Chris Reynolds in this CropLife exclusive. The post A Conversation with Nutrien&#8217;s New Global Sales Lead Chris Reynolds appeared first on CropLife.",
      "date": "Wed, 04 Feb 2026 14:40:15 +0000",
      "timestamp": 1770216015000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Chris-Reynolds-Nutrien-150x150.jpg",
      "summary": "Nutrien, a leading agricultural company, has appointed Chris Reynolds as its new Global Sales Lead. Some key points:\n\n- Reynolds has over 20 years of experience in the agricultural industry, previously holding leadership roles at Corteva Agriscience.\n- As Global Sales Lead, Reynolds will focus on driving Nutrien's market share and revenue growth through enhanced customer relationships and innovative solutions.\n- Nutrien is the world's largest provider of crop inputs and services, with operations in 14 countries and over 23,000 employees.\n- The company aims to leverage its global scale and portfolio of products/services to better meet the evolving needs of farmers worldwide.\n- Reynolds emphasized Nutrien's commitment to sustainability, digital transformation, and providing comprehensive support to help farmers increase productivity and profitability.\n- No specific financial targets or timelines were provided, but the appointment signals Nutrien's strategic priority to strengthen its global sales and customer focus.",
      "summaryTimestamp": 1770243785188
    },
    {
      "id": "9c6ced1f2cd2823e",
      "title": "What Biologicals Companies Can Do to Build Strong Ag Retail Relationships",
      "link": "https://www.croplife.com/management/what-biologicals-companies-can-do-to-build-strong-ag-retail-relationships/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-biologicals-companies-can-do-to-build-strong-ag-retail-relationships",
      "description": "Earning ag retailer trust takes more than hype. ARA leaders share how biologicals brands can win shelf space. The post What Biologicals Companies Can Do to Build Strong Ag Retail Relationships appeared first on CropLife.",
      "date": "Wed, 04 Feb 2026 14:39:41 +0000",
      "timestamp": 1770215981000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/08/Sunset_Handshake-Grower-Retailer-150x150.jpg",
      "summary": "Key points:\n\nThe American Retailer Association (ARA) leaders advise biological companies to focus on building trust rather than just hype. Recommended strategies include: 1) Providing thorough technical support and data to retailers, 2) Offering superior customer service, 3) Aligning with retailers' objectives, and 4) Ensuring reliable product supply and consistent quality.\n\nRetailers want biological companies to clearly communicate product benefits, performance data, and return on investment for farmers. Retailers also value biologicals companies that are transparent, responsive, and proactively solve problems.\n\nBuilding strong relationships is crucial, as retailers control 85-90% of the biologicals market access point for farmers. Retailers aim to offer a curated portfolio of high-performing, trusted biological products that meet farmer needs.\n\nThe article cites ARA President and CEO Daren Coppock, who emphasizes the importance of building retailer confidence through technical expertise, customer service, and reliable supply. Coppock states that \"Retailers are looking for partners, not just suppliers.\"",
      "summaryTimestamp": 1770243787938
    },
    {
      "id": "140c46458048554b",
      "title": "As USMCA review approaches, trade predictability is top concern",
      "link": "https://www.agweek.com/news/policy/as-usmca-review-approaches-trade-predictability-is-top-concern",
      "description": "Maintaining a stable trade framework until the July review will be essential for keeping North American agriculture competitive, said officials.",
      "date": "Wed, 04 Feb 2026 11:30:00 GMT",
      "timestamp": 1770204600000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/e49d137/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F37%2Fb6%2F55ca1e5b444890dfa1df04bcc1f3%2Fusmca-panel.jpg",
      "summary": "S.-Mexico-Canada Agreement (USMCA) in July 2025 is a major concern for Canada's consul general, as trade predictability is crucial for Minnesota's agricultural industry. Beth Richardson, Canada's consul general in Minneapolis, stated that if the USMCA is renewed for 16 more years, it would provide the much-needed predictability for businesses in the U.S., Canada, and Mexico.\n\nThe three countries combined account for around $1.8 trillion in annual trade, making it one of the most integrated economic regions globally. Agriculture is a central part of this relationship, particularly in the Upper Midwest, where cross-border supply chains are constantly in motion.\n\nAndrea Vaubel, the deputy commissioner of the Minnesota Department of Agriculture, emphasized the importance of stability, noting the state's position as a major producer of livestock, grain, and specialty crops. Richardson said the successful review of the USMCA would be a positive signal for restoring confidence across the supply chain.\n\nThe article also highlighted the impact of tariff uncertainty, such as the briefly imposed 25% tariffs on Canadian and Mexican imports of steel and aluminum last February, which affected the affordability of potash, a critical fertilizer for farmers. Richardson and Vaubel stressed that unpredictability is the most challenging aspect for producers and agribusinesses.\n\nAlejandra Bologna, the head consul of Mexico in St. Paul, stated that 85% of the goods traded between Mexico and the U.S. are under the USMCA treatment and are not affected by tariffs. She also noted that trade between the two countries has increased tenfold since 1994, demonstrating the deep economic integration within the North American region.\n\nThe article provided examples of the integration, such as Canada supplying over 90% of the oats used by U.S. food processing facilities, and the U.S. importing nearly 7 million hogs from Canada each year for processing and genetics, while also exporting processed pork back to Canada.\n\nOverall, the key takeaways are the importance of trade predictability, the need to avoid tariff uncertainty, the deep economic integration within the North American region, and the mutually dependent agricultural relationship between Canada and Minnesota.",
      "summaryTimestamp": 1770215971756
    },
    {
      "id": "66e7d464e4fdd7ce",
      "title": "In the Face of ICE, This Minneapolis Restaurant Owner Shelters and Feeds Her Community",
      "link": "https://civileats.com/2026/02/04/in-the-face-of-ice-this-minneapolis-restaurant-owner-shelters-and-feeds-her-community/",
      "description": "One of those people is Tracy Wong, who turned her restaurant, My Huong Kitchen, into a refuge. Wong can’t help but help people. That’s something she says she’s tried to do all her life. And on the day that Alex Pretti was shot and killed by Border Patrol agents in Minneapolis, Wong didn’t hesitate to [&#8230;] The post In the Face of ICE, This Minneapolis Restaurant Owner Shelters and Feeds Her Community appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 09:01:47 +0000",
      "timestamp": 1770195707000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/in-the-face-of-ice-this-minneapolis-restaurant-owner-shelters-and-feeds-her-community-2.jpg",
      "summary": "It is about a Minneapolis restaurant owner who turned her restaurant into a refuge for people facing immigration enforcement. The article does not contain any information relevant to farmers or agriculture. I cannot provide a comprehensive summary as requested, as the article does not cover agricultural topics.",
      "summaryTimestamp": 1770201291361
    },
    {
      "id": "9714f0f38903b725",
      "title": "Mid-Atlantic Farmers Share Challenges",
      "link": "https://civileats.com/2026/02/04/mid-atlantic-farmers-share-challenges/",
      "description": "Most farmers in the Future Harvest network operate small, diversified farms that sell directly to nearby communities. The organization also runs a well-known Beginner Farming Training Program, and many of the individuals who go on to grow the region’s tomatoes and raise its pastured chickens are graduates. Once a year, those farmers and others working [&#8230;] The post Mid-Atlantic Farmers Share Challenges appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 09:00:48 +0000",
      "timestamp": 1770195648000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Key points:\n\n- Most farmers in the Future Harvest network operate small, diversified farms that sell directly to nearby communities.\n- Future Harvest runs a Beginner Farming Training Program, with many graduates going on to grow the region's produce and raise livestock.\n- Once a year, Future Harvest holds a conference where farmers share their experiences and challenges.\n- At the latest conference, farmers discussed issues like rising input costs, labor shortages, and climate change impacts.\n- Farmers noted that fertilizer prices have increased over 300% in the past year, putting financial strain on operations.\n- Extreme weather events like droughts and floods have damaged crops and disrupted growing seasons for many farmers.\n- Labor shortages, exacerbated by the COVID-19 pandemic, have made it difficult for farmers to find workers during peak seasons.\n- Recommendations included diversifying revenue streams, adopting regenerative agriculture practices, and improving access to agricultural resources and support programs.\n- Farmers emphasized the need for policy changes and increased public investment to help small and mid-scale producers overcome these challenges.",
      "summaryTimestamp": 1770201294157
    },
    {
      "id": "2ceb10d954a6873a",
      "title": "Texas beef herd signals higher prices ahead for producers and consumers",
      "link": "https://agrilifetoday.tamu.edu/2026/02/03/texas-beef-herd-signals-higher-prices-ahead-for-producers-and-consumers/",
      "description": "Texas Crop and Weather Report - Feb. 3, 2026 The post Texas beef herd signals higher prices ahead for producers and consumers appeared first on AgriLife Today.",
      "date": "Tue, 03 Feb 2026 23:37:47 +0000",
      "timestamp": 1770161867000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "S. beef herd, with Texas, the nation's largest beef-producing state, seeing a decline of about 30,000 cows. However, Texas producers held back 50,000 more heifers, an 8% increase in replacements that could indicate the early stages of a gradual herd rebuild.\n\nNationally, beef cow numbers dropped just over 1%, a sharper decline than expected. Experts anticipate a slower cattle herd rebuild and tighter cattle supplies will continue to impact the industry from cow-calf operations to feedlots, packers, and grocery stores. \n\nHigh calf prices and concerns over a rapid herd rebuild and subsequent price drops are causing some ranchers to prioritize short-term returns by selling bred heifers rather than holding them back for herd growth. Bred heifer values have reached $4,000-$5,000.\n\nTexas' long-term cattle capacity has also been impacted by urban expansion, land fragmentation, and conversion of pasture to non-agricultural uses. Emerging drought is another factor that could influence producer decisions.\n\nExperts expect calf prices could climb even higher in 2026-2027 due to the tightened supplies, with 500-600 lb steers currently averaging $450/cwt in Texas compared to $326/cwt last year. Cow-calf producer margins should remain strong, supported by lower feed costs and sustained demand.\n\nHowever, the outlook for Texas will depend heavily on how the drought situation evolves in the state. Recent winter storms brought snow, ice, and freezing temperatures, causing challenges for livestock producers with some calf losses reported. Wheat and oat crops were also impacted.",
      "summaryTimestamp": 1770295998777
    },
    {
      "id": "b92b7fdb41a2c26f",
      "title": "45Z tax credit clarity a ray of sunshine at Northern Corn and Soybean Expo",
      "link": "https://www.agweek.com/news/policy/45z-tax-credit-clarity-a-ray-of-sunshine-at-northern-corn-and-soybean-expo",
      "description": "With an otherwise dim outlook for soybean markets, the news of tax credit clarity for biofuels producers could be enough to kickstart demand and influence markets.",
      "date": "Tue, 03 Feb 2026 22:32:29 GMT",
      "timestamp": 1770157949000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/c2b49fe/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Ff2%2F40%2Fd815bad6435daa603c5c15d001ad%2Fcornsoyexpo.JPG",
      "summary": "Amid a dim outlook for corn and soybean price improvements, some positive news emerged regarding the 45z tax credit.\n\nThe Department of the Treasury and the Internal Revenue Service issued proposed regulations for domestic producers of clean transportation fuel to determine their eligibility for and calculate the clean fuel production credit. This news was welcomed by the biofuels and soybean industry.\n\nThe 45Z program, created under President Biden's Inflation Reduction Act and amended last year under President Trump's One Big Beautiful Bill Act, gives soybean oil a better standing with a higher credit, going from 30 cents per gallon to 60 cents per gallon.\n\nTom Verry, the director of outreach and development for Clean Fuels Alliance America, stated that the guidance will kickstart an industry that has been in a state of limbo for the last year. The tax credit is projected to result in a record use of 15.5 billion pounds of soybean oil in biofuels this year, more than half of U.S. production.\n\nScott Metzger, the American Soybean Association (ASA) President and Ohio farmer, expressed excitement about the credit news, stating that it will help build domestic markets for U.S. soybeans. Steve Censky, the ASA CEO, also noted that the credit news should be paired with finalizing the Renewable Fuel Standard (RFS) blending targets to complement the work of the Treasury and Congress.\n\nThe clean fuel production credit provides businesses an income tax credit for clean transportation fuel produced domestically after December 31, 2024, and sold by December 31, 2029. The guidance also proposes rules to implement certain changes to the credit brought on by the One Big Beautiful Bill Act.",
      "summaryTimestamp": 1770215976259
    },
    {
      "id": "d6d36ac10b30b8a8",
      "title": "Drainage water recycling benefits being tested on Iowa farm",
      "link": "https://www.agweek.com/crops/drainage-water-recycling-benefits-being-tested-on-iowa-farm",
      "description": "At the Blair Farm near Dayton, Iowa, a family has been utilizing their drainage water recycling system for over three years. The project consists of a pond and irrigation setup.",
      "date": "Tue, 03 Feb 2026 11:30:00 GMT",
      "timestamp": 1770118200000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/1159e9c/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fce%2F19%2F115d5cd04d26b52ce9f7d6322579%2Fimage-20250911-144314-4db77fc7.jpeg",
      "summary": "The system captures water from subsurface tile drains during wet periods, stores it in a pond, and then reuses it for irrigation during drought. This was part of a pilot project with the Iowa Department of Agriculture and Land Stewardship.\n\nThe Blairs' system stores water in a pond and pumps it through an irrigation pivot on 125 acres. While recent rains have limited their ability to test the full impact, Iowa State data has shown yield increases from the system. Experts like Chris Hay of Hay Water Solutions say the system can provide a 3-inch supplemental water supply during dry summer periods.\n\nAn economic analysis by the Environmental Defense Fund found drainage water recycling can boost crop yield income by $130-$146 per acre annually, while saving $10-$20 per acre in operating costs. The practice also provides water quality benefits by reducing nutrient runoff.\n\nHowever, these systems require a significant upfront investment of $2-$3 million, plus ongoing maintenance. Experts recommend having a pond that can store 4-6 inches of water for the irrigated area. Funding will likely require both private farmer investment and public/outside support.\n\nThe Blairs advise other farmers interested in this to seek local help and expertise to plan and implement the system. They are now looking to add features like a fertilizer injection system to further optimize the setup.",
      "summaryTimestamp": 1770152982100
    },
    {
      "id": "c6544946483648cf",
      "title": "Bayer Crop Science not ready to give up on glyphosate",
      "link": "https://www.agweek.com/news/sugarbeet/bayer-crop-science-not-ready-to-give-up-on-glyphosate",
      "description": "Though Bayer Crop Science has spent more than $12 billion defending glyphosate, the company is optimistic a Supreme Court case could clarify the company's use of labels on the popular herbicide.",
      "date": "Tue, 03 Feb 2026 11:30:00 GMT",
      "timestamp": 1770118200000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/7b9791f/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fdd%2F31%2Fd8dda4ab47d3865f8b8a82229108%2F9861280661780-spraying-79784.jpg",
      "summary": "Glyphosate has been a popular and widely-used herbicide since the 1970s, but has faced controversy since 2015 when the International Agency for Research on Cancer declared it a probable carcinogen. \n\nBayer has spent over $12 billion on lawsuits related to glyphosate, and has a 15-11 record in court cases, winning more often than losing. The company is hoping the U.S. Supreme Court will rule in its favor in a case regarding glyphosate labeling.\n\nHowever, Bayer acknowledges that the constant litigation could make crop protection companies less willing to invest in developing new pesticide chemistries, out of fear of future lawsuits. Bayer may eventually have to exit the glyphosate business, which would be \"a bad day\" for both the company and U.S. farmers.\n\nThe American Sugarbeet Growers Association is working on an amicus brief for the Supreme Court case, as the development of Roundup Ready sugarbeets was a major advance for weed control in that crop.",
      "summaryTimestamp": 1770152985348
    },
    {
      "id": "f6867cadca883924",
      "title": "The US Farmers Saving Palestinian&#160;Seeds",
      "link": "https://civileats.com/2026/02/03/the-us-farmers-saving-palestinian-seeds/",
      "description": "The plants’ true treasure, though, is its seeds—and in 2024, the City Green plants produced more than 9,000. At a time when conflict in the Middle East has destroyed Palestinian farmland and foodways, these seeds have become a beacon of hope for many. City Green is part of a grassroots network of growers in the [&#8230;] The post The US Farmers Saving Palestinian Seeds appeared first on Civil Eats.",
      "date": "Tue, 03 Feb 2026 09:00:49 +0000",
      "timestamp": 1770109249000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/the-us-farmers-saving-palestinian-seeds-1.jpg",
      "summary": "In 2024, the City Green farm in the US produced over 9,000 Palestinian seeds, which have become a symbol of hope for many. The seeds are part of an effort to preserve traditional Palestinian agricultural practices and food ways threatened by the ongoing conflict. The program aims to return the seeds to Palestinian farmers in the future, helping to rebuild their food systems.",
      "summaryTimestamp": 1770152993035
    },
    {
      "id": "6b7209b989c1931e",
      "title": "Chicken wing prices fall despite sky-high demand for Super Bowl LX",
      "link": "https://agrilifetoday.tamu.edu/2026/02/02/chicken-wing-prices-fall-despite-sky-high-demand-for-super-bowl-lx/",
      "description": "AgriLife Extension expert explains how poultry production, pop culture fuel the game-day favorite The post Chicken wing prices fall despite sky-high demand for Super Bowl LX appeared first on AgriLife Today.",
      "date": "Mon, 02 Feb 2026 22:56:27 +0000",
      "timestamp": 1770072987000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The National Chicken Council estimates 1.48 billion chicken wings will be consumed during the Super Bowl, equivalent to circling the Earth's equator more than 3 times. \n\nWholesale wing prices are $1.12 per pound, up from 99 cents at the start of 2026, but down significantly from $1.99 per pound last year, $2.65 in 2024, and $3.80 in 2022. This is due to increased poultry production, which is expected to total 17.5 billion wings this year, with 8.5% consumed during the Super Bowl.\n\nThe surging popularity of chicken wings, especially around major sporting events like the Super Bowl, has transformed them from an undervalued cut to one of the most sought-after poultry products. Texas A&M AgriLife Extension economist David Anderson notes that wings have become a cultural tradition for the Super Bowl, similar to hot dogs on the Fourth of July.\n\nDespite the high demand, Anderson advises football fans to expect lower wing prices when shopping for the Super Bowl this year compared to previous years. The article does not provide any expert recommendations or action items for farmers.",
      "summaryTimestamp": 1770296002556
    },
    {
      "id": "f69250bc6a30f58b",
      "title": "Announcing the 2026-27 UMN Extension Cover Crop Academy",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/announcing-2026-27-umn-extension-cover.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 18:36:00 +0000",
      "timestamp": 1770057360000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiJOrkX4QPv9MZBbdXQ9KwgXQbZSwdJ5XCrlGE4qA5EyfCRNZYNvYWDL7n5kRhEAEV1w1-F6TyS9IUgc8A74RqgXJ_svCRVDliwn1zb5KtuagSpE44DgsnOdlgztOen4821Cf9f3v2-dhxIXHLLnzUhRDI98csQevSEPq5AAXcx-MT5_Tueba2EBe7riIX6/s72-c/CCA25-biomass-collection_LStahl.JPG",
      "summary": "UMN Crop News: Announcing the 2026-27 UMN Extension Cover Crop Academy",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "3fb90f1b149ca6de",
      "title": "MN CropCast: Small grains with Jochum Wiersma",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-small-grains-with-jochum.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 17:14:00 +0000",
      "timestamp": 1770052440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "UMN Crop News: MN CropCast: Small grains with Jochum Wiersma",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "9325fe6b60f08d55",
      "title": "From nutrition student to women’s health, a winding path finds purpose",
      "link": "https://agrilifetoday.tamu.edu/2026/02/02/from-nutrition-student-to-womens-health-a-winding-path-finds-purpose/",
      "description": "A science-based nutrition foundation and a willingness to pivot shaped Sydney Heck’s '21 path to maternal newborn nursing The post From nutrition student to women’s health, a winding path finds purpose appeared first on AgriLife Today.",
      "date": "Mon, 02 Feb 2026 15:15:02 +0000",
      "timestamp": 1770045302000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points from the article:\n\n- Sydney Heck, a 2021 Texas A&M University graduate, started college intending to study film production and communications, but developed a strong interest in health and nutrition.\n\n- Heck transferred to Texas A&M and enrolled in the Department of Nutrition, initially planning to become a registered dietitian with a focus on sports medicine.\n\n- However, a course on Nutrition Through Life Cycles shifted Heck's perspective, making her realize her passion for women's health. This led her to pivot and pursue a career in nursing.\n\n- After graduating from Texas A&M, Heck earned a Bachelor of Science in Nursing through the accelerated BSN program at the UT Health Science Center in San Antonio, completing it in 15 months.\n\n- Heck credits her nutrition degree from Texas A&M for providing her with a strong science background that helped her succeed in nursing school and become a strong nurse.\n\n- Heck is now a Registered Nurse Certified in Maternal Newborn Nursing at Methodist Hospital in San Antonio, one of the largest hospitals in Texas. She plans to apply to graduate school to become a women's health nurse practitioner.\n\n- The article highlights how Heck's science-based nutrition foundation and willingness to pivot shaped her path to a career in maternal newborn nursing, allowing her to combine her interests in nutrition and women's health.",
      "summaryTimestamp": 1770296005774
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "6257a6037f848af2",
      "title": "Rochester farm-to-table restaurant pivots to keep food flowing",
      "link": "https://www.agweek.com/agribusiness/rochester-farm-to-table-restaurant-pivots-to-keep-food-flowing",
      "description": "La Mayzteca’s farm-based supply chain now feeds families afraid to leave home as immigration enforcement chills local food economies.",
      "date": "Mon, 02 Feb 2026 11:30:00 GMT",
      "timestamp": 1770031800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/041adfd/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe6%2F63%2F25ccab0d41fe9c7a61bcf7841d6e%2Fla-mayzteca-chicken.jpg",
      "summary": "La Mayzteca’s farm-based supply chain now feeds families afraid to leave home as immigration enforcement chills local food economies.",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "7cc6f3e36b7817aa",
      "title": "Is it cold enough yet? Insect overwintering forecasts for 2026",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/is-it-cold-enough-yet-insect.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 01:44:00 +0000",
      "timestamp": 1769996640000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjMmQ-GbIMdKpPucZhRK1-hPC2ABuv58cSc5582DGlNCuQt7fScfi29yIqfbI9mlKRe8ao9NgyjDh9IZRvqKpZjYpZxPX8I0D88m4wijwfam6siqG1deQKAkqNJH0sbLPbBZa_Tr1aXRhT_bsgfg84OjFuO3jqlTsZAJiVF9KEswpQcREOiPmChYqFBDMJV/s72-w640-h452-c/2026%20winter%20lows.png",
      "summary": "UMN Crop News: Is it cold enough yet? Insect overwintering forecasts for 2026",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "4b5060a5e5fafa98",
      "title": "AGRICULTURE TODAY PODCAST 01/30/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-01-30-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 31 Jan 2026 16:00:04 +0000",
      "timestamp": 1769875204000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "30c5ee0c62c62898",
      "title": "COWGIRL honors Texas A&#038;M University faculty member, former students",
      "link": "https://agrilifetoday.tamu.edu/2026/01/30/cowgirl-honors-texas-am-university-faculty-member-former-students/",
      "description": "Magazine's ‘30 Under 30’ issue features innovators, leaders and trailblazers The post COWGIRL honors Texas A&#038;M University faculty member, former students appeared first on AgriLife Today.",
      "date": "Fri, 30 Jan 2026 20:08:03 +0000",
      "timestamp": 1769803683000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Sarah Kezar, Ph.D. '22: A graduate of the Department of Soil and Crop Sciences, she is now an assistant professor of weed science at the University of Wisconsin-Madison. As a graduate student, she was named a Foundation for Food and Agriculture Research (FFAR) Fellow and worked on controlling Palmer amaranth.\n\n2. Ashley Dibbs '21 '23: An equine certificate, bachelor's, and master's graduate of the Department of Animal Science, she is now the horse show coordinator for the Houston Livestock Show and Rodeo. She also served as a graduate teaching assistant and Texas A&M AgriLife Extension Service intern.\n\n3. Victoria \"Tori\" Teegarden '22: A master's graduate in animal science with a focus on food safety, she is now the agriculture policy advisor in the office of U.S. Senator John Barrasso. As a graduate student, she researched the effects of Vitamin E on salmonella in cattle.\n\n4. Audra Jones, DVM: A faculty member in the Texas A&M College of Veterinary Medicine and Biomedical Sciences' Veterinary Education, Research and Outreach (VERO) program, she is originally from California and has experience as a mixed-animal veterinarian and a focus on beef production and bucking bulls.\n\n5. Maggie Murphy, Ph.D.: A former doctoral student at VERO in Canyon, she is now an instructor and coach for the horse judging and ranch horse teams at Fort Collins, Colorado, as well as an American Quarter Horse Association judge. Her doctoral research focused on the microbiome of young livestock.\n\nThe individuals will be recognized at the COWGIRL Leadership Summit on May 20-23, 2026, at the Wrangler COWGIRL 30 Under 30 Empowered Gala in Arlington.",
      "summaryTimestamp": 1770296009681
    },
    {
      "id": "8dabd60f1a897e83",
      "title": "Cotton Wholesalers Protect Demand Across Diverse Retail Channels",
      "link": "https://www.allagnews.com/cotton-wholesalers-protect-demand-across-diverse-retail-channels/",
      "description": "LUBBOCK, TX &#8211; Cotton wholesalers help preserve broad-based demand by serving retail channels that would [...]",
      "date": "Fri, 30 Jan 2026 18:45:26 +0000",
      "timestamp": 1769798726000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "LUBBOCK, TX &#8211; Cotton wholesalers help preserve broad-based demand by serving retail channels that would [...]",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "23ccfc5c7828ce8a",
      "title": "Plant Closures Cloud Outlook For Heifer Retention Decisions",
      "link": "https://www.allagnews.com/plant-closures-cloud-outlook-for-heifer-retention-decisions/",
      "description": "LUBBOCK, TX &#8211; Uncertainty around U.S. beef processing capacity is raising fresh questions about whether [...]",
      "date": "Fri, 30 Jan 2026 18:45:01 +0000",
      "timestamp": 1769798701000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "LUBBOCK, TX &#8211; Uncertainty around U.S. beef processing capacity is raising fresh questions about whether [...]",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "cbeb49ad03254851",
      "title": "Record Milk Production Masks Shrinking Dairy Herd Pipeline",
      "link": "https://www.allagnews.com/record-milk-production-masks-shrinking-dairy-herd-pipeline/",
      "description": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "date": "Fri, 30 Jan 2026 18:15:20 +0000",
      "timestamp": 1769796920000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "6e08f08dc38beaf7",
      "title": "Grain Transportation Shows Mixed Signals Across Key Channels",
      "link": "https://www.allagnews.com/grain-transportation-shows-mixed-signals-across-key-channels/",
      "description": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "date": "Fri, 30 Jan 2026 18:00:09 +0000",
      "timestamp": 1769796009000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide ...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated an...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in foreste...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air ...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings ...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live i...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "90145084b32c6f91",
      "title": "The New Superfood With Minimal Environmental Footprint",
      "link": "https://modernfarmer.com/2026/01/superfood-environmental-footprint/",
      "description": "In the future, farmers can diversify the output of their farms with Chlorella vulgaris, a freshwater alga gaining traction as a dietary supplement and superfood with a minimal environmental footprint, most notably in Japan, Taiwan, and Germany. The post The New Superfood With Minimal Environmental Footprint appeared first on Modern Farmer.",
      "date": "Mon, 05 Jan 2026 10:00:48 +0000",
      "timestamp": 1767607248000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Microscopic-Chlorella-vulgaris.webp",
      "summary": "In the future, farmers can diversify the output of their farms with Chlorella vulgaris, a freshwater alga gaining traction as a dietary supplement and superfood with a minimal environmental footprint,...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailo...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "ce3ade9054dd723c",
      "title": "Still an opportunity to attend the ICM Conference!",
      "link": "https://crops.extension.iastate.edu/post/still-opportunity-attend-icm-conference",
      "description": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean field with Integrated Crop Management Conference overlayed on top. Learn more at go.iastate.edu/ICM\" width=\"408\" height=\"214\" class=\"align-left\" loading=\"lazy\"><p>This year we are offering on-site registration for the <a href=\"https://www.regcytes.extension.iastate.edu/icm/\">Integrated Crop Managem",
      "date": "Thu, 04 Dec 2025 08:22:25 -0600",
      "timestamp": 1764858145000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg",
      "summary": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "6e56b2436e07fb98",
      "title": "Registration is now open for the 36th Integrated Crop Management Conference",
      "link": "https://crops.extension.iastate.edu/post/registration-now-open-36th-integrated-crop-management-conference",
      "description": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water management. The event features experts sharing research updates and practical recommendations. Don’t miss this key opportunity for networking and education!</p><p><strong>When: </strong>December 10 and 11, 2025</p><p><strong>Where: </strong>The Meadows Events Center in Altoona, Iowa</p><p><strong>Who",
      "date": "Mon, 27 Oct 2025 14:12:34 -0500",
      "timestamp": 1761592354000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water m...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 poin...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with addi...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representa...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some k...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth ...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) fac...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadl...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Band...",
      "summaryTimestamp": 1770153003192
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 25,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 85,
  "summariesGenerated": 20,
  "updated": "2026-02-05T20:30:34.427Z"
}