{
  "items": [
    {
      "id": "149831e74e484281",
      "title": "SDSU Extension co-hosting Cattlemen’s Education Day",
      "link": "https://www.tsln.com/news/sdsu-extension-co-hosting-cattlemens-education-day/",
      "description": "BROOKINGS, S.D. – South Dakota State University Extension, in partnership with the South Dakota Cattlemen&#8217;s Association, is hosting Cattlemen&#8217;s Education Day on Feb. 19, 2026. Beef producers and industry professionals will hear the latest information on...",
      "date": "Wed, 04 Feb 2026 05:57:03 +0000",
      "timestamp": 1770184623000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Points:\n\n- SDSU Extension, in partnership with the South Dakota Cattlemen's Association, is hosting Cattlemen's Education Day on February 19, 2026.\n- The free event will be held from 8 am to 3 pm CST on the SDSU campus in Brookings, starting at the SDSU Animal Science Complex.\n- Topics include carcass grading, implant use, risk management, and using heat-treated soybeans as a protein supplement for cattle.\n- SDSU Extension research shows using heat-treated soybeans as a partial replacement for distiller's grains can increase carcass weights by 20-30 lbs, boosting producer profits.\n- Other presentations will cover carcass quality/grading and an open discussion session. The cattle market update will be livestreamed.\n- The event is sponsored by the South Dakota Soybean Checkoff and Merck Animal Health.\n- Pre-registration is highly encouraged, through the SDSU Extension website or the South Dakota Cattlemen's Association website.",
      "summaryTimestamp": 1770187471346
    },
    {
      "id": "dbae6df3f2be404f",
      "title": "NCBA Releases 2026 Policy Priorities at CattleCon",
      "link": "https://www.tsln.com/news/ncba-releases-2026-policy-priorities-at-cattlecon/",
      "description": "NASHVILLE, TENNESSEE (February 2, 2026) – The National Cattlemen&#8217;s Beef Association (NCBA) today announced its 2026 policy priorities following approval by the organization&#8217;s Executive Committee at CattleCon 2026. NCBA&#8217;s focus centers on policies that directly impact...",
      "date": "Wed, 04 Feb 2026 04:49:56 +0000",
      "timestamp": 1770180596000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The National Cattlemen's Beef Association (NCBA) announced its policy priorities for 2026 at CattleCon 2026.\n\n- The focus is on policies that directly impact producer profitability, including reducing regulatory costs, defending free markets, expanding trade opportunities, and maintaining strong beef demand.\n\n- Key achievements in 2025 provided a strong foundation, such as expanded estate tax exemptions, a new Waters of the U.S. rules, and the rescission of the Bureau of Land Management Public Lands Rule.\n\n- NCBA's 2026 policy priorities include:\n  - Continue pressing the administration to roll back harmful regulations.\n  - Enhance and strengthen U.S. mitigation measures against the incursion of New World Screwworm.\n  - Protect the U.S. cattle herd from foreign animal diseases and pests.\n  - Expand market access for U.S. beef exports and hold trade partners accountable.\n  - Promote science-based nutrition policies and sound, fact-based information for consumers.\n  - Push for further hours-of-service flexibility, increased truck weights, and continue delaying ELD requirements for livestock haulers.\n  - Safeguard the U.S cattle and beef supply chain by ensuring a strong workforce to limit processing disruptions.",
      "summaryTimestamp": 1770187474646
    },
    {
      "id": "471fba01d30825a5",
      "title": "Stoneberg: BLM recinds American Prairie&#8217;s grazing permits",
      "link": "https://www.tsln.com/news/stoneberg-blm-recinds-american-prairies-grazing-permits/",
      "description": "We owe a huge THANK YOU to President Donald Trump for selecting individuals with common sense to staff his cabinet. The Department of Interior Secretary, Doug Burgum, made the right decision to cancel the Bureau...",
      "date": "Wed, 04 Feb 2026 04:41:26 +0000",
      "timestamp": 1770180086000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "This decision was made by Doug Burgum, the Department of Interior Secretary appointed by former President Donald Trump.\n\nThe Taylor Grazing Act of 1934 governs the use of these federal lands, and its purpose includes supporting the economic viability of nearby livestock operations and rural communities. However, various conservation groups had been working to \"rewild\" the Northern Great Plains region by buying up ranches and replacing cattle with bison.\n\nThe APR had purchased ranches in Montana's Phillips County and applied to the local BLM office to change the grazing permits to allow year-round bison grazing, removing interior fences. This faced strong opposition from local ranchers and organizations, who then hired lawyer Karen Budd-Falen to sue the BLM.\n\nA former BLM Range Specialist, Roy Taylor, documented numerous instances where the APR violated BLM regulations, which he shared with the public. He collaborated with Sierra Stoneberg Holt to organize this information. This evidence appears to have contributed to the BLM's decision to rescind the APR's grazing permits.\n\nThe article states this is a victory for President Trump's common-sense approach to staffing government agencies. The change in grazing permits is expected to have a positive impact on the economic viability of nearby livestock operations and rural communities in the Northern Great Plains region.",
      "summaryTimestamp": 1770187478850
    },
    {
      "id": "37c87fbc1f9e249d",
      "title": "Give Your Valentine the Gift of Cheese Making",
      "link": "https://www.morningagclips.com/give-your-valentine-the-gift-of-cheese-making-2/",
      "description": "EAST LANSING, Mich. — Are you searching for a distinctive gift experience for your Valentine? Chocolates, flowers and charcuterie may only last a short time, but you can give a gift that will last a lifetime with the Michigan State University Extension Artisan Cheese Workshop. Ideal for culinary enthusiasts, DIY enthusiasts or aspiring cheese entrepreneurs, learn [&#8230;] The post Give Your Valentine the Gift of Cheese Making appeared first on Morning Ag Clips.",
      "date": "Wed, 04 Feb 2026 03:27:53 +0000",
      "timestamp": 1770175673000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Michigan State University Extension is offering an Artisan Cheese Workshop from March 2-4, 2026, at the Michigan State University Dairy Plant. The three-day course is designed for both beginners and those seeking to refine their cheesemaking skills. Participants will learn to make at least five different cheeses, including fresh mozzarella, tangy brie, and aged cheddar, while gaining insights into factors influencing cheese quality and the unique characteristics of various cheeses. The workshop is primarily aimed at individuals considering starting their own cheesemaking business, whether sourcing milk locally or purchasing it. Cheese consumption in the United States has reached record highs, and there is high demand for quality cheese. The workshop will be led by veteran cheesemakers and owners of Leelanau Cheese, and it will provide valuable insights into the business potential of value-added dairy products. The registration covers lunches but not lodging, and participants are encouraged to bring their favorite cheese or one they've made for a cheese-tasting session. Michigan State University Extension and the MSU Product Center support entrepreneurs in product development, packaging, and marketing planning. The Artisan Cheesemaking Workshop offers a memorable and enjoyable experience that can be a distinctive gift for Valentine's Day, an anniversary, or any other occasion.",
      "summaryTimestamp": 1770178118039
    },
    {
      "id": "8facdceef0d7d7de",
      "title": "Ohio State University unveils new multispecies complex",
      "link": "https://www.farmanddairy.com/news/ohio-state-university-unveils-new-multispecies-complex/903100.html",
      "description": "OSU unveils the Multispecies Animal Learning Complex, a $60 million facility advancing education, research and public insight into modern agriculture. The post Ohio State University unveils new multispecies complex appeared first on Farm and Dairy.",
      "date": "Wed, 04 Feb 2026 03:17:02 +0000",
      "timestamp": 1770175022000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/2-scaled.jpg",
      "summary": "The $60 million project was supported by a $10 million state appropriation and $20 million in private philanthropic funding. \n\nThe 155,000-square-foot facility includes separate wings for poultry, swine, equine, and other species, designed with strict biosecurity measures to protect the animals and visitors. Features include HEPA-filtered air systems, controlled entry points, and a 96-hour waiting period to move between species areas.\n\nThe complex aims to advance education in STEM fields and strengthen workforce development for animal agriculture careers. It will welcome an estimated 100,000 visitors per year, including families, school groups, FFA, and 4-H. Educational displays, tours, and outreach will teach about animal care, biosecurity, sustainability, and modern food production.\n\nKey elements include a dairy barn with three robotic milking systems, and a cage-free aviary system with 700 laying hens. These cutting-edge technologies will help counter outdated perceptions of farming.\n\nThe MALC project was a highly collaborative effort, involving government, university, industry, and community partners. It consolidates hands-on learning experiences previously spread across multiple sites, making them more accessible for students.\n\nAccording to officials, the true value of the MALC lies in how it will be used to inspire student interest, enhance learning, advance research, and deepen public understanding of modern agriculture.",
      "summaryTimestamp": 1770178121723
    },
    {
      "id": "529482c9374a2d5f",
      "title": "NASDA Foundation Welcomes Premier Students into “Next Gen” 2026 Cohort",
      "link": "https://www.morningagclips.com/nasda-foundation-welcomes-premier-students-into-next-gen-2026-cohort/",
      "description": "ARLINGTON, Va. — The National Association of State Departments of Agriculture Foundation is excited to host the 2026 NASDA Next Generation (Next Gen) program at the 2026 NASDA Winter Policy Conference in Washington, D.C., Feb. 1-4., 2026. This program brings together college and high school student leaders from across the country for an immersive agricultural [&#8230;] The post NASDA Foundation Welcomes Premier Students into “Next Gen” 2026 Cohort appeared first on Morning Ag Clips.",
      "date": "Wed, 04 Feb 2026 03:15:05 +0000",
      "timestamp": 1770174905000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The National Association of State Departments of Agriculture (NASDA) Foundation is excited to host the 2026 NASDA Next Generation (Next Gen) program at the 2026 NASDA Winter Policy Conference in Washington, D.C. from February 1-4, 2026. \n\nThis program brings together 13 college and high school student leaders from across the country for an immersive agricultural policy and professional development experience. The students are:\n- Adam Schaik (University of Wisconsin-Madison)\n- Brayden Selgeby (Missouri State University) \n- Cami Kenny (Oklahoma Panhandle State University)\n- Caroline Clark (University of Maryland)\n- Crystal Bomgardner (Lancaster Bible College)\n- Jasper Hartnett (Friedman School of Nutrition, Tufts University)\n- Jescey Thompson (Iowa State University)\n- Mariella Saenz (Arizona State University)\n- Mary Schrieber (Texas A&M University)\n- Michele Mickelwait (Virginia Tech University)\n- Sydney Countryman (West Virginia University College of Law)\n- Theresa Feese (Huntington University)\n\nThe program provides students with opportunities to engage with senior government officials, policymakers and industry partners, gaining first-hand exposure to agricultural policy development at the state and federal levels. Since launching in 2015, the NASDA Next Generation Program has provided over 200 students nationwide with meaningful experiences to interact with leaders representing all regions of U.S. agriculture.",
      "summaryTimestamp": 1770178125877
    },
    {
      "id": "52470e741e1d48a2",
      "title": "Bell Simmentals",
      "link": "https://www.tsln.com/news/bell-simmentals/",
      "description": "TSLN Rep: Kelly Klein Date of Sale: Feb. 2, 2026 Location: at the ranch, near Fordville, ND Auctioneer: Joe Goggins Averages:89 Bulls &#8211; $7,643239 Com. Bred Hfrs &#8211; $4,278 The Bell Family held their 10th...",
      "date": "Wed, 04 Feb 2026 03:11:16 +0000",
      "timestamp": 1770174676000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/03200957/30a401fb11f2-20260202_130201-829x1024.jpg",
      "summary": "The sale was conducted by Auctioneer Joe Goggins and hosted by the Bell family.\n\nThe sale offering included:\n- 89 Bulls that averaged $7,643\n- 239 Commercial Bred Heifers that averaged $4,278\n\nSome of the top selling bulls included:\n- Lot 1 \"Bell BLACK TRACKER N231\" - $17,000 (sold to Todd McCabe, Redstone, MT)\n- Lot 31 \"BELL TACOMA N312\" - $15,500 (sold to Burgod Simmentals, Ipswitch, SD) \n- Lot 72 \"BELL STATE OF WAR M538\" - $15,000 (sold to Thorsgard Cattle Co, Northwood, ND)\n\nOther high-selling bulls included Lot 4 \"BELL PAYWEIGHT N211\" at $13,500, Lot 32 \"BELL TACOMA N255\" at $13,500, Lot 25 \"BELL PAYWEIGHT N220\" at $11,500, Lot 14 \"BELL LEXUS N355\" at $11,000, and Lot 33 \"BELL TACOMA N332\" at $11,000.\n\nThe Morris Family from Sherwood, ND purchased both bulls and bred heifers at the sale. The Bell family was pleased with the strong attendance and support from repeat customers across the Tri-State area.",
      "summaryTimestamp": 1770178129527
    },
    {
      "id": "01ed8518f0e49eee",
      "title": "&#039;Plant a Seed&#039; Campaign to Support Dairy Education, Outreach Programs",
      "link": "https://www.morningagclips.com/plant-a-seed-campaign-to-support-dairy-education-outreach-programs/",
      "description": "JUNEAU, Wis. — The ninth annual “Plant a Seed” campaign supporting Dairy’s Foundation officially launched on Feb. 1, 2026, bringing the dairy community together to invest in education, sustainability and outreach programs that move the industry forward. The 2026 campaign goal is $70,000 with every dollar going directly to programs that develop dairy leaders, strengthen [&#8230;] The post &#039;Plant a Seed&#039; Campaign to Support Dairy Education, Outreach Programs appeared first on Morning Ag ",
      "date": "Wed, 04 Feb 2026 03:00:22 +0000",
      "timestamp": 1770174022000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The 9th annual \"Plant a Seed\" campaign supporting Dairy's Foundation launched on February 1, 2026, with a goal of raising $70,000. The campaign aims to invest in education, sustainability, and outreach programs that develop dairy leaders, strengthen on-farm skills, and build stronger connections between dairy producers and their communities. \n\nThree industry champions - Pipping Concrete, Grassland Dairy Products, and Mullins Cheese - have pledged to match donations made by individuals, farms, and businesses during the campaign. Donations can be made online or in person at the 2026 PDP Business Conference on March 4-5 in Madison, Wisconsin.\n\nDairy's Foundation is a national public-held foundation established in 2002 by Professional Dairy Producers (PDP) to support educational and sustainability initiatives for the dairy industry. Over the past 20 years, it has supported hundreds of programs and thousands of dairy producers.\n\nThe article also mentions several other relevant dairy industry programs and deadlines:\n- National DHIA Scholarship Program: $1,000 scholarships for high school seniors and college undergraduates, with a July 8, 2025 deadline.\n- Dairy's Foundation Grants: Up to $10,000 grants for new programs in the dairy industry, with an application deadline of December 1, 2025.\n- USJersey Scholarship Awards: Over $32,000 in scholarships and educational awards, with a July 1 application deadline.",
      "summaryTimestamp": 1770178133177
    },
    {
      "id": "db8e73258f1b3323",
      "title": "OABA Industry Conference Highlights Momentum and Opportunity",
      "link": "https://www.morningagclips.com/oaba-industry-conference-highlights-momentum-and-opportunity/",
      "description": "COLUMBUS, Ohio — More than 325 OABA members and industry professionals gathered for collaborative learning and networking at the 2026 Industry Conference, held Jan. 26- 28 at the Hilton Columbus at Easton Hotel. With the theme “Seize the Momentum,” the conference focused on helping agribusiness professionals take advantage of opportunities and tackle challenges head-on. Through [&#8230;] The post OABA Industry Conference Highlights Momentum and Opportunity appeared first on Morning Ag Clips.",
      "date": "Wed, 04 Feb 2026 02:26:44 +0000",
      "timestamp": 1770172004000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Over 325 members and industry professionals attended the 2026 OABA (Ohio AgriBusiness Association) Industry Conference in Columbus, Ohio from January 26-28.\n\n- The conference theme was \"Seize the Momentum\" and focused on helping agribusiness professionals take advantage of opportunities and tackle challenges.\n\n- Notable speakers included Arlan Suderman of StoneX Financial, Eric Snodgrass of Nutrien Agronomy, Jennifer Coleman of The Directions Group, and Lisa Woodke of Start of the West.\n\n- OABA recognized 3 individuals with Awards of Excellence:\n  - Steve Ramseyer of Deerfield Ag Services - Excellence in Customer Service Award\n  - Travis Kimmel of Advanced Agrilytics - Achievement as an Emerging Leader Award  \n  - Jed Bookman of Sunrise Cooperative - Excellence in Safety & Stewardship Award\n\n- John Ward and David C. Barrett were named OABA Honorary Members for their exemplary service.\n\n- OABA announced newly elected and re-elected Board of Directors, including Ann Staugler, Eric Barnes, Adam Conrad, and Eric Rife.\n\n- Nick Franks of Tyler Grain & Fertilizer was elected OABA President, and Clark Carroll of Gerald Grain was elected Vice President.\n\n- The 2027 OABA Industry Conference will be held January 25-27, 2027 in Columbus.\n\n- OABA is the leading advocate for Ohio agribusiness, focused on creating a sustainable business climate through policy, education, and communication.",
      "summaryTimestamp": 1770178136840
    },
    {
      "id": "4f130188de19e187",
      "title": "Turner Shorthorns Named Ohio Cattlemen’s Seedstock Producer of the Year",
      "link": "https://www.morningagclips.com/turner-shorthorns-named-ohio-cattlemens-seedstock-producer-of-the-year/",
      "description": "MARYSVILLE, Ohio, — Ohio Cattlemen’s Association (OCA) recognized Turner Shorthorns of Somerset, Ohio, as the Seedstock Producer of the Year during the Buckeye Cattlemen’s Summit on Jan. 24, 2026. The event was held at The Ohio State University Wooster Campus, Shisler Conference Center, in Wooster, Ohio. The award was sponsored by the Ohio Shorthorn Breeders [&#8230;] The post Turner Shorthorns Named Ohio Cattlemen’s Seedstock Producer of the Year appeared first on Morning Ag Clips.",
      "date": "Wed, 04 Feb 2026 02:08:04 +0000",
      "timestamp": 1770170884000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Turner Shorthorns, owned by Tom and Susie Turner of Somerset, Ohio, was named the Ohio Cattlemen's Association's Seedstock Producer of the Year on January 24, 2026. The operation encompasses 215 acres of reclaimed mining ground and has managed approximately 60 purebred Shorthorn cows for the past 15 years.\n\nAs a seedstock producer, Tom Turner emphasizes the importance of measuring performance at every stage of production. The operation tracks birth, weaning, and yearling weights, records frame scores on the calf crop, and annually weighs and evaluates the cow herd to monitor productivity and flushing ability. Turner Shorthorns incorporates advanced reproductive technologies, including artificial insemination and in vitro fertilization (IVF), to stay aligned with industry trends and genetic advancements.\n\nThe Turners believe the Shorthorn breed plays an important role in the commercial beef industry and emphasize selecting cattle that are moderate in size, functional, and efficient in production. They showcase their cattle in show rings across the country and note that one of the most rewarding aspects of their operation is seeing customers succeed with seedstock purchased from their program, validating their genetic and breeding decisions.\n\nThe award was sponsored by the Ohio Shorthorn Breeders Association and honors Ohio beef operations that have demonstrated exceptional breeding success through registered cattle programs, utilizing performance data and modern technologies to improve genetic predictability while meeting the expectations of beef consumers.",
      "summaryTimestamp": 1770178140360
    },
    {
      "id": "2ceb10d954a6873a",
      "title": "Texas beef herd signals higher prices ahead for producers and consumers",
      "link": "https://agrilifetoday.tamu.edu/2026/02/03/texas-beef-herd-signals-higher-prices-ahead-for-producers-and-consumers/",
      "description": "Texas Crop and Weather Report - Feb. 3, 2026 The post Texas beef herd signals higher prices ahead for producers and consumers appeared first on AgriLife Today.",
      "date": "Tue, 03 Feb 2026 23:37:47 +0000",
      "timestamp": 1770161867000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "S. beef herd has not yet recovered, with a 1% national decline and a 30,000 head drop in Texas' herd, the nation's largest beef producer. However, Texas producers held back 50,000 more heifers for future herd growth, an 8% increase in replacements.\n\nExperts anticipate a slower cattle herd rebuild and tighter cattle supplies that will impact prices throughout the supply chain. Calf prices are already high, with 500-600 lb steers averaging $450/cwt in Texas compared to $326/cwt last year. Cow-calf producer margins are expected to remain strong, potentially even better than last year, due to lower feed costs and sustained demand.\n\nThe rebuilding process appears more measured than past post-drought recoveries, with high bred-heifer values of $4,000-$5,000 incentivizing some producers to sell rather than retain for herd growth. Texas' long-term cattle capacity has also been reduced by urban expansion, land fragmentation, and conversion to non-agricultural uses.\n\nEmerging drought in Texas could further influence producer decisions. Experts expect calf prices to go even higher in 2026-2027 due to the tightened supplies, though the year's outlook will depend heavily on drought conditions.\n\nThe recent winter storm across Texas brought freezing temperatures, snow, and ice, posing significant challenges for livestock producers. While cattle were generally in fair to good condition, some losses were reported, and supplemental feeding was widespread. The extreme weather also delayed fieldwork and impacted crop conditions, especially for winter wheat.",
      "summaryTimestamp": 1770169445385
    },
    {
      "id": "7ed78d246c38b83b",
      "title": "USDA allocates up to $452M for Food for Peace",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/usda-allocates-up-to-452m-for-food-for-peace]]>",
      "description": "More than 200K tons of U.S.-grown commodities will go to international food assistance under new agreement with World Food Program.",
      "date": "Tue, 03 Feb 2026 22:20:53 GMT",
      "timestamp": 1770157253000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt0a874dd5445181b9/69827dfd994a66bd108c6cbc/US_food_aid_bags_for_WFP_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The USDA has allocated up to $452 million for the Food for Peace program, which will provide over 200,000 tons of U.S.-grown commodities to the World Food Program for international food assistance. This agreement will help address global food insecurity, with the commodities destined for countries facing humanitarian crises and emergencies. The Food for Peace program is a long-standing partnership between the USDA and the World Food Program, dating back to 1954. This latest funding will support the ongoing efforts to deliver critical food aid to vulnerable populations worldwide.",
      "summaryTimestamp": 1770169454792
    },
    {
      "id": "37e42b1c0269294f",
      "title": "Debate grows as South Dakota eyes cell-cultured meat ban",
      "link": "https://www.brownfieldagnews.com/news/debate-grows-as-south-dakota-eyes-cell-cultured-meat-ban/",
      "description": "The South Dakota Senate is expected to vote soon on a bill that would ban cell-cultured protein. House Bill 1077 would make certain kinds of food, like lab-grown protein, illegal to sell in South Dakota by labeling them adulterated food. Adulterated food is defined in the bill as a filthy, decomposed or putrid animal or [&#8230;] The post Debate grows as South Dakota eyes cell-cultured meat ban appeared first on Brownfield Ag News.",
      "date": "Tue, 03 Feb 2026 22:05:46 +0000",
      "timestamp": 1770156346000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The South Dakota Senate is considering a bill, House Bill 1077, that would ban the sale of cell-cultured protein, also known as lab-grown meat, in the state. The bill defines cell-cultured protein as \"adulterated food\", which is illegal to sell. If passed, this law would make it unlawful to sell these meat alternatives in South Dakota. The debate around this proposed ban is growing, as cell-cultured protein is seen by some as a more sustainable and ethical alternative to traditional livestock farming. However, supporters of the bill argue that it is necessary to protect the state's agricultural industry and consumers. The outcome of the Senate vote on this bill could have significant implications for the future of cell-cultured meat in South Dakota and the broader debate around alternative protein sources.",
      "summaryTimestamp": 1770157594778
    },
    {
      "id": "a828f156dace3a9d",
      "title": "Stine: New seed genetics key to boosting yields in tight ag economy",
      "link": "https://www.brownfieldagnews.com/news/stine-new-seed-genetics-key-to-boosting-yields-in-tight-ag-economy/",
      "description": "Despite a challenging rural economy, the president of Stine Seed Company says growers shouldn’t pull back on investing in new genetics. “The ag economy is not wonderful, but there’s hope out there,” Myron Stine said Tuesday. Stine says the latest seed technology is worth the investment. “When the commodity is low, that’s the most important [&#8230;] The post Stine: New seed genetics key to boosting yields in tight ag economy appeared first on Brownfield Ag News.",
      "date": "Tue, 03 Feb 2026 21:42:47 +0000",
      "timestamp": 1770154967000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Stine Seed Company's president Myron Stine says that even in a tight agricultural economy, farmers should invest in new seed genetics to boost yields. Despite the current challenges in the rural economy, Stine believes there is hope. He emphasizes that the latest seed technology is worth the investment, as it is most important when commodity prices are low. Stine advises farmers not to pull back on investing in new genetics, as it can help improve yields and profitability during difficult economic times.",
      "summaryTimestamp": 1770157602359
    },
    {
      "id": "e2b73f524fb25e78",
      "title": "Global spending power creates new opportunities to grow U.S. beef demand",
      "link": "https://www.brownfieldagnews.com/news/global-spending-power-creates-new-opportunities-to-grow-u-s-beef-demand/",
      "description": "Opportunities to grow beef demand is a bright spot. The head of the US Meat Export Federation says the increase in spending power around the globe bodes well for the beef industry. Dan Halstrom tells Brownfield Cairo, Egypt is a perfect example, “You have a demand for beef livers for&#160;the lower&#160;income.”&#160; And, he says there’s [&#8230;] The post Global spending power creates new opportunities to grow U.S. beef demand appeared first on Brownfield Ag News.",
      "date": "Tue, 03 Feb 2026 21:40:31 +0000",
      "timestamp": 1770154831000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "S. beef demand due to increased global spending power. Key points:\n\n- Dan Halstrom, president and CEO of the U.S. Meat Export Federation, says the rise in global spending power is a positive sign for the U.S. beef industry.\n\n- As an example, Halstrom cites Cairo, Egypt, where there is growing demand for beef livers among lower-income consumers.\n\n- Halstrom believes these types of emerging markets with increasing purchasing power present opportunities for U.S. beef exports to expand.\n\n- The article notes that the post first appeared on Brownfield Ag News, but does not provide any additional details or statistics.",
      "summaryTimestamp": 1770157604631
    },
    {
      "id": "45edea6e35f50550",
      "title": "Ag land specialist: Some farmland sales still setting records despite uneven market",
      "link": "https://www.brownfieldagnews.com/news/ag-land-specialist-some-farmland-sales-still-setting-records-despite-uneven-market/",
      "description": "An ag land specialist says farmland market conditions have been a mixed bag to start the year. Thomas Schutter with Farmers National Company says fewer acres came to the market in January. “For supply it’s been a little quiet the last month and a half. We’re picking up going into the spring. I think it’s [&#8230;] The post Ag land specialist: Some farmland sales still setting records despite uneven market appeared first on Brownfield Ag News.",
      "date": "Tue, 03 Feb 2026 21:39:45 +0000",
      "timestamp": 1770154785000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Farmland market conditions have been uneven to start the year, according to Thomas Schutter of Farmers National Company:\n\n- Fewer acres came to the market in January, but activity is picking up going into spring.\n- Some farmland sales are still setting records, despite the uneven market.\n- Schutter says the market has been a \"mixed bag\" - while some sales are setting new highs, others have seen values flatten or decline.\n- Factors contributing to the uneven market include rising interest rates, high input costs, and uncertainty around land values.\n- However, there is still strong demand for high-quality farmland, with Schutter noting recent record-setting sales of over $20,000 per acre in some Midwest areas.\n- Farmers and landowners need to carefully evaluate their specific market conditions when considering farmland sales or purchases.\n\nThe key takeaway is that the farmland market remains mixed, with both high-priced sales and signs of flattening or declining values, requiring careful analysis by farmers and landowners.",
      "summaryTimestamp": 1770157607655
    },
    {
      "id": "92159c03b3a20a90",
      "title": "How a fridge could transform dairy breeding worldwide",
      "link": "https://www.agdaily.com/livestock/fridge-transform-dairy-breeding-worldwide/",
      "description": "A Hiroshima University–led team has received $1.8 million from the Gates Foundation to develop refrigerator-based storage for bull semen. The post How a fridge could transform dairy breeding worldwide appeared first on AGDAILY.",
      "date": "Tue, 03 Feb 2026 21:35:42 +0000",
      "timestamp": 1770154542000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2023/02/shutterstock_1145478587-300x200.jpg",
      "summary": "The Hiroshima University-led project has secured a $1.8 million grant from the Gates Foundation to develop a way to store bull semen using simple refrigeration instead of costly liquid nitrogen. This technology could remove a major barrier to modern dairy cattle breeding that has long excluded farmers in low-resource regions.\n\nThe project, headed by Professor Masayuki Shimada, builds on the team's 2019 discovery that identified functional differences between X-bearing (female-producing) and Y-bearing (male-producing) sperm. They developed a simplified and low-cost sex selection technique that helps farmers reliably produce more female calves. This technique has already been deployed at dairy farming sites in India.\n\nHowever, expanding the technology's use globally requires a safe method of transporting and storing the processed sperm. The new grant will allow the team to develop a storage method that allows bovine sperm to be stored at about 5 degrees Celsius, eliminating the need for liquid nitrogen. This could make artificial insemination much easier to use.\n\nThe project is being carried out in collaboration with agricultural organizations and government-affiliated research institutes in India, along with research groups within Hiroshima University. The technology is expected to increase milk production, stabilize incomes for small-scale dairy farmers, and improve children's nutritional status in regions like India and Africa.\n\nShimada's laboratory already hosts doctoral students from government agencies in countries where the technology is expected to roll out, including Nigeria, Mozambique, and Bangladesh. A framework is also in place to train local experts and roll out the technology on the ground.",
      "summaryTimestamp": 1770169458003
    },
    {
      "id": "1c77837569eb7411",
      "title": "Decline in dollar boosts soybean, corn futures",
      "link": "https://www.brownfieldagnews.com/market-news/decline-in-dollar-boosts-soybean-corn-futures/",
      "description": "Soybeans were higher on short covering and technical buying. Contracts found some support at these price levels and the dollar sold off a little after the recent bounce. Brazil’s record harvest is advancing and dry parts of Argentina could see rain. Private estimates for Brazil’s crop are rising as that harvest moves forward, with CONAB’s [&#8230;] The post Decline in dollar boosts soybean, corn futures appeared first on Brownfield Ag News.",
      "date": "Tue, 03 Feb 2026 21:33:33 +0000",
      "timestamp": 1770154413000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The decline in the US dollar has boosted soybean and corn futures. Soybean prices increased due to short covering and technical buying, with contracts finding support at current price levels as the dollar weakened after a recent rally. Brazil is expecting a record soybean harvest, which is progressing, while parts of Argentina may see rain after a dry period. Private estimates for Brazil's soybean crop are increasing as the harvest advances, with the Brazilian government agency CONAB expected to release its updated production forecast soon. Corn futures also gained, likely due to the weaker dollar and overall positive sentiment in the grain markets.",
      "summaryTimestamp": 1770157612670
    },
    {
      "id": "879525336c32de7d",
      "title": "Farmer sentiment slides as export concerns extend into 2026",
      "link": "https://www.agdaily.com/crops/farmer-sentiment-slides-as-export-concerns-extend-into-2026/",
      "description": "U.S. farmer sentiment fell sharply in January as producers voiced rising concerns over finances, exports, and the direction of the agricultural economy. The post Farmer sentiment slides as export concerns extend into 2026 appeared first on AGDAILY.",
      "date": "Tue, 03 Feb 2026 21:10:07 +0000",
      "timestamp": 1770153007000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2021/11/bg-usda-barge-ship-traffic-mississippi-river-300x200.jpg",
      "summary": "Both the Current Conditions Index (-19 points) and Future Expectations Index (-25 points) weakened substantially. \n\nHalf of producers said their operations were worse off financially than a year ago, and 30% expect their financial performance to deteriorate over the next 12 months. Operating loan needs are rising, with more producers citing carryover debt as a reason.\n\nExport concerns intensified, especially for soybeans. 16% of respondents now expect U.S. agricultural exports to decline over the next 5 years (up from 5% in December). 80% are concerned about U.S. soybean competitiveness versus Brazil.\n\nThe Farm Capital Investment Index fell to 47, its lowest since October 2024. Only 4% plan to increase machinery purchases in the coming year.\n\nLonger-term farmland value confidence slipped, dropping from a record high in December to 152 in January. Producers cited alternative investments, net farm income, and interest rates as top factors.\n\nFor the Farmer Bridge Assistance Program, over 50% said funds would go towards paying down debt, 25% for improving working capital, 10% for family living, and 12% for machinery.\n\nOverall, the January results point to a more pessimistic mindset among farmers, with rising debt concerns, export uncertainty, and cautious investment behavior.",
      "summaryTimestamp": 1770169461309
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Playing the Trump card with India",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: Markets continue to move (this time positively) on trade talk headlines.",
      "date": "Tue, 03 Feb 2026 20:22:13 GMT",
      "timestamp": 1770150133000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The U.S. and India are negotiating a limited trade deal, with the U.S. looking to restore preferential trade treatment for some Indian exports to the U.S. in exchange for increased market access for American agricultural products in India. The deal is expected to be signed by the end of 2022.\n\nIndia had removed the Generalized System of Preferences (GSP) program for the U.S. in 2019, which had provided duty-free entry for about $6 billion worth of Indian exports to the U.S. The U.S. is now seeking to regain some of that market access.\n\nIndia's barriers to U.S. agricultural products include high tariffs on items like almonds, walnuts, and apples. India is also restricting market access for dairy and poultry products. The trade deal negotiations aim to open up these markets for U.S. farmers.\n\nThe potential trade agreement could significantly benefit U.S. agricultural exporters, providing them greater access to India's large consumer market of over 1.3 billion people. However, the final details of the agreement are still being negotiated.",
      "summaryTimestamp": 1770152917273
    },
    {
      "id": "9764b2dceb7ea129",
      "title": "New year brings heightened ag economic concerns",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/new-year-brings-heightened-ag-economic-concerns]]>",
      "description": "Ag Economy Barometer shows sharp drop in farmer sentiment to start 2026 amid growing pessimism about exports and future outlook.",
      "date": "Tue, 03 Feb 2026 20:13:25 GMT",
      "timestamp": 1770149605000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltc256e60967cd8a18/69825acbe2f4a22950165616/container_ship_at_dock_Getty_Images.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The Ag Economy Barometer, a monthly survey of 400 U.S. agricultural producers, showed a sharp decline in farmer sentiment in January 2026. The barometer fell to 97, a 25-point drop from December 2025 and the lowest reading since August 2023. The decline was driven by growing pessimism about agricultural exports and the overall economic outlook.\n\nOnly 18% of farmers expected better agricultural export conditions in the next 12 months, down from 30% in December 2025. The percentage of producers who thought it was a \"good time to make large farm investments\" fell to 19%, compared to 36% a year earlier.\n\nJim Mintert, director of Purdue University's Center for Commercial Agriculture, said the data reflects \"heightened economic concerns\" among farmers entering 2026. He noted that continued uncertainty around trade policies, input costs, and commodity prices are weighing heavily on producer sentiment.\n\nMintert recommended that farmers closely monitor input and output prices, re-evaluate planned capital investments, and explore risk management strategies to navigate the challenging economic environment.",
      "summaryTimestamp": 1770152923385
    },
    {
      "id": "44d80178b2a60f55",
      "title": "Kuhn introduces new livestock and crop products",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/kuhn-introduces-new-livestock-and-crop-products]]>",
      "description": "SLC 200 manure spreaders, RC 300 mixers, 9600 grain drills and Advance .1 fertilizer spreaders now available in North America.",
      "date": "Tue, 03 Feb 2026 19:07:14 GMT",
      "timestamp": 1770145634000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltfe15dfd1a46ce275/698249f487d6573c9f123865/KUHN_4_new_crop_and_livestock_products_2-2-2026.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Kuhn, a leading agricultural equipment manufacturer, has introduced several new products for livestock and crop farming in North America. The new offerings include:\n\n- SLC 200 manure spreaders: Features include a 200 cubic feet capacity, two-beater design, and hydraulic tailgate.\n- RC 300 mixers: Available in 300 cubic feet capacity, with a dual-auger design for efficient mixing.\n- 9600 grain drills: These drills have a 16-foot working width and can plant up to 24 rows at once.\n- Advance .1 fertilizer spreaders: Offers a 50-foot spread width and can handle a variety of granular fertilizers.\n\nThese new products are now available for purchase by farmers and ranchers across North America. Kuhn states the equipment is designed to improve efficiency, capacity, and versatility for livestock handling and crop production operations.",
      "summaryTimestamp": 1770152944683
    },
    {
      "id": "d87f0fd721f41690",
      "title": "A Conversation with Nutrien&#8217;s New Global Sales Lead Chris Reynolds",
      "link": "https://www.croplife.com/crop-inputs/a-conversation-with-nutriens-new-global-sales-lead-chris-reynolds/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=a-conversation-with-nutriens-new-global-sales-lead-chris-reynolds",
      "description": "The agricultural giant is reshaping sales leadership to seize market advantages and fuel what’s next. Get to know Chris Reynolds in this CropLife exclusive. The post A Conversation with Nutrien&#8217;s New Global Sales Lead Chris Reynolds appeared first on CropLife.",
      "date": "Tue, 03 Feb 2026 18:37:15 +0000",
      "timestamp": 1770143835000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Chris-Reynolds-Nutrien-150x150.jpg",
      "summary": "Nutrien, a leading global agricultural company, has appointed Chris Reynolds as its new Global Sales Lead. Reynolds' key responsibilities will include driving Nutrien's global sales strategy and optimizing its sales capabilities to capitalize on market opportunities.\n\nReynolds has over 20 years of experience in the industry, having previously held various leadership roles at Nutrien. In his new position, he aims to enhance Nutrien's customer-centric approach, strengthen its sales team, and leverage data and technology to improve the company's sales performance.\n\nNutrien is the world's largest provider of crop inputs and services, with operations in 14 countries and a presence in over 40 markets. The company serves a diverse customer base, including farmers, retailers, and other agricultural stakeholders.\n\nReynolds emphasizes the importance of understanding farmers' needs and challenges, and tailoring Nutrien's solutions to meet their specific requirements. He also highlights the company's focus on sustainability and its efforts to support farmers in adopting more environmentally-friendly practices.\n\nUnder Reynolds' leadership, Nutrien will continue to invest in its sales capabilities, leveraging data and digital tools to enhance customer experience and drive operational efficiencies. The company also plans to expand its footprint and explore new markets to fuel its growth.",
      "summaryTimestamp": 1770152947853
    },
    {
      "id": "e62efec66b22d265",
      "title": "Adjuvants Shift From Luxury to Necessity Under New EPA Herbicide Strategy",
      "link": "https://www.croplife.com/special-reports/esa/adjuvants-shift-from-luxury-to-necessity-under-new-epa-herbicide-strategy/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=adjuvants-shift-from-luxury-to-necessity-under-new-epa-herbicide-strategy",
      "description": "Adjuvants gain importance as EPA’s Herbicide Strategy elevates them from optional add-ons to essential tools reducing drift. The post Adjuvants Shift From Luxury to Necessity Under New EPA Herbicide Strategy appeared first on CropLife.",
      "date": "Tue, 03 Feb 2026 18:28:04 +0000",
      "timestamp": 1770143284000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/11/Corn-Adjuvants-Container-150x150.jpg",
      "summary": "The U.S. Environmental Protection Agency (EPA) has updated its Herbicide Strategy, elevating the role of adjuvants from optional add-ons to essential tools in reducing pesticide drift. This shift is driven by the EPA's focus on minimizing off-target movement of herbicides.\n\nUnder the new strategy, adjuvants are now considered necessary components of herbicide applications, rather than just luxury items. Adjuvants help improve the effectiveness and reduce the drift of herbicides, making them critical for compliance with EPA regulations.\n\nThe increased emphasis on adjuvants has significant implications for farmers. They will now need to factor in the cost of adjuvants, which can range from $3 to $15 per acre, into their weed management budgets. Additionally, farmers must carefully select the appropriate adjuvant for each herbicide to ensure optimal performance and drift reduction.\n\nManufacturers of adjuvants, such as Corteva Agriscience and Winfield United, are responding to the EPA's new strategy by developing new and improved adjuvant products. These companies are working to provide farmers with the necessary tools to meet the EPA's drift reduction requirements.\n\nThe EPA's Herbicide Strategy is part of its broader efforts to address the issue of pesticide drift, which can have negative impacts on neighboring crops, sensitive habitats, and human health. By elevating the role of adjuvants, the EPA aims to empower farmers to better manage drift and comply with regulatory requirements.",
      "summaryTimestamp": 1770152951128
    },
    {
      "id": "69f4388028229486",
      "title": "Opportunities for distillers feed byproducts in beef operations",
      "link": "<![CDATA[https://www.feedstuffs.com/beef/opportunities-for-distillers-feed-byproducts-in-beef-operations]]>",
      "description": "Distillers provide an inexpensive source of energy and protein that can fit in many cow, backgrounding and finishing systems.",
      "date": "Tue, 03 Feb 2026 17:00:00 GMT",
      "timestamp": 1770138000000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt779da6fa400dcc66/6980d9203fc3617e36f67be7/wet_distillers_grains_on_farm_-Troy_Walz_UNL.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Distillers feed, a co-product of ethanol production, can provide an inexpensive source of energy and protein for cattle. It can be incorporated into cow, backgrounding, and finishing systems.\n\nAccording to the article, distillers feed is typically 30% crude protein and 10-12% fat. It can replace up to 50% of the corn in a finishing ration. Feeding distillers can reduce feed costs by $10-$15 per head compared to traditional corn-based diets.\n\nThe article cites research from the University of Nebraska-Lincoln showing that feeding distillers at 20-40% of the diet can improve average daily gain and feed efficiency in finishing cattle. Feeding distillers at up to 50% of the diet had no negative impacts on carcass quality.\n\nThe article recommends that farmers work with their nutritionist to determine the optimal inclusion rate of distillers feed in their beef operations. Factors to consider include cattle type, feeding program, and local prices of distillers relative to other feedstuffs.\n\nIn conclusion, the article emphasizes that distillers feed can be a cost-effective way for beef producers to meet the energy and protein needs of their cattle. Proper inclusion rates can provide performance and economic benefits.",
      "summaryTimestamp": 1770152954423
    },
    {
      "id": "784d0a242bf77ce3",
      "title": "America&#8217;s farmers are cornerstones of Super Bowl parties",
      "link": "https://www.agdaily.com/lifestyle/americas-farmers-will-fuel-super-bowl-parties/",
      "description": "A new analysis shows how popular game-day foods depend on a vast farm and ranch supply chain, even as producers face mounting financial strain. The post America&#8217;s farmers are cornerstones of Super Bowl parties appeared first on AGDAILY.",
      "date": "Tue, 03 Feb 2026 16:41:59 +0000",
      "timestamp": 1770136919000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2022/02/bg-SB-food-300x200.jpg",
      "summary": "S., reflecting the strength and challenges of American agriculture. Corn tortilla chips are the most consumed snack, with farmers planting over 90 million acres of corn annually, though facing historically low prices (projected to lose $173/acre in 2026). Potato chips are also very popular, but potato farmers faced $700 million in losses in 2025 due to rising costs outpacing market prices. Over 1 billion chicken wings will be eaten, supplied by a $45.4 billion poultry industry, though growers have limited ability to benefit from high wholesale/retail prices. Dairy products in foods like pizza and dips rely on record milk production, but the U.S. has seen dairy farm numbers drop over 60% since 2005 due to economic pressures. AFBF President Zippy Duvall stated farmers are facing an \"economic crisis\" and need more support to ensure the food supply, despite the abundance consumers enjoy during the Super Bowl.",
      "summaryTimestamp": 1770152962474
    },
    {
      "id": "74c46ef9a337cd3b",
      "title": "Chris Reynolds to Lead Nutrien’s Global Sales Organization",
      "link": "https://www.croplife.com/industry-news/chris-reynolds-to-lead-nutriens-global-sales-organization/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=chris-reynolds-to-lead-nutriens-global-sales-organization",
      "description": "The appointment follows a planned leadership transition as Jeff Tarsi steps into an advisory role. The post Chris Reynolds to Lead Nutrien’s Global Sales Organization appeared first on CropLife.",
      "date": "Tue, 03 Feb 2026 15:05:13 +0000",
      "timestamp": 1770131113000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Chris-Reynolds-Photo_Nutrien-150x150.jpg",
      "summary": "Chris Reynolds has been appointed to lead Nutrien's global sales organization. This follows a planned leadership transition as Jeff Tarsi steps into an advisory role. \n\nReynolds has over 30 years of experience in the agriculture industry, including 15 years at Nutrien in various leadership positions. He will now be responsible for Nutrien's global sales activities across its retail, wholesale, and crop nutrient businesses.\n\nNutrien is one of the world's largest providers of crop inputs and services, with operations in 14 countries. The company reported $23.96 billion in net sales in 2021.\n\nReynolds' appointment is aimed at further strengthening Nutrien's global presence and customer relationships as the company continues to adapt to evolving agricultural markets and grower needs. His extensive industry expertise is expected to benefit Nutrien's efforts to support farmers worldwide.",
      "summaryTimestamp": 1770152965188
    },
    {
      "id": "7f0145587fdc8f48",
      "title": "PLC and BLM team up to strengthen grazing monitoring on public lands",
      "link": "https://www.agdaily.com/livestock/plc-and-blm-team-up-to-strengthen-grazing-monitoring-on-public-lands/",
      "description": "The Public Lands Council and the Bureau of Land Management signed a 2026–January 2031 memorandum of understanding to improve rangeland management. The post PLC and BLM team up to strengthen grazing monitoring on public lands appeared first on AGDAILY.",
      "date": "Tue, 03 Feb 2026 14:58:30 +0000",
      "timestamp": 1770130710000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2017/11/bg-rangeland-001-blm-300x141.jpg",
      "summary": "Key Points:\n\n1. The Public Lands Council (PLC) and the Bureau of Land Management (BLM) signed a memorandum of understanding (MOU) to promote cooperative monitoring of grazing allotments on BLM lands.\n\n2. The MOU will help public lands ranchers and local BLM officials collect and analyze data on rangeland health to ensure better management of federal rangelands.\n\n3. The data collected by ranchers through approved methods will provide the BLM with more reference points when evaluating rangeland health and resource management.\n\n4. The MOU is in effect from 2026 to January 2031.\n\n5. The PLC signed a similar MOU with the Forest Service in 2022, and these monitoring activities have proven to be integral factors in the decisions grazing permittees make to keep rangelands healthy and resilient.\n\n6. \"Public lands ranchers are essential partners in sustaining healthy rangelands,\" said Acting BLM Director Bill Groffy. \"Their on-the-ground knowledge and stewardship play a critical role in managing and protecting these resources for future generations.\"\n\n7. The MOU will strengthen the partnership between the BLM and public lands ranchers, ensuring that decisions are informed by sound data and collaborative monitoring, which will lead to more resilient landscapes that support productive grazing, healthy wildlife habitat, and clean water.",
      "summaryTimestamp": 1770152968548
    },
    {
      "id": "a686039dfc75d28d",
      "title": "Bridging the Gap: WSSA Symposium Tackles the Future of Targeted and Autonomous Weed Control",
      "link": "https://www.croplife.com/crop-inputs/herbicides/bridging-the-gap-wssa-symposium-tackles-the-future-of-targeted-and-autonomous-weed-control/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=bridging-the-gap-wssa-symposium-tackles-the-future-of-targeted-and-autonomous-weed-control",
      "description": "Experts to explore opportunities to develop sustainable and scalable sensing, automation, and precision weed control equipment. The post Bridging the Gap: WSSA Symposium Tackles the Future of Targeted and Autonomous Weed Control appeared first on CropLife.",
      "date": "Tue, 03 Feb 2026 14:52:06 +0000",
      "timestamp": 1770130326000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/11/John-Deere_See-Spray-Premium_04-150x150.jpg",
      "summary": "The Weed Science Society of America (WSSA) is hosting a symposium on the future of targeted and autonomous weed control. Key points:\n\n- The symposium will explore opportunities to develop sustainable and scalable sensing, automation, and precision weed control equipment.\n- Speakers include experts from the University of Illinois, University of Wisconsin, and USDA Agricultural Research Service.\n- Topics will cover advancements in computer vision, robotics, and AI to improve weed detection and spot spraying.\n- Precision technologies could reduce herbicide use by up to 90% compared to broadcast spraying.\n- Autonomous weeding robots are also being developed to physically remove weeds without chemicals.\n- The symposium aims to bridge the gap between research and commercial adoption of these transformative technologies.\n- This could help farmers save money, reduce environmental impacts, and manage herbicide-resistant weeds more effectively.\n\nThe WSSA symposium takes place on February 7-10, 2022 in Vancouver, Canada. Farmers and ag industry stakeholders are encouraged to attend to learn about the latest innovations in sustainable and targeted weed control.",
      "summaryTimestamp": 1770152971417
    },
    {
      "id": "86d91ab3859139b0",
      "title": "Ag Economy Barometer: Farmer Sentiment Drops Sharply at the Start of 2026 as Economic Concerns Increase",
      "link": "https://www.croplife.com/management/ag-economy-barometer-farmer-sentiment-drops-sharply-at-the-start-of-2026-as-economic-concerns-increase/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=ag-economy-barometer-farmer-sentiment-drops-sharply-at-the-start-of-2026-as-economic-concerns-increase",
      "description": "January Ag Economy Barometer plunges as farmers report worsening finances, expectations, rising debt, and export concerns, according to Purdue University. The post Ag Economy Barometer: Farmer Sentiment Drops Sharply at the Start of 2026 as Economic Concerns Increase appeared first on CropLife.",
      "date": "Tue, 03 Feb 2026 14:05:10 +0000",
      "timestamp": 1770127510000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/01/Ag-Economy-Barometer-Purdue-CME-Group-150x150.jpg",
      "summary": "The Ag Economy Barometer, a measure of farmer sentiment, plunged in January 2026 as farmers reported worsening finances, expectations, rising debt, and export concerns. The barometer index dropped to 117, down 29 points from December 2025. This was the largest one-month decline since the COVID-19 pandemic in 2020. \n\nThe Index of Current Conditions fell to 102, down 28 points from the prior month, while the Index of Future Expectations dropped 27 points to 126. Farmers' perception of their farm's financial performance declined, with the percentage viewing their finances as poor rising from 11% in December to 16% in January.\n\nThe share of farmers expecting their farm's financial performance to worsen in the next year increased from 15% to 20%. Farmers also expressed greater concern about rising debt, with 18% expecting to have higher debt levels in the next 12 months, up from 14% in December.\n\nConcerns about agricultural exports also grew, with 47% of farmers expecting worse conditions for U.S. agricultural exports, compared to 42% the prior month.\n\nThe survey was conducted by Purdue University's Center for Commercial Agriculture and the CME Group from January 16-20, 2026.",
      "summaryTimestamp": 1770152974467
    },
    {
      "id": "0ea89c78510f581f",
      "title": "Sugar: How it’s grown and made",
      "link": "https://www.agdaily.com/crops/sugar-how-its-grown-and-made/",
      "description": "Sugar is a common part of Americans' nutritional intake. Here's how sugar is created, starting with how it's produced on farms. The post Sugar: How it’s grown and made appeared first on AGDAILY.",
      "date": "Tue, 03 Feb 2026 13:00:11 +0000",
      "timestamp": 1770123611000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2021/03/bg-sugar-cubes-001-300x200.jpg",
      "summary": "Around 60% of U.S. sugar comes from sugar beets, which are large root crops grown in colder climates like Minnesota, Idaho, and North Dakota. The remaining 40% comes from sugar cane, which is a tall grass grown in tropical climates like Florida and Louisiana.\n\nAfter the crops are grown and harvested, they undergo similar processing steps to extract the sucrose. This includes separating the juice, filtering, boiling to crystallize the sugar, and centrifuging to remove excess liquid. Sugar beets complete the full refining process at one facility, while sugar cane goes through an additional refining stage at a separate sugar refinery.\n\nBy-products of sugar processing include molasses, which is used for animal feed, baking, and pharmaceuticals, as well as the plant residues like beet pulp and cane stalks, which are also used for animal feed and fuel. Even the water used in processing is recycled.\n\nThe article notes that sugar is naturally white, and it has an indefinite shelf life since it contains no preservatives. It is a balanced part of the diet, found in many foods and even some medicines. Overall, sugar production demonstrates an efficient and sustainable process from the original plant materials.",
      "summaryTimestamp": 1770152977886
    },
    {
      "id": "d6d36ac10b30b8a8",
      "title": "Drainage water recycling benefits being tested on Iowa farm",
      "link": "https://www.agweek.com/crops/drainage-water-recycling-benefits-being-tested-on-iowa-farm",
      "description": "At the Blair Farm near Dayton, Iowa, a family has been utilizing their drainage water recycling system for over three years. The project consists of a pond and irrigation setup.",
      "date": "Tue, 03 Feb 2026 11:30:00 GMT",
      "timestamp": 1770118200000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/1159e9c/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fce%2F19%2F115d5cd04d26b52ce9f7d6322579%2Fimage-20250911-144314-4db77fc7.jpeg",
      "summary": "The system captures water from subsurface tile drains during wet periods, stores it in a pond, and then reuses it for irrigation during drought. This was part of a pilot project with the Iowa Department of Agriculture and Land Stewardship.\n\nThe Blairs' system stores water in a pond and pumps it through an irrigation pivot on 125 acres. While recent rains have limited their ability to test the full impact, Iowa State data has shown yield increases from the system. Experts like Chris Hay of Hay Water Solutions say the system can provide a 3-inch supplemental water supply during dry summer periods.\n\nAn economic analysis by the Environmental Defense Fund found drainage water recycling can boost crop yield income by $130-$146 per acre annually, while saving $10-$20 per acre in operating costs. The practice also provides water quality benefits by reducing nutrient runoff.\n\nHowever, these systems require a significant upfront investment of $2-$3 million, plus ongoing maintenance. Experts recommend having a pond that can store 4-6 inches of water for the irrigated area. Funding will likely require both private farmer investment and public/outside support.\n\nThe Blairs advise other farmers interested in this to seek local help and expertise to plan and implement the system. They are now looking to add features like a fertilizer injection system to further optimize the setup.",
      "summaryTimestamp": 1770152982100
    },
    {
      "id": "c6544946483648cf",
      "title": "Bayer Crop Science not ready to give up on glyphosate",
      "link": "https://www.agweek.com/news/sugarbeet/bayer-crop-science-not-ready-to-give-up-on-glyphosate",
      "description": "Though Bayer Crop Science has spent more than $12 billion defending glyphosate, the company is optimistic a Supreme Court case could clarify the company's use of labels on the popular herbicide.",
      "date": "Tue, 03 Feb 2026 11:30:00 GMT",
      "timestamp": 1770118200000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/7b9791f/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fdd%2F31%2Fd8dda4ab47d3865f8b8a82229108%2F9861280661780-spraying-79784.jpg",
      "summary": "Glyphosate has been a popular and widely-used herbicide since the 1970s, but has faced controversy since 2015 when the International Agency for Research on Cancer declared it a probable carcinogen. \n\nBayer has spent over $12 billion on lawsuits related to glyphosate, and has a 15-11 record in court cases, winning more often than losing. The company is hoping the U.S. Supreme Court will rule in its favor in a case regarding glyphosate labeling.\n\nHowever, Bayer acknowledges that the constant litigation could make crop protection companies less willing to invest in developing new pesticide chemistries, out of fear of future lawsuits. Bayer may eventually have to exit the glyphosate business, which would be \"a bad day\" for both the company and U.S. farmers.\n\nThe American Sugarbeet Growers Association is working on an amicus brief for the Supreme Court case, as the development of Roundup Ready sugarbeets was a major advance for weed control in that crop.",
      "summaryTimestamp": 1770152985348
    },
    {
      "id": "6deb384fcc3ed89f",
      "title": "Starter Flock Program helps students get involved in the Targhee sheep breed",
      "link": "https://www.agweek.com/livestock/other-livestock/starter-flock-program-helps-students-get-involved-in-the-targhee-sheep-breed",
      "description": "In 2023, Annabel Coudron of Marshall, Minnesota, received her starter flock through the U.S. Targhee Sheep Association. Now her breeding program continues to grow.",
      "date": "Tue, 03 Feb 2026 11:27:00 GMT",
      "timestamp": 1770118020000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/3af82c6/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fcf%2F57%2Ff257f2914673bfdf638eb92f9df8%2Fimg-1432.jpg",
      "summary": "S. Targhee Sheep Association is helping more young people get started in the livestock industry by providing them with a starter flock of three Targhee ewes, with at least one being a ewe lamb donated by association members. \n\nIn 2023, Annabel Coudron of Marshall, Minnesota received her starter flock through this program and has continued to grow her Targhee sheep flock.\n\nThe program aims to make it more accessible for young people to get involved with the Targhee sheep breed. Getting started in the livestock industry can be challenging, but this program provides recipients with a helpful start.\n\nNo other specific numbers, prices, statistics, or deadlines were mentioned in the article. The only named individual was Annabel Coudron. The program and Targhee sheep breed were the main organizations/focuses discussed. The location referenced was Marshall, Minnesota. \n\nThe article does not provide much context or discuss any causes or impacts for farmers. However, it does indicate that the Starter Flock Program is intended to make it easier for young people to get involved in raising Targhee sheep, which could have positive impacts by bringing in new producers and helping grow the breed.\n\nNo expert quotes were included in this article.",
      "summaryTimestamp": 1770152990606
    },
    {
      "id": "f6867cadca883924",
      "title": "The US Farmers Saving Palestinian&#160;Seeds",
      "link": "https://civileats.com/2026/02/03/the-us-farmers-saving-palestinian-seeds/",
      "description": "The plants’ true treasure, though, is its seeds—and in 2024, the City Green plants produced more than 9,000. At a time when conflict in the Middle East has destroyed Palestinian farmland and foodways, these seeds have become a beacon of hope for many. City Green is part of a grassroots network of growers in the [&#8230;] The post The US Farmers Saving Palestinian Seeds appeared first on Civil Eats.",
      "date": "Tue, 03 Feb 2026 09:00:49 +0000",
      "timestamp": 1770109249000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/the-us-farmers-saving-palestinian-seeds-1.jpg",
      "summary": "In 2024, the City Green farm in the US produced over 9,000 Palestinian seeds, which have become a symbol of hope for many. The seeds are part of an effort to preserve traditional Palestinian agricultural practices and food ways threatened by the ongoing conflict. The program aims to return the seeds to Palestinian farmers in the future, helping to rebuild their food systems.",
      "summaryTimestamp": 1770152993035
    },
    {
      "id": "3e17a40d75326cb7",
      "title": "Cattle Raisers commend USDA preventative screwworm efforts in Texas",
      "link": "https://www.tsln.com/news/cattle-raisers-commend-usda-preventative-screwworm-efforts-in-texas/",
      "description": "FORT WORTH, Texas (February 2, 2026) — As part of preventative efforts to stop the northward spread of New World screwworm, United States Department of Agriculture has established a new sterile fly dispersal polygon that...",
      "date": "Tue, 03 Feb 2026 03:14:19 +0000",
      "timestamp": 1770088459000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Points:\n\n- The USDA has established a new sterile fly dispersal polygon extending 50 miles into Texas along the U.S.-Mexico border to prevent the northward spread of New World screwworm.\n\n- The dispersal facility at Moore Air Base is scheduled to receive its first shipment of NWS pupae this week for testing, and is expected to be fully operational within 2-3 weeks.\n\n- Texas & Southwestern Cattle Raisers Association (TSCRA) President Carl Ray Polk Jr. welcomes the progress and ongoing collaboration with USDA, but states that until the measures are fully established, keeping the U.S.-Mexico border closed to livestock imports is the responsible course of action to protect livestock and wildlife.\n\n- USDA Secretary Brooke Rollins will keep the border closed, as the threat posed by NWS remains significant and a single incursion could have devastating economic consequences.\n\n- TSCRA, a 148-year-old trade association with over 28,000 members, stands ready to support USDA's efforts to safeguard animal health until the fly can be pushed further south.",
      "summaryTimestamp": 1770152996057
    },
    {
      "id": "6b7209b989c1931e",
      "title": "Chicken wing prices fall despite sky-high demand for Super Bowl LX",
      "link": "https://agrilifetoday.tamu.edu/2026/02/02/chicken-wing-prices-fall-despite-sky-high-demand-for-super-bowl-lx/",
      "description": "AgriLife Extension expert explains how poultry production, pop culture fuel the game-day favorite The post Chicken wing prices fall despite sky-high demand for Super Bowl LX appeared first on AgriLife Today.",
      "date": "Mon, 02 Feb 2026 22:56:27 +0000",
      "timestamp": 1770072987000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "An estimated 1.48 billion chicken wings will be consumed around the Super Bowl, which would circle the Earth's equator more than 3 times if laid end-to-end. \n\nWholesale wing prices are $1.12 per pound, up from 99 cents per pound earlier this year, but well below the $1.99 per pound last year, $2.65 in 2024, and $3.80 in 2022. This is due to increased poultry production, even as wings remain a hugely popular Super Bowl snack.\n\nThe article cites Texas A&M AgriLife Extension economist David Anderson, who says wings have become a cultural tradition for the Super Bowl, similar to hot dogs on the 4th of July. He notes that wing production is limited by animal physiology, but overall U.S. production this year is estimated at 17.5 billion wings, with about 8.5% consumed just during the Super Bowl.\n\nAnderson says the Super Bowl represents the pinnacle of chicken wing demand each year, and that he will personally be making wings to enjoy for the big game.",
      "summaryTimestamp": 1770152999481
    },
    {
      "id": "2e00b2d7c0095aa4",
      "title": "The science of frost cracks: What really happens when trees explode",
      "link": "https://www.farmanddairy.com/news/the-science-of-frost-cracks-what-really-happens-when-trees-explode/903061.html",
      "description": "Ever heard a gunshot-like bang in the winter woods? It might have been an exploding tree. Learn the science behind this wild phenomenon, why extreme temperature swings cause frost cracks and which species are most at risk. The post The science of frost cracks: What really happens when trees explode appeared first on Farm and Dairy.",
      "date": "Mon, 02 Feb 2026 19:26:33 +0000",
      "timestamp": 1770060393000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/IMG_0163-560x420.jpg",
      "summary": "Ever heard a gunshot-like bang in the winter woods? It might have been an exploding tree. Learn the science behind this wild phenomenon, why extreme temperature swings cause frost cracks and which spe...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "5b35fcd6b7a6dab3",
      "title": "New Federal Policy Could Undercut Shareholder Food&#160;Activism",
      "link": "https://civileats.com/2026/02/02/new-federal-policy-could-undercut-shareholder-activism/",
      "description": "February 2, 2026 – The Securities and Exchange Commission (SEC) changed an obscure policy last week that could make it much harder for shareholders to pass resolutions that call on companies—including food and agriculture companies—to improve environmental and social outcomes. Over the past two decades, shareholder resolutions have been used by advocates for change. They [&#8230;] The post New Federal Policy Could Undercut Shareholder Food Activism appeared first on Civil Eats.",
      "date": "Mon, 02 Feb 2026 18:46:57 +0000",
      "timestamp": 1770058017000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "February 2, 2026 – The Securities and Exchange Commission (SEC) changed an obscure policy last week that could make it much harder for shareholders to pass resolutions that call on companies—including...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "f69250bc6a30f58b",
      "title": "Announcing the 2026-27 UMN Extension Cover Crop Academy",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/announcing-2026-27-umn-extension-cover.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 18:36:00 +0000",
      "timestamp": 1770057360000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiJOrkX4QPv9MZBbdXQ9KwgXQbZSwdJ5XCrlGE4qA5EyfCRNZYNvYWDL7n5kRhEAEV1w1-F6TyS9IUgc8A74RqgXJ_svCRVDliwn1zb5KtuagSpE44DgsnOdlgztOen4821Cf9f3v2-dhxIXHLLnzUhRDI98csQevSEPq5AAXcx-MT5_Tueba2EBe7riIX6/s72-c/CCA25-biomass-collection_LStahl.JPG",
      "summary": "UMN Crop News: Announcing the 2026-27 UMN Extension Cover Crop Academy",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "698a96f383fccfaf",
      "title": "At Least 1.75 Million Fewer People Are Receiving SNAP Since Trump Took&#160;Office",
      "link": "https://civileats.com/2026/02/02/at-least-1-75-million-fewer-people-are-receiving-snap-since-trump-took-office/",
      "description": "February 2, 2025 – An estimated 1.75 million fewer people are participating in the Supplemental Nutrition Assistance Program (SNAP) since the start of the Trump administration, demonstrating a decline even before large policy changes to the program began to take effect in November. The latest data from the U.S. Department of Agriculture (USDA) Food and [&#8230;] The post At Least 1.75 Million Fewer People Are Receiving SNAP Since Trump Took Office appeared first on Civil Eats.",
      "date": "Mon, 02 Feb 2026 18:17:52 +0000",
      "timestamp": 1770056272000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "February 2, 2025 – An estimated 1.75 million fewer people are participating in the Supplemental Nutrition Assistance Program (SNAP) since the start of the Trump administration, demonstrating a decline...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "3fb90f1b149ca6de",
      "title": "MN CropCast: Small grains with Jochum Wiersma",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-small-grains-with-jochum.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 17:14:00 +0000",
      "timestamp": 1770052440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "UMN Crop News: MN CropCast: Small grains with Jochum Wiersma",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "9325fe6b60f08d55",
      "title": "From nutrition student to women’s health, a winding path finds purpose",
      "link": "https://agrilifetoday.tamu.edu/2026/02/02/from-nutrition-student-to-womens-health-a-winding-path-finds-purpose/",
      "description": "A science-based nutrition foundation and a willingness to pivot shaped Sydney Heck’s '21 path to maternal newborn nursing The post From nutrition student to women’s health, a winding path finds purpose appeared first on AgriLife Today.",
      "date": "Mon, 02 Feb 2026 15:15:02 +0000",
      "timestamp": 1770045302000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "A science-based nutrition foundation and a willingness to pivot shaped Sydney Heck’s '21 path to maternal newborn nursing The post From nutrition student to women’s health, a winding path finds purpos...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "aea0f0285edfdde0",
      "title": "2026 tree sales listings",
      "link": "https://www.farmanddairy.com/news/2026-tree-sales-listings/903062.html",
      "description": "Find details about your local tree sale in Ohio, Pennsylvania and West Virginia here. The post 2026 tree sales listings appeared first on Farm and Dairy.",
      "date": "Mon, 02 Feb 2026 14:51:35 +0000",
      "timestamp": 1770043895000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Find details about your local tree sale in Ohio, Pennsylvania and West Virginia here. The post 2026 tree sales listings appeared first on Farm and Dairy.",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "6257a6037f848af2",
      "title": "Rochester farm-to-table restaurant pivots to keep food flowing",
      "link": "https://www.agweek.com/agribusiness/rochester-farm-to-table-restaurant-pivots-to-keep-food-flowing",
      "description": "La Mayzteca’s farm-based supply chain now feeds families afraid to leave home as immigration enforcement chills local food economies.",
      "date": "Mon, 02 Feb 2026 11:30:00 GMT",
      "timestamp": 1770031800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/041adfd/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe6%2F63%2F25ccab0d41fe9c7a61bcf7841d6e%2Fla-mayzteca-chicken.jpg",
      "summary": "La Mayzteca’s farm-based supply chain now feeds families afraid to leave home as immigration enforcement chills local food economies.",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "49dd7959d1e7b5ef",
      "title": "Fighting Hunger in Fayetteville,&#160;Arkansas",
      "link": "https://civileats.com/2026/02/02/fighting-hunger-in-fayetteville-arkansas/",
      "description": "Executive Director Mary Thompson remembers one child in particular, a fourth-grader who had just harvested a carrot. “He washed it and put it in his pocket. Later, he took it out and took a nibble like he was really savoring it, then put it back,” she said. “I told him we could harvest another carrot, [&#8230;] The post Fighting Hunger in Fayetteville, Arkansas appeared first on Civil Eats.",
      "date": "Mon, 02 Feb 2026 09:00:27 +0000",
      "timestamp": 1770022827000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/01/fighting-hunger-in-fayetteville-arkansas-1.jpg",
      "summary": "Executive Director Mary Thompson remembers one child in particular, a fourth-grader who had just harvested a carrot. “He washed it and put it in his pocket. Later, he took it out and took a nibble lik...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "7cc6f3e36b7817aa",
      "title": "Is it cold enough yet? Insect overwintering forecasts for 2026",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/is-it-cold-enough-yet-insect.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 01:44:00 +0000",
      "timestamp": 1769996640000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjMmQ-GbIMdKpPucZhRK1-hPC2ABuv58cSc5582DGlNCuQt7fScfi29yIqfbI9mlKRe8ao9NgyjDh9IZRvqKpZjYpZxPX8I0D88m4wijwfam6siqG1deQKAkqNJH0sbLPbBZa_Tr1aXRhT_bsgfg84OjFuO3jqlTsZAJiVF9KEswpQcREOiPmChYqFBDMJV/s72-w640-h452-c/2026%20winter%20lows.png",
      "summary": "UMN Crop News: Is it cold enough yet? Insect overwintering forecasts for 2026",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "3838d234b152d631",
      "title": "Commentary: Looking back at a year of putting Ohio farmers first",
      "link": "https://www.farmanddairy.com/top-stories/commentary-looking-back-at-a-year-of-putting-ohio-farmers-first/903021.html",
      "description": "Ohio FSA Director Don Jones reflects on the president's second term in office and how it impacted Ohio agriculture. The post Commentary: Looking back at a year of putting Ohio farmers first appeared first on Farm and Dairy.",
      "date": "Sat, 31 Jan 2026 20:29:55 +0000",
      "timestamp": 1769891395000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Ohio FSA Director Don Jones reflects on the president's second term in office and how it impacted Ohio agriculture. The post Commentary: Looking back at a year of putting Ohio farmers first appeared f...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "4b5060a5e5fafa98",
      "title": "AGRICULTURE TODAY PODCAST 01/30/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-01-30-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 31 Jan 2026 16:00:04 +0000",
      "timestamp": 1769875204000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "e777c038285a2c46",
      "title": "AgweekTV Full Show: New fungicides, La Mayzteca, soil compaction, sheep starter program",
      "link": "https://www.agweek.com/tv/agweektv-full-show-new-fungicides-la-mayzteca-soil-compaction-sheep-starter-program",
      "description": "Latest products for beet and bean diseases. Minnesota business uses ancient technique for healthier tortillas. Tips for reducing soil compaction. Help for young people to start sheep flocks.",
      "date": "Sat, 31 Jan 2026 11:30:00 GMT",
      "timestamp": 1769859000000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/8282f9a/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fassets-jpcust.jwpsrv.com%2Fthumbnails%2F1ofDsEZL-720.jpg",
      "summary": "Latest products for beet and bean diseases. Minnesota business uses ancient technique for healthier tortillas. Tips for reducing soil compaction. Help for young people to start sheep flocks.",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "414bb181c78c3920",
      "title": "Farm and Dairy Weekly Rundown: Episode 42 (1-29-26)",
      "link": "https://www.farmanddairy.com/news/farm-and-dairy-weekly-rundown-episode-42-1-29-26/903054.html",
      "description": "Reporters Liz Partsch and Paul Rowley give a rundown of the top stories in Farm and Dairy newspaper for the week of Jan. 29, 2026. The post Farm and Dairy Weekly Rundown: Episode 42 (1-29-26) appeared first on Farm and Dairy.",
      "date": "Fri, 30 Jan 2026 21:25:18 +0000",
      "timestamp": 1769808318000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Reporters Liz Partsch and Paul Rowley give a rundown of the top stories in Farm and Dairy newspaper for the week of Jan. 29, 2026. The post Farm and Dairy Weekly Rundown: Episode 42 (1-29-26) appeared...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "30c5ee0c62c62898",
      "title": "COWGIRL honors Texas A&#038;M University faculty member, former students",
      "link": "https://agrilifetoday.tamu.edu/2026/01/30/cowgirl-honors-texas-am-university-faculty-member-former-students/",
      "description": "Magazine's ‘30 Under 30’ issue features innovators, leaders and trailblazers The post COWGIRL honors Texas A&#038;M University faculty member, former students appeared first on AgriLife Today.",
      "date": "Fri, 30 Jan 2026 20:08:03 +0000",
      "timestamp": 1769803683000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Magazine's ‘30 Under 30’ issue features innovators, leaders and trailblazers The post COWGIRL honors Texas A&#038;M University faculty member, former students appeared first on AgriLife Today.",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "4c143df8f11e505c",
      "title": "Donna Alexander retires after 30 years of service to AgriLife Extension",
      "link": "https://agrilifetoday.tamu.edu/2026/01/30/donna-alexander-retires-after-30-years-of-service-to-agrilife-extension/",
      "description": "Longtime agency financial officer and budgetary innovator leaves lasting impact The post Donna Alexander retires after 30 years of service to AgriLife Extension appeared first on AgriLife Today.",
      "date": "Fri, 30 Jan 2026 19:50:51 +0000",
      "timestamp": 1769802651000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Longtime agency financial officer and budgetary innovator leaves lasting impact The post Donna Alexander retires after 30 years of service to AgriLife Extension appeared first on AgriLife Today.",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "8dabd60f1a897e83",
      "title": "Cotton Wholesalers Protect Demand Across Diverse Retail Channels",
      "link": "https://www.allagnews.com/cotton-wholesalers-protect-demand-across-diverse-retail-channels/",
      "description": "LUBBOCK, TX &#8211; Cotton wholesalers help preserve broad-based demand by serving retail channels that would [...]",
      "date": "Fri, 30 Jan 2026 18:45:26 +0000",
      "timestamp": 1769798726000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "LUBBOCK, TX &#8211; Cotton wholesalers help preserve broad-based demand by serving retail channels that would [...]",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "23ccfc5c7828ce8a",
      "title": "Plant Closures Cloud Outlook For Heifer Retention Decisions",
      "link": "https://www.allagnews.com/plant-closures-cloud-outlook-for-heifer-retention-decisions/",
      "description": "LUBBOCK, TX &#8211; Uncertainty around U.S. beef processing capacity is raising fresh questions about whether [...]",
      "date": "Fri, 30 Jan 2026 18:45:01 +0000",
      "timestamp": 1769798701000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "LUBBOCK, TX &#8211; Uncertainty around U.S. beef processing capacity is raising fresh questions about whether [...]",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "cbeb49ad03254851",
      "title": "Record Milk Production Masks Shrinking Dairy Herd Pipeline",
      "link": "https://www.allagnews.com/record-milk-production-masks-shrinking-dairy-herd-pipeline/",
      "description": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "date": "Fri, 30 Jan 2026 18:15:20 +0000",
      "timestamp": 1769796920000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "6e08f08dc38beaf7",
      "title": "Grain Transportation Shows Mixed Signals Across Key Channels",
      "link": "https://www.allagnews.com/grain-transportation-shows-mixed-signals-across-key-channels/",
      "description": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "date": "Fri, 30 Jan 2026 18:00:09 +0000",
      "timestamp": 1769796009000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "a3f65bc7a793f6b8",
      "title": "Senator Amy Klobuchar Launches Campaign for Minnesota&#160;Governor",
      "link": "https://civileats.com/2026/01/29/senator-amy-klobuchar-launches-campaign-for-minnesota-governor/",
      "description": "January 29, 2025 – Senator Amy Klobuchar (D-Minnesota), the top Democrat on the Senate Agriculture Committee, has officially joined the Minnesota gubernatorial race. The current governor, Tim Walz, who is also a Democrat, announced earlier this month that he would drop his reelection campaign, amid escalating tensions with the Trump administration. Walz and other Minnesota [&#8230;] The post Senator Amy Klobuchar Launches Campaign for Minnesota Governor appeared first on Civil Eats.",
      "date": "Thu, 29 Jan 2026 22:03:55 +0000",
      "timestamp": 1769724235000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "January 29, 2025 – Senator Amy Klobuchar (D-Minnesota), the top Democrat on the Senate Agriculture Committee, has officially joined the Minnesota gubernatorial race. The current governor, Tim Walz, wh...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "d57cc7c9daeb26a1",
      "title": "New Irrigation Cost-Share Opportunity Coming to Minnesota Farmers: Sign-Up Opens on February 2nd 2026",
      "link": "https://blog-crop-news.extension.umn.edu/2026/01/new-irrigation-cost-share-opportunity.html",
      "description": "",
      "date": "Thu, 29 Jan 2026 16:51:00 +0000",
      "timestamp": 1769705460000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh4EfB_R_EsViYRP1IYRymXTsOEJ6s6Krmc2hREqgYQzFkc-2eNo1ui2KwCZGeHM0mqjiLMqOC2JSo3Zfj1vTBOgOZeuymWvHBw9jLOFUCzUCC8tVKRd8529WIVASA8rA0i0G0Vv4rBCkTvMzhHghzJ739n90luTCQPCa4WZtkLu8wSC-dzNyVVy_dUGIJR/s72-w640-h426-c/MIP%20field%20day%20(26).JPG",
      "summary": "UMN Crop News: New Irrigation Cost-Share Opportunity Coming to Minnesota Farmers: Sign-Up Opens on February 2nd 2026",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide ...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "fa48333649a8e7d4",
      "title": "MN CropCast: Soil compaction with Jodi DeJong-Hughes",
      "link": "https://blog-crop-news.extension.umn.edu/2026/01/mn-cropcast-soil-compaction-with-jodi.html",
      "description": "",
      "date": "Wed, 28 Jan 2026 20:35:00 +0000",
      "timestamp": 1769632500000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "UMN Crop News: MN CropCast: Soil compaction with Jodi DeJong-Hughes",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated an...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degree...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in foreste...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high tempe...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air ...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "75d0524dd80f4e3e",
      "title": "Double-crop Soybean Management Practices &#8211; Project Report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/double-crop-soybean-management-practices-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wheat acreage has been limited in recent decades. USDA-NASS survey estimates that 60-80% of Illinois wheat acres are double-cropped with soybeans. Implementing this system in central and northern Illinois has been constrained primarily by low wheat acreage and by later wheat harvest, which often delay",
      "date": "Tue, 13 Jan 2026 12:52:03 +0000",
      "timestamp": 1768308723000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/01/Table1_site-info.jpg",
      "summary": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wh...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings ...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live i...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "c5d2a6507d94433d",
      "title": "Glufosinate-Resistant Waterhemp (Amaranthus tuberculatus) Confirmed in Illinois",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/glufosinate-resistant-waterhemp-amaranthus-tuberculatus-confirmed-in-illinois.html",
      "description": "Weed scientists at the University of Illinois and Southern Illinois University Carbondale recently announced the confirmation of glufosinate resistance in Illinois waterhemp populations. Glufosinate is a non-selective herbicide most commonly applied postemergence in Illinois corn and soybean crops engineered with resistance to the herbicide. Use of glufosinate has increased over the past decade as the efficacy of other postemergence herbicides against waterhemp has been compromised through the e",
      "date": "Fri, 09 Jan 2026 17:51:48 +0000",
      "timestamp": 1767981108000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Weed scientists at the University of Illinois and Southern Illinois University Carbondale recently announced the confirmation of glufosinate resistance in Illinois waterhemp populations. Glufosinate i...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "0833801a366b965b",
      "title": "Jan 08 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/jan-08-climate-review-and-weather-forecast.html",
      "description": "Happy new year! For the first summary of 2026, we’ll take a quick look back at December and the weather year of 2025, and then look forward to the rest of winter and a bit of spring. December was around 2.5 degrees colder than normal statewide, which was quite a contrast to a very warm fall season. However, the average temperature in December doesn’t tell the story of its huge temperature swings. Much of the state had temperatures that were 20 to 30 degrees below normal in the middle of the mont",
      "date": "Fri, 09 Jan 2026 14:01:04 +0000",
      "timestamp": 1767967264000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Happy new year! For the first summary of 2026, we’ll take a quick look back at December and the weather year of 2025, and then look forward to the rest of winter and a bit of spring. December was arou...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "90145084b32c6f91",
      "title": "The New Superfood With Minimal Environmental Footprint",
      "link": "https://modernfarmer.com/2026/01/superfood-environmental-footprint/",
      "description": "In the future, farmers can diversify the output of their farms with Chlorella vulgaris, a freshwater alga gaining traction as a dietary supplement and superfood with a minimal environmental footprint, most notably in Japan, Taiwan, and Germany. The post The New Superfood With Minimal Environmental Footprint appeared first on Modern Farmer.",
      "date": "Mon, 05 Jan 2026 10:00:48 +0000",
      "timestamp": 1767607248000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Microscopic-Chlorella-vulgaris.webp",
      "summary": "In the future, farmers can diversify the output of their farms with Chlorella vulgaris, a freshwater alga gaining traction as a dietary supplement and superfood with a minimal environmental footprint,...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailo...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "d66a7adf5c8399a3",
      "title": "The Three Market Forces Reshaping Agriculture Sales and Marketing",
      "link": "https://www.farmjournal.com/the-three-market-forces-reshaping-agriculture-sales-and-marketing/",
      "description": "What Ag Suppliers Must Know to Stay Ahead in a Rapidly Changing Industry Agriculture is in one of its most consequential periods in decades. Today’s farm economy is under prolonged financial strain that is reshaping how growers make decisions, a moment economists describe as “not a collapse, but a grind.” (AgWeb) In this environment, the [&#8230;] The post The Three Market Forces Reshaping Agriculture Sales and Marketing appeared first on Farm Journal.",
      "date": "Thu, 11 Dec 2025 18:08:03 +0000",
      "timestamp": 1765476483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2025/12/image-2-1024x577.png",
      "summary": "What Ag Suppliers Must Know to Stay Ahead in a Rapidly Changing Industry Agriculture is in one of its most consequential periods in decades. Today’s farm economy is under prolonged financial strain th...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "ce3ade9054dd723c",
      "title": "Still an opportunity to attend the ICM Conference!",
      "link": "https://crops.extension.iastate.edu/post/still-opportunity-attend-icm-conference",
      "description": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean field with Integrated Crop Management Conference overlayed on top. Learn more at go.iastate.edu/ICM\" width=\"408\" height=\"214\" class=\"align-left\" loading=\"lazy\"><p>This year we are offering on-site registration for the <a href=\"https://www.regcytes.extension.iastate.edu/icm/\">Integrated Crop Managem",
      "date": "Thu, 04 Dec 2025 08:22:25 -0600",
      "timestamp": 1764858145000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg",
      "summary": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "6e56b2436e07fb98",
      "title": "Registration is now open for the 36th Integrated Crop Management Conference",
      "link": "https://crops.extension.iastate.edu/post/registration-now-open-36th-integrated-crop-management-conference",
      "description": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water management. The event features experts sharing research updates and practical recommendations. Don’t miss this key opportunity for networking and education!</p><p><strong>When: </strong>December 10 and 11, 2025</p><p><strong>Where: </strong>The Meadows Events Center in Altoona, Iowa</p><p><strong>Who",
      "date": "Mon, 27 Oct 2025 14:12:34 -0500",
      "timestamp": 1761592354000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water m...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 poin...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with addi...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representa...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some k...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth ...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) fac...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadl...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Band...",
      "summaryTimestamp": 1770153003192
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 3,
  "updated": "2026-02-04T06:44:39.050Z"
}