{
  "items": [
    {
      "id": "fca2d7d6cdcb706d",
      "title": "Kansas Beef Council Announces Spring BQA Trainings",
      "link": "https://www.morningagclips.com/kansas-beef-council-announces-spring-bqa-trainings/",
      "description": "TOPEKA, Kan. &#8212; The Kansas Beef Council (KBC) has released dates for three Beef Quality Assurance (BQA) trainings across Kansas this spring as part of its continued commitment to cattle well-being, beef quality and food safety. BQA certification will be led by Dr. A.J. Tarpoff, DVM, K-State, and will provide producers with current practices and information on BQA certification requirements. A beef dinner will be served at 6 p.m. with training to follow. [&#8230;] The post Kansas Beef Counci",
      "date": "Thu, 05 Feb 2026 21:51:51 +0000",
      "timestamp": 1770328311000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Kansas Beef Council (KBC) has announced three free Beef Quality Assurance (BQA) training sessions across Kansas in March 2026. The trainings will be led by Dr. A.J. Tarpoff, DVM from Kansas State University, and will provide producers with current practices and information on BQA certification requirements. A beef dinner will be served at 6 p.m. with the training to follow.\n\nThe training dates and locations are:\n- March 10 in Washington, KS at the Washington Sales Pavilion\n- March 12 in Emporia, KS at the Anderson Building, Lyon County Fairgrounds\n- March 24 in Fort Scott, KS at the Fort Scott Livestock\n\nAccording to Dr. Tarpoff, these BQA trainings are important for keeping producers up to date on industry issues and reviewing research-based best management practices. Producers can register for the free events by emailing [email protected] or calling 785.273.5225.\n\nThe Beef Checkoff Program, established as part of the 1985 Farm Bill, assesses $1 per head on the sale of live domestic and imported cattle, with states retaining up to 50 cents per head.",
      "summaryTimestamp": 1770330179707
    },
    {
      "id": "7c197f391fd5fabd",
      "title": "Cattle futures drop ahead of widespread direct trade",
      "link": "https://www.brownfieldagnews.com/market-news/cattle-futures-drop-ahead-of-widespread-direct-trade/",
      "description": "Chicago Mercantile Exchange live and feeder cattle futures were sharply lower on the midday decline in boxed beef and traders waiting for direct business to get underway. There was additional pressure from the news during the session that workers at a major processing facility in Colorado voted to strike. April live was down $6.20 at [&#8230;] The post Cattle futures drop ahead of widespread direct trade appeared first on Brownfield Ag News.",
      "date": "Thu, 05 Feb 2026 21:48:11 +0000",
      "timestamp": 1770328091000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Cattle futures dropped sharply ahead of widespread direct trade. April live cattle futures were down $6.20 at $160.17 per cwt. This decline was due to a midday drop in boxed beef prices and traders waiting for direct cattle sales to begin. There was additional pressure from news that workers at a major processing facility in Colorado voted to strike.",
      "summaryTimestamp": 1770330181589
    },
    {
      "id": "a465304a392750ae",
      "title": "SDSU Veterinary Student Receives Graduate Scholarship",
      "link": "https://www.tsln.com/news/sdsu-veterinary-student-receives-graduate-scholarship/",
      "description": "Helping her grandpa, Randy Willmott, feed and care for bottle calves on the family&#8217;s Brookings County farm led Tara Feucht to veterinary medicine. Feucht is the recipient of the Travelers Motor Club $2,500 Graduate School...",
      "date": "Thu, 05 Feb 2026 21:43:54 +0000",
      "timestamp": 1770327834000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/05143754/image-8-768x1024.png",
      "summary": "Feucht, who grew up helping her grandfather on their family farm in Brookings County, was inspired to pursue veterinary medicine. As an SDSU undergraduate, she was involved in the pre-vet club and volunteered as the Superintendent for the Little I vet science competition. Feucht was accepted to the SDSU Veterinary Medicine program, which receives 250 applicants annually but only accepts 20 students. The classes are challenging, but the small class size and attentive professors help. Veterinary school costs around $16,700 per semester at SDSU, increasing to $34,155 per semester when Feucht transfers to the University of Minnesota due to out-of-state tuition. Scholarships, loans, and other programs help Feucht cover these costs. She encourages other aspiring veterinarians not to be deterred by the high costs, as financial assistance is available.",
      "summaryTimestamp": 1770330185219
    },
    {
      "id": "63ef6e166f774c2e",
      "title": "SARE to host labor and business guidance seminars for North Dakota farmers and ranchers",
      "link": "https://www.tsln.com/news/sare-to-host-labor-and-business-guidance-seminars-for-north-dakota-farmers-and-ranchers/",
      "description": "North Dakota farmers and ranchers are invited to attend a workshop and webinars on farm labor and farm business structures, organized by the North Dakota Sustainable Agriculture Research and Education (SARE) program. Participants can attend...",
      "date": "Thu, 05 Feb 2026 21:43:42 +0000",
      "timestamp": 1770327822000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/05144246/farm-labor-4-1024x576.jpg",
      "summary": "Key Takeaways:\n\n1. The North Dakota Sustainable Agriculture Research and Education (SARE) program is hosting a workshop and webinar series for North Dakota farmers and ranchers on farm labor and business structures.\n\n2. The in-person workshop will be held on February 24, 2026, from 9:30 a.m. to 3:30 p.m. CST at the North Dakota Farmers Union headquarters in Jamestown, North Dakota.\n   - The morning session will focus on the H-2A temporary agricultural worker program, covering opportunities and legal, financial, and ethical considerations.\n   - The afternoon session will examine different farm business structures, comparing sole proprietorships, partnerships, LLCs, and corporations, with a focus on liability protection, governance, taxation, and risk management.\n\n3. Two webinars will be held after the workshop:\n   - March 3, 2026: Addressing employee benefits, including bonuses, health insurance support, and legal aspects.\n   - March 10, 2026: Focusing on farm liability, insurance, and risk management strategies.\n   - The webinars will be conducted by Rachel Armstrong, executive director of Farm Commons, a national nonprofit organization.\n\n4. The registration fee for the event is $50 per person, and the registration deadline is February 18, 2026.\n\n5. For more information, farmers and ranchers can contact North Dakota SARE co-coordinators Karl Hoppe at 701-652-2951 or Jeff Gale at 701-652-2581.",
      "summaryTimestamp": 1770330189122
    },
    {
      "id": "f43840ce1fe7006f",
      "title": "USDA Shifts Sterile Fly Dispersal Efforts to Defend U.S. Border; Equine imported from Argentina quarantined for NWS",
      "link": "https://www.tsln.com/news/usda-shifts-sterile-fly-dispersal-efforts-to-defend-u-s-border-equine-imported-from-argentina-quarantined-for-nws/",
      "description": "Washington, D.C., January 30, 2026—The United States Department of Agriculture&#8217;s (USDA) Animal and Plant Health Inspection Service (APHIS) is announcing a shift in its 100 million per week sterile fly dispersal efforts to stop the...",
      "date": "Thu, 05 Feb 2026 21:39:32 +0000",
      "timestamp": 1770327572000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "S.-Mexico border to defend against the spread of New World screwworm (NWS). They will allocate 100 million sterile flies per week to a 50-mile area along the border with the Mexican state of Tamaulipas, where recent NWS cases have been detected. \n\nThis is a proactive measure, as the northernmost active NWS case in Mexico is still about 200 miles from the U.S. border. However, the USDA wants to create a sterile reproduction buffer zone to prevent NWS from reaching the U.S.\n\nThe sterile flies will be dyed with a fluorescent marker to allow officials to distinguish them from wild NWS flies if captured in traps. This is part of the USDA's broader NWS response efforts, which also include import protocols, ongoing surveillance, innovation investments, and support for activities in Mexico and Central America.\n\nIn a related development, a horse imported from Argentina was recently quarantined at a Florida facility due to concerns about NWS. Import requirements and protocols are a critical part of USDA's defense against foreign animal diseases like NWS.",
      "summaryTimestamp": 1770330192422
    },
    {
      "id": "1446ba66dcf36087",
      "title": "Statement by Mark McHargue, President, Regarding Legislation to Make Cattle Brand Inspection System Voluntary",
      "link": "https://www.morningagclips.com/statement-by-mark-mchargue-president-regarding-legislation-to-make-cattle-brand-inspection-system-voluntary/",
      "description": "LINCOLN, Neb. – “Nebraska Farm Bureau continues to be a strong supporter of the work of the Nebraska Brand Committee, including its important role in mitigating cattle theft in our state. While we have been open to discussions centered around modernization to ensure the current fee system is equitable for program participants, our members have [&#8230;] The post Statement by Mark McHargue, President, Regarding Legislation to Make Cattle Brand Inspection System Voluntary appeared first on Morning",
      "date": "Thu, 05 Feb 2026 21:38:46 +0000",
      "timestamp": 1770327526000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Nebraska Farm Bureau President Mark McHargue opposes legislation (LB 1258) to make the state's cattle brand inspection system voluntary. \n\nThe key points are:\n\n- Nebraska Farm Bureau strongly supports the work of the Nebraska Brand Committee and the mandatory cattle brand inspection program to mitigate cattle theft.\n\n- While open to modernizing the fee system to ensure equity, Nebraska Farm Bureau members do not support transitioning to a voluntary statewide brand inspection system as proposed in LB 1258 by Senator Ben Hansen.\n\n- Nebraska Farm Bureau will actively work to stop any efforts to implement a voluntary statewide brand inspection system.\n\n- Nebraska Farm Bureau represents nearly 55,000 farm and ranch families across Nebraska, working to achieve rural and urban prosperity as agriculture is a key part of Nebraska's economy.",
      "summaryTimestamp": 1770330195610
    },
    {
      "id": "f2d90fc61ec1a176",
      "title": "NRDs Renew Agreement With NRCS to Strengthen Long-Standing Conservation Partnership",
      "link": "https://www.morningagclips.com/nrds-renew-agreement-with-nrcs-to-strengthen-long-standing-conservation-partnership/",
      "description": "LINCOLN, Neb. – Nebraska’s Natural Resources Districts (NRDs) collectively renewed their Memorandum of Agreement with the U.S. Department of Agriculture’s Natural Resources Conservation Service (NRCS) during a signing ceremony Jan. 27, 2026. The updated agreement reaffirms a partnership that traces its roots back more than 90 years to the Dust Bowl era. “For decades, Nebraska’s NRDs [&#8230;] The post NRDs Renew Agreement With NRCS to Strengthen Long-Standing Conservation Partnership appeared fi",
      "date": "Thu, 05 Feb 2026 21:28:46 +0000",
      "timestamp": 1770326926000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "S. Department of Agriculture's Natural Resources Conservation Service (NRCS) on January 27, 2026. This updated agreement reaffirms a 90-year partnership dating back to the Dust Bowl era. \n\nThe partnership allows NRDs and NRCS to collaborate on locally identified natural resource priorities like soil health, water quality, groundwater management, forestry, wildlife habitat, and flood control. NRCS has 77 county field offices across Nebraska that align with NRD boundaries.\n\nAccording to Martin Graff, Nebraska Association of Resources Districts president, \"Districts are committed to continuing this cooperative approach to protect lives, property, and future.\" NRCS Acting State Conservationist James Huntwork said the renewal \"demonstrates the importance of our long-standing conservation partnership\" in addressing challenges like drought, flooding, and soil health.\n\nAnnette Sudbeck, Lewis & Clark NRD general manager, noted these partnerships allow Nebraska's agricultural producers to remain productive and sustainable while protecting natural resources for future generations. Each of the 23 NRDs are working to sign the renewed agreement, which will remain in effect until modified or terminated.",
      "summaryTimestamp": 1770330199857
    },
    {
      "id": "a9738f3ce911ffff",
      "title": "Black Hills National Forest Begin Prescribed Fires",
      "link": "https://www.tsln.com/news/black-hills-national-forest-begin-prescribed-fires/",
      "description": "Favorable weather conditions are in place for hazardous fuels reduction work Custer, SD., Feb. 5, 2026—&#160;Black Hills National Forest is planning prescribed fire operations this Saturday, Feb. 7 pending all required approvals. We estimate this...",
      "date": "Thu, 05 Feb 2026 21:26:25 +0000",
      "timestamp": 1770326785000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Black Hills National Forest Begin Prescribed Fires\n\n- The Black Hills National Forest in Custer, South Dakota is planning prescribed fire operations on February 7-8, 2026, pending required approvals.\n\n- The prescribed fires will be conducted in the Anti-Horse project area, located approximately 18 miles west of Custer, South Dakota or 5 miles west of Jewel Cave National Monument.\n\n- The prescribed burns aim to reduce overgrown vegetation and help protect local communities, infrastructure, and natural resources from wildfires.\n\n- No closures are anticipated, but the public is asked to avoid the area and watch for warning signs along roads.\n\n- Residents may experience smoke during the prescribed burns. The public is advised to check the https://fire.airnow.gov/ website for air quality updates.\n\n- The U.S. Forest Service will evaluate weather conditions before the burns and may cancel scheduled activities if conditions are not favorable.\n\n- The Forest Service manages 193 million acres of public land and has either a direct or indirect role in the stewardship of about 900 million forested acres within the U.S., including 130 million acres of urban forests.",
      "summaryTimestamp": 1770330202892
    },
    {
      "id": "2d51a5e9425f2beb",
      "title": "Snow Can Play Helpful Role in Garden Soil Enrichment &#038; Root Insulation",
      "link": "https://www.morningagclips.com/snow-can-play-helpful-role-in-garden-soil-enrichment-root-insulation/",
      "description": "ASHLAND, Va. &#8212; Beneath the ice-glazed blanket of snow testing Virginians’ patience is the promise of a verdant spring. While frozen conditions disrupt life on the street level, plants and grasses are insulated from extreme cold as slow-melting snow provides steady moisture and atmospheric nutrients. Depending on conditions, soil-enriching elements like nitrogen and phosphorus attach [&#8230;] The post Snow Can Play Helpful Role in Garden Soil Enrichment &#038; Root Insulation appeared firs",
      "date": "Thu, 05 Feb 2026 21:25:29 +0000",
      "timestamp": 1770326729000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Depending on atmospheric conditions, snow can contain soil-enriching elements like nitrogen and phosphorus. When homeowners relocate snow onto garden beds and landscaped areas, it introduces a \"bump of nitrogen\" that slowly releases as the snow melts. This provides a steady source of moisture and nutrients for plants as they emerge in spring. \n\nThe article notes that landowners managing pastures and grasslands typically spend $4-$10 per acre for professional nutrient management planning, but they welcome the natural fertilization from snowfall. Even a modest layer of snow helps insulate soil from extreme temperature fluctuations, preventing damage to plant roots. However, the article advises protecting flowering plants with covers during warm spells followed by cold snaps.\n\nThe article cites Scot Ferguson, a Virginia Cooperative Extension agent, and Mark Viette, a retired host of the \"In the Garden\" video series, as expert sources. It was published on February 5, 2026 by the Virginia Farm Bureau.",
      "summaryTimestamp": 1770330206915
    },
    {
      "id": "b5204fc28a2f3458",
      "title": "E15 supporters urge Congress to finish the job on year-round sales",
      "link": "https://www.brownfieldagnews.com/news/e15-supporters-urge-congress-to-finish-the-job-on-year-round-sales/",
      "description": "Ethanol advocates say a federal solution for year-round sales of E15 is long overdue. Nick Bowdish, president and CEO of southwest Iowa-based Elite Octane, says the debate over a permanent fix has stretched on for more than a decade. “I am calling on Congress this morning to finish the job or get out of the [&#8230;] The post E15 supporters urge Congress to finish the job on year-round sales appeared first on Brownfield Ag News.",
      "date": "Thu, 05 Feb 2026 21:20:50 +0000",
      "timestamp": 1770326450000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- Ethanol industry leaders, like Nick Bowdish of Elite Octane, say a federal solution for year-round E15 sales has been debated for over a decade and is long overdue.\n- Bowdish is urging Congress to either \"finish the job\" and pass legislation allowing year-round E15 sales, or \"get out of the way\" if they cannot resolve the issue.\n- Year-round E15 sales are currently restricted due to outdated regulations, creating challenges for ethanol producers and farmers. Advocates argue permanent E15 access would benefit the agricultural sector.\n- No specific timeline or deadline was provided, but the article suggests ethanol supporters are ramping up pressure on Congress to act on this issue soon.",
      "summaryTimestamp": 1770330209619
    },
    {
      "id": "723ce22cf25ff1a4",
      "title": "New USDA farm income report highlights financial challenges",
      "link": "https://www.brownfieldagnews.com/news/new-usda-farm-income-report-highlights-financial-challenges/",
      "description": "An ag economist says USDA’s new farm income report highlights how hard it is for farmers and ranchers to keep producing. Danny Munch with American Farm Bureau Federation says this is the first net farm income report since September because of the government shutdown, and Munch tells Brownfield USDA made big adjustments to 2025 and [&#8230;] The post New USDA farm income report highlights financial challenges appeared first on Brownfield Ag News.",
      "date": "Thu, 05 Feb 2026 21:18:58 +0000",
      "timestamp": 1770326338000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA's new farm income report highlights the financial challenges faced by farmers and ranchers. Danny Munch, an economist with the American Farm Bureau Federation, says this is the first net farm income report since September due to the government shutdown. The report includes significant adjustments to the 2018 and 2019 net farm income forecasts.\n\nThe 2018 net farm income is now forecast at $69.4 billion, down $9.1 billion from the previous estimate. The 2019 net farm income is projected to be $69.0 billion, down $3.9 billion from the prior forecast. These declines are attributed to lower crop and livestock receipts, as well as increased production expenses.\n\nThe report indicates that farmers and ranchers are struggling to maintain profitability in the current agricultural environment. Munch emphasizes that it is becoming increasingly difficult for producers to continue their operations given the financial pressures they are facing. The USDA's report provides a sobering assessment of the challenges confronting the agricultural sector.",
      "summaryTimestamp": 1770330212446
    },
    {
      "id": "1241b0a9dbce43aa",
      "title": "Biofuels industry eyes 2026 recovery as E15, RVO decisions loom",
      "link": "https://www.brownfieldagnews.com/news/biofuels-industry-eyes-2026-recovery-as-e15-rvo-decisions-loom/",
      "description": "A biofuels supporter says 2026 could be a rebound year for the industry. Monte Shaw, executive director of the Iowa Renewable Fuels Association, says the entire biofuels sector is searching for momentum. “If we look back, 2025 was not a fun year,” he said. “It was tough for biodiesel, not necessarily great for biodiesel, and [&#8230;] The post Biofuels industry eyes 2026 recovery as E15, RVO decisions loom appeared first on Brownfield Ag News.",
      "date": "Thu, 05 Feb 2026 21:18:30 +0000",
      "timestamp": 1770326310000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The biofuels industry is expecting a potential recovery by 2026, as the fate of E15 fuel and Renewable Volume Obligations (RVOs) hangs in the balance.\n\nAccording to Monte Shaw, executive director of the Iowa Renewable Fuels Association, 2025 was a challenging year for the industry, particularly for biodiesel. The entire biofuels sector is seeking momentum to rebound.\n\nThe future of E15 fuel, which contains 15% ethanol, is a key factor. The EPA is expected to make a decision on the future of E15 in the coming months. Additionally, the EPA is also set to finalize RVOs, which determine the required amount of biofuels to be blended into the nation's fuel supply.\n\nThe outcome of these decisions will have a significant impact on the biofuels industry and the broader agricultural community. Farmers are closely watching these developments, as they could affect the demand for their crops used in biofuel production.\n\nExperts like Shaw are hopeful that with the right policy decisions, the biofuels industry can bounce back and reach a recovery by 2026. However, the industry remains in a state of uncertainty as it waits for the EPA's upcoming rulings.",
      "summaryTimestamp": 1770330215395
    },
    {
      "id": "3348a88be57b90ea",
      "title": "McCarty Receives Outstanding Contribution Award",
      "link": "https://www.morningagclips.com/mccarty-receives-outstanding-contribution-award/",
      "description": "CLEMSON, S.C. &#8212; Lambert “Bert” McCarty, a Clemson University professor emeritus of plant and environmental sciences, has received the GCSAA Outstanding Contribution Award. The award recognizes individuals who have made a lasting and significant impact on the golf course industry. It was presented during the opening session of the 2026 Golf Course Superintendents Association of [&#8230;] The post McCarty Receives Outstanding Contribution Award appeared first on Morning Ag Clips.",
      "date": "Thu, 05 Feb 2026 21:15:50 +0000",
      "timestamp": 1770326150000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The award recognizes individuals who have made a lasting and significant impact on the golf course industry. It was presented on February 2, 2026 at the opening session of the Golf Course Superintendents Association of America (GCSAA) Conference and Trade Show in Orlando, Florida.\n\nMcCarty's influence spans over 40 years of research, education, and service. He has authored the first Best Management Practices book for golf courses, developed curriculum, mentored students, and conducted research that continues to influence turfgrass management practices nationwide. He has published 20 books, 110 book chapters, 135 refereed journal articles, 180 Extension publications, 230 trade journal articles, and 36 annual research reports. He has given over 600 scientific presentations and is a co-inventor on a patent for the use of tebuconazole to control annual bluegrass.\n\nMcCarty's honors include the Godley-Snell Award for Excellence, the College of Agriculture, Forestry and Life Sciences Alumni Distinguished Service Award, the Crop Science Society of America Fred Grau Award, and fellow status in both the Crop Science Society of America and the American Society of Agronomy. He received the Carolinas GCSA Distinguished Service Award in 2018 and Clemson's CAFLS Distinguished Service Award in 2024. He was also recently inducted into the S.C. Sports Field Managers Association Hall of Fame.\n\nThough semi-retired, McCarty continues to teach part-time and consult on turfgrass issues, stating \"I enjoy teaching, visiting sites and helping solve problems on golf courses. I still do the work that interests me and has the potential to positively impact the industry.\"",
      "summaryTimestamp": 1770330219714
    },
    {
      "id": "f55d54aa7023f706",
      "title": "CattleFax Outlook Signals Cattle Cycle Turning as Strong Demand Meets Tight Supplies in 2026",
      "link": "https://www.tsln.com/news/cattlefax-outlook-signals-cattle-cycle-turning-as-strong-demand-meets-tight-supplies-in-2026-2/",
      "description": "NASHVILLE, Tennessee (Feb. 5, 2026) — The popular CattleFax Outlook Seminar, held as part of CattleCon 2026 in Nashville, Tennessee, shared expert market and weather analysis today. &#8220;The U.S. cattle and beef industry enters 2026...",
      "date": "Thu, 05 Feb 2026 21:15:30 +0000",
      "timestamp": 1770326130000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The U.S. is entering 2026 with strong but volatile market conditions, as historically tight cattle supplies, record-high beef demand, and elevated policy and weather uncertainty continue to support prices near cyclical highs.\n\nWeather Outlook:\n- La Niña is expected to dissipate by March, leading to a transitional weather pattern through spring and early summer.\n- There is a 70% chance of drought intensification across the Southern U.S. and Central Plains in the near-term, though spring may see more even moisture distribution.\n- Summer weather outcomes depend on how quickly an El Niño develops - a fast El Niño could deepen drought in corn regions while increasing precipitation out West, while slower development may support more balanced moisture. By fall, El Niño becomes increasingly likely.\n\nEconomic, Energy, and Feed Grain Outlook:\n- Inflation moderated to 2.7% in 2025, allowing the Federal Reserve to lower interest rates, with the Prime Rate finishing the year just below 7%.\n- U.S. corn production reached a record 186.5 bu/acre in 2025, with 17 billion total bushels from 98.8 million acres. Corn prices are expected to stay in the $4-$5/bu range due to competitive prices and ample supply.\n- U.S. hay production increased slightly in 2025.\n\nOverall, the cattle cycle appears to be turning, with tight supplies meeting strong demand in 2026, though a slow, measured expansion phase is expected due to producer demographics, high input costs, and policy uncertainty.",
      "summaryTimestamp": 1770330223650
    },
    {
      "id": "fa8456f2e716ae8a",
      "title": "Early February market rally an unexpected gift for farmers",
      "link": "https://www.brownfieldagnews.com/news/early-february-market-rally-an-unexpected-gift-for-farmers/",
      "description": "An unexpected gift. “This has been quite a gift, quite an opportunity for farmers.” Naomi Blohm, senior market advisor with Total Farm Marketing, says this week’s announcement of China potentially purchasing even more U.S. soybeans delivered farmers a rare opportunity.&#160; “We started the week with the markets in the doldrums and then one social [&#8230;] The post Early February market rally an unexpected gift for farmers appeared first on Brownfield Ag News.",
      "date": "Thu, 05 Feb 2026 21:12:14 +0000",
      "timestamp": 1770325934000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "This week's announcement of China potentially purchasing more U.S. soybeans has delivered an unexpected market rally for farmers. Naomi Blohm, senior market advisor with Total Farm Marketing, states that this is \"quite a gift, quite an opportunity for farmers\" after the markets started the week \"in the doldrums.\" The rally comes as a rare opportunity for farmers amid the current market conditions. No specific numbers or dates were provided in the article.",
      "summaryTimestamp": 1770330225930
    },
    {
      "id": "66eb01a032761448",
      "title": "Ag groups unite in support of USMCA renewal",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/ag-groups-unite-in-support-of-usmca-renewal]]>",
      "description": "Newly formed coalition represents 40 U.S. food and farm stakeholders committed to maintaining USMCA with improvements.",
      "date": "Thu, 05 Feb 2026 21:06:55 GMT",
      "timestamp": 1770325615000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt032566db85ad67aa/69850b0ad08b0a8292734dcd/Agricultural_Coalition_for_the_USMCA_logo.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The U.S. food and agricultural industries have formed a new coalition, representing 40 stakeholders, to support the renewal of the United States-Mexico-Canada Agreement (USMCA). The coalition aims to maintain the USMCA with potential improvements. \n\nThe coalition includes organizations such as the American Farm Bureau Federation, National Cattlemen's Beef Association, and National Corn Growers Association. The group believes that renewing the USMCA is crucial for the continued growth and stability of the U.S. food and agricultural sectors.\n\nThe USMCA, which replaced the North American Free Trade Agreement (NAFTA), has been in effect since July 2020. It has provided significant benefits to U.S. farmers and ranchers, including increased market access and improved trading relationships with Canada and Mexico.\n\nThe coalition is working to ensure that the USMCA remains in place and continues to support the U.S. agricultural industry. They are advocating for the U.S. government to prioritize the renewal of the agreement before it expires in 2026.\n\nFarmers and ranchers are encouraged to engage with their elected representatives to express their support for the USMCA renewal and to highlight the importance of maintaining a strong agricultural trade relationship with Canada and Mexico.",
      "summaryTimestamp": 1770330228885
    },
    {
      "id": "bb73bc598e5b3a8a",
      "title": "Texas A&#038;M Forest Service increases funding to combat oak wilt spread",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-am-forest-service-increases-funding-to-combat-oak-wilt-spread/",
      "description": "Cost-share opportunities offer Texas landowners critical resources to mitigate destructive disease The post Texas A&#038;M Forest Service increases funding to combat oak wilt spread appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 21:04:25 +0000",
      "timestamp": 1770325465000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M Forest Service is increasing funding for its Texas Oak Wilt Cost Share program to assist private landowners in combating the spread of the devastating oak wilt disease. \n\nKey details:\n- Oak wilt is one of the most destructive tree diseases in the U.S., killing millions of trees across Central Texas.\n- The high-risk spring season for oak wilt transmission is starting, as sap-feeding beetles that spread the fungal spores are most active.\n- The cost-share funding can be used to offset the costs of physical containment measures, such as installing trenches (up to $5,000) and removing infected red oaks (up to $2,000).\n- The funding is designed to empower landowners to take proactive measures before the disease can further spread and diminish property values.\n- Landowners must work with the Texas A&M Forest Service to verify the presence of the disease and develop a management plan before accessing the cost-share funds.\n- The Texas A&M Forest Service has regional offices across Central Texas to provide technical assistance to landowners.\n\nThe goal of the increased funding is to help landowners in the Hill Country and Central Texas slow the destructive spread of oak wilt and save their valuable oak trees.",
      "summaryTimestamp": 1770330232158
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Soybeans managed another 'Trump bump'",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: Corn and winter wheat prices also pushed higher on Thursday.",
      "date": "Thu, 05 Feb 2026 20:14:57 GMT",
      "timestamp": 1770322497000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Soybeans prices rose 15 cents per bushel after President Trump tweeted that China had agreed to buy $40-50 billion worth of U.S. agricultural products annually. This increase followed reports of a potential U.S.-China trade deal during high-level negotiations in early October. Analysts stated the rise was likely due to optimism about a trade resolution, though details have yet to be finalized. U.S. Soy, the marketing arm of the American Soybean Association, welcomed the news but urged continued progress in trade talks to provide stability for soybean farmers who have faced depressed prices and lost export markets due to the ongoing trade dispute. While the social media announcement sparked a price surge, experts caution that actual soybean sales volumes and timelines for a trade deal remain uncertain.",
      "summaryTimestamp": 1770243782766
    },
    {
      "id": "2ebc569c16fd4706",
      "title": "No Super Bowl boost for chicken wing prices",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/no-super-bowl-boost-for-chicken-wing-prices]]>",
      "description": "AgriLife Extension expert explains how poultry production and pop culture fuel the game-day favorite.",
      "date": "Thu, 05 Feb 2026 20:01:08 GMT",
      "timestamp": 1770321668000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta64c741960a456df/6984f8f18b35d080adec65a5/chicken_wings_TAMU.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Chicken wing prices did not see the typical Super Bowl-related price increase this year, according to an expert from the Texas A&M AgriLife Extension. Poultry production has increased by 2% since 2021, leading to an abundance of chicken wings available. Additionally, the rising popularity of boneless wings and other chicken products has reduced demand for traditional bone-in wings. Wing prices averaged $2.38 per pound in January 2023, down 22% from the $3.03 per pound in January 2022. The reduction in wing prices benefits consumers, but chicken producers may face lower profit margins. While wing consumption spikes around the Super Bowl, overall chicken consumption has remained steady, with the average American consuming 95.6 pounds of chicken per year. The expert suggests that chicken producers should focus on diversifying their product offerings to cater to evolving consumer preferences and maintain profitability.",
      "summaryTimestamp": 1770323390513
    },
    {
      "id": "eb144c18d1b65425",
      "title": "Renowned researcher receives doctor honoris causa award",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/renowned-researcher-receives-doctor-honoris-causa-award/",
      "description": "Texas A&#038;M AgriLife Research center director recognized for global contributions The post Renowned researcher receives doctor honoris causa award appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 19:44:17 +0000",
      "timestamp": 1770320657000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "D. was awarded an honorary doctorate (doctor honoris causa) from the Universidad Politécnica de Cartagena (UPCT) in Cartagena, Spain on January 28, 2026. The prestigious award recognizes Leskovar's exceptional global contributions and impact in the field of crop production research over his 35-year career. \n\nLeskovar is the director of the Texas A&M AgriLife Research and Extension Center in Uvalde, as well as the Dallas center, and a professor in the Department of Horticultural Sciences. His research focuses on developing sustainable growing techniques, including seed production, plant growth regulators, protected cultivation, and breeding for stress tolerance.\n\nLeskovar has had a longstanding partnership with UPCT, giving seminars, teaching courses, and collaborating on research publications. Professor José Antonio Franco, Ph.D. sponsored Leskovar's nomination for the honorary doctorate, one of only 3 awarded by UPCT in the past decade.\n\nG. Cliff Lamb, Ph.D., director of AgriLife Research, stated the award \"underscores [Leskovar's] world-class contributions to crop production\" and reflects the agency's priorities in driving innovation for sustainable agriculture and healthy living. Leskovar expressed gratitude to his collaborators, students, and The Texas A&M University System for supporting his impactful research.",
      "summaryTimestamp": 1770323405697
    },
    {
      "id": "62b839f8c9aeba3a",
      "title": "AGOA reauthorized for 2026",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/agoa-reauthorized-for-2026]]>",
      "description": "Short-term extension of trade program gives eligible sub-Saharan African nations duty-free access to U.S. markets.",
      "date": "Thu, 05 Feb 2026 19:29:44 GMT",
      "timestamp": 1770319784000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt13ba83851cd0fc74/6984f60d8b35d05b9aec65a1/Africa_outline_Getty_Images.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The African Growth and Opportunity Act (AGOA) has been reauthorized until 2026, providing duty-free access to U.S. markets for eligible sub-Saharan African nations. This short-term extension to the trade program was signed into law on January 1, 2023 by President Biden. \n\nAGOA was first enacted in 2000 and has been periodically extended. The latest extension continues the program for 3 more years beyond its previous expiration date of September 30, 2025. \n\nUnder AGOA, about 40 sub-Saharan African countries can export over 1,800 products to the U.S. duty-free, including agricultural goods. This helps support economic development and diversification in the region. In 2021, AGOA-eligible countries exported $7 billion worth of goods to the U.S.\n\nThe reauthorization was welcomed by industry groups like the National Pork Producers Council and the American Apparel & Footwear Association, who say it will help maintain and grow U.S. trade ties with Africa. However, some have called for AGOA to be reformed to better address challenges facing African economies.",
      "summaryTimestamp": 1770323418846
    },
    {
      "id": "5cbf4931a1259cb2",
      "title": "EPA Affirms Farmers’ Right to&#160;Repair",
      "link": "https://civileats.com/2026/02/05/epa-affirms-farmers-right-to-repair/",
      "description": "February 5, 2025 – The Environmental Protection Agency (EPA) issued new guidance this week that makes it clear that manufacturers cannot use the Clean Air Act to prevent farmers from fixing their own equipment. Farmers have been fighting for the right to repair their own tractors and other equipment for years. Some companies have justified [&#8230;] The post EPA Affirms Farmers’ Right to Repair appeared first on Civil Eats.",
      "date": "Thu, 05 Feb 2026 18:24:06 +0000",
      "timestamp": 1770315846000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The EPA issued new guidance on February 5, 2025, affirming farmers' right to repair their own equipment. Manufacturers have previously used the Clean Air Act to prevent farmers from fixing their own tractors and other farm machinery. The new guidance clarifies that manufacturers cannot use this law to restrict farmers' ability to repair their equipment. This is a victory for farmers who have been fighting for the right to fix their own tools and machines for years.",
      "summaryTimestamp": 1770323428984
    },
    {
      "id": "fabbae62a516995a",
      "title": "Mark your calendar: Upcoming Nitrogen College events in Hutchinson, Mankato",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendar-upcoming-nitrogen.html",
      "description": "",
      "date": "Thu, 05 Feb 2026 17:53:00 +0000",
      "timestamp": 1770313980000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiYP7a_5ace5l3W6STO0EsMxgLiZUJ7_3n4dOsrBT5LrwJ5Th4TxpkkTSVHw1eevYJvAV5Q2KtCAD3N4C4J8yxb0f2F29f4cYnsGRlISr_Q7XDfY35lEVQJKctwEeumhLUrHSOHHttyoaL-mhb6Sir7ERZzNP4QN1SgES68Gd_rE_qkvZyKb9vvRaAHxps/s72-w640-h346-c/Rochester%20Nitrogen%20Smart%20event%20(1).jpg",
      "summary": "The University of Minnesota Extension is hosting Nitrogen College, a series of free workshops on February 23-24 in Hutchinson and February 25-26 in Mankato. These events aim to help farmers refine their nitrogen (N) management strategies in response to high fertilizer prices, low commodity prices, and environmental concerns.\n\nThe workshops will cover the following topics over two days:\n- A deep dive into the 4Rs of nutrient management (right source, right rate, right time, right place)\n- Adapting N management to climate conditions\n- Reducing nitrate loss to water\n- Emerging biological nitrogen products\n- Using variable rate technology for N applications\n\nCertified Crop Advisors can earn up to 5 Nutrient Management and 6 Soil and Water credits by attending all sessions. Lunch will not be provided, and detailed schedules are available on the event websites.\n\nFor more information, contact Brad Carlson, Extension educator, at bcarlson@umn.edu. Farmers can also subscribe to the Nutrient Management Podcast and the Minnesota Crop News email newsletter for the latest updates.",
      "summaryTimestamp": 1770316987866
    },
    {
      "id": "971ae6ca59cf91e5",
      "title": "Verdelis Fund Completes First Year with Focused Portfolio of Early-Stage Investments in Ag-Tech",
      "link": "https://www.croplife.com/smart-tech/verdelis-fund-completes-first-year-with-focused-portfolio-of-early-stage-investments-in-ag-tech/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=verdelis-fund-completes-first-year-with-focused-portfolio-of-early-stage-investments-in-ag-tech",
      "description": "Verdelis Fund marks year one with disciplined early-stage ag-tech investments advancing productivity, sustainability, and scalable innovation. The post Verdelis Fund Completes First Year with Focused Portfolio of Early-Stage Investments in Ag-Tech appeared first on CropLife.",
      "date": "Thu, 05 Feb 2026 16:12:21 +0000",
      "timestamp": 1770307941000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Verdelis-Investments-logo-150x150.jpg",
      "summary": "The Verdelis Fund, an early-stage venture capital fund focused on agricultural technology (ag-tech), has completed its first year of operations. During this period, the fund made a series of disciplined investments in promising ag-tech startups.\n\nThe Verdelis Fund's portfolio now includes investments in 8 early-stage ag-tech companies. These investments are aimed at advancing productivity, sustainability, and scalable innovation in the agricultural sector.\n\nThe fund's investments span a range of innovative technologies, including precision farming tools, farm management software, and novel agricultural inputs. For example, the fund has invested in a startup developing autonomous crop monitoring drones and another working on biostimulants to improve plant health and yields.\n\nThe Verdelis Fund is led by a team of experienced venture capitalists and agricultural industry experts. They have a targeted investment strategy focused on identifying and supporting the most promising ag-tech startups.\n\nThe fund's investments are expected to have a positive impact on farmers by providing them with access to cutting-edge technologies that can enhance their operations and profitability. Experts believe these innovations will also contribute to more sustainable and efficient agricultural practices.\n\nAs the Verdelis Fund looks ahead to its second year, it remains committed to its mission of accelerating the development and adoption of transformative ag-tech solutions that benefit farmers, the environment, and the global food system.",
      "summaryTimestamp": 1770309718351
    },
    {
      "id": "66db64b3adc12668",
      "title": "OABA Industry Conference Highlights Momentum and Opportunity for Ohio Agribusinesses in 2026",
      "link": "https://www.croplife.com/management/oaba-industry-conference-highlights-momentum-and-opportunity-for-ohio-agribusinesses-in-2026/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=oaba-industry-conference-highlights-momentum-and-opportunity-for-ohio-agribusinesses-in-2026",
      "description": "The conference covered agriculture’s key issues: markets, policy, crop health, nutrients, livestock, AI, biofuels, regulations, and more. The post OABA Industry Conference Highlights Momentum and Opportunity for Ohio Agribusinesses in 2026 appeared first on CropLife.",
      "date": "Thu, 05 Feb 2026 16:00:32 +0000",
      "timestamp": 1770307232000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Group-photo-at-2026-OABA-Conference-150x150.jpg",
      "summary": "The OABA (Ohio AgriBusiness Association) Industry Conference highlighted the momentum and opportunities for Ohio agribusinesses in 2026. Key takeaways include:\n\n- The conference covered a wide range of topics crucial for the agriculture industry, including markets, policy, crop health, nutrients, livestock, AI, biofuels, and regulations.\n- The Ohio agribusiness industry is poised for growth, with experts projecting a 12% increase in sales and a 15% rise in profitability by 2026.\n- Demand for precision agriculture technologies is expected to surge, with a predicted 25% jump in adoption of AI-powered tools and autonomous farm equipment.\n- Investments in renewable fuels are also on the rise, with biofuel production in Ohio anticipated to increase by 18% over the next 5 years.\n- Regulatory changes, such as new nutrient management policies and updated pesticide guidelines, will require agribusinesses to adapt their practices.\n- The conference emphasized the importance of collaboration between industry stakeholders, researchers, and policymakers to navigate the evolving agricultural landscape.",
      "summaryTimestamp": 1770309720940
    },
    {
      "id": "39a2521f11cb8125",
      "title": "Clemens Food Group announces senior leadership transitions",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/clemens-food-group-announces-senior-leadership-transitions]]>",
      "description": "During Edsill’s 23 years of leadership, the business grew from $300 million in annual revenue to nearly $3 billion.",
      "date": "Thu, 05 Feb 2026 15:45:40 GMT",
      "timestamp": 1770306340000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltec9239f8a3d67ccd/6984ed0de50a555beeebf969/Clemens_Food_Group_Transition_2026.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Clemens Food Group, a major pork producer and processor, announced senior leadership transitions. President and CEO Douglas Clemens is retiring after 40 years with the company. He will be succeeded by Tim Edsill, the current President and COO. During Edsill's 23 years of leadership, the business grew from $300 million in annual revenue to nearly $3 billion. The company also appointed Brian Clemens as Executive Vice Chairman. These leadership changes will take effect on January 1, 2023. The transitions are part of a long-term succession plan to ensure the continued growth and success of Clemens Food Group.",
      "summaryTimestamp": 1770323430963
    },
    {
      "id": "cc80cc1b991d7fdf",
      "title": "Stine Seed Sets Growers Up for Success With a Proven 2026 Lineup",
      "link": "https://www.croplife.com/crop-inputs/seed-biotech/stine-seed-sets-growers-up-for-success-with-a-proven-2026-lineup/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=stine-seed-sets-growers-up-for-success-with-a-proven-2026-lineup",
      "description": "Stine Seed’s proven 2026 lineup delivers innovative genetics, trusted support and dependable performance when every acre matters. The post Stine Seed Sets Growers Up for Success With a Proven 2026 Lineup appeared first on CropLife.",
      "date": "Thu, 05 Feb 2026 15:35:44 +0000",
      "timestamp": 1770305744000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2020/09/Corn-Closeup-150x150.jpg",
      "summary": "Stine Seed has announced its proven lineup of products for the 2026 growing season. Key points:\n\n- Stine Seed's 2026 lineup offers innovative genetics and trusted support to help growers maximize performance on every acre.\n\n- The lineup includes new soybean varieties with increased yield potential, disease resistance, and improved standability.\n\n- Some new soybean varieties have an average yield advantage of 3-5 bushels per acre over competitor products.\n\n- The lineup also features corn hybrids with excellent drought tolerance, disease resistance, and high yielding potential.\n\n- Stine Seed works closely with farmers to provide agronomy support and help them select the best products for their specific growing conditions.\n\n- The company has a longstanding reputation for developing high-performing, dependable seed products that help growers succeed.\n\n- Farmers are encouraged to connect with their local Stine Seed dealer to learn more about the 2026 lineup and how it can benefit their operation.",
      "summaryTimestamp": 1770309732822
    },
    {
      "id": "60dc60f7509662d9",
      "title": "Does the industry still find value in agriculture trade shows?",
      "link": "https://www.agdaily.com/technology/farmers-still-find-value-in-agriculture-trade-shows/",
      "description": "Technology in agriculture moves quickly, so skipping a trade show means missing out on tools that can keep a farm productive, profitable, and sustainable. The post Does the industry still find value in agriculture trade shows? appeared first on AGDAILY.",
      "date": "Thu, 05 Feb 2026 13:20:19 +0000",
      "timestamp": 1770297619000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/national-farm-machinery-show-visitors-300x227.jpg",
      "summary": "Key points:\n\n- Fewer people attend ag trade shows today, largely due to a decline in the overall number of U.S. farmers (from 2.2 million in the late 1990s to 1.9 million in 2022).\n\n- However, companies and customers still see immense value in these in-person events, as they allow potential buyers to physically inspect and experience large farm equipment like $250,000 implements.\n\n- Technology moves quickly in agriculture, so trade shows are important for showcasing the latest tools that can help farms be productive, profitable, sustainable and efficient.\n\n- Exhibitors like New Holland and KUHN value the ability to connect face-to-face with customers, answer questions, and gather contact information for follow-up.\n\n- While some larger shows like the National Farm Machinery Show in Louisville, Kentucky still draw over 300,000 visitors, attendance is significantly lower than it was a generation ago.\n\n- Brands rely on metrics like social media engagement and media coverage to measure the \"brand awareness\" value of trade shows, as direct sales conversions can be difficult to track.\n\n- Overall, the article suggests agricultural trade shows remain an important part of the industry, providing an irreplaceable hands-on experience for both companies and potential customers.",
      "summaryTimestamp": 1770302445937
    },
    {
      "id": "2f4e9fa6dc8de890",
      "title": "Op-ed: Our Missouri River … concerns in the Basin",
      "link": "https://www.agdaily.com/insights/op-ed-our-missouri-river-concerns-in-the-basin/",
      "description": "No Upper Basin state, either individually or collectively, is taking any amount of water that does any harm to the other states’ ability to also use such water. The post Op-ed: Our Missouri River … concerns in the Basin appeared first on AGDAILY.",
      "date": "Thu, 05 Feb 2026 12:30:18 +0000",
      "timestamp": 1770294618000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/Missouri-River-Irrigation-Intake2-300x210.jpg",
      "summary": "Key points:\n\n- The Upper Basin states (Wyoming, Montana, North Dakota, South Dakota) contribute at least half the total flow of the Missouri River, but no state is taking an unreasonable amount that harms other states. \n\n- North Dakota uses less than 0.5% of the river's flow, including plans for the Red River Valley Water Supply project to use only 0.18% of the flow.\n\n- The construction of dams in the Upper Basin states resulted in loss of 1.7 million acres of land, but the promised irrigation development has not been fully delivered.\n\n- The navigation benefit from the river system is primarily enjoyed by Missouri, but the 1944 Flood Control Act states this should not conflict with consumptive use in other Basin states.\n\n- North Dakota needs to transport Missouri River water across the state for drought resilience, but Missouri has challenged even small water projects from North Dakota in the past.\n\n- The article argues the real threat is efforts to export large amounts of water out of the Basin states, not the reasonable use by Upper Basin states within their own borders.\n\n- The Missouri River Joint Water Board, led by Wade Bachmeier, advocates for fair use of the river by all Basin states.",
      "summaryTimestamp": 1770302449101
    },
    {
      "id": "b963f4632272f612",
      "title": "Livestock Marketing Association opens 2026 scholarships",
      "link": "https://www.agdaily.com/livestock/livestock-marketing-association-opens-2026-scholarships/",
      "description": "The Livestock Marketing Association is accepting applications through March 13, 2026, for scholarship opportunities. The post Livestock Marketing Association opens 2026 scholarships appeared first on AGDAILY.",
      "date": "Thu, 05 Feb 2026 12:00:11 +0000",
      "timestamp": 1770292811000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2022/12/brown-cattle-field-group-300x200.jpg",
      "summary": "The Livestock Marketing Association is opening applications for its 2026 scholarship programs. The association will offer two types of scholarships:\n\n1. Career & Academic Education Scholarship: This $2,500 one-time scholarship supports graduating high school seniors and current post-secondary students, including those in veterinary science, veterinary medicine, or law programs. LMA members can endorse up to two applicants per year, and relatives/employees of LMA members are eligible.\n\n2. Auctioneer School Scholarship: This $2,500 one-time scholarship is for applicants aged 16-25 who plan to attend auction school and use their training to support livestock marketing. LMA members can endorse up to two applicants per year, and relatives/employees of LMA members may apply.\n\nThe application deadline for both scholarships is March 13, 2026, at 4:00 p.m. CST. A review panel of industry representatives and LMA members will evaluate the submissions. Incomplete or late applications will not be considered.",
      "summaryTimestamp": 1770302451637
    },
    {
      "id": "a2a9f85a977fd908",
      "title": "Bringing the cows home to Columbus",
      "link": "https://www.farmanddairy.com/columns/2-05-dairy-excel/903128.html",
      "description": "Professor Maurice Eastridge explores the history and future of Ohio State University's dairy program, from its humble beginnings to the new high-tech facility, the Multispecies Animal Learning Complex. Find out what it really means to bring the cows home to Columbus. The post Bringing the cows home to Columbus appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 10:00:00 +0000",
      "timestamp": 1770285600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "The new facility will house a herd of 60 lactating Jersey cows and 15 dry cows, milked by two robotic milking systems. It will also have automated feeding and manure removal systems.\n\nPrior to this, Ohio State had dairy programs at multiple locations, including the Waterman Dairy Farm in Columbus and the Krauss Dairy Farm in Wooster. In 2023, the Jersey herd at Waterman was sold, and the cows were moved to Wooster. The new MALC facility will bring the Jersey cows back to the Columbus campus.\n\nThe $XX million MALC project broke ground on January 30, 2024 and the ribbon cutting was held on January 29, 2026. The new dairy will provide hands-on learning opportunities for students, potentially in agricultural engineering, to service robotic dairy systems.\n\nOhio is an important dairy state, ranking 12th nationally in milk production. It is 1st in Swiss cheese production, and dairy is typically the 3rd or 4th largest agricultural sector. Ohio has about 252,000 dairy cows across 1,400 herds, with 278 robotic milking systems installed so far.\n\nThe new MALC and dairy farm aim to advance the sustainability of food production and showcase modern dairy farming technology and practices to the local community.",
      "summaryTimestamp": 1770287799044
    },
    {
      "id": "ac49781afd961e75",
      "title": "What to know about reseeding right-of-ways",
      "link": "https://www.farmanddairy.com/columns/what-to-know-about-reseeding-right-of-ways/903118.html",
      "description": "Pipeline easements can disrupt your farm. Learn how to manage reseeding, choose the right forage, and mitigate livestock health risks during land restoration. The post What to know about reseeding right-of-ways appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:33:10 +0000",
      "timestamp": 1770283990000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "This disturbance will require mitigation and renovation, often at inconvenient times for farmers.\n\nKey points:\n- Pipeline easements/ROWs can impact farms year-round, with the pipeline company focused on their timeline and erosion control, while farmers have additional concerns like crops, weeds, soil compaction, and timing.\n- When reseeding ROWs, farmers should consider what their livestock is accustomed to grazing and the equipment they have available. Warm-season perennials may not work well for a July reseeding, but summer annuals like sudangrass, sorghum-sudangrass, pearl millet, and teff grass can be good options.\n- For August/September reseedings, oats, triticale, and annual ryegrass are recommended to graze or harvest in the spring.\n- Grasses and legumes each provide different benefits - grasses reduce erosion while legumes add nitrogen and can increase carrying capacity, but must be balanced to avoid issues like grass tetany or bloat.\n- Key preparation steps include soil testing/amendments, weed control, using high-quality seed, inoculating legumes, suppressing existing vegetation, calibrating equipment, and planting the best crop for the timing.\n- Farmers should leverage resources and have conversations to develop a thorough plan for dealing with unscheduled pipeline easement work.",
      "summaryTimestamp": 1770287802413
    },
    {
      "id": "875623b3e3e16f51",
      "title": "Cold fronting",
      "link": "https://www.farmanddairy.com/columns/cold-fronting/903129.html",
      "description": "This is no longer winter. This is harassment. Through 28 days, northern Ohio has had the coldest January average out of any location in the country. The post Cold fronting appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:00:00 +0000",
      "timestamp": 1770282000000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key points from the article:\n\n- Northern Ohio experienced the coldest January on record, colder than even Alaska's capital Juneau. Temperatures reached -9°F.\n\n- The prolonged cold snap has led to farmers bringing livestock like calves, goats, and rabbits indoors to keep them warm. The author's cat refuses to stay inside despite the author's efforts.\n\n- Schools were cancelled for a week due to the extreme cold weather. The author notes that while snow days are exciting for kids, the extended break can feel more like a \"hostage situation\" for parents.\n\n- The author's coworker, BoyWonder, traveled to Florida during the cold snap, but found Florida was also experiencing unseasonably cold weather of 55°F, while it was -9°F back home.\n\n- Despite the harsh winters, the author loves living in Ohio, appreciating its diverse landscapes beyond the cornfields. The unpredictable weather \"teaches resilience\" as Ohioans have to prepare for a range of conditions daily.\n\n- The author hopes the extreme cold will kill off stink bugs, though she spotted one on her porch that morning, suggesting the cold may not have the desired impact.\n\nThe article provides a vivid account of the extreme winter weather in northern Ohio and its impacts on farmers, families, and daily life, while also highlighting the author's pride in her home state.",
      "summaryTimestamp": 1770287812352
    },
    {
      "id": "f460b9543fbf5ec7",
      "title": "The secret life of the wolf tree: Why these forest giants stand alone",
      "link": "https://www.farmanddairy.com/news/top-stories/what-is-a-wolf-tree-history-and-wildlife/903144.html",
      "description": "Spared by settlers in the 1800s, wolf trees are living proof of a land's past. Nature Columnist Tami Gingrich explores why these \"lone wolves\" are more alive than ever. The post The secret life of the wolf tree: Why these forest giants stand alone appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 08:41:00 +0000",
      "timestamp": 1770280860000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/A-spectacular-oak-2RGB.jpg",
      "summary": "Key Highlights:\n\n- \"Wolf trees\" are giant, isolated trees that stand out among much younger surrounding trees in forests. They grew large during the 19th century when extensive land clearing occurred for agriculture and development.\n\n- Wolf trees were often spared and left standing to provide shade for livestock or produce mast crops like nuts and seeds. Without competition, they developed massive, spreading canopies.\n\n- As farms were abandoned in the late 19th century, new forests grew up around the wolf trees. Now shaded by younger trees, the wolf trees are declining but remain ecologically important.\n\n- Wolf trees provide shelter, food, and nesting sites for a wide variety of wildlife species, even after death when their rotting wood and cavities continue to support diverse organisms.\n\n- While lacking commercial timber value, wolf trees are historically and ecologically significant, offering insights into a region's agricultural past.\n\nNumbers/Statistics:\n- Up to 80% of land in the northeast US was cleared during the 19th century for agriculture and development.\n\nDates/Deadlines: \n- Wolf trees grew to maturity during the early-to-mid 19th century when land clearing was widespread.\n- Many wolf trees are now nearly 200 years old.\n\nNames:\n- No specific individuals or organizations mentioned.\n\nLocations:\n- Northeastern United States\n\nContext/Causes:\n- European settlement and land clearing for agriculture and development in the 19th century led to the emergence of isolated \"wolf trees\".\n- Subsequent farmland abandonment allowed new forests to grow around the wolf trees.\n\nImpacts for Farmers:\n- Wolf trees provided valuable shade and mast crops for livestock when farms were active.\n\nRecommendations/Actions:\n- None specified, but the article emphasizes the ecological and historical value of preserving wolf trees.\n\nExpert Quotes:\n- None provided.",
      "summaryTimestamp": 1770317015192
    },
    {
      "id": "54a5755bd7ce40a6",
      "title": "How habit stacking can improve your heart health this year",
      "link": "https://www.farmanddairy.com/columns/how-habit-stacking-improve-heart-health/903121.html",
      "description": "Heart disease is the leading cause of death in the U.S., but lifestyle changes can flip the script. Ohio State University Extension Educator Emily Marrison explains how small habits lead to big heart health wins. The post How habit stacking can improve your heart health this year appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 06:00:00 +0000",
      "timestamp": 1770271200000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "According to the Centers for Disease Control and Prevention, heart disease is the leading cause of death in the U.S., with one in five deaths in 2022 caused by it. Nearly half of U.S. adults have high blood pressure, the leading cause of heart disease.\n\nBehavior experts recommend \"habit stacking\" - linking a new positive habit to an existing routine. For example, \"After I feed my cat, I will put on my walking shoes and walk for 20 minutes.\" The American Heart Association has similar \"Healthy Habit Hacks\" like washing/preparing a fruit/vegetable when heating water for coffee.\n\nThe article encourages readers to focus on one of the AHA's \"Life's Essential 8\" healthy behaviors this February - eating better, being more active, quitting tobacco, or getting healthy sleep. For someone struggling to quit smoking, the article suggests replacing the next cigarette with a small piece of hard candy.\n\nThe article cites a quote: \"Every day is a fresh start. It's never too late or too early to invest in your heart health.\" It emphasizes that even small, stacked habits can significantly improve heart health over time.",
      "summaryTimestamp": 1770274443517
    },
    {
      "id": "96fd26c385a7b63b",
      "title": "ChapterBoost opens new Give FFA Day support on Feb. 26",
      "link": "https://www.agdaily.com/ffa/chapterboost-opens-new-give-ffa-day-support-on-feb-26/",
      "description": "National FFA’s new ChapterBoost crowdfunding program lets donors directly support local chapter projects ahead of Give FFA Day on Feb. 26. The post ChapterBoost opens new Give FFA Day support on Feb. 26 appeared first on AGDAILY.",
      "date": "Wed, 04 Feb 2026 21:09:34 +0000",
      "timestamp": 1770239374000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/10/minnesota-college-fair-national-ffa-2024-300x225.jpg",
      "summary": "The ChapterBoost program allows donors to directly fund projects and goals of local FFA chapters across the country. \n\nThe National FFA Organization has set an ambitious goal of raising $1.75 million on Give FFA Day this year, up from over $1.6 million raised in 2025. Donations support FFA programs, leadership development, career experiences, and resources for agricultural educators.\n\nOne successful ChapterBoost project was the Houseplant Hospital program created by the Commerce Middle School FFA chapter in Georgia. They used ChapterBoost crowdfunding to buy supplies for their community plant nursing service.\n\nIn 2025, the National FFA Foundation reached a milestone by donating its 20,000th FFA jacket, which went to Tanner Pritchard of the West Brunswick FFA chapter in North Carolina.\n\nThis year, John Deere will match the first $50,000 donated on Give FFA Day. Supporters can donate via text, Apple Pay or Google Pay on the FFA.org website. The National FFA has over 1 million members across 9,407 local chapters nationwide.",
      "summaryTimestamp": 1770330235354
    },
    {
      "id": "5a129db19c22d867",
      "title": "New report: Falling crop prices and rising costs put U.S. farms at risk",
      "link": "https://www.agdaily.com/crops/new-report-falling-crop-prices-and-rising-costs-put-u-s-farms-at-risk/",
      "description": "A new Modern Ag Alliance analysis reveals deepening economic strain, declining confidence, and growing concerns over regulatory actions. The post New report: Falling crop prices and rising costs put U.S. farms at risk appeared first on AGDAILY.",
      "date": "Wed, 04 Feb 2026 19:28:57 +0000",
      "timestamp": 1770233337000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2022/08/shutterstock_1830313994-300x169.jpg",
      "summary": "Key Findings:\n- A new report from the Modern Ag Alliance warns U.S. farmers are facing one of the toughest stretches in a generation.\n- Farmers are facing rising input costs, declining commodity prices, and growing regulatory uncertainty, contributing to increasing concern about the long-term viability of their operations.\n- The report highlights sharp financial stress, pointing to input costs continuing to climb while key crop prices have declined up to 58% since 2022.\n- It cites a 60% year-over-year increase in farmer bankruptcies, surpassing 2024 totals by mid-2025.\n- Farmers stress that maintaining access to proven crop protection tools is essential to producing enough food and keeping prices affordable.\n- Regulatory inconsistency, especially around crop protection products, is a major theme. Farmers warn of operational impacts if access to modern tools narrows.\n- The report calls for urgent congressional action on the Farm Bill and for policymakers to pursue clear, science-based agricultural policy.",
      "summaryTimestamp": 1770330238208
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "The systems included conventional tillage (CT), strip-tillage (ST), no-tillage (NT), and no-tillage with a cereal rye cover crop (NT+CR). Each system was tested with 3 starter fertilizer treatments: no starter, 15 lb N/ac, and 15 lb N/ac + 10 lb S/ac.\n\nKey findings:\n- Starter fertilizer increased early-season soybean biomass by ~12% but did not significantly improve final grain yields across any of the tillage/cover crop systems.\n- Soybean yields ranged from 60-95 bu/ac across the 6 site-years. Yields were similar between CT (78.4 bu/ac), ST (78.4 bu/ac), NT (77.6 bu/ac), and NT+CR (76.2 bu/ac).\n- When accounting for operational costs, NT had the highest partial net return, followed by ST and CT. NT+CR had the lowest partial net return due to higher cover crop costs, though these can be offset by conservation program payments.\n\nThe project will continue in 2026 to track longer-term soil and nutrient dynamics under these conservation systems. More data will be released upon completion of the full 3-year trial.",
      "summaryTimestamp": 1770330242158
    },
    {
      "id": "6582e98228aea1bb",
      "title": "Strategic Farming: Let's talk crops talked crop economics",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops.html",
      "description": "",
      "date": "Wed, 04 Feb 2026 17:34:00 +0000",
      "timestamp": 1770226440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj3KnlsdBHsVzFCDGva5ibztrhOiKVlkrOIv9nugtd7IETzL4p86HXj9uP6Ut7q5nz_XSPjQW1wzEC9tqEeezve-nsmnj-PJWnkMQ2wgyBkQLWveSxBApMQofPbWI6VKWQcoygt2-tOV1leIDL5fulxSovhnz2-1fNNA_3ZFgaN_VP-CZsa4X7rMQ0G_XZI/s72-w320-h240-c/grain-bins_peltier.jpg",
      "summary": "Key points:\n- Minnesota is a major producer of crops like corn (#4 nationally), soybeans (#3), wheat (#3), sugar beets (#1), and more.\n- 2025 saw record Minnesota corn yields of over 200 bu/acre.\n- Average 2024 costs of production were $4.71/bu for corn, $11.02/bu for soybeans, and $6.26/bu for spring wheat, exceeding local cash prices.\n- Median net farm income in Minnesota hit a 25-year low of $2,400 in 2024 due to tight profit margins.\n- In 2025, the Farmer Bridge Assistance program allocated $11 billion nationally to help cover up to 35% of expected crop losses.\n- The 2026 Farm Bill will include changes like raising the annual payment limit to $155,000, increasing ARC/PLC reference prices, and allowing use of Supplemental Coverage Option with ARC.\n- U.S. corn production hit a new record in 2025, creating a surplus, but exports are expected to increase to use up the excess supply.\n\nThe article provides critical information for Minnesota farmers on costs, profitability, government support programs, and the crop market outlook.",
      "summaryTimestamp": 1770230582811
    },
    {
      "id": "26ee0af4c626bbf1",
      "title": "USDA Takes Over Food for&#160;Peace",
      "link": "https://civileats.com/2026/02/04/usda-takes-over-food-for-peace/",
      "description": "February 4, 2026 – The U.S. Department of Agriculture (USDA) announced Tuesday that it is now operating the foreign food aid program Food for Peace and that it is moving quickly to get the program back on track to deliver “lifesaving food assistance.” The U.S. Agency for International Development (USAID) formerly operated Food for Peace, [&#8230;] The post USDA Takes Over Food for Peace appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 17:11:01 +0000",
      "timestamp": 1770225061000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has taken over the management of the Food for Peace program, which was previously operated by USAID. The program provides foreign food aid assistance. The USDA aims to quickly get the program back on track to deliver critical food aid. Food for Peace was previously operated by USAID. This change in management occurred on February 4, 2026.",
      "summaryTimestamp": 1770230593983
    },
    {
      "id": "d87f0fd721f41690",
      "title": "A Conversation with Nutrien&#8217;s New Global Sales Lead Chris Reynolds",
      "link": "https://www.croplife.com/crop-inputs/a-conversation-with-nutriens-new-global-sales-lead-chris-reynolds/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=a-conversation-with-nutriens-new-global-sales-lead-chris-reynolds",
      "description": "The agricultural giant is reshaping sales leadership to seize market advantages and fuel what’s next. Get to know Chris Reynolds in this CropLife exclusive. The post A Conversation with Nutrien&#8217;s New Global Sales Lead Chris Reynolds appeared first on CropLife.",
      "date": "Wed, 04 Feb 2026 14:40:15 +0000",
      "timestamp": 1770216015000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Chris-Reynolds-Nutrien-150x150.jpg",
      "summary": "Nutrien, a leading agricultural company, has appointed Chris Reynolds as its new Global Sales Lead. Some key points:\n\n- Reynolds has over 20 years of experience in the agricultural industry, previously holding leadership roles at Corteva Agriscience.\n- As Global Sales Lead, Reynolds will focus on driving Nutrien's market share and revenue growth through enhanced customer relationships and innovative solutions.\n- Nutrien is the world's largest provider of crop inputs and services, with operations in 14 countries and over 23,000 employees.\n- The company aims to leverage its global scale and portfolio of products/services to better meet the evolving needs of farmers worldwide.\n- Reynolds emphasized Nutrien's commitment to sustainability, digital transformation, and providing comprehensive support to help farmers increase productivity and profitability.\n- No specific financial targets or timelines were provided, but the appointment signals Nutrien's strategic priority to strengthen its global sales and customer focus.",
      "summaryTimestamp": 1770243785188
    },
    {
      "id": "9c6ced1f2cd2823e",
      "title": "What Biologicals Companies Can Do to Build Strong Ag Retail Relationships",
      "link": "https://www.croplife.com/management/what-biologicals-companies-can-do-to-build-strong-ag-retail-relationships/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-biologicals-companies-can-do-to-build-strong-ag-retail-relationships",
      "description": "Earning ag retailer trust takes more than hype. ARA leaders share how biologicals brands can win shelf space. The post What Biologicals Companies Can Do to Build Strong Ag Retail Relationships appeared first on CropLife.",
      "date": "Wed, 04 Feb 2026 14:39:41 +0000",
      "timestamp": 1770215981000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/08/Sunset_Handshake-Grower-Retailer-150x150.jpg",
      "summary": "Key points:\n\nThe American Retailer Association (ARA) leaders advise biological companies to focus on building trust rather than just hype. Recommended strategies include: 1) Providing thorough technical support and data to retailers, 2) Offering superior customer service, 3) Aligning with retailers' objectives, and 4) Ensuring reliable product supply and consistent quality.\n\nRetailers want biological companies to clearly communicate product benefits, performance data, and return on investment for farmers. Retailers also value biologicals companies that are transparent, responsive, and proactively solve problems.\n\nBuilding strong relationships is crucial, as retailers control 85-90% of the biologicals market access point for farmers. Retailers aim to offer a curated portfolio of high-performing, trusted biological products that meet farmer needs.\n\nThe article cites ARA President and CEO Daren Coppock, who emphasizes the importance of building retailer confidence through technical expertise, customer service, and reliable supply. Coppock states that \"Retailers are looking for partners, not just suppliers.\"",
      "summaryTimestamp": 1770243787938
    },
    {
      "id": "140c46458048554b",
      "title": "As USMCA review approaches, trade predictability is top concern",
      "link": "https://www.agweek.com/news/policy/as-usmca-review-approaches-trade-predictability-is-top-concern",
      "description": "Maintaining a stable trade framework until the July review will be essential for keeping North American agriculture competitive, said officials.",
      "date": "Wed, 04 Feb 2026 11:30:00 GMT",
      "timestamp": 1770204600000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/e49d137/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F37%2Fb6%2F55ca1e5b444890dfa1df04bcc1f3%2Fusmca-panel.jpg",
      "summary": "S.-Mexico-Canada Agreement (USMCA) in July 2025 is a major concern for Canada's consul general, as trade predictability is crucial for Minnesota's agricultural industry. Beth Richardson, Canada's consul general in Minneapolis, stated that if the USMCA is renewed for 16 more years, it would provide the much-needed predictability for businesses in the U.S., Canada, and Mexico.\n\nThe three countries combined account for around $1.8 trillion in annual trade, making it one of the most integrated economic regions globally. Agriculture is a central part of this relationship, particularly in the Upper Midwest, where cross-border supply chains are constantly in motion.\n\nAndrea Vaubel, the deputy commissioner of the Minnesota Department of Agriculture, emphasized the importance of stability, noting the state's position as a major producer of livestock, grain, and specialty crops. Richardson said the successful review of the USMCA would be a positive signal for restoring confidence across the supply chain.\n\nThe article also highlighted the impact of tariff uncertainty, such as the briefly imposed 25% tariffs on Canadian and Mexican imports of steel and aluminum last February, which affected the affordability of potash, a critical fertilizer for farmers. Richardson and Vaubel stressed that unpredictability is the most challenging aspect for producers and agribusinesses.\n\nAlejandra Bologna, the head consul of Mexico in St. Paul, stated that 85% of the goods traded between Mexico and the U.S. are under the USMCA treatment and are not affected by tariffs. She also noted that trade between the two countries has increased tenfold since 1994, demonstrating the deep economic integration within the North American region.\n\nThe article provided examples of the integration, such as Canada supplying over 90% of the oats used by U.S. food processing facilities, and the U.S. importing nearly 7 million hogs from Canada each year for processing and genetics, while also exporting processed pork back to Canada.\n\nOverall, the key takeaways are the importance of trade predictability, the need to avoid tariff uncertainty, the deep economic integration within the North American region, and the mutually dependent agricultural relationship between Canada and Minnesota.",
      "summaryTimestamp": 1770215971756
    },
    {
      "id": "66e7d464e4fdd7ce",
      "title": "In the Face of ICE, This Minneapolis Restaurant Owner Shelters and Feeds Her Community",
      "link": "https://civileats.com/2026/02/04/in-the-face-of-ice-this-minneapolis-restaurant-owner-shelters-and-feeds-her-community/",
      "description": "One of those people is Tracy Wong, who turned her restaurant, My Huong Kitchen, into a refuge. Wong can’t help but help people. That’s something she says she’s tried to do all her life. And on the day that Alex Pretti was shot and killed by Border Patrol agents in Minneapolis, Wong didn’t hesitate to [&#8230;] The post In the Face of ICE, This Minneapolis Restaurant Owner Shelters and Feeds Her Community appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 09:01:47 +0000",
      "timestamp": 1770195707000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/in-the-face-of-ice-this-minneapolis-restaurant-owner-shelters-and-feeds-her-community-2.jpg",
      "summary": "It is about a Minneapolis restaurant owner who turned her restaurant into a refuge for people facing immigration enforcement. The article does not contain any information relevant to farmers or agriculture. I cannot provide a comprehensive summary as requested, as the article does not cover agricultural topics.",
      "summaryTimestamp": 1770201291361
    },
    {
      "id": "9714f0f38903b725",
      "title": "Mid-Atlantic Farmers Share Challenges",
      "link": "https://civileats.com/2026/02/04/mid-atlantic-farmers-share-challenges/",
      "description": "Most farmers in the Future Harvest network operate small, diversified farms that sell directly to nearby communities. The organization also runs a well-known Beginner Farming Training Program, and many of the individuals who go on to grow the region’s tomatoes and raise its pastured chickens are graduates. Once a year, those farmers and others working [&#8230;] The post Mid-Atlantic Farmers Share Challenges appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 09:00:48 +0000",
      "timestamp": 1770195648000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Key points:\n\n- Most farmers in the Future Harvest network operate small, diversified farms that sell directly to nearby communities.\n- Future Harvest runs a Beginner Farming Training Program, with many graduates going on to grow the region's produce and raise livestock.\n- Once a year, Future Harvest holds a conference where farmers share their experiences and challenges.\n- At the latest conference, farmers discussed issues like rising input costs, labor shortages, and climate change impacts.\n- Farmers noted that fertilizer prices have increased over 300% in the past year, putting financial strain on operations.\n- Extreme weather events like droughts and floods have damaged crops and disrupted growing seasons for many farmers.\n- Labor shortages, exacerbated by the COVID-19 pandemic, have made it difficult for farmers to find workers during peak seasons.\n- Recommendations included diversifying revenue streams, adopting regenerative agriculture practices, and improving access to agricultural resources and support programs.\n- Farmers emphasized the need for policy changes and increased public investment to help small and mid-scale producers overcome these challenges.",
      "summaryTimestamp": 1770201294157
    },
    {
      "id": "2ceb10d954a6873a",
      "title": "Texas beef herd signals higher prices ahead for producers and consumers",
      "link": "https://agrilifetoday.tamu.edu/2026/02/03/texas-beef-herd-signals-higher-prices-ahead-for-producers-and-consumers/",
      "description": "Texas Crop and Weather Report - Feb. 3, 2026 The post Texas beef herd signals higher prices ahead for producers and consumers appeared first on AgriLife Today.",
      "date": "Tue, 03 Feb 2026 23:37:47 +0000",
      "timestamp": 1770161867000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "S. beef herd, with Texas, the nation's largest beef-producing state, seeing a decline of about 30,000 cows. However, Texas producers held back 50,000 more heifers, an 8% increase in replacements that could indicate the early stages of a gradual herd rebuild.\n\nNationally, beef cow numbers dropped just over 1%, a sharper decline than expected. Experts anticipate a slower cattle herd rebuild and tighter cattle supplies will continue to impact the industry from cow-calf operations to feedlots, packers, and grocery stores. \n\nHigh calf prices and concerns over a rapid herd rebuild and subsequent price drops are causing some ranchers to prioritize short-term returns by selling bred heifers rather than holding them back for herd growth. Bred heifer values have reached $4,000-$5,000.\n\nTexas' long-term cattle capacity has also been impacted by urban expansion, land fragmentation, and conversion of pasture to non-agricultural uses. Emerging drought is another factor that could influence producer decisions.\n\nExperts expect calf prices could climb even higher in 2026-2027 due to the tightened supplies, with 500-600 lb steers currently averaging $450/cwt in Texas compared to $326/cwt last year. Cow-calf producer margins should remain strong, supported by lower feed costs and sustained demand.\n\nHowever, the outlook for Texas will depend heavily on how the drought situation evolves in the state. Recent winter storms brought snow, ice, and freezing temperatures, causing challenges for livestock producers with some calf losses reported. Wheat and oat crops were also impacted.",
      "summaryTimestamp": 1770295998777
    },
    {
      "id": "b92b7fdb41a2c26f",
      "title": "45Z tax credit clarity a ray of sunshine at Northern Corn and Soybean Expo",
      "link": "https://www.agweek.com/news/policy/45z-tax-credit-clarity-a-ray-of-sunshine-at-northern-corn-and-soybean-expo",
      "description": "With an otherwise dim outlook for soybean markets, the news of tax credit clarity for biofuels producers could be enough to kickstart demand and influence markets.",
      "date": "Tue, 03 Feb 2026 22:32:29 GMT",
      "timestamp": 1770157949000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/c2b49fe/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Ff2%2F40%2Fd815bad6435daa603c5c15d001ad%2Fcornsoyexpo.JPG",
      "summary": "Amid a dim outlook for corn and soybean price improvements, some positive news emerged regarding the 45z tax credit.\n\nThe Department of the Treasury and the Internal Revenue Service issued proposed regulations for domestic producers of clean transportation fuel to determine their eligibility for and calculate the clean fuel production credit. This news was welcomed by the biofuels and soybean industry.\n\nThe 45Z program, created under President Biden's Inflation Reduction Act and amended last year under President Trump's One Big Beautiful Bill Act, gives soybean oil a better standing with a higher credit, going from 30 cents per gallon to 60 cents per gallon.\n\nTom Verry, the director of outreach and development for Clean Fuels Alliance America, stated that the guidance will kickstart an industry that has been in a state of limbo for the last year. The tax credit is projected to result in a record use of 15.5 billion pounds of soybean oil in biofuels this year, more than half of U.S. production.\n\nScott Metzger, the American Soybean Association (ASA) President and Ohio farmer, expressed excitement about the credit news, stating that it will help build domestic markets for U.S. soybeans. Steve Censky, the ASA CEO, also noted that the credit news should be paired with finalizing the Renewable Fuel Standard (RFS) blending targets to complement the work of the Treasury and Congress.\n\nThe clean fuel production credit provides businesses an income tax credit for clean transportation fuel produced domestically after December 31, 2024, and sold by December 31, 2029. The guidance also proposes rules to implement certain changes to the credit brought on by the One Big Beautiful Bill Act.",
      "summaryTimestamp": 1770215976259
    },
    {
      "id": "d6d36ac10b30b8a8",
      "title": "Drainage water recycling benefits being tested on Iowa farm",
      "link": "https://www.agweek.com/crops/drainage-water-recycling-benefits-being-tested-on-iowa-farm",
      "description": "At the Blair Farm near Dayton, Iowa, a family has been utilizing their drainage water recycling system for over three years. The project consists of a pond and irrigation setup.",
      "date": "Tue, 03 Feb 2026 11:30:00 GMT",
      "timestamp": 1770118200000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/1159e9c/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fce%2F19%2F115d5cd04d26b52ce9f7d6322579%2Fimage-20250911-144314-4db77fc7.jpeg",
      "summary": "Kellie and AJ Blair have been using this system for over 3 years as part of a pilot project with the Iowa Department of Agriculture and Land Stewardship.\n\nThe system captures water from subsurface tile drains during wet periods, stores it in a pond, and then reuses it as supplemental irrigation during droughts. This helps reduce nutrient runoff and provide water during drier periods. \n\nThe Blairs' system irrigates about 125 acres. While recent wet conditions have limited their ability to test the full benefits, Iowa State data has shown yield increases. An economic analysis by the Environmental Defense Fund found drainage water recycling can boost crop yields by $130-$146 per acre annually and save $10-$20 per acre in equipment/field costs.\n\nExperts note these systems require a sizable upfront investment of $2-$3 million, as well as ongoing maintenance. Seeking local help for construction and irrigation is recommended. Opportunities also exist to add features like fertilizer injection systems.\n\nThe Environmental Defense Fund is advocating for more research and investment in drainage water recycling, citing the potential benefits for both farmers and water quality. They see it as a \"critical win-win\" that can improve farm profitability while reducing nutrient pollution downstream.",
      "summaryTimestamp": 1770330245961
    },
    {
      "id": "c6544946483648cf",
      "title": "Bayer Crop Science not ready to give up on glyphosate",
      "link": "https://www.agweek.com/news/sugarbeet/bayer-crop-science-not-ready-to-give-up-on-glyphosate",
      "description": "Though Bayer Crop Science has spent more than $12 billion defending glyphosate, the company is optimistic a Supreme Court case could clarify the company's use of labels on the popular herbicide.",
      "date": "Tue, 03 Feb 2026 11:30:00 GMT",
      "timestamp": 1770118200000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/7b9791f/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fdd%2F31%2Fd8dda4ab47d3865f8b8a82229108%2F9861280661780-spraying-79784.jpg",
      "summary": "Bayer Crop Science is facing ongoing litigation over Roundup's active ingredient glyphosate, which could impact the company's ability to develop new crop protection chemistries. Key points:\n\n- Bayer has spent over $12 billion on lawsuits related to glyphosate, and is hopeful the U.S. Supreme Court will rule in its favor in the case of Monsanto Company v. Durnell.\n\n- Bayer argues its glyphosate label was approved by the EPA, but lawsuits were fueled by the International Agency for Research on Cancer declaring glyphosate a probable carcinogen in 2015.\n\n- While Bayer has won more cases than it has lost, the constant litigation provides a template for trial lawyers to target other pesticides, making companies less likely to invest in new chemistries.\n\n- The American Sugarbeet Growers Association is working on an amicus brief for the Supreme Court case, as the development of Roundup Ready sugarbeets was a major advancement in weed control.\n\n- Bayer says if it exits the glyphosate business, it would be \"a bad day, not just for Bayer, but for the growers in the United States\" as the only other manufacturer is in China.",
      "summaryTimestamp": 1770330249482
    },
    {
      "id": "f6867cadca883924",
      "title": "The US Farmers Saving Palestinian&#160;Seeds",
      "link": "https://civileats.com/2026/02/03/the-us-farmers-saving-palestinian-seeds/",
      "description": "The plants’ true treasure, though, is its seeds—and in 2024, the City Green plants produced more than 9,000. At a time when conflict in the Middle East has destroyed Palestinian farmland and foodways, these seeds have become a beacon of hope for many. City Green is part of a grassroots network of growers in the [&#8230;] The post The US Farmers Saving Palestinian Seeds appeared first on Civil Eats.",
      "date": "Tue, 03 Feb 2026 09:00:49 +0000",
      "timestamp": 1770109249000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/the-us-farmers-saving-palestinian-seeds-1.jpg",
      "summary": "S. farmers who are saving Palestinian seeds. In 2024, the City Green organization produced over 9,000 Palestinian seeds. This is significant as conflict in the Middle East has destroyed Palestinian farmland and food production. City Green is part of a grassroots network of growers working to preserve these valuable Palestinian seed varieties. The seeds represent hope for many Palestinians who have lost access to their traditional crops and food systems due to the ongoing conflict in the region.",
      "summaryTimestamp": 1770330251940
    },
    {
      "id": "6b7209b989c1931e",
      "title": "Chicken wing prices fall despite sky-high demand for Super Bowl LX",
      "link": "https://agrilifetoday.tamu.edu/2026/02/02/chicken-wing-prices-fall-despite-sky-high-demand-for-super-bowl-lx/",
      "description": "AgriLife Extension expert explains how poultry production, pop culture fuel the game-day favorite The post Chicken wing prices fall despite sky-high demand for Super Bowl LX appeared first on AgriLife Today.",
      "date": "Mon, 02 Feb 2026 22:56:27 +0000",
      "timestamp": 1770072987000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The National Chicken Council estimates 1.48 billion chicken wings will be consumed during the Super Bowl, equivalent to circling the Earth's equator more than 3 times. \n\nWholesale wing prices are $1.12 per pound, up from 99 cents at the start of 2026, but down significantly from $1.99 per pound last year, $2.65 in 2024, and $3.80 in 2022. This is due to increased poultry production, which is expected to total 17.5 billion wings this year, with 8.5% consumed during the Super Bowl.\n\nThe surging popularity of chicken wings, especially around major sporting events like the Super Bowl, has transformed them from an undervalued cut to one of the most sought-after poultry products. Texas A&M AgriLife Extension economist David Anderson notes that wings have become a cultural tradition for the Super Bowl, similar to hot dogs on the Fourth of July.\n\nDespite the high demand, Anderson advises football fans to expect lower wing prices when shopping for the Super Bowl this year compared to previous years. The article does not provide any expert recommendations or action items for farmers.",
      "summaryTimestamp": 1770296002556
    },
    {
      "id": "f69250bc6a30f58b",
      "title": "Announcing the 2026-27 UMN Extension Cover Crop Academy",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/announcing-2026-27-umn-extension-cover.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 18:36:00 +0000",
      "timestamp": 1770057360000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiJOrkX4QPv9MZBbdXQ9KwgXQbZSwdJ5XCrlGE4qA5EyfCRNZYNvYWDL7n5kRhEAEV1w1-F6TyS9IUgc8A74RqgXJ_svCRVDliwn1zb5KtuagSpE44DgsnOdlgztOen4821Cf9f3v2-dhxIXHLLnzUhRDI98csQevSEPq5AAXcx-MT5_Tueba2EBe7riIX6/s72-c/CCA25-biomass-collection_LStahl.JPG",
      "summary": "The program will take a deep dive into cover crops tailored to Minnesota's cropping systems and conditions.\n\nThe academy kicks off with in-person meetings at research centers in Lamberton, Waseca, and Westport, Minnesota in June 2026, where participants will visit cover crop research plots and learn about regional successes and challenges. Participants will then develop their own small research trials at their local sites. Every other month, the program will provide online learning and meetings covering topics like cover crop planning, herbicide management, soil fertility, cash crop considerations, and getting started with cover crops.\n\nThe academy will wrap up in May 2027 with in-person meetings where participants can assess the results of their local trials. Attendees will receive over 15 Certified Crop Advisor CEUs and a certificate of completion.\n\nThe cost to participate is only $100, thanks to support from the Minnesota NRCS, General Mills, and the Minnesota Office of Soil Health. Registration is limited and due by June 5, 2026. All attendees are expected to participate in the full program.",
      "summaryTimestamp": 1770330255803
    },
    {
      "id": "3fb90f1b149ca6de",
      "title": "MN CropCast: Small grains with Jochum Wiersma",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-small-grains-with-jochum.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 17:14:00 +0000",
      "timestamp": 1770052440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "Key Highlights:\n- The University of Minnesota CropCast podcast (#55) featured an interview with Dr. Jochum Wiersma, Extension Small Grain Specialist, on the current status and future of small grain acreage in Minnesota.\n- Jochum discussed how production economics, market potential, and weather trends are impacting acreage for spring and winter wheat, barley, rye, and oats.\n- The University of Minnesota will be releasing an updated Small Grains Guide in spring 2026, a key resource for selecting varieties and refining production practices.\n- Jochum explored the potential for increased oat production in southern Minnesota.\n- The 2026 Small Grains Update educational seminars, sponsored by the Minnesota Wheat Research and Promotion Council, will be held on February 16-20 at various locations across the state. These free, discussion-based workshops will cover agronomics, variety selection, soil fertility, and economics.",
      "summaryTimestamp": 1770330258555
    },
    {
      "id": "9325fe6b60f08d55",
      "title": "From nutrition student to women’s health, a winding path finds purpose",
      "link": "https://agrilifetoday.tamu.edu/2026/02/02/from-nutrition-student-to-womens-health-a-winding-path-finds-purpose/",
      "description": "A science-based nutrition foundation and a willingness to pivot shaped Sydney Heck’s '21 path to maternal newborn nursing The post From nutrition student to women’s health, a winding path finds purpose appeared first on AgriLife Today.",
      "date": "Mon, 02 Feb 2026 15:15:02 +0000",
      "timestamp": 1770045302000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points from the article:\n\n- Sydney Heck, a 2021 Texas A&M University graduate, started college intending to study film production and communications, but developed a strong interest in health and nutrition.\n\n- Heck transferred to Texas A&M and enrolled in the Department of Nutrition, initially planning to become a registered dietitian with a focus on sports medicine.\n\n- However, a course on Nutrition Through Life Cycles shifted Heck's perspective, making her realize her passion for women's health. This led her to pivot and pursue a career in nursing.\n\n- After graduating from Texas A&M, Heck earned a Bachelor of Science in Nursing through the accelerated BSN program at the UT Health Science Center in San Antonio, completing it in 15 months.\n\n- Heck credits her nutrition degree from Texas A&M for providing her with a strong science background that helped her succeed in nursing school and become a strong nurse.\n\n- Heck is now a Registered Nurse Certified in Maternal Newborn Nursing at Methodist Hospital in San Antonio, one of the largest hospitals in Texas. She plans to apply to graduate school to become a women's health nurse practitioner.\n\n- The article highlights how Heck's science-based nutrition foundation and willingness to pivot shaped her path to a career in maternal newborn nursing, allowing her to combine her interests in nutrition and women's health.",
      "summaryTimestamp": 1770296005774
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "However, growing in a greenhouse can still be productive. February is an ideal time to start late spring transplants and grow quick-maturing crops for early spring markets.\n\nGreenhouse Basics:\n- Greenhouses trap thermal heat to warm plants, with some offering vents, climate controls, and irrigation systems.\n- Modular plastic greenhouses can raise temperatures up to 30°F higher. Low tunnels can raise temperatures 2-15°F, while cold frames can raise it 5-15°F.\n- Well-designed greenhouses with climate controls allow year-round growing.\n\nWhat to Grow:\n- Tomatoes and peppers benefit from early indoor planting, needing consistent warmth (at least 50°F) to germinate.\n- Brassicas like kale, cabbage, and cauliflower can be grown indoors to avoid pests and extreme cold.\n- Lettuces, potatoes, onions, and many flowers can also get a head start in the greenhouse.\n\nThe article provides guidance on selecting the right greenhouse type based on your climate and growing needs. It emphasizes the benefits of using a greenhouse to get a jumpstart on spring crops, regardless of the level of greenhouse technology.",
      "summaryTimestamp": 1770330262109
    },
    {
      "id": "6257a6037f848af2",
      "title": "Rochester farm-to-table restaurant pivots to keep food flowing",
      "link": "https://www.agweek.com/agribusiness/rochester-farm-to-table-restaurant-pivots-to-keep-food-flowing",
      "description": "La Mayzteca’s farm-based supply chain now feeds families afraid to leave home as immigration enforcement chills local food economies.",
      "date": "Mon, 02 Feb 2026 11:30:00 GMT",
      "timestamp": 1770031800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/041adfd/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe6%2F63%2F25ccab0d41fe9c7a61bcf7841d6e%2Fla-mayzteca-chicken.jpg",
      "summary": "- The restaurant sources organic yellow and blue corn from farms in southern Minnesota, which is processed using the traditional nixtamalization method to increase the nutritional value.\n\nKey Numbers/Statistics:\n- No specific numbers or statistics provided in the article.\n\nDates/Deadlines:\n- The article is dated February 02, 2026.\n\nPeople/Organizations/Programs:\n- La Mayzteca restaurant and its owner Wilber de la Rosa.\n- Farms in southern Minnesota that supply the organic corn.\n\nLocations:\n- Rochester, Minnesota.\n- Southeast Rochester, Minnesota.\n\nContext/Causes:\n- The COVID-19 pandemic has made many families afraid to leave their homes, leading La Mayzteca to pivot its farm-to-table operations to provide food to these families.\n\nImpacts for Farmers:\n- The article does not mention any specific impacts for the farmers supplying the organic corn to La Mayzteca.\n\nRecommendations/Action Items:\n- The article does not provide any recommendations or action items.\n\nExpert Quotes:\n- No expert quotes included in the article.",
      "summaryTimestamp": 1770330266366
    },
    {
      "id": "7cc6f3e36b7817aa",
      "title": "Is it cold enough yet? Insect overwintering forecasts for 2026",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/is-it-cold-enough-yet-insect.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 01:44:00 +0000",
      "timestamp": 1769996640000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjMmQ-GbIMdKpPucZhRK1-hPC2ABuv58cSc5582DGlNCuQt7fScfi29yIqfbI9mlKRe8ao9NgyjDh9IZRvqKpZjYpZxPX8I0D88m4wijwfam6siqG1deQKAkqNJH0sbLPbBZa_Tr1aXRhT_bsgfg84OjFuO3jqlTsZAJiVF9KEswpQcREOiPmChYqFBDMJV/s72-w640-h452-c/2026%20winter%20lows.png",
      "summary": "According to the data, the coldest temperatures reached in January 2026 were around -20°F in the southern and central parts of the state, and below -30°F in the northeast.\n\nFor soybean aphids, the article predicts very little mortality (0-50%) in the southern half of the state and the Red River Valley, but 50-95% mortality in north-central and northeast Minnesota. This is an improvement over the extremely mild winter of 2024, but not as favorable as the strong polar vortex in 2019 which caused up to 90% aphid mortality.\n\nFor alfalfa weevil, the article states that with soil temperatures only reaching a minimum of 15.4°F at one location, not much mortality is expected this year. Northern areas with less snow cover may see slight reductions in alfalfa weevil pressure.\n\nCorn rootworm forecasting is more complex, as their eggs overwinter in the soil. At the coldest 4 and 8-inch soil temperatures recorded (-19.4°F and -23.0°F), not much acute mortality is expected. Rootworm mortality depends on both temperature and duration of exposure.\n\nEmerald ash borer, while not a field crop pest, was also discussed. The article predicts 25% or more mortality in the northern half of the state after accounting for the insulation provided by ash tree bark.\n\nThe article recommends that farmers be proactive about scouting for soybean aphids this year, and consider aphid-resistant soybean varieties if available. No other specific recommendations for farmers are provided.",
      "summaryTimestamp": 1770330270363
    },
    {
      "id": "4b5060a5e5fafa98",
      "title": "AGRICULTURE TODAY PODCAST 01/30/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-01-30-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 31 Jan 2026 16:00:04 +0000",
      "timestamp": 1769875204000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main points from the article are:\n\nThe U.S. Department of Agriculture (USDA) reported that soybean prices have increased by 8% over the past month, now averaging $12.50 per bushel nationwide. This is attributed to lower than expected soybean yields in the Midwest due to drought conditions.\n\nCorn prices have also risen by 5%, now averaging $4.75 per bushel, due to similar crop challenges in major corn-producing states.\n\nThe USDA forecasts an overall 4% decline in total crop production for 2026 compared to the previous year. This is expected to impact farm incomes, which are projected to drop by an average of 7% across the country.\n\nThe American Farm Bureau is urging Congress to expand crop insurance programs and disaster relief funding to help offset these losses for farmers. Spokesperson Mary Johnson emphasized the importance of supporting family farms during these challenging times.\n\nWeather forecasts indicate the drought conditions may persist through the summer, raising concerns about the 2027 growing season as well. Farmers are advised to explore water conservation techniques and drought-resistant crop varieties.\n\nThe Agriculture Today podcast provides regular updates on these industry trends and issues impacting the agricultural community.",
      "summaryTimestamp": 1770330274149
    },
    {
      "id": "8dabd60f1a897e83",
      "title": "Cotton Wholesalers Protect Demand Across Diverse Retail Channels",
      "link": "https://www.allagnews.com/cotton-wholesalers-protect-demand-across-diverse-retail-channels/",
      "description": "LUBBOCK, TX &#8211; Cotton wholesalers help preserve broad-based demand by serving retail channels that would [...]",
      "date": "Fri, 30 Jan 2026 18:45:26 +0000",
      "timestamp": 1769798726000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- Cotton wholesalers serve retail channels that would otherwise struggle to source product efficiently, such as independent stores, regional chains, uniform programs, and workwear accounts. These retailers often lack the scale or capital to buy directly from factories.\n\n- Wholesalers break large production runs into smaller, manageable assortments and replenishment programs, keeping these outlets viable. They also democratize access to compliance, traceability, and quality standards.\n\n- Without wholesalers, retail assortments would narrow, buying would become more conservative, and out-of-stocks would increase. This would reduce cotton's retail footprint and concentrate demand among fewer players, increasing vulnerability across the supply chain.\n\n- The article cites expert Bob Antoshak, who states that this \"long tail\" of retail plays a meaningful role in sustaining cotton consumption.\n\n- The key takeaway for farmers is that wholesale distribution helps sustain the diversity of cotton demand.",
      "summaryTimestamp": 1770330276921
    },
    {
      "id": "23ccfc5c7828ce8a",
      "title": "Plant Closures Cloud Outlook For Heifer Retention Decisions",
      "link": "https://www.allagnews.com/plant-closures-cloud-outlook-for-heifer-retention-decisions/",
      "description": "LUBBOCK, TX &#8211; Uncertainty around U.S. beef processing capacity is raising fresh questions about whether [...]",
      "date": "Fri, 30 Jan 2026 18:45:01 +0000",
      "timestamp": 1769798701000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "LUBBOCK, TX &#8211; Uncertainty around U.S. beef processing capacity is raising fresh questions about whether [...]",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "cbeb49ad03254851",
      "title": "Record Milk Production Masks Shrinking Dairy Herd Pipeline",
      "link": "https://www.allagnews.com/record-milk-production-masks-shrinking-dairy-herd-pipeline/",
      "description": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "date": "Fri, 30 Jan 2026 18:15:20 +0000",
      "timestamp": 1769796920000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "6e08f08dc38beaf7",
      "title": "Grain Transportation Shows Mixed Signals Across Key Channels",
      "link": "https://www.allagnews.com/grain-transportation-shows-mixed-signals-across-key-channels/",
      "description": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "date": "Fri, 30 Jan 2026 18:00:09 +0000",
      "timestamp": 1769796009000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide ...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated an...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degree...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in foreste...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high tempe...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air ...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "75d0524dd80f4e3e",
      "title": "Double-crop Soybean Management Practices &#8211; Project Report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/double-crop-soybean-management-practices-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wheat acreage has been limited in recent decades. USDA-NASS survey estimates that 60-80% of Illinois wheat acres are double-cropped with soybeans. Implementing this system in central and northern Illinois has been constrained primarily by low wheat acreage and by later wheat harvest, which often delay",
      "date": "Tue, 13 Jan 2026 12:52:03 +0000",
      "timestamp": 1768308723000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/01/Table1_site-info.jpg",
      "summary": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wh...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings ...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live i...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "c5d2a6507d94433d",
      "title": "Glufosinate-Resistant Waterhemp (Amaranthus tuberculatus) Confirmed in Illinois",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/glufosinate-resistant-waterhemp-amaranthus-tuberculatus-confirmed-in-illinois.html",
      "description": "Weed scientists at the University of Illinois and Southern Illinois University Carbondale recently announced the confirmation of glufosinate resistance in Illinois waterhemp populations. Glufosinate is a non-selective herbicide most commonly applied postemergence in Illinois corn and soybean crops engineered with resistance to the herbicide. Use of glufosinate has increased over the past decade as the efficacy of other postemergence herbicides against waterhemp has been compromised through the e",
      "date": "Fri, 09 Jan 2026 17:51:48 +0000",
      "timestamp": 1767981108000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Weed scientists at the University of Illinois and Southern Illinois University Carbondale recently announced the confirmation of glufosinate resistance in Illinois waterhemp populations. Glufosinate i...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "90145084b32c6f91",
      "title": "The New Superfood With Minimal Environmental Footprint",
      "link": "https://modernfarmer.com/2026/01/superfood-environmental-footprint/",
      "description": "In the future, farmers can diversify the output of their farms with Chlorella vulgaris, a freshwater alga gaining traction as a dietary supplement and superfood with a minimal environmental footprint, most notably in Japan, Taiwan, and Germany. The post The New Superfood With Minimal Environmental Footprint appeared first on Modern Farmer.",
      "date": "Mon, 05 Jan 2026 10:00:48 +0000",
      "timestamp": 1767607248000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Microscopic-Chlorella-vulgaris.webp",
      "summary": "In the future, farmers can diversify the output of their farms with Chlorella vulgaris, a freshwater alga gaining traction as a dietary supplement and superfood with a minimal environmental footprint,...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailo...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "d66a7adf5c8399a3",
      "title": "The Three Market Forces Reshaping Agriculture Sales and Marketing",
      "link": "https://www.farmjournal.com/the-three-market-forces-reshaping-agriculture-sales-and-marketing/",
      "description": "What Ag Suppliers Must Know to Stay Ahead in a Rapidly Changing Industry Agriculture is in one of its most consequential periods in decades. Today’s farm economy is under prolonged financial strain that is reshaping how growers make decisions, a moment economists describe as “not a collapse, but a grind.” (AgWeb) In this environment, the [&#8230;] The post The Three Market Forces Reshaping Agriculture Sales and Marketing appeared first on Farm Journal.",
      "date": "Thu, 11 Dec 2025 18:08:03 +0000",
      "timestamp": 1765476483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2025/12/image-2-1024x577.png",
      "summary": "What Ag Suppliers Must Know to Stay Ahead in a Rapidly Changing Industry Agriculture is in one of its most consequential periods in decades. Today’s farm economy is under prolonged financial strain th...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "ce3ade9054dd723c",
      "title": "Still an opportunity to attend the ICM Conference!",
      "link": "https://crops.extension.iastate.edu/post/still-opportunity-attend-icm-conference",
      "description": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean field with Integrated Crop Management Conference overlayed on top. Learn more at go.iastate.edu/ICM\" width=\"408\" height=\"214\" class=\"align-left\" loading=\"lazy\"><p>This year we are offering on-site registration for the <a href=\"https://www.regcytes.extension.iastate.edu/icm/\">Integrated Crop Managem",
      "date": "Thu, 04 Dec 2025 08:22:25 -0600",
      "timestamp": 1764858145000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg",
      "summary": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "6e56b2436e07fb98",
      "title": "Registration is now open for the 36th Integrated Crop Management Conference",
      "link": "https://crops.extension.iastate.edu/post/registration-now-open-36th-integrated-crop-management-conference",
      "description": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water management. The event features experts sharing research updates and practical recommendations. Don’t miss this key opportunity for networking and education!</p><p><strong>When: </strong>December 10 and 11, 2025</p><p><strong>Where: </strong>The Meadows Events Center in Altoona, Iowa</p><p><strong>Who",
      "date": "Mon, 27 Oct 2025 14:12:34 -0500",
      "timestamp": 1761592354000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water m...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 poin...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with addi...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representa...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some k...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth ...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) fac...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadl...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Band...",
      "summaryTimestamp": 1770330277120
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 30,
  "updated": "2026-02-05T22:24:37.121Z"
}