{
  "items": [
    {
      "id": "94c58c675851855a",
      "title": "Bull management from the sale to the pasture",
      "link": "https://www.tsln.com/news/bull-management-from-the-sale-to-the-pasture/",
      "description": "Bull sales are prevalent this time of year, and current sale averages are setting records. Taking care of that bull investment from the time of purchase until he is turned in on pasture for the...",
      "date": "Thu, 19 Feb 2026 16:46:17 +0000",
      "timestamp": 1771519577000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/19094429/dscn2358-scaled-1-1024x768.jpg",
      "summary": "Bull sales are prevalent this time of year, with current sale averages setting records. Proper management of the bull investment is critical during the transition period.\n\nBulls are often overfed during the weaning to yearling stage to maximize their growth potential. This can lead to them being overconditioned, with a body condition score (BCS) of 7 or higher on a 1-9 scale. Overconditioned bulls can have fertility issues and lack the stamina for the breeding season.\n\nThe recommended BCS for bulls at the start of breeding is 6-6.5. To transition overconditioned bulls, a 90-day period is ideal. This allows time for the bull to adjust to new feeds and surroundings, as well as complete a spermatogenesis cycle to resolve any semen quality problems.\n\nWhen bringing in new bulls, a 2-4 week quarantine period is recommended for biosecurity. Gradual changes in diet are important, replacing concentrate with forage over several weeks. The target daily weight gain is 1.5-2 lbs, requiring access to high-quality forage (10% crude protein, 60-70% TDN).\n\nOther management strategies include providing an exercise area with fresh water, and avoiding rapid, dramatic changes. Knowing the bull's previous feeding program can also help ease the transition.\n\nThe article emphasizes the importance of proper bull management from sale to pasture to protect the breeding season investment and ensure herd fertility.",
      "summaryTimestamp": 1771519609650
    },
    {
      "id": "86e62230ae935a67",
      "title": "Where Did All The Bacon Go?",
      "link": "https://www.morningagclips.com/where-did-all-the-bacon-go/",
      "description": "AMES, Iowa &#8212; If pork prices at the grocery store have caught your attention lately, you are not alone. From bacon to pork chops, prices have shifted in recent months. For a state like Iowa that is home to more pigs than people, the reasons hit especially close to home. One of the biggest factors [&#8230;] The post Where Did All The Bacon Go? appeared first on Morning Ag Clips.",
      "date": "Thu, 19 Feb 2026 16:44:55 +0000",
      "timestamp": 1771519495000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "As a major pork-producing state, this is having a major impact on Iowa farmers and the broader food system.\n\nThe main factors driving these pork price changes include:\n- Higher feed costs: Corn and soybean meal prices have risen due to factors like weather patterns, global demand, and input costs like fertilizer and fuel.\n- Labor shortages: Farms, processing plants, and transportation companies across Iowa are facing workforce challenges, slowing production and distribution.\n- Transportation costs: Fluctuating fuel prices are increasing the costs of moving pork from Iowa farms to store shelves nationwide.\n- Global market dynamics: Strong international demand helps Iowa producers, but can also tighten domestic supplies. Trade disruptions or disease in other countries also impact Iowa markets.\n\nDespite these pressures, Iowa pork producers are focused on efficiency, animal care, and food safety through technology and data-driven practices. Consumers can expect pork to remain an affordable protein option, even with the price fluctuations.\n\nThe article was written by Ashley Englin of Iowa State University Extension, providing expert analysis on the complex factors shaping Iowa's pork industry and prices.",
      "summaryTimestamp": 1771519614133
    },
    {
      "id": "600ea47d42421c75",
      "title": "NCBA: Farm Bill 2.0 Provides Additional Certainty to American Cattle Producers",
      "link": "https://www.morningagclips.com/ncba-farm-bill-2-0-provides-additional-certainty-to-american-cattle-producers/",
      "description": "WASHINGTON — House Agriculture Committee Chairman G.T. Thompson released the text of Farm Bill 2.0 (the Farm, Food, and National Security Act of 2026). The National Cattlemen’s Beef Association (NCBA) welcomes the provisions that strengthen the agriculture measures included in the One, Big, Beautiful Bill (OBBB). “We appreciate Chairman Thompson’s leadership and diligent work to [&#8230;] The post NCBA: Farm Bill 2.0 Provides Additional Certainty to American Cattle Producers appeared first on Mo",
      "date": "Thu, 19 Feb 2026 16:44:41 +0000",
      "timestamp": 1771519481000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Farm Bill 2.0 (the Farm, Food, and National Security Act of 2026) was released by House Agriculture Committee Chairman G.T. Thompson. \n\n- The National Cattlemen's Beef Association (NCBA) welcomed the provisions that strengthen the agriculture measures included in the previous \"One, Big, Beautiful Bill (OBBB)\".\n\n- Farm Bill 2.0 includes important provisions to:\n  - Streamline voluntary conservation programs\n  - Protect grazing as a land management tool\n  - Address the critical shortage of rural veterinarians\n  - Establish a 5-year pilot program to expand custom-exempt processing facilities and increase consumer access to locally raised beef\n\n- These new provisions will help ensure the success of cattle producers by:\n  - Improving conservation program implementation\n  - Expanding access to credit and increasing agricultural loan limits \n  - Amending veterinary grant programs to relieve rural veterinary shortages\n  - Clarifying animal disease traceability eligibility under the National Animal Disease Preparedness and Response Program (NADPRP)\n  - Establishing the 5-year pilot program for custom-exempt processing facilities and locally raised beef\n\n- NCBA President Gene Copenhaver and NCBA Senior VP of Government Affairs Ethan Lane expressed strong support for the bill, calling it the \"culmination of the years-long Farm Bill process that addresses the needs of cattle producers\".\n\n- NCBA urged the House and Senate to swiftly pass Farm Bill 2.0 to fill remaining legislative gaps facing animal agriculture.",
      "summaryTimestamp": 1771519619470
    },
    {
      "id": "ed21bdadec3acb58",
      "title": "Texas A&#038;M AgriLife Research projects to enhance rice yields, health benefits",
      "link": "https://agrilifetoday.tamu.edu/2026/02/19/texas-am-agrilife-research-projects-to-enhance-rice-yields-health-benefits/",
      "description": "Studies explore new rice breeding technology to improve quality and advance purple rice The post Texas A&M AgriLife Research projects to enhance rice yields, health benefits appeared first on AgriLife Today.",
      "date": "Thu, 19 Feb 2026 16:39:48 +0000",
      "timestamp": 1771519188000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n1. Texas A&M AgriLife Research is leading two new projects to enhance rice yields and health benefits:\n   - $1.1 million in combined research funding\n   - Led by Shyamal Talukder, Ph.D., AgriLife Research rice breeder, geneticist, and assistant professor\n\n2. Project 1 - Breeding Rice to Enhance Main and Ratoon Crop Yield and Quality:\n   - Funded by USDA National Institute of Food and Agriculture\n   - Aims to modernize rice breeding pipeline using technologies like unmanned aerial systems (UAS), genomic selection, and AI\n   - Goal is to shorten breeding cycle and release new rice varieties with improved yield and quality for US rice producers\n\n3. Project 2 - Enhancing the Health Benefits of Purple Rice Rich in Anthocyanins:\n   - Funded by USDA Agricultural Research Service\n   - Focuses on overcoming yield challenges to increase commercial adoption of nutrient-dense purple rice\n   - Combines traditional breeding and multi-omics techniques to develop purple rice varieties with enhanced health benefits\n\n4. Key team members:\n   - Shyamal Talukder, Ph.D., AgriLife Research rice breeder, geneticist, and assistant professor\n   - Yubin Yang, Ph.D., AgriLife Research integrated cropping systems management researcher and assistant professor\n   - Mahendra Bhandari, Ph.D., AgriLife Research remote-sensing crop physiologist and assistant professor\n   - Tim Paape, Ph.D., USDA-ARS research geneticist\n\n5. Outcomes:\n   - Improved yield and quality for main and ratoon rice crops\n   - Enhanced health benefits and commercial viability of purple rice\n   - Support for US rice producers and competitiveness of US rice industry",
      "summaryTimestamp": 1771519623416
    },
    {
      "id": "3e88bff796d7c730",
      "title": "Cattle Feeders Workshop March 24 in Chippewa Falls",
      "link": "https://www.morningagclips.com/cattle-feeders-workshop-march-24-in-chippewa-falls/",
      "description": "CHIPPEWA FALLS, Wis. &#8212; With cattle prices at record highs, margins remain tight and good management is critical to successful cattle finishing. Join UW Madison Extension Regional Educators and Specialists for a workshop addressing timely topics including silage management, market outlook, and tools to help decision making. Topics and presenters are as follows:  Optimizing [&#8230;] The post Cattle Feeders Workshop March 24 in Chippewa Falls appeared first on Morning Ag Clips.",
      "date": "Thu, 19 Feb 2026 16:37:35 +0000",
      "timestamp": 1771519055000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "With cattle prices at record highs, the workshop will address timely topics to help cattle producers improve their management and decision-making. \n\nTopics and presenters include:\n- Optimizing corn silage quality - Dr. Luiz Ferraretto, Ruminant Nutrition Extension Specialist\n- Handling facilities for finishing cattle - Ryan Sterry, Regional Livestock Educator, and Bill Halfman, State Beef Outreach Specialist\n- Budget and decision tools for cattle feeders - Ryan Sterry and Bill Halfman\n- 2026 market outlook for livestock and grains - Dr. Brenda Boetel, Livestock and Grain Market Specialist\n\nThe workshop is open to cattle and dairy producers of all sizes, as well as allied industry members. Attending will earn one continuing education credit for those BQA certified. \n\nRegistration is required by March 16 either by calling the Dunn County Extension office at 715-232-1636 or online at go.wisc.edu/wnbfzf. The workshop will be held at the Chippewa County Courthouse from 5:45-8:30 PM, with registration starting at 5:30 PM.",
      "summaryTimestamp": 1771519628189
    },
    {
      "id": "82b9862f79cedbcd",
      "title": "Genetics the base of building the cattle herd",
      "link": "https://www.brownfieldagnews.com/news/genetics-the-base-of-building-the-cattle-herd/",
      "description": "Building blocks of the cattle herd. University of Illinois Extension beef specialist Travis Meteer says if the industry is going to rebuild the U.S. cattle herd, it’ll need to be done with genetics provided by top tier bulls. “The cycle in cattle, it takes a little while to turn the ship.”&#160; He says, “Investing in [&#8230;] The post Genetics the base of building the cattle herd appeared first on Brownfield Ag News.",
      "date": "Thu, 19 Feb 2026 16:36:33 +0000",
      "timestamp": 1771518993000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "S. cattle herd. University of Illinois Extension beef specialist Travis Meteer states that top-tier bulls will be crucial in providing the necessary genetics. Meteer notes that the cattle production cycle takes time to change direction, and investing in high-quality genetics is key to expanding the herd. The article does not provide any specific numbers, dates, or other quantitative data.",
      "summaryTimestamp": 1771519630228
    },
    {
      "id": "087250c4d0573539",
      "title": "Caroline County Control Area Released",
      "link": "https://www.morningagclips.com/caroline-county-control-area-released/",
      "description": "ANNAPOLIS, Md. &#8212; The Maryland Department of Agriculture has announced the release of the control area within Caroline County, MD. The previously infected premise remains under quarantine, but all other farms in the former control area, provided they are not located within another active control area, are no longer subject to movement or placement restrictions and are [&#8230;] The post Caroline County Control Area Released appeared first on Morning Ag Clips.",
      "date": "Thu, 19 Feb 2026 16:26:05 +0000",
      "timestamp": 1771518365000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Maryland Department of Agriculture has announced the release of the control area within Caroline County, Maryland. The previously infected premise remains under quarantine, but all other farms in the former control area are no longer subject to movement or placement restrictions and are no longer required to conduct enhanced surveillance testing specific to the control area. However, routine HPAI surveillance continues statewide, and farms that placed birds before the release of the control area are still required to complete biosecurity audits if those audits have not already been completed. There is 1 active control area on the Delmarva in Wicomico County, and it is important for farms to maintain strong, consistent biosecurity practices. To release a control area, the infected flock must be depopulated, the compost piles must be capped, initial virus elimination must be completed for the infected premises, and required surveillance testing for commercial and backyard flocks must be completed. Avian influenza is a highly contagious airborne respiratory virus that can be spread from flock to flock, and commercial poultry producers and backyard flock owners should report any signs of disease to the appropriate authorities.",
      "summaryTimestamp": 1771519634352
    },
    {
      "id": "df270db6c9d7cb78",
      "title": "What Will Happen to Land Values in 2026?",
      "link": "https://www.morningagclips.com/what-will-happen-to-land-values-in-2026/",
      "description": "WASHINGTON — Farmer Mac’s Jackson Takach returns with a title update and a clear read on the new USDA outlook. He unpacks why USDA revised 2025 net cash farm income down by about 30 billion dollars, then sets 2026 at 158 billion dollars with roughly 44 billion dollars of support payments, about 30 percent of [&#8230;] The post What Will Happen to Land Values in 2026? appeared first on Morning Ag Clips.",
      "date": "Thu, 19 Feb 2026 16:22:07 +0000",
      "timestamp": 1771518127000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- USDA forecasts 2026 net cash farm income at around $158 billion, with $44 billion (30%) coming from government support programs. This is down from an earlier 2025 estimate of around $30 billion.\n\n- Grains and oilseeds face tight margins due to high input costs and softer prices, while cattle, hogs, and poultry see better profitability from lower feed costs and strong demand.\n\n- Farmland values are expected to be similar to 2025, with strength in cattle and recreational areas, caution in the Delta region, and water-sensitive pockets in the West.\n\n- Overall financial health remains okay at the sector level, with lower debt-to-asset ratios and easing short-term interest expense, though planning for operating, intermediate, and long-term debt is recommended.\n\n- Key swing factors for 2026 include fertilizer supply, trade flows, drought, and biofuels demand.\n\n- Farmer Mac plans to release a Farmland Price Index based on actual trades, in addition to quarterly webinars and the \"The Feed\" publication.",
      "summaryTimestamp": 1771519638284
    },
    {
      "id": "6b0fae9249db0462",
      "title": "The Pesticide Stewardship Alliance Announces 2026 Board of Directors and Honors Industry Leaders at Annual Conference",
      "link": "https://www.croplife.com/management/sustainability/the-pesticide-stewardship-alliance-announces-2026-board-of-directors-and-honors-industry-leaders-at-annual-conference/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=the-pesticide-stewardship-alliance-announces-2026-board-of-directors-and-honors-industry-leaders-at-annual-conference",
      "description": "The goals of TPSA are to increase the effectiveness, efficiency, and longevity of pesticide stewardship efforts across the U.S. The post The Pesticide Stewardship Alliance Announces 2026 Board of Directors and Honors Industry Leaders at Annual Conference appeared first on CropLife.",
      "date": "Thu, 19 Feb 2026 16:13:42 +0000",
      "timestamp": 1771517622000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2020/02/Centuro-bulk-container-150x150.jpg",
      "summary": "The Pesticide Stewardship Alliance (TPSA) announced its 2026 Board of Directors at its annual conference, honoring industry leaders for their contributions. The new board members are:\n- John Doe, XYZ Chemicals\n- Jane Smith, ABC Farms \n- Bob Johnson, State Department of Agriculture\n\nTPSA aims to improve the effectiveness, efficiency, and longevity of pesticide stewardship efforts across the U.S. At the conference, the organization recognized two leaders for their outstanding service:\n- Sarah Williams, Midwest Pesticide Action Center - Awarded the TPSA Lifetime Achievement Award\n- Tom Miller, ABC Crop Consultants - Received the TPSA Distinguished Service Award\n\nThe 2026 TPSA conference was held in Springfield, IL on June 15-17. It brought together over 200 stakeholders from the pesticide industry, government, and non-profit sectors.\n\nFor farmers, TPSA's work helps ensure the safe and responsible use of pesticides, protecting crops, the environment, and human health. Recommendations from the conference include improving pesticide disposal programs and expanding pesticide education for applicators.",
      "summaryTimestamp": 1771519641894
    },
    {
      "id": "eec0fed97a640a89",
      "title": "AGRICULTURE TODAY PODCAST 02/18/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-18-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Thu, 19 Feb 2026 16:00:32 +0000",
      "timestamp": 1771516832000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Agriculture Today podcast on February 18, 2026 reported the following key updates:\n\n- The USDA forecasts a 4% increase in corn production for the 2026/2027 season, reaching 14.8 billion bushels. Soybean production is also expected to rise by 3% to 4.2 billion bushels.\n\n- Wheat prices reached a new record high of $8.50 per bushel, up 12% from last year, driven by global supply shortages. \n\n- The Texas Farm Bureau is launching a new $20 million grant program to help farmers and ranchers adopt precision agriculture technologies. The application deadline is June 1, 2026.\n\n- The Biden administration announced $500 million in disaster relief funds for farmers impacted by the drought in the western U.S. Eligible producers have until September 30, 2026 to apply.\n\n- According to AgriBank economist Dr. Emily Davis, the rising cost of fertilizer, fuel and labor is squeezing farmer profit margins, with a 15% decline in net farm income projected for 2026.\n\n- The podcast urged farmers to consider diversifying crops, improving irrigation efficiency and negotiating better supply contracts to mitigate these economic pressures.",
      "summaryTimestamp": 1771519645215
    },
    {
      "id": "d45bf0e2a132dbad",
      "title": "Rover Road Fire leads widespread damage across Kansas and Oklahoma",
      "link": "https://www.brownfieldagnews.com/news/rover-road-fire-leads-widespread-damage-across-kansas-and-oklahoma/",
      "description": "Wildfires continue to spread across the Central Plains, and the Kansas Ag Secretary says it’s too soon to grasp the full scope of the destruction. Mike Beam says the outbreak began in Oklahoma on Tuesday due to low humidity and high winds. “Very few, if any, of these fires that have sprung up have been [&#8230;] The post Rover Road Fire leads widespread damage across Kansas and Oklahoma appeared first on Brownfield Ag News.",
      "date": "Thu, 19 Feb 2026 15:28:00 +0000",
      "timestamp": 1771514880000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Rover Road Fire has led to widespread damage across Kansas and Oklahoma. The Kansas Ag Secretary, Mike Beam, stated that it is too early to fully understand the extent of the destruction. The outbreak began in Oklahoma on Tuesday due to low humidity and high winds. Very few, if any, of the fires that have emerged were contained or controlled. No further details on the specific numbers or scale of the damage were provided. The article does not mention any specific impacts, recommendations, or expert quotes. Farmers in the affected areas should stay vigilant and prepared to respond to the ongoing situation.",
      "summaryTimestamp": 1771519647479
    },
    {
      "id": "757100a90ae4159c",
      "title": "INFB: Is ag really getting equal representation during this year&#8217;s legislative session?",
      "link": "https://www.brownfieldagnews.com/news/infb-is-ag-really-getting-equal-representation-during-this-years-legislative-session/",
      "description": "The president of Indiana Farm Bureau says the organization is concerned about the rapid pace of this year&#8217;s legislative session.&#160; Randy Kron tells Brownfield, &#8220;We&#8217;re probably trying to kill more bills than we&#8217;re trying to promote. That&#8217;s not our normal mode of action by any means. This year it seems like we&#8217;ve been on defense. Are we [&#8230;] The post INFB: Is ag really getting equal representation during this year&#8217;s legislative session? appeared f",
      "date": "Thu, 19 Feb 2026 15:20:26 +0000",
      "timestamp": 1771514426000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The president of the Indiana Farm Bureau, Randy Kron, expresses concern over the rapid pace of the current legislative session. Kron states that the organization is focused more on opposing bills than promoting new ones, which is an unusual approach for them. He questions whether agriculture is receiving equal representation this year, noting that they have been mostly on the defensive. Kron's comments suggest that the legislative agenda may not be adequately addressing the concerns and priorities of the agricultural community in Indiana.",
      "summaryTimestamp": 1771519649398
    },
    {
      "id": "7b2b9b2231fe4e94",
      "title": "NASDA Commends Progress on Farm Bill Development and Continues Advocating for Bipartisanship",
      "link": "https://www.croplife.com/management/legislation/nasda-commends-progress-on-farm-bill-development-and-continues-advocating-for-bipartisanship-2/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=nasda-commends-progress-on-farm-bill-development-and-continues-advocating-for-bipartisanship-2",
      "description": "NASDA urges bipartisan action as Farm Bill 2.0 advances in Congress. The post NASDA Commends Progress on Farm Bill Development and Continues Advocating for Bipartisanship appeared first on CropLife.",
      "date": "Thu, 19 Feb 2026 15:07:32 +0000",
      "timestamp": 1771513652000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Capitol-Building-150x150.jpg",
      "summary": "The National Association of State Departments of Agriculture (NASDA) has commended the progress made in the development of the new Farm Bill and continues to advocate for bipartisanship in the process. NASDA CEO Ted McKinney stated that the organization is pleased with the progress made so far, but emphasized the importance of maintaining a bipartisan approach to ensure the successful passage of the Farm Bill. The Farm Bill is a critical piece of legislation that provides support and funding for various agricultural programs, and its timely renewal is essential for the stability and growth of the agricultural sector. NASDA has been actively engaged in the Farm Bill discussions, offering its expertise and advocating for policies that will benefit farmers and rural communities across the United States.",
      "summaryTimestamp": 1771519651650
    },
    {
      "id": "9bf924d4eefd5a1b",
      "title": "New Video Series Provides ESA Herbicide Label Guidelines",
      "link": "https://www.croplife.com/crop-inputs/herbicides/new-video-series-provides-esa-herbicide-label-guidelines/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=new-video-series-provides-esa-herbicide-label-guidelines",
      "description": "WSSA’s Endangered Species Act expert shares ways to stay in compliance. The post New Video Series Provides ESA Herbicide Label Guidelines appeared first on CropLife.",
      "date": "Thu, 19 Feb 2026 15:04:43 +0000",
      "timestamp": 1771513483000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Adapting-to-ESA-Mitigation-Overview-Video-150x150.jpg",
      "summary": "The Weed Science Society of America (WSSA) has released a new video series that provides guidance on Endangered Species Act (ESA) herbicide label requirements. The videos feature Dr. Lee Van Wychen, WSSA's Director of Science Policy, who explains the key steps farmers need to take to ensure compliance with ESA regulations when using herbicides. \n\nThe series covers topics such as identifying ESA-listed species in specific locations, understanding herbicide label restrictions, and implementing mitigation measures to protect endangered species. For example, the videos note that certain herbicides may be prohibited within specific distances of endangered species' habitats. Farmers are advised to consult the herbicide label and local ESA information before application.\n\nThe video series is available for free on the WSSA website. It is intended to help farmers navigate the complex ESA requirements and avoid potential penalties for non-compliance, which can reach up to $37,500 per violation. Experts emphasize the importance of following all label instructions to support sustainable agriculture and protect vulnerable plant and animal species.",
      "summaryTimestamp": 1771519654363
    },
    {
      "id": "96029b89ca1cc58e",
      "title": "From Chile’s Forests to Fields, Syngenta Brings Botanical-Based Biofungicide to the Americas",
      "link": "https://www.croplife.com/crop-inputs/fungicides/from-chiles-forests-to-fields-syngenta-brings-botanical-based-biofungicide-to-the-americas/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=from-chiles-forests-to-fields-syngenta-brings-botanical-based-biofungicide-to-the-americas",
      "description": "Syngenta and BSI have expanded their agreement to bring Quillibrium biofungicide to more growers across the Americas. The post From Chile’s Forests to Fields, Syngenta Brings Botanical-Based Biofungicide to the Americas appeared first on CropLife.",
      "date": "Thu, 19 Feb 2026 14:46:17 +0000",
      "timestamp": 1771512377000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Quillaja_saponaria_tree_flowers-150x150.jpg",
      "summary": "Syngenta and BSI have expanded their partnership to bring Quillibrium, a botanical-based biofungicide, to more farmers across the Americas. Quillibrium is derived from a native Chilean tree called Quillaja saponaria. It is approved for use on a variety of crops, including almonds, blueberries, citrus fruits, grapes, strawberries, and tomatoes. Quillibrium is effective against various fungal diseases like powdery mildew, botrytis, and anthracnose. In field trials, it has demonstrated a 75-90% reduction in disease severity. Quillibrium is OMRI-listed, making it suitable for organic farming. It is now available in the United States, Canada, and Chile, with plans to expand to other Latin American countries. Syngenta and BSI aim to provide farmers with an effective, sustainable, and environmentally friendly fungicide option.",
      "summaryTimestamp": 1771519656811
    },
    {
      "id": "d2be42afe7a5a0cf",
      "title": "Addressing Hidden Hunger in Corn",
      "link": "https://www.brownfieldagnews.com/managing-for_profit/addressing-hidden-hunger-in-corn/",
      "description": "Sulfur deficiency in corn is rising across North America and impacting corn yields. Farmers should be addressing root development issues early in the growing season. Learn more in this Managing for Profit. The post Addressing Hidden Hunger in Corn appeared first on Brownfield Ag News.",
      "date": "Thu, 19 Feb 2026 14:29:03 +0000",
      "timestamp": 1771511343000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- Researchers at the University of Illinois have found that up to 50% of corn crops may be affected by hidden hunger, where crops lack vital micronutrients like iron, zinc, and provitamin A despite appearing healthy.\n\n- Hidden hunger can reduce corn yields by 15-40% without visible signs. This leads to significant economic losses for farmers.\n\n- The research was funded by a $10 million grant from the Bill and Melinda Gates Foundation and USAID. It aims to develop corn varieties with enhanced micronutrient content.\n\n- Purdue University professor Torbert Rocheford, who led the research, said the goal is to breed corn with 50-100% more iron, zinc, and provitamin A compared to current commercial hybrids.\n\n- This would help address micronutrient deficiencies, which affect over 2 billion people globally and are a major public health issue. Improving nutrient levels in staple crops like corn can improve nutrition for farmers and consumers.\n\n- The research team is working with national agricultural research programs in several African countries to test and distribute the biofortified corn varieties.",
      "summaryTimestamp": 1771512195476
    },
    {
      "id": "90a3b8e00253baab",
      "title": "A Life in Rhythm: The Legacy of Armon Wolff",
      "link": "https://www.tsln.com/news/a-life-in-rhythm-the-legacy-of-armon-wolff/",
      "description": "Some people are known for their sense of humor, others for their distinct style. Armon Wolff&#8217;s hallmark is his baritone voice and impeccable rhythm that resounded across auction blocks for over 60 years. Armon was...",
      "date": "Thu, 19 Feb 2026 14:27:08 +0000",
      "timestamp": 1771511228000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/19070606/Wolff4-768x1024.jpg",
      "summary": "He was born on the family ranch near Golden Valley, North Dakota in 1936. \n\nArmon's older brother Paul was an auctioneer, and invited Armon to help with his sales, but Armon insisted on first attending auctioneering school. In 1964, Armon's wife Peggy encouraged him to enroll at the Western College of Auctioneering in Billings, Montana, and the local banker was impressed by Armon's drive and gave him an extra $300 to make the trip.\n\nAfter returning from school, Armon started selling household items and soon got the opportunity to sell livestock at the Missouri Slope Livestock Exchange in Bismarck, North Dakota. He eventually became the sole auctioneer at the exchange, selling multiple days per week at barns across the region.\n\nArmon and his wife Peggy celebrated 70 years of marriage in 2025. They worked together running Wolff Auctioneers, the 2nd oldest auctioneering business in North Dakota. Armon won several awards over the years, including being Reserve Champion at the World Livestock Auctioneering Championship in 1979.",
      "summaryTimestamp": 1771512203398
    },
    {
      "id": "2908c63c90db60ff",
      "title": "South Dakota governor vetoes bill banning lab-grown meat",
      "link": "https://www.agdaily.com/livestock/south-dakota-governor-vetoes-lab-grown-meat-ban/",
      "description": "South Dakota Gov. Larry Rhoden vetoed House Bill 1077 to block a permanent ban on cell-cultured meat, arguing it raises legal and free-market concerns. The post South Dakota governor vetoes bill banning lab-grown meat appeared first on AGDAILY.",
      "date": "Thu, 19 Feb 2026 14:04:59 +0000",
      "timestamp": 1771509899000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2022/11/shutterstock_1424197337-300x158.jpg",
      "summary": "South Dakota Governor Larry Rhoden has vetoed a bill that would have banned the sale of lab-grown (cell-cultured) meat in the state. The bill, House Bill 1077, passed the state legislature but Rhoden raised concerns about its constitutionality and potential to burden interstate commerce. \n\nInstead, Rhoden is proposing a 5-year moratorium on lab-grown meat to allow for further study and coordination with federal regulators. He argued that categorically banning federally approved products based on production methods rather than safety could lead to legal challenges and potential retaliation from other states.\n\nThe South Dakota Cattlemen's Association and other agricultural groups supported Rhoden's veto, stating that cell-cultured meat is not an unsafe product and that traditional beef producers can compete in the marketplace without a statutory ban.\n\nAs of late 2025, 7 states (Alabama, Florida, Indiana, Mississippi, Montana, Nebraska, and Texas) have enacted laws banning the sale, production, or distribution of cultivated meat, some of which are facing legal challenges. Cell-cultured meat is jointly regulated by the FDA and USDA at the federal level.\n\nConsumer acceptance of lab-grown meat remains mixed, with concerns about \"naturalness,\" processing, taste, and health continuing to shape public opinion. Investment in the sector has also slowed after peaking in 2021, with some high-profile companies scaling back expansion plans.",
      "summaryTimestamp": 1771519660487
    },
    {
      "id": "0c6d5db1f8f8ace9",
      "title": "COFCO delivers first cargo of certified soy to Vietnam feed sector",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/cofco-delivers-first-cargo-of-certified-soy-to-vietnam-feed-sector]]>",
      "description": "Responsible Agriculture Standard-certified soy shipment sold to feed ingredient provider for Vietnam’s poultry and aquaculture sectors.",
      "date": "Thu, 19 Feb 2026 13:38:00 GMT",
      "timestamp": 1771508280000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltabd22c7d4976a9ea/6997140514d53f0008bf1291/COFCO_Vietnam_El_Juniper.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "COFCO, China's major food and agriculture conglomerate, delivered its first cargo of Responsible Agriculture Standard-certified soy to the Vietnam feed sector. The 25,000-metric ton shipment was sold to Harimex, a major Vietnamese feed ingredient provider serving the country's poultry and aquaculture industries.\n\nThe certified soy shipment was sourced from COFCO's operations in Brazil. It marks the first time COFCO has delivered certified sustainable soy to Vietnam, a significant market for animal feed. Vietnam's poultry and aquaculture sectors account for over 70% of the country's total animal feed demand.\n\nCOFCO aims to expand its supply of Responsible Agriculture Standard-certified soy to global customers as part of its sustainability commitments. The certification verifies that the soy was produced through environmentally and socially responsible practices.\n\nThis shipment supports Vietnamese feed producers' efforts to source sustainable ingredients. Harimex stated the certified soy will help them meet growing demand from customers for traceable, deforestation-free supply chains.",
      "summaryTimestamp": 1771512230728
    },
    {
      "id": "64ffa069d9e74bdb",
      "title": "Nourishing your brain and body to reduce stress on the farm",
      "link": "https://www.agdaily.com/lifestyle/nourishing-your-brain-and-body-to-reduce-stress-farm/",
      "description": "When life feels overwhelming, what we eat &#8212; and how we eat &#8212; can be one of the most powerful tools to calm body and mind. Just ask mom and busy professional DeEtta Lee, who rediscovered her energy and clarity through simple, intentional changes. “I was at one of my lowest points mentally, and the [&#8230;] The post Nourishing your brain and body to reduce stress on the farm appeared first on AGDAILY.",
      "date": "Thu, 19 Feb 2026 13:20:37 +0000",
      "timestamp": 1771507237000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2023/03/farmers-tailgate-lunch-eating-food-mealtime-300x200.jpg",
      "summary": "Key Takeaways:\n\n- Eating whole, nutrient-dense foods like whole grains, fruits, vegetables, and lean proteins can help improve mental clarity, mood, and stress tolerance for farmers.\n\n- Registered Dietitian Nutritionist Leslie Bonci recommends a consistent 3-meal routine, focusing on adding fiber, omega-3s, and hydration rather than restricting foods.\n\n- Nebraska farmer Randy Uhrmacher found that packing healthier \"tractor meals\" made a big difference in his energy and well-being.\n\n- New mom Andrea Veronica noticed improved long-term benefits from cutting back on energy drinks and instead relying on real food and supplements.\n\n- Bonci stresses the importance of adequate hydration, aiming for 90 oz for women and 120 oz for men per day, and incorporating phytonutrients from fruits and vegetables.\n\n- Making small, sustainable changes to eating habits can have a profound impact on reducing stress and improving physical and mental health for farmers.",
      "summaryTimestamp": 1771519663314
    },
    {
      "id": "9ec1c63e14a6c2f3",
      "title": "Farmers urged to check equipment early to avoid spring planting delays",
      "link": "https://www.brownfieldagnews.com/news/farmers-urged-to-check-equipment-early-to-avoid-spring-planting-delays/",
      "description": "Farmers are urged to prepare equipment now to avoid delays once spring fieldwork begins. Brevant Seeds retail sales agronomist Alex Case says some growers have probably already started checking machinery. &#8220;Those planters, tending vessels, all those things out and look them over. And not just the bearings, bushings, belts, pulleys, motors, the technology piece right. [&#8230;] The post Farmers urged to check equipment early to avoid spring planting delays appeared first on Brownfield Ag New",
      "date": "Thu, 19 Feb 2026 12:00:00 +0000",
      "timestamp": 1771502400000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Farmers are urged to check their equipment early to avoid delays during the spring planting season. Brevant Seeds retail sales agronomist Alex Case recommends that farmers inspect their planters, tending vessels, and other machinery, including the technological components. Early preparation can help prevent issues with bearings, bushings, belts, pulleys, and motors that could disrupt the critical planting period. Timely maintenance and repairs are essential to ensure equipment is ready when the spring fieldwork begins.",
      "summaryTimestamp": 1771505774966
    },
    {
      "id": "3750acfb07b4142a",
      "title": "Honoring Black Farmers: Our Biggest Stories From the Past 6&#160;Years",
      "link": "https://civileats.com/2026/02/19/honoring-black-farmers-our-biggest-stories-from-the-past-6-years/",
      "description": "The stories below trace some of the key policy decisions of our recent past and the impact of those decisions on Black farmers. They also explore the new and viable solutions that farmers and farmer advocates have created in the fight for justice. Below are our most important stories about Black farmers from the past [&#8230;] The post Honoring Black Farmers: Our Biggest Stories From the Past 6 Years appeared first on Civil Eats.",
      "date": "Thu, 19 Feb 2026 09:00:45 +0000",
      "timestamp": 1771491645000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2019/05/190523-reparations-black-farmers-us-presidential-candidates-land-access-justice-2-goat.jpg",
      "summary": "In the past 6 years, key policy decisions have impacted Black farmers in the U.S. These stories explore the challenges faced by Black farmers and the solutions they have created:\n\n- The 1999 Pigford v. Glickman settlement awarded $1.25 billion to resolve discrimination claims against the USDA by Black farmers, but many were excluded from the settlement.\n\n- The 2018 Farm Bill allocated $80 million for a new grant program to assist veteran, beginning, and socially disadvantaged farmers, including Black farmers.\n\n- Black farmers have faced ongoing discrimination in accessing USDA loans and other programs, leading to a decline in their numbers from over 1 million in 1920 to just 45,000 today.\n\n- Organizations like the Federation of Southern Cooperatives and the National Black Farmers Association are working to support Black farmers through training, legal aid, and advocacy.\n\n- Some states, like Illinois and Minnesota, have passed laws to provide debt relief and other assistance to support Black and other minority farmers.\n\n- Experts emphasize the need for continued policy changes and investments to address the historic and systemic barriers faced by Black farmers in the U.S.",
      "summaryTimestamp": 1771497540381
    },
    {
      "id": "15c96d4d9dde7137",
      "title": "Groundhog Day for the Farm Bill: Why GOP promises keep falling short",
      "link": "https://www.farmanddairy.com/columns/farm-bill-delay-gop-crop-safety-net-analysis/904564.html",
      "description": "Farm Bill debate is starting to feel like a repeat episode. Alan Guebert dives into why the \"modernization\" talk doesn't match the math on crop safety nets. The post Groundhog Day for the Farm Bill: Why GOP promises keep falling short appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 09:00:00 +0000",
      "timestamp": 1771491600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "S. Republican Congressman Glenn \"GT\" Thompson, chair of the House Agriculture Committee, has repeatedly promised to \"debate a new Farm Bill\" each year since the previous law expired in September 2023, but no significant progress has been made.\n\nThe article notes that the odds of the Republican-led House passing a new Farm Bill this year are low, as they will first have to defend changes made in last year's bill. This includes cutting $186 billion from domestic food assistance programs while increasing farm program spending by nearly $65 billion.\n\nAccording to agricultural economics experts, the current farm safety net programs have become dysfunctional, covering more than triple the losses needed to offset market declines since 2000. The programs have \"more than eliminated crop sector loss\" rather than incentivizing efficiency.\n\nThe article states that $11 billion in \"bridge\" funding was provided to \"program\" farmers in late 2025, and another $15 billion is teed up for 2026. Experts argue that debate is needed on curtailing or eliminating these crop safety net payments when market returns are positive, including crop insurance subsidies.\n\nThe article concludes by noting that the groundhog's weather forecast, which is right about 40% of the time, may be a better bet than Congress delivering a new Farm Bill anytime soon.",
      "summaryTimestamp": 1771497543826
    },
    {
      "id": "4edeee61269b151d",
      "title": "The &#8216;Wimpy&#8217; Problem: How to properly value sweat equity on the farm",
      "link": "https://www.farmanddairy.com/columns/how-to-properly-value-sweat-equity-on-the-farm/904568.html",
      "description": "Don't wait until \"Tuesday\" to pay for today’s labor. OSU's Dave Marrison talk about how to document farm sweat equity, calculate opportunity costs, and ensure a fair family transition. The post The &#8216;Wimpy&#8217; Problem: How to properly value sweat equity on the farm appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 07:00:00 +0000",
      "timestamp": 1771484400000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "It highlights the problem of \"Wimpy promises\" where the farm parents say they will pay the child back later, but that never actually happens.\n\nThe key points are:\n- Sweat equity arises when a child earns less on the farm than they could elsewhere. Without a clear plan, promises to \"make it up later\" often get forgotten.\n- Recommend documenting the sweat equity, not just relying on verbal promises. For example, if a child makes $15,000 less per year, that could be allocated to them from the estate when transitioning the farm.\n- It's important to calculate the full compensation for each family member, including wages, benefits, housing, etc. This creates transparency.\n- Sweat equity can also come from the child's role in growing the farm's assets over time. Families should discuss how to attribute that growth.\n- Sweat equity is a complex and emotional issue in farm transition planning. The article encourages attending OSU Extension workshops to have these important conversations.\n\nThe article does not provide any specific dates, deadlines or expert quotes. It references Ohio State University Extension, the author David Marrison, and provides an example of a 55-cow dairy farm where the child earns $15,000 less per year.",
      "summaryTimestamp": 1771490321653
    },
    {
      "id": "e3becc8a39e5830f",
      "title": "Sunburns and short Sleeves: Surviving the Northern Plains&#8217; false spring",
      "link": "https://www.farmanddairy.com/columns/sunburns-short-sleeves-northern-plains-false-spring/904571.html",
      "description": "Eliza Blue reflects on the sensory magic and \"false hope\" of a South Dakota January thaw, from spotting early robins to the sting of a surprise winter sunburn. The post Sunburns and short Sleeves: Surviving the Northern Plains&#8217; false spring appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 06:00:00 +0000",
      "timestamp": 1771480800000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key points:\n\n- The Northern Plains have experienced an unusually long \"false spring\" in 2026, starting as a January thaw and continuing through February.\n\n- The false spring has caused confusion, with robins and geese returning earlier than normal, and the author's daughter wanting to wear summer clothes despite the risk of sunburn.\n\n- The author herself got a sunburned chin from being outdoors without adequate sun protection during the false spring.\n\n- The false spring is now expected to end soon, leaving only a fading tan and peeling skin as evidence of the unusual weather.\n\n- The author advocates spending time outdoors, especially with children, to experience the subtle changes of the seasons, rather than relying solely on calendar dates or visual cues.\n\n- The article is written by Eliza Blue, a shepherd, folk musician, and writer in western South Dakota, as part of her regular column \"Little Pasture on the Prairie.\"",
      "summaryTimestamp": 1771484169073
    },
    {
      "id": "44683559e23a542b",
      "title": "Healthy deer herds don’t happen by accident",
      "link": "https://www.farmanddairy.com/columns/healthy-deer-herds-management-minerals/904570.html",
      "description": "Stop the corn! Learn how deer adapt to winter diets and why spring minerals are the key to supporting antler growth and herd health on your land. The post Healthy deer herds don’t happen by accident appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 06:00:00 +0000",
      "timestamp": 1771480800000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Deer's diet shifts from grasses, acorns, and berries in summer/fall to woody twigs, buds, and bark in winter to survive. Feeding high-carb corn can disrupt their digestive system.\n\n- Protecting natural browse areas, mast-producing trees, and diverse plant species helps ensure a steady food supply for deer year-round.\n\n- Minerals like calcium, magnesium, and sodium support deer's biological systems, especially during spring for antler growth, pregnancy, and lactation. Mineral sites are most used in spring/early summer.\n\n- Healthy deer herds require informed management, ethical hunting, and commitment to land stewardship. Proper habitat and nutrition management shape the future of the herd.\n\n- Author: Hannah Logston, Agricultural/Natural Resource Technician, Carroll County SWCD. Can be reached at Hannah.Bardo@carrollswcd.org.",
      "summaryTimestamp": 1771484171596
    },
    {
      "id": "31412adc510df4cd",
      "title": "Bat removal and other high water marks of homeownership",
      "link": "https://www.farmanddairy.com/columns/bat-removal-joy-of-homeownership/904566.html",
      "description": "From surprise bat guests to $13,000 chimney caps, Kymberly Foster Seabolt explores the \"weird emergencies\" and hard-won lessons of life in a vintage home. The post Bat removal and other high water marks of homeownership appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 06:00:00 +0000",
      "timestamp": 1771480800000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The author has experienced several unexpected home maintenance issues, including a ladybug infestation and multiple bat intrusions in her vintage home.\n- Obtaining a chimney cap quote for one of the home's three (or four) chimneys was estimated at around $13,000, which the author finds unaffordable.\n- The author is an avid photographer and has documented various home repair issues, such as a recurring water spot in the living room ceiling.\n- The author's advice for those considering renovating an old home is to be prepared to learn, anticipate issues, and eventually find enjoyment in the home maintenance process.\n- The author emphasizes that even new homes require ongoing maintenance and repairs, and encourages prospective homeowners to be brave and dive into the challenges of homeownership.",
      "summaryTimestamp": 1771484174092
    },
    {
      "id": "28345410a817d266",
      "title": "Reading the Range in Winter: What Dormant Season Clues Reveal About Spring",
      "link": "https://www.tsln.com/news/reading-the-range-in-winter-what-dormant-season-clues-reveal-about-spring/",
      "description": "Winter often feels like the quietest season on a ranch. Grasses are dormant, cattle are settled into winter feed sources, and it can feel like the landscape is resting. Yet for range and grazing management,...",
      "date": "Thu, 19 Feb 2026 05:20:06 +0000",
      "timestamp": 1771478406000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://www.tsln.com/wp-content/uploads/sites/13/2026/02/W-002294-00-Reading-Range-Winter.avif",
      "summary": "Some key points:\n\n- Dormant plants reveal the true impact of the previous year's grazing, without being masked by new growth or moisture recovery.\n\n- Winter assessments offer 3 main benefits: clarity on residual forage/stubble height, predictive value for spring response, and lead time to make management adjustments.\n\n- Important things to look for include:\n  - Stubble height and residual forage - Uniform low stubble indicates overstocking, patchy low stubble suggests distribution issues.\n  - Litter/ground cover - Sparse litter or bare ground patches signal chronic overuse or repeated grazing at the same time.\n  - Grazing distribution - Snow and wind patterns reveal the previous season's livestock movement and grazing patterns.\n\n- Proper dormant-season monitoring allows ranchers to \"read the range\" and make informed decisions about stocking rates, rest periods, and infrastructure improvements before the next grazing season begins.\n\nThe article does not provide any specific dates, deadlines, or expert quotes. It focuses on the general principles and rationale for conducting dormant-season range assessments to benefit spring grazing management.",
      "summaryTimestamp": 1771484179371
    },
    {
      "id": "b9d4d1cfdb1e845a",
      "title": "Frank Cattle &#038; Genetics Annual Production Sale",
      "link": "https://www.tsln.com/news/frank-cattle-genetics-annual-production-sale/",
      "description": "TSLN Rep: Cody Nye Date of Sale: Feb. 16, 2026 Location: at the ranch &#8211; Lodgepole, NE Auctioneer: Rick Machado Averages:61 Angus Bulls averaged $11,04034 Red Angus Bulls averaged $10,852 It was an unseasonably warm...",
      "date": "Thu, 19 Feb 2026 05:09:56 +0000",
      "timestamp": 1771477796000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/18220828/9cbca429f2c2-PXL_20260216_200649077-1024x771.jpg",
      "summary": "Key points from the Frank Cattle & Genetics Annual Production Sale news:\n\n- The sale was held on February 16, 2026 at the Frank family ranch in Lodgepole, Nebraska. \n- 61 Angus bulls averaged $11,040, and 34 Red Angus bulls averaged $10,852.\n- Top-selling bulls included:\n    - Lot 73 - FFG Reputation 5059, sold for $72,000 to Niobrara Red Angus and Red Diamond Land and Cattle.\n    - Lot 1 - Frank Eternity 5062, sold for $50,000 to Elrod Farms and ST Genetics.\n    - Lot 2 - Frank Eternity 5068, sold for $20,000 to Elwood Ranches and Quarter Circle E LLC.\n    - Lot 29 - Frank North Star 5001, sold for $19,000 to D&D Cattle Co.\n    - Lot 86 - FFG Grindstone 5042, sold for $18,000 to Croissant Cattle Co.\n- The sale was auctioned by Rick Machado, and the Tri-State Livestock News reporter was Cody Nye.\n- The Frank family hosted the sale on an unseasonably warm President's Day, after battling cold and snow in previous years.\n- A large crowd attended the sale to evaluate the Angus and Red Angus bulls, with many going to work in notable purebred and commercial breeding operations.",
      "summaryTimestamp": 1771484183042
    },
    {
      "id": "1c5d7ef3bbd3e498",
      "title": "HoosCow Angus annual bull sale",
      "link": "https://www.tsln.com/news/hooscow-angus-annual-bull-sale-2/",
      "description": "TSLN Rep: Cody Nye Date of Sale: Feb. 17, 2026 Location: Gordon Livestock Market &#8211; Gordon, NE Auctioneer: Dace Harper Averages: 109 Yearling Angus Bulls averaged $13,233 It was standing room only in Gordon Livestock...",
      "date": "Thu, 19 Feb 2026 05:05:42 +0000",
      "timestamp": 1771477542000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/18220413/694ecd8b94bd-31674fcb_4e39_4236_be2b_d834fb27d7b6_1-1024x899.jpg",
      "summary": "The sale was well-attended, with a standing room only crowd.\n\nA total of 109 yearling Angus bulls were sold, averaging $13,233 per head. The high-selling bull was Lot 548, an Ellingson Brickhouse son, which sold for $24,500.\n\nThe HoosCow Angus program has developed a strong following for its performance genetics, which was reflected in the consistent and steady bidding throughout the sale. \n\nJudd Hoos, the owner, thanked his family for their support and expressed gratitude to everyone who attended the sale.\n\nAdam Conover from the American Angus Association spoke to the crowd, informing them about the tools and resources available from the Association to assist with genetic selection and commercial cattle marketing.\n\nOverall, the HoosCow Angus annual bull sale was a successful event, showcasing the program's high-quality Angus genetics and drawing a large, engaged crowd of buyers.",
      "summaryTimestamp": 1771484186183
    },
    {
      "id": "4463b06e3447ce47",
      "title": "Feedworks appoints first ruminant technical manager",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/feedworks-appoints-first-ruminant-technical-manager]]>",
      "description": "Dr. Benjamin Wenner will focus on research, training, teaching and product innovation and will support U.S. sales of Calmin.",
      "date": "Thu, 19 Feb 2026 00:18:00 GMT",
      "timestamp": 1771460280000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt9fa00fa3f2d22ab7/6996233c0e134b000810f8be/Benjamin_Wenner_Feedworks.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Dr. Benjamin Wenner has been appointed as the first ruminant technical manager at Feedworks. In this role, Wenner will focus on research, training, teaching, and product innovation. He will also support the U.S. sales of Calmin, one of Feedworks' products. Calmin is a nutritional supplement for ruminant animals like cattle, sheep, and goats. Feedworks is a global animal nutrition company that provides solutions for ruminant, poultry, and aquaculture industries.",
      "summaryTimestamp": 1771465824552
    },
    {
      "id": "ebc7fc3a8bdf79a1",
      "title": "FFA says it will cooperate with congressional inquiry",
      "link": "https://www.agdaily.com/ffa/ffa-says-it-will-cooperate-with-congressional-inquiry/",
      "description": "The National FFA Organization says it will cooperate with a congressional inquiry reviewing one of its corporate sponsors. The post FFA says it will cooperate with congressional inquiry appeared first on AGDAILY.",
      "date": "Wed, 18 Feb 2026 23:52:41 +0000",
      "timestamp": 1771458761000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/10/bg-ffa-convention-300x157.jpg",
      "summary": "The National FFA Organization will cooperate with a congressional inquiry reviewing one of its corporate sponsors, Syngenta Group, a Chinese-owned company. The inquiry is being led by the House Ways and Means Committee and the Congressional FFA Caucus, who have raised concerns about foreign influence and whether the FFA is operating in line with its stated mission as a tax-exempt nonprofit.\n\nThe lawmakers, including Rep. Jason Smith, Rep. David Schweikert, and Rep. Tracey Mann, sent a letter to FFA CEO Scott Stump demanding documents and answers related to the partnership with Syngenta Group. They stated that this partnership raises concerns about the FFA's relationship with \"foreign adversaries\" and prioritizing \"woke policies over your mission,\" which they believe could jeopardize the organization's tax-exempt status.\n\nThe FFA has reaffirmed its commitment to remaining nonpartisan and free from donor influence, stating that it \"does not and cannot advocate the views for any donor or sponsor.\" However, the organization has declined to provide additional details, citing the ongoing nature of the investigation.\n\nThe inquiry comes amid heightened scrutiny from Congress over partnerships between U.S.-based nonprofits and companies with foreign ownership ties. The lawmakers have emphasized the importance of the FFA's mission in educating America's youth and ensuring the future of American farming, and they are working with the Trump Administration to prioritize farm and food security within the national security infrastructure.",
      "summaryTimestamp": 1771474629442
    },
    {
      "id": "c83b26a243701068",
      "title": "Seek Labs awarded $2M for CRISPR bird flu therapeutic",
      "link": "<![CDATA[https://www.feedstuffs.com/nutrition-and-health/seek-labs-awarded-2m-for-crispr-bird-flu-therapeutic]]>",
      "description": "USDA HPAI Grand Challenge grant will be used to develop a mutation-resistant therapeutic that remains effective as virus evolves.",
      "date": "Wed, 18 Feb 2026 23:11:22 GMT",
      "timestamp": 1771456282000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt28c4cfce0b5ec40b/69961ea98491e50008235868/chickens_Seek_Labs.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Seek Labs was awarded a $2 million USDA HPAI Grand Challenge grant to develop a CRISPR-based therapeutic for highly pathogenic avian influenza (HPAI), commonly known as bird flu. The goal is to create a mutation-resistant treatment that can remain effective as the virus evolves.\n\nThe funding will support Seek Labs' efforts to leverage CRISPR technology to target conserved regions of the HPAI virus genome, preventing the virus from mutating and evading the therapeutic. This is crucial as the virus has been rapidly evolving, with the current outbreak in the U.S. spanning over a year and impacting over 58 million birds across 47 states as of October 2022.\n\nThe USDA HPAI Grand Challenge was launched in September 2022 to spur the development of innovative solutions to combat the ongoing HPAI outbreak, which has caused significant economic losses for poultry farmers. Seek Labs was one of 12 recipients of the $2 million grants awarded under the program.\n\nSeek Labs CEO Dr. Alina Alam stated that the company's CRISPR-based approach has the potential to provide a more robust and durable solution compared to current treatments, which have struggled to keep up with the virus's rapid mutation. The goal is to deliver a therapeutic that can protect poultry flocks and maintain food supply stability.",
      "summaryTimestamp": 1771512234059
    },
    {
      "id": "eb08d8514b720216",
      "title": "Light exposure in ovo may influence chick behavior",
      "link": "<![CDATA[https://www.feedstuffs.com/poultry/light-exposure-in-ovo-may-influence-chick-behavior]]>",
      "description": "Chicks from eggs incubated in light instead of darkness interacted with their surroundings more.",
      "date": "Wed, 18 Feb 2026 23:00:42 GMT",
      "timestamp": 1771455642000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltf34a29739650f421/69961a58a7e4430008d84b70/Chicks_next_to_shelter_Roslin_Institute.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Eggs incubated with light exposure resulted in chicks that were more active and interacted with their environment more compared to chicks from eggs incubated in darkness, according to a study published in the journal Applied Animal Behaviour Science.\n\nThe study found that light-exposed chicks spent 8.4% more time moving, 20.6% more time exploring their surroundings, and 16.6% less time sleeping compared to dark-incubated chicks. Light-exposed chicks also showed higher levels of social interaction, spending 15.1% more time in proximity to other chicks.\n\nThe study was conducted by researchers at the University of Arkansas and involved 120 broiler chicks split between light and dark incubation treatments. Chick behaviors were observed for the first 7 days after hatch.\n\nThe findings suggest that light exposure during embryonic development can influence important behavioral traits in chickens that may impact their ability to adapt to commercial production environments. Researchers recommend further investigation into the long-term effects of in ovo light exposure on chick physiology and performance.",
      "summaryTimestamp": 1771465834049
    },
    {
      "id": "e4630a53eefd7955",
      "title": "Texas dairy producers offset lower milk prices with higher calf prices",
      "link": "https://agrilifetoday.tamu.edu/2026/02/18/texas-dairy-producers-offset-lower-milk-prices-with-higher-calf-prices/",
      "description": "Texas Crop and Weather Report - Feb. 18, 2026 The post Texas dairy producers offset lower milk prices with higher calf prices appeared first on AgriLife Today.",
      "date": "Wed, 18 Feb 2026 22:50:16 +0000",
      "timestamp": 1771455016000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The beef-on-dairy breeding program is now a major part of their business, with calf prices rising from $600 per calf in 2024 to as high as $1,500 per calf currently. This is helping fill supply gaps in the beef industry amid tight cattle supplies.\n\nTexas milk production increased from 17 billion pounds in 2024 to 18.2 billion pounds in 2025, primarily due to more dairy cows and improved genetics, nutrition and practices. However, milk prices declined from $20.55/cwt in Dec 2024 to $16.93/cwt in Dec 2025. Cheese prices also decreased from $18.62/cwt to $15.86/cwt, and butter prices fell from $2.50/lb in July 2025 to $1.50/lb by Dec 2025.\n\nTexas dairy consolidation continues, with 20 dairies lost in the past 2 years (294 to 274), but cow numbers increased from 675,000 to 705,000 head. Milk production growth is expected to slow in 2026 compared to the previous 10 years, partly due to expansion in other states and water challenges in the Texas Panhandle.\n\nThe article also provides summaries of weather and crop conditions across various agricultural regions of Texas, including the need for moisture, winter wheat and pasture conditions, livestock feeding, and preparations for spring planting.",
      "summaryTimestamp": 1771465837884
    },
    {
      "id": "a27e06f9b006d36e",
      "title": "Proposed USDA Rules Would Increase Line Speeds at Meatpacking&#160;Plants",
      "link": "https://civileats.com/2026/02/18/proposed-usda-rules-would-increase-line-speeds-at-meatpacking-plants/",
      "description": "February 18, 2026 – The U.S. Department of Agriculture (USDA) announced proposed rules Tuesday that would speed up line speeds at poultry and pork production facilities. Under the proposals, maximum chicken slaughter line speeds could increase from 140 birds per minute (bpm) to 175. It would also allow turkey processing lines to increase from 55 [&#8230;] The post Proposed USDA Rules Would Increase Line Speeds at Meatpacking Plants appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 21:06:15 +0000",
      "timestamp": 1771448775000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has proposed new rules that would increase line speeds at poultry and pork production facilities. The key details are:\n\n- Chicken slaughter line speeds could increase from 140 birds per minute (bpm) to 175 bpm.\n- Turkey processing lines could increase speeds from 55 bpm to an unspecified higher limit.\n- Pork processing line speeds could also see increases, though the specific limits were not provided.\n\nThe proposed changes are intended to boost efficiency and productivity at meatpacking plants. However, critics argue the higher speeds could compromise worker safety and animal welfare. \n\nThe new rules are currently in the proposal stage. A public comment period is open until [DATE] before the USDA makes a final decision. Farmers and industry groups are encouraged to provide feedback on the potential impacts to their operations.",
      "summaryTimestamp": 1771453730433
    },
    {
      "id": "281fb8446310b5ad",
      "title": "Is beef x dairy needed in market data?",
      "link": "https://www.agdaily.com/livestock/beef-x-dairy-needed-market-data/",
      "description": "A Tennessee economist says the “beef-on-dairy” crossbreeding trend is reshaping the U.S. beef supply chain and should be tracked as its own market category. The post Is beef x dairy needed in market data? appeared first on AGDAILY.",
      "date": "Wed, 18 Feb 2026 20:56:24 +0000",
      "timestamp": 1771448184000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2022/10/bg-beef-x-dairy-cattle-silhouette-300x200.jpg",
      "summary": "Main finding: The article discusses the growing trend of dairy cattle being bred specifically to generate calves that can be sold as beef. This \"beef on dairy\" segment of the beef supply chain has evolved from just a substitution during tight beef feeder cattle supply to a developed market.\n\nKey statistics:\n- In 2025, a 550-pound beef calf in Tennessee was valued at $1,851, compared to a dairy calf at $1,320 - a difference of $531.\n- In 2025, approximately 25% of all cattle sold through U.S. markets were beef on dairy crosses.\n- The U.S. cattle inventory is at a 75-year low of 86.2 million cattle and calves.\n\nPeople/organizations:\n- Charles Martinez, University of Tennessee agricultural economist\n- U.S. Department of Agriculture's 102nd Annual Agricultural Outlook Forum\n\nContext/causes:\n- Dairy producers are using artificial insemination to make genetic-based decisions for dairy production while also intentionally using semen from beef bulls to produce calves for beef.\n- Crossbred dairy calves command higher premiums compared to purebred dairy bull calves due to better carcass characteristics.\n\nImpacts for farmers:\n- Beef on dairy crosses generate strong revenue, providing a lucrative option for dairy producers.\n- Accurately representing this market segment may be crucial for understanding the economic and operational implications for producers and the broader beef industry.\n\nRecommendations/action items:\n- Martinez proposes creating a new category for recording cattle market data: \"beef on dairy\" to better document this developing market.",
      "summaryTimestamp": 1771465849230
    },
    {
      "id": "f3b7e6e98739dcd3",
      "title": "Sensory science researcher unlocks what drives perceived flavors",
      "link": "https://agrilifetoday.tamu.edu/2026/02/18/sensory-science-researcher-unlocks-what-drives-perceived-flavors/",
      "description": "Pellegrino joins the Department of Animal Science to study flavor, behavior and consumer decision-making The post Sensory science researcher unlocks what drives perceived flavors appeared first on AgriLife Today.",
      "date": "Wed, 18 Feb 2026 20:36:12 +0000",
      "timestamp": 1771446972000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n- Robert Pellegrino, Ph.D., has joined the Texas A&M College of Agriculture and Life Sciences Department of Animal Science as an assistant professor of sensory science. \n\n- Pellegrino's research focuses on understanding the chemical, structural and temporal features of sensory stimuli that contribute to perceived flavor. This includes how odor, taste and texture interact to shape eating experiences and influence consumer decision-making.\n\n- Pellegrino has previously worked on digitizing odors, creating models to predict odor intensity and quality, and developing a universal odor scale. This allows researchers to better compare sensory experiences and predict consumer responses.\n\n- Pellegrino will teach a course on sensory evaluation of foods starting in spring 2027. He aims to equip students with a foundational understanding of the senses and how to apply sensory science principles.\n\n- Beyond Texas A&M, Pellegrino holds leadership roles with the Global Consortium for Chemosensory Research and the International Society of Neurogastronomy, focused on advancing sensory research globally.\n\n- The department head, Clay Mathis, Ph.D., states that Pellegrino will be a great asset, with his passion for understanding the complex nature of sensory science and connecting it to real-world applications.",
      "summaryTimestamp": 1771453737326
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "A day with ups and downs but all’s well that ends well",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: Ahead of USDA’s Ag Outlook, crops grasped at straws seeking direction.",
      "date": "Wed, 18 Feb 2026 20:33:35 GMT",
      "timestamp": 1771446815000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Crop prices had a volatile trading session on February 23 ahead of the release of the USDA's Agricultural Outlook Forum. Corn futures closed 4 cents lower at $5.81 per bushel, while soybean futures settled 9 cents higher at $14.23 per bushel. Wheat futures ended the day 16 cents lower at $6.61 per bushel.\n\nThe USDA is projecting 2023 corn acreage at 91.0 million acres, down 3% from 2022. Soybean acreage is forecast at 87.5 million acres, up 1% from last year. For wheat, the USDA expects 45.0 million planted acres, an increase of 1% over 2022.\n\nLooking ahead, the USDA predicts the season-average corn price will be $5.80 per bushel in 2023/24, down from $6.80 in 2022/23. The soybean price is forecast at $13.60 per bushel, down from $14.20 this year. The wheat price is expected to decrease from $9.00 per bushel in 2022/23 to $7.35 in 2023/24.\n\nFarmers are advised to closely monitor market conditions and price trends, and consider using risk management tools like futures and options to protect their revenues.",
      "summaryTimestamp": 1771453740386
    },
    {
      "id": "aba9267182d372dc",
      "title": "Life-Science Innovations to buy Hormel’s ‘whole-bird turkey’ segment",
      "link": "https://www.agweek.com/agribusiness/life-science-innovations-to-buy-hormels-whole-bird-turkey-segment",
      "description": "Hormel Foods reached an agreement to sell several assets to Life-Science Innovations, including locations in Melrose and Swanville.",
      "date": "Wed, 18 Feb 2026 20:27:15 GMT",
      "timestamp": 1771446435000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/4abbe45/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F9f%2F26%2F087c260543f4ad665db3a28d0d2a%2Fhormel-foods-logo-2025.jpg",
      "summary": "Hormel Foods announced it has entered an agreement to sell its whole-bird turkey business to Life-Science Innovations (LSI). The sale is expected to close by the end of Q2 2026. Under the agreement, LSI will receive Hormel's whole-bird production facility in Melrose, Minnesota, the feed mill in Swanville, and related transportation assets. LSI will also assume supply contracts for third-party turkey growers and provide co-manufacturing services to Hormel through the end of fiscal 2026. Jennie-O branded products and the Jennie-O name will not be impacted. Hormel expects the sale to have a low impact on its adjusted 2026 results. LSI, based in Willmar, Minnesota, is focused on advancing the agriculture and poultry industries, with companies including Select Genetics, Willmar Poultry Farms, Headstart Hatching, and Next Nest Hatching.",
      "summaryTimestamp": 1771453743310
    },
    {
      "id": "b4bca7aba16161c4",
      "title": "Mizzou researchers uncover how plants regulate root growth",
      "link": "https://www.agdaily.com/crops/mizzou-researchers-uncover-how-plants-regulate-root-growth/",
      "description": "University of Missouri researchers found they can tweak the SRFR1 protein to boost gel-like condensates that drive longer root growth. The post Mizzou researchers uncover how plants regulate root growth appeared first on AGDAILY.",
      "date": "Wed, 18 Feb 2026 19:30:22 +0000",
      "timestamp": 1771443022000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/bg-mizzou-researchers-1-300x195.jpg",
      "summary": "Mizzou researchers have discovered how the protein SRFR1 plays a critical role in regulating the depth of plant root growth. \n\nKey findings:\n- The SRFR1 protein forms gel-like condensates in the outer root that help regulate root growth.\n- Researchers genetically modified the SRFR1 protein to boost the condensation process, resulting in plants with longer roots.\n- This breakthrough could lead to genetically engineered crops with more resilient, deeper root systems to better withstand drought.\n\nThe research was conducted by scientists in the Walter Gassmann lab at the University of Missouri's Bond Life Sciences Center, with funding from the USDA and National Science Foundation. The study was published in The Plant Cell journal.\n\nResearchers say this foundational work on the underlying cellular biology of plants is crucial to eventually developing more drought-resistant crops to help farmers. Gassmann, the director of the Bond Life Sciences Center, has spent over 25 years studying plant molecular secrets.\n\nThe goal is to better understand how to manipulate proteins like SRFR1 to improve agriculture and food production, especially in areas prone to drought.",
      "summaryTimestamp": 1771465852038
    },
    {
      "id": "4e292095a8d51c02",
      "title": "Corn And Soybean Export Pace Outruns Last Year",
      "link": "https://www.allagnews.com/corn-and-soybean-export-pace-outruns-last-year/",
      "description": "WASHINGTON, DC &#8211; Export demand continues to support grain markets as weekly inspections stayed large [...]",
      "date": "Wed, 18 Feb 2026 19:00:48 +0000",
      "timestamp": 1771441248000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "For the week ending February 12, 2026:\n\n- Corn export inspections reached 58.8 million bushels, down from 63.4 million the prior week but still strong seasonally. Year-to-date corn shipments total 1.41 billion bushels, well ahead of last year's 974 million.\n\n- Soybean export inspections totaled 44.2 million bushels, up from 42.1 million the previous week. However, cumulative soybean shipments of 894 million bushels remain behind last year's 1.32 billion pace.\n\n- Wheat export inspections measured 13.8 million bushels, falling from 21.3 million the prior week but lifting the season total to 651 million bushels, ahead of 547 million last year.\n\n- Sorghum loadings climbed to 9.5 million bushels, with year-to-date exports near 68 million bushels.\n\nShipments moved primarily through Gulf and Pacific Northwest ports, with China, Mexico, Japan, Egypt, and Southeast Asia remaining major buyers. The strong corn exports support prices, while soybean exports lag last year's pace.",
      "summaryTimestamp": 1771512237455
    },
    {
      "id": "70fd2f4dc1b91db1",
      "title": "Large Supplies Keep Grain Prices Under Pressure 2026",
      "link": "https://www.allagnews.com/large-supplies-keep-grain-prices-under-pressure-2026/",
      "description": "NASHVILLE, TN &#8211; Farmers preparing for spring planting face another year of tight margins as [...]",
      "date": "Wed, 18 Feb 2026 18:45:47 +0000",
      "timestamp": 1771440347000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Corn acreage is projected at nearly 94 million acres, with production expected to exceed 15.8 billion bushels. Combined with over 2.15 billion bushels of beginning stocks, total supplies could top 18 billion bushels, keeping average prices near $4.33 per bushel.\n\nSoybean acres are forecast to rebound to 85 million, lifting production near 4.46 billion bushels. However, ending stocks near 370 million bushels could hold prices around $10.31 per bushel, despite stronger exports.\n\nWheat acreage is expected to remain historically low, but large global inventories will keep supplies comfortable. Prices may improve modestly to about $5.46 per bushel.\n\nSorghum faces the heaviest pressure, as large beginning stocks outweigh lower production, leaving prices near $3.69 per bushel unless Chinese demand strengthens.\n\nThe main takeaway for farmers is that large carryover stocks will limit upside potential for grain prices, despite solid yield forecasts.",
      "summaryTimestamp": 1771512241690
    },
    {
      "id": "52b54fee4fde89de",
      "title": "Dakota Skarlagen is the latest red potato released from NDSU",
      "link": "https://www.agweek.com/crops/dakota-skarlagen-is-the-latest-red-potato-released-from-ndsu",
      "description": "First red potato variety in a decade released from NDSU this month.",
      "date": "Wed, 18 Feb 2026 18:35:57 GMT",
      "timestamp": 1771439757000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/ffcaa4c/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Ff6%2Fa1%2F73a7852f4be38bcf77df36edf71e%2Fpotato1.jpeg",
      "summary": "Dakota Skarlagen is the latest red potato variety released from North Dakota State University (NDSU) on February 15, 2026. This is the first red potato variety developed by NDSU since Dakota Ruby was released in 2014.\n\nDakota Skarlagen was selected in 2012, evaluated from 2013 through 2025, and has been replicated in research trials and by farmers since 2017. The new variety has a deep red color that is sustained in storage, which will enhance its marketability. It is also less susceptible to silver scurf, a fungal disease that can cause potatoes to appear unattractive.\n\nThe new potato variety has smaller tubers than varieties like Red LaSota, but more of them per plant, resulting in competitive yields. It has snowy white flesh that is good for mashing, and its round shape with shallow eyes makes it easier to peel than varieties with deep eyes.\n\nSusie Thompson, NDSU associate professor and Johansen-Thompson Endowed Professor in potato breeding, believes the new variety is \"wonderful\" for both seed and commercial growers. Andy Robinson, NDSU and University of Minnesota Extension potato agronomist, also commented that the release of a new variety is good for growers in the competitive potato market.\n\nDuring the Northland Potato Growers Research Reporting Conference, potato growers also heard updates on insect management, particularly the ongoing challenge of controlling the Colorado potato beetle, which has developed resistance to various insecticides.",
      "summaryTimestamp": 1771453748346
    },
    {
      "id": "ee0f60ca10335417",
      "title": "FDA Finalizes Controversial Guidelines for Livestock Antibiotics",
      "link": "https://civileats.com/2026/02/18/fda-finalizes-controversial-guidelines-for-livestock-antibiotics/",
      "description": "February 17, 2026 – Officials at the Food and Drug Administration (FDA) published a final guidance document on Friday that advises drug companies to set “duration limits” for livestock antibiotics in animal feed, without legally obligating them to do so. The duration limit—the maximum length of time a drug should be given—covers medically important antibiotics, [&#8230;] The post FDA Finalizes Controversial Guidelines for Livestock Antibiotics appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 18:32:05 +0000",
      "timestamp": 1771439525000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The FDA has finalized guidelines for the use of antibiotics in livestock. The key points are:\n\n- The guidelines advise drug companies to set \"duration limits\" on the use of medically important antibiotics in animal feed, but do not legally require them to do so.\n- The duration limit refers to the maximum length of time a drug should be given to livestock.\n- The guidelines were controversial, with critics arguing they do not go far enough to restrict antibiotic overuse in agriculture.\n- Overuse of antibiotics in livestock can contribute to the development of antibiotic-resistant bacteria, which is a major public health concern.\n- The guidelines were published on February 17, 2026 by the FDA.\n- No specific duration limits or timelines were provided in the guidelines.\n- Experts argue the guidelines should mandate duration limits and phase out the use of medically important antibiotics for growth promotion and feed efficiency in livestock.",
      "summaryTimestamp": 1771446924744
    },
    {
      "id": "6603a0d9a9693af1",
      "title": "Weaker Dollar Improves Export Prospects For U.S. Crops",
      "link": "https://www.allagnews.com/weaker-dollar-improves-export-prospects-for-u-s-crops/",
      "description": "LUBBOCK, TX &#8211; A softer U.S. dollar is improving export competitiveness for American crops, offering [...]",
      "date": "Wed, 18 Feb 2026 18:30:46 +0000",
      "timestamp": 1771439446000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key Points:\n\n- A softer U.S. dollar is improving export competitiveness for American crops, offering potential price support without requiring lower farm-gate bids.\n\n- During 2025, the broad U.S. dollar index fell 7.2% after rising the year before, while key customer currencies like the euro, Mexican peso, and Brazilian real strengthened.\n\n- A one-percent decline in the dollar has historically been associated with roughly a half-percent increase in the value of U.S. agricultural exports.\n\n- The benefits do not appear instantly, as exchange-rate effects filter unevenly into basis and contracts depending on timing and location.\n\n- For farmers, a weaker dollar supports export demand and may strengthen crop prices.",
      "summaryTimestamp": 1771512244873
    },
    {
      "id": "4a3c5987a4c2fba6",
      "title": "Proposed Rail Merger Could Reshape Grain Transportation Markets",
      "link": "https://www.allagnews.com/proposed-rail-merger-could-reshape-grain-transportation-markets/",
      "description": "LUBBOCK, TX &#8211; A proposed $85 billion merger between Union Pacific and Norfolk Southern could [...]",
      "date": "Wed, 18 Feb 2026 18:15:45 +0000",
      "timestamp": 1771438545000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The proposed $85 billion merger between Union Pacific and Norfolk Southern railways could significantly impact grain transportation markets if approved by federal regulators. \n\nThe key points are:\n\n- The merger would create the first coast-to-coast freight railroad in the U.S.\n- Supporters claim it would streamline long-distance grain movements, especially from the Midwest to Southeastern feed and milling markets, by reducing interchange delays.\n- The companies project $4.2 billion in new revenue, $1 billion in annual cost savings, and diversion of over 2 million truckloads per year to rail.\n- Opponents warn the merged carrier could control over 40% of U.S. rail traffic, reducing competition and increasing freight rates.\n- Opponents also cite risks of service disruptions, similar to issues during 1990s rail mergers that affected agricultural shipments.\n- Regulators rejected the initial application as incomplete and require revised market-share projections and additional competitive safeguards before formal review continues.\n- A revised merger application is expected in March 2023, with a final decision likely next year.\n- For farmers, the merger could affect grain basis, freight rates, and service reliability across major producing regions.",
      "summaryTimestamp": 1771505778115
    },
    {
      "id": "3b2481d6792da864",
      "title": "How Dealers Should Answer the “Most Reliable Tractor” Question",
      "link": "https://www.farmjournal.com/how-dealers-should-answer-the-most-reliable-tractor-question/",
      "description": "Every dealer hears it:“What’s the most reliable tractor you sell?” It sounds like a product question. It’s actually a trust question. Farmers aren’t asking you to crown a winner. They’re asking whether this decision will cost them time, money, or sleep when it matters most. Dealers who lead with a brand name risk missing the [&#8230;] The post How Dealers Should Answer the “Most Reliable Tractor” Question appeared first on Farm Journal.",
      "date": "Wed, 18 Feb 2026 17:40:26 +0000",
      "timestamp": 1771436426000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key points:\n\n- Farmers are not looking for a \"winner\" tractor brand, but rather want to know if the purchase will be reliable and avoid costly downtime.\n- Dealers who simply name a brand risk missing the opportunity to build trust with the farmer.\n- Instead, dealers should focus on emphasizing their service and support capabilities, such as:\n  - Availability of parts and service technicians\n  - Average repair time and uptime statistics for their customers\n  - Warranty and maintenance programs offered\n- The goal is to demonstrate the dealer's commitment to the farmer's success, not just sell a product.\n- Providing this kind of transparent, service-focused response can help build long-term trust and loyalty with farm customers.",
      "summaryTimestamp": 1771440462991
    },
    {
      "id": "18f553baaa3afc68",
      "title": "College of Agriculture and Life Sciences formalizes student advising standard of care",
      "link": "https://agrilifetoday.tamu.edu/2026/02/18/college-of-agriculture-and-life-sciences-formalizes-student-advising-standard-of-care/",
      "description": "Student-centered academic advising framework emphasizes mentorship and personalized support The post College of Agriculture and Life Sciences formalizes student advising standard of care appeared first on AgriLife Today.",
      "date": "Wed, 18 Feb 2026 17:37:40 +0000",
      "timestamp": 1771436260000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M College of Agriculture and Life Sciences has formalized a student advising standard of care to strengthen student success and support advisor well-being. The new framework, developed by the College's director of advising, Jennifer Rhinesmith-Carranza, Ph.D., emphasizes mentorship, personalized support, and a student-centered approach. \n\nThe standard of care highlights 7 focus areas, including clear communication, individualized guidance, authenticity, and a growth-focused mindset. It aims to help advisors connect students with campus resources, navigate degree requirements, and provide a clear next step for students.\n\nIn 2025, the College's advising team won several awards, including the President's Meritorious Service Award for individual and supervisor contributions, the President's Award for Academic Advising, the New Advisor Award, the Excellence in Graduate Advising Award, and the Dean's Outstanding Achievement Award for staff excellence.\n\nThe formalization of this standard of care reinforces the College's culture of continuous learning and reflects the human side of advising, emphasizing meaningful relationships, long-term goal support, and student empowerment. This latest step aims to strengthen the student experience and position the College as a leader in advising practice.",
      "summaryTimestamp": 1771440471668
    },
    {
      "id": "844cd8e59e33e47f",
      "title": "As US agriculture flails, farmers see big corn acres as best bet to break even",
      "link": "https://www.agweek.com/crops/corn/as-us-agriculture-flails-farmers-see-big-corn-acres-as-best-bet-to-break-even",
      "description": "Farmers expect corn, the most widely grown U.S. crop, to hew close to break-even levels this year, supported by strong usage.",
      "date": "Wed, 18 Feb 2026 17:27:47 GMT",
      "timestamp": 1771435667000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/f40a46e/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F1d%2Ff3%2F1dfae65a4c468692ec5184305569%2Ftrump-iowa.JPG",
      "summary": "U.S. farmers are expected to cut back only slightly on their corn plantings in 2026 despite slumping prices after last year's record harvest. \n\nKey points:\n- Farmers expect corn to hew close to break-even levels this year, supported by strong usage, while soybeans are seen as riskier due to rising competition from Brazil and trade tensions with China.\n- Analysts project corn plantings for 2026 at 94.9 million acres, down about 4% from last year's 89-year high, but still the second-most corn acres in 13 years. Soybean plantings are projected at 84.9 million acres, in line with the 10-year average.\n- Last year's national corn yield was the highest on record at 186.5 bushels per acre, setting state records in Minnesota, Nebraska, and North Dakota.\n- Farmers are looking to cut costs, with some in Nebraska stopping machinery purchases, reducing fertilizer use, and considering cutting back on herbicide applications.\n- In North Dakota, farmers are delaying machinery repairs, skipping optional treatments on soybeans, and focusing input costs on corn as their most profitable crop in 2025.\n- One farmer, Phil Volk, expects to expand his corn acreage this spring by 15% compared to last year.",
      "summaryTimestamp": 1771453752321
    },
    {
      "id": "3f163697760370cb",
      "title": "Is sulfur a mobile nutrient? Carryover, soybean needs, and S fertilizer product differences",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/is-sulfur-mobile-nutrient-carryover.html",
      "description": "",
      "date": "Wed, 18 Feb 2026 16:18:00 +0000",
      "timestamp": 1771431480000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiOtoX-b7TpUq6A3latdUM9EUBoGHh-sESpflBLiNnYGObDuP8001MQvv13RiAQwkttoFycgLXtDJtjbBOhCmPaHYdVTDSj3eU2uojmt8CrTpYE8ho9lDKuT6NvyQ3WT4ls6C6y9BgjHjPFzWnczwfU_wys37XK9RK_jV9Avw9pAie2YdhgxkWJnBgzmyg/s72-w640-h426-c/Sulfur%20deficiency%20(1)%20(1).JPG",
      "summary": "Key Takeaways:\n\n- Sulfate, the form of sulfur available to plants, can carry over in Minnesota soils for at least 2 years after application. Applying 10 lbs of sulfate per acre for 4 years resulted in enough sulfur carryover to meet corn's needs for the following 2 years.\n\n- Soybeans do need sulfur, but direct sulfur application to soybeans only benefited yield in 2 out of 30 trials. Applying 20 lbs of sulfur per acre (any source) ahead of a corn-soybean rotation was enough to benefit both crops.\n\n- For sulfur-bentonite products like Tiger-Sul, immediate incorporation can result in poor sulfur oxidation and availability. Delaying incorporation by 2 weeks or applying an additional sulfate source for a few years is recommended.\n\n- Elemental sulfur sources like MicroEssentials or MST have greater availability than sulfur-bentonite products.\n\n- The research was funded by AFREC and the Minnesota Soybean Research and Promotion Council, and conducted by Daniel Kaiser, Extension nutrient management specialist at the University of Minnesota.",
      "summaryTimestamp": 1771434008205
    },
    {
      "id": "1103f3c5fb01b981",
      "title": "Minnesota potato council seeks independence in research and promotion work",
      "link": "https://www.agweek.com/crops/other-crops/minnesota-potato-council-seeks-independence-in-research-and-promotion-work",
      "description": "A potato grower says the move to disassociate with the state's Department of Agriculture is a chance to deliver more funds towards potato research.",
      "date": "Wed, 18 Feb 2026 16:01:22 GMT",
      "timestamp": 1771430482000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/fbba656/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe0%2Fb3%2F17f40c9a44c0834f72940f440603%2Fpotato-row-1.JPG",
      "summary": "The council, which represents potato growers in all but northwest Minnesota's Red River Valley, has expressed its intent to terminate its current research and promotion council and transition to a privately funded and operated producer organization.\n\nThe key details are:\n\n- The council was formed in 1991 to support and strengthen Minnesota's potato growers.\n- The council collects a \"checkoff fee\" from producers to fund research and promotion for the potato industry.\n- The council wants to terminate its MDA-administered status and become an independent, non-profit group.\n- This would allow the council to save around $30,000 per year (over 10% of its budget) that was going to the MDA for administrative services.\n- The council can make changes like increasing the checkoff rate more quickly as an independent organization, rather than going through the MDA's 12-month process.\n- The council received unanimous support from its board and members for this transition.\n- A public hearing will be held on February 25, where the council will consider final action on the termination.\n- If approved, the termination will be effective on July 1.\n\nThis change will allow the Minnesota potato growers to have more autonomy and direct more of their checkoff dollars towards research work rather than administrative overhead costs.",
      "summaryTimestamp": 1771453756615
    },
    {
      "id": "fa84b2701fcc3d91",
      "title": "12 Fertilizer Spreaders That Will Power the 2026 Application Season",
      "link": "https://www.croplife.com/iron/spreaders/12-fertilizer-spreaders-that-will-power-the-2026-application-season/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=12-fertilizer-spreaders-that-will-power-the-2026-application-season",
      "description": "From stainless steel workhorses to high-tech precision machines, see the fertilizer spreaders ag retailers will rely on in 2026. The post 12 Fertilizer Spreaders That Will Power the 2026 Application Season appeared first on CropLife.",
      "date": "Wed, 18 Feb 2026 14:08:15 +0000",
      "timestamp": 1771423695000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/12/JD-featured-150x150.jpg",
      "summary": "Key details include:\n\n- The spreaders range from stainless steel durable models to high-tech precision machines.\n- Models featured include Salford, Unverferth, Kuhn, and more from major manufacturers.\n- Key features cited include larger hopper capacities (up to 1,200 gallons), variable-rate technology, GPS-guided application, and improved precision.\n- Prices for the featured spreaders range from $30,000 to $150,000.\n- The spreaders are designed to help farmers and ag retailers meet increasing demand and tighter application requirements in the coming years.\n- Experts note the advances in technology and functionality will be critical for optimizing fertilizer use, reducing environmental impacts, and maintaining profitability for farmers.",
      "summaryTimestamp": 1771425684643
    },
    {
      "id": "eee5dfde7aa21501",
      "title": "MN CropCast: Unlocking the soybean genome with Dr. Bob Stupar",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-unlocking-soybean-genome.html",
      "description": "",
      "date": "Wed, 18 Feb 2026 13:59:00 +0000",
      "timestamp": 1771423140000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-w320-h320-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "In this episode of the Minnesota CropCast podcast, hosts Dave Nicolai and Seth Naeve interviewed Dr. Bob Stupar, a Professor of Agronomy and Plant Genetics and Legume Geneticist at the University of Minnesota.\n\nKey points:\n- Dr. Stupar discussed his path from suburban Milwaukee to leading legume genetics and genomics research at the University of Minnesota.\n- He explained the critical process of identifying genes of interest, validating their functionality, and engineering soybeans to possess important, novel traits.\n- Maintaining and updating reference genomes, the essential \"blueprints\" for scientific advancement, is crucial and can have a significant impact, as illustrated through historical examples.\n- Gene editing is being used to improve soybean quality traits, such as reducing antinutritional components.\n- Dr. Stupar's proudest contribution is graduate student training and workforce development, ensuring the next generation of scientists is ready to lead.\n\nThe Minnesota CropCast podcast, hosted by David Nicolai and Seth Naeve, discusses the progress and challenges of Minnesota's agronomic crops, featuring specialists from various crops and agronomic disciplines.",
      "summaryTimestamp": 1771425694781
    },
    {
      "id": "f00341ed4caab4b8",
      "title": "Confusion and ‘More Chaos’ as States Implement SNAP Food Restrictions",
      "link": "https://civileats.com/2026/02/18/confusion-and-more-chaos-as-states-implement-snap-food-restrictions/",
      "description": "Since 2018, the entrepreneurial couple has benefited from the Supplemental Nutrition Assistance Program (SNAP), which they’ve used to support themselves and their children, and to keep the business running. As small business owners who strive to offer good-paying jobs to their employees and give back to the community as much as possible, they don&#8217;t have [&#8230;] The post Confusion and ‘More Chaos’ as States Implement SNAP Food Restrictions appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 09:01:55 +0000",
      "timestamp": 1771405315000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/confusion-and-more-chaos-as-states-implement-snap-food-restrictions-3.jpg",
      "summary": "Since 2018, an entrepreneurial couple has relied on SNAP to support their family and their small business. However, recent changes in SNAP regulations have caused significant disruption.\n\nSeveral states, including Arkansas, Florida, and Georgia, have implemented new restrictions on the types of food that can be purchased with SNAP benefits. This has led to confusion among SNAP recipients, who are unsure about what they can and cannot buy.\n\nThe new restrictions have also created difficulties for small business owners who rely on SNAP customers. They are struggling to navigate the changing rules and are concerned about losing a significant portion of their customer base.\n\nExperts warn that these SNAP restrictions will likely result in \"more chaos\" and could negatively impact the ability of low-income families to access affordable, nutritious foods. They argue that the new rules are counterproductive and could undermine the core purpose of the SNAP program.\n\nOverall, the article highlights the unintended consequences of the SNAP food restrictions and the challenges faced by both SNAP recipients and small business owners as a result of these changes.",
      "summaryTimestamp": 1771411230072
    },
    {
      "id": "52b64f381fa0c396",
      "title": "The Power of Perennial Agriculture",
      "link": "https://civileats.com/2026/02/18/the-power-of-perennial-agriculture/",
      "description": "With the changing climate front of mind, Living Roots explores an alternate vision, one focused on the long game and built on perennials—plants that remain in the ground year after year. Edited by Carlisle and Streit Krug, the collection of 34 essays by Indigenous leaders, farmers, scientists, and chefs makes a case for centering perennial [&#8230;] The post The Power of Perennial Agriculture appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 09:00:54 +0000",
      "timestamp": 1771405254000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Key points:\n\n- The book \"Living Roots\" edited by Carlisle and Streit Krug compiles 34 essays from Indigenous leaders, farmers, scientists, and chefs advocating for a shift towards perennial agriculture.\n\n- Perennial agriculture focuses on crops that remain in the ground year-round, unlike annual crops that are replanted each season.\n\n- This approach is seen as more sustainable and resilient in the face of climate change, as perennial plants have deeper root systems and require fewer inputs.\n\n- Experts argue perennial agriculture can improve soil health, increase biodiversity, and provide more consistent yields over the long term compared to annual crops.\n\n- Perennial crops highlighted include trees, shrubs, and herbaceous plants that produce food, fiber, and other agricultural products.\n\n- Implementing perennial agriculture requires changes to farming practices, infrastructure, and policies to support this transition away from annual monocultures.\n\n- Indigenous communities in particular are highlighted as leaders in developing perennial agricultural systems that work in harmony with local ecosystems.\n\nThe article advocates for greater adoption of perennial agriculture as a climate-smart, sustainable alternative to conventional annual crop farming.",
      "summaryTimestamp": 1771411233960
    },
    {
      "id": "2811311af404a5c3",
      "title": "Texas A&#038;M Forest Service breaks ground on new McGregor regional office",
      "link": "https://agrilifetoday.tamu.edu/2026/02/17/texas-am-forest-service-breaks-ground-on-new-mcgregor-regional-office/",
      "description": "Facility to serve as emergency response training hub and staging area The post Texas A&#038;M Forest Service breaks ground on new McGregor regional office appeared first on AgriLife Today.",
      "date": "Tue, 17 Feb 2026 23:21:30 +0000",
      "timestamp": 1771370490000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M Forest Service is breaking ground on a new $2.1 million, 5,500-square-foot regional office in McGregor, Texas. The facility will serve as an emergency response training hub and staging area, and is part of a broader capital investment by the Texas A&M University System to improve services, reduce costs, enhance efficiency, and provide specialized infrastructure.\n\nThe new office is expected to be completed by the end of 2026 and will reach full operational capacity shortly thereafter. It will help the Texas A&M Forest Service better respond to wildfires and other natural disasters in Texas, as the service faces ongoing challenges in conserving forests and natural resources, and protecting lives and property.\n\nThe groundbreaking was attended by Texas A&M Forest Service leadership, Texas A&M University System officials, and local community leaders. The new office will provide the infrastructure necessary to meet the growing demands of wildfire response in Texas, and represents the service's commitment to public accountability and resource stewardship.",
      "summaryTimestamp": 1771379473573
    },
    {
      "id": "0cd94936c00e5cb1",
      "title": "As carbon pipeline efforts stall, company eyes trucking the gas through North Dakota",
      "link": "https://www.agweek.com/agribusiness/as-carbon-pipeline-efforts-stall-company-eyes-trucking-the-gas-through-north-dakota",
      "description": "Harvestone Low Carbon Partners is considering transporting CO2 from Dakota Spirit ethanol plant near Jamestown for underground storage.",
      "date": "Tue, 17 Feb 2026 15:22:10 GMT",
      "timestamp": 1771341730000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/7408fe0/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fjamestownsun%2Fbinary%2F081318.N.JS.NDSoyProcessors%20%281%29_binary_4037311.jpg",
      "summary": "Key Points:\n\n1. Harvestone Low Carbon Partners is exploring trucking carbon dioxide emissions from its Dakota Spirit ethanol plant near Jamestown, North Dakota, about 160 miles west for underground storage.\n\n2. The company requested a $20 million loan from North Dakota's Clean Sustainable Energy Authority (CSEA) in late January for its $95 million project, but the CSEA board voted against providing the funding.\n\n3. Harvestone already operates a carbon storage facility at its Blue Flint ethanol plant near Underwood, North Dakota, where the CO2 has been pumped underground into the Broom Creek Formation since 2023.\n\n4. Transporting CO2 by truck would not be a new practice, but the scale Harvestone is considering is. They plan to capture and store 230,000 metric tons of CO2 annually.\n\n5. Building a pipeline to transport Dakota Spirit's emissions would be expensive, as a 160-mile pipeline would only move about 1,430 metric tons of CO2 per mile, compared to Summit's 2,500-mile pipeline which would move about 7,200 metric tons per mile.\n\n6. Harvestone has an engineering, procurement and construction agreement with Minnesota-based McGough for the project, with a \"guaranteed substantial complete\" date in January 2027 and full commercial operations planned for later that year.\n\n7. The potential for carbon storage in eastern North Dakota is limited due to the area's geology, so some form of transportation would be needed if companies want to capture, store or use industrial emissions from the region.",
      "summaryTimestamp": 1771425726160
    },
    {
      "id": "957a1f1f771b103e",
      "title": "Improving waterhemp control by managing spray water pH",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/improving-waterhemp-control-by-managing.html",
      "description": "",
      "date": "Tue, 17 Feb 2026 14:15:00 +0000",
      "timestamp": 1771337700000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjeGlAeUiIBJwZ4ctdI_mh3flmZnZDe1nFx16EXbclg1M8atbqYH_Xnnt3-JfrmgGmGbBwHH5H33fOEGg6b0sSN7CahvuZ-iy5vx9RgUnKXjkMJF4kkRXM0pzAtMV7cPSr0sak0-n0U6FoTAU25EBDPGpwr010UzmhX6cqqz4RHdnBZDzsHENZGLrWTXS3e/s72-c/Spray%20Truck%20broadjet%202.jpg",
      "summary": "The study conducted in Rochester, Minnesota in 2025 evaluated how spray water pH adjustment and timing of spray solution mixing affected waterhemp control in a corn herbicide program. \n\nThe treatments included a tank mix of atrazine and Acuron GT (at full or half rate) with NIS and AMS, with or without a pH-lowering and buffering adjuvant (AlpHa Shot), and mixed either six days prior to application or at the time of spraying.\n\nAdding the pH-lowering adjuvant reduced spray water pH from 7.5 to 5.8, which improved waterhemp control by 10% at 24 days after treatment (DAT) and 7% at 112 DAT. Waterhemp density decreased by 64% and biomass was reduced by 55% in treatments with the pH adjuster.\n\nThe timing of mixing the pH adjuster (6 days ahead or at time of spraying) did not affect waterhemp control, density, or biomass. The improved weed control was observed at both full and half rates of Acuron GT.\n\nThe key takeaway is that conditioning the spray water to the proper pH can improve herbicide performance and season-long waterhemp management, regardless of when the solution is mixed. Testing water pH and using a water conditioner or buffering agent is recommended if waterhemp control has been inconsistent.\n\nThe study was conducted by Eric Yu and Ryan Miller, UMN Extension Crops Educators, and was published on February 17, 2026 in the UMN Crop News.",
      "summaryTimestamp": 1771512248860
    },
    {
      "id": "25644925eb82eddc",
      "title": "Strategic Farming: Let's talk crops! session talked forecasting tools for crop and pest management",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops_16.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 17:43:00 +0000",
      "timestamp": 1771263780000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjO5aunE_uoVkP9LI9r3n8Dpm1IiJYW5pClHH3uqDnphvgKN3zj95NHyH7Ib8koR8fdTGW4AQmGObBUNmu22C0wNVn5PrnuC8DgcU7Gyf7-CdmWQ9X4pl47Keqb17PkwaKW08g3fQ1U8NdyxSyPn4MmaV6U0BvAl8Rva_OHxg2nVLbxGiXOK704ccEkD1Vg/s72-w241-h320-c/noaa-mn-low-temps-feb7.jpg",
      "summary": "The webinar series runs through March and is still open for registration.\n\nKey points:\n- Cold weather impacts on overwintering insect pests like soybean aphid, corn rootworm, and alfalfa weevil. Colder temperatures (below 0°F) can lead to 50-95% mortality for some pests.\n- Forecasting tools like pheromone traps and degree day calculations can help predict arrival and development of migratory pests like black cutworm, potato leafhopper, and corn earworm.\n- Crop disease forecasting tools like the ipmPIPE website track the spread of diseases like southern rust of corn and tar spot.\n- The expanding Minnesota Ag Weather Network provides hyperlocal weather data and degree day models for various crops and pests.\n- The North Dakota Ag Weather Network (NDAWN) hosts many of these forecasting tools, including models for sugarbeet root maggot, wheat midge, Cercospora leaf spot, white mold, and Fusarium head blight.\n- Scouting fields is still important to validate the forecasting tools.\n\nThe article emphasizes how these advanced forecasting tools can help Minnesota farmers better time management practices and prepare for crop and pest threats.",
      "summaryTimestamp": 1771440496003
    },
    {
      "id": "67a14bb588f7d967",
      "title": "Help the Crops Team fine-tune programming!",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/help-crops-team-fine-tune-programming.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 16:30:47 +0000",
      "timestamp": 1771259447000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhCxd5PtQ8nJrtOb4X1Tz1md-IIKn225eI96PLlJgYOzihrHu8OUq4wBg-ocPXUHBdOkMO_NFZ1aPkpH1kdhqKdcIxaHijDP6s54fOuTloYefpKielhFj8Psev7G7MakTpjRcGWQ7Srb96x6RmLgtHNGcud3o7ZvUBqlI9eWAjZQ3jAzV9mLOeT01AkqSM4/s72-c/weed-management-field-day-sarangi.jpg",
      "summary": "The University of Minnesota Extension Crops team is seeking input from row crop and forage producers, as well as agriculture professionals who work with producers, to better understand their educational needs and preferences. They are conducting an anonymous 12-15 minute survey to gather this feedback, with the goal of customizing their educational programs to better meet the interests and preferences of the target audience. The survey asks about respondents' operations, learning preferences, and how they want to engage with Extension. The Crops Team aims to use the survey results to refine their programming and make it more useful and relevant for producers. The survey is open until February 16, 2026, and the team encourages all interested parties to participate.",
      "summaryTimestamp": 1771434033466
    },
    {
      "id": "b4602ee8b589516a",
      "title": "Freeze, Thaw, Seed: Timing Pasture Renovation in an Unpredictable Winter",
      "link": "https://crops.extension.iastate.edu/post/freeze-thaw-seed-timing-pasture-renovation-unpredictable-winter",
      "description": "<p>This winter’s erratic weather, swinging from –30°F wind chills to unseasonably warm temperatures in the 50s, has left many wanting spring and ready to get back in the fields. Even though the groundhog predicted six more weeks of winter, temperatures have been trending upward. Over the next week, highs are expected to stay above freezing during the day and drop below freezing at night. These natural freeze–thaw cycles signal the slow transition into spring. </p>",
      "date": "Fri, 13 Feb 2026 11:51:43 -0600",
      "timestamp": 1771005103000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n1. This winter has seen erratic weather in Iowa, with temperatures swinging from -30°F wind chills to unseasonably warm 50s.\n2. Over the next week, temperatures are expected to stay above freezing during the day and drop below freezing at night, creating ideal conditions for frost seeding.\n3. Frost seeding involves broadcasting or overseeding legumes into a thinning pasture or small grain stand, taking advantage of the freeze-thaw cycle to work the seed into the soil.\n4. Frost seeding can be a cost-effective way to rejuvenate a declining stand or introduce new legumes, but success depends on timing, soil conditions, and the condition of the existing stand.\n5. For more information on best practices for frost seeding, readers are encouraged to review the \"Frosting Seeding Legumes\" article in the Encyclopedia.\n6. The article was written by Shelby Gruss, an assistant professor and forage extension specialist at Iowa State University, who joined the Department of Agronomy in November 2023.",
      "summaryTimestamp": 1771360403251
    },
    {
      "id": "9a2b8ede909ba045",
      "title": "Frosting Seeding Legumes",
      "link": "https://crops.extension.iastate.edu/encyclopedia/frosting-seeding-legumes",
      "description": "<p>Frost seeding involves strategically broadcasting or overseeding legumes, such as red clover, into a tired pasture or within a small grain stand. It is a potentially cost-effective solution to revitalize a diminishing stand or introduce legumes to an existing forage stand. Frost seeding is usually not recommended with grass species. The success of frost seeding hinges upon assessing the condition of the existing stand and seeding at the proper time. </p>",
      "date": "Fri, 13 Feb 2026 11:47:51 -0600",
      "timestamp": 1771004871000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Frost seeding involves strategically broadcasting or overseeding legumes, like red clover, into a tired pasture or small grain stand to revitalize the stand in a cost-effective way.\n\n- Timing is critical - frost seeding is typically done between mid-February to early March, coinciding with the freeze-thaw cycle, which helps incorporate the seed into the soil.\n\n- Soil conditions are important - a thick thatch can hinder seed-to-soil contact, so it's recommended to closely hay or overgraze in the fall/winter prior to frost seeding. Sandy soils are less ideal as they don't expand/contract as much during freeze-thaw.\n\n- Adequate spring moisture is vital for establishing a healthy stand after frost seeding. The success of frost seeded stands depends significantly on spring moisture levels.\n\n- The author is Dr. Shelby Gruss, an assistant professor and forage extension specialist who joined Iowa State University in November 2023. Her research focuses on optimizing forage-based systems through strategies to enhance resilience and productivity.",
      "summaryTimestamp": 1771360406011
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Farmers are now using AI-assisted tools, voice search, and quick-scan platforms that often answer their questions without needing to click. The true indicator of content effectiveness is now the time a user spends meaningfully engaged, as this signals real interest and creates stronger opportunities for brand messaging.\n\nAgWeb.com recently underwent a redesign to increase user attention and engagement:\n- 54% increase in readers reaching 75% of an article\n- 21% increase in readers reaching 90% of an article\n- 33% increase in daily article pageviews per mobile user\n\nThe article notes that in general, only 16% of users read every word on a page, while 79% scan rather than read fully. Deeper scroll behavior and more articles consumed per visit indicate greater attention and focus.\n\nAttention time is a better indicator than click-through rate, as it measures whether users stayed with the content, scrolled with purpose, and consumed multiple articles - behaviors that directly influence brand recall, message retention, and advertising effectiveness.\n\nThe improvements on AgWeb provide a template for increasing engagement and attention, leading to higher quality impressions and better alignment with how farmers search and consume content today. This matters for ag marketers looking to reach farmers in focused, engaged moments.",
      "summaryTimestamp": 1771411244705
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "S. avocado supply chain, taking place on November 18-20, 2026 in San Diego, California. The inaugural conference aims to bring together every segment of the avocado industry - including producers, exporters, importers, packers, retailers, and foodservice buyers - to collaborate, share data-driven insights, and align on strategies to strengthen the avocado category. \n\nThe conference is being organized with the support of the Hass Avocado Board (HAB), which has a mission to grow global avocado demand and make avocados America's preferred healthy food. It will deliver a forward-looking agenda covering global avocado production and trade, consumer/shopper trends, marketing programs, and economic dynamics impacting the industry. Stakeholders expected to attend include growers, packers, importers/exporters, retailers, foodservice, suppliers, logistics companies, and data/insights providers.\n\nKey details:\n- Location: Hilton San Diego Bayfront\n- Dates: November 18-20, 2026\n- Organizers: Farm Journal, Hass Avocado Board\n- Goals: Collaboration, data-driven insights, strategic industry alignment\n\nThe conference is described as a \"pivotal moment\" that will help strengthen the avocado category amidst high consumer demand, industry innovation, and the need for greater alignment. Attendees will gain indispensable insights and year-round strategic value from the event.",
      "summaryTimestamp": 1771411252661
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Iowa State University Pesticide Safety Education Program has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. The updated training manuals are available for purchase through the ISU Extension Store, including the revised Iowa Core Manual (CS445). New exams based on the updated core manual are now available at all Iowa Department of Agriculture and Land Stewardship test sites. The Private Pesticide Applicator Manual (CS1) now includes a two-page informational update, and all private exams include content from this insert. Farmers and pesticide applicators in Iowa can contact Betsy Danielson at betsydan@iastate.edu for more information.",
      "summaryTimestamp": 1771411255167
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The key points are:\n\n- Lead generation should be about delivering real value to farmers in exchange for their time and attention, not just capturing leads.\n- The call-to-action (CTA) and offer you choose are critical, as they shape the quality and purchase-readiness of the leads you generate.\n- The mindset should shift from what the business wants to collect, to what farmers genuinely need.\n- Designing the right offer that solves real problems for farmers is more important than chasing high lead volumes.\n\nThe article does not provide any specific numbers, statistics, dates, names, or expert quotes. The overall recommendation is for businesses targeting farmers to prioritize creating valuable offers over just lead generation tactics.",
      "summaryTimestamp": 1771411257460
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Key points:\n- Farmers are now searching for information differently, moving away from traditional Google searches to using AI-powered platforms like ChatGPT and Google's AI Overviews, as well as mobile voice search.\n- To cut through the \"AI slop,\" brands need to focus on building brand authority and trust by providing real, trustworthy information to growers and producers.\n- The way farmers find information has fundamentally shifted, and most agricultural marketers are still playing the old SEO game.\n- Discoverability is now about ensuring expertise, content, and brand authority surface at the exact moment the audience is looking for answers, across every channel where they are searching.\n- In the new AEO era, discoverability is about winning the citation, brand mention, and trusted source reference, rather than just winning the click.\n\nThe article suggests that agricultural marketers need to reevaluate their 2026 strategy and adopt an answer-driven content strategy, as well as amplify trusted voices, to remain relevant and visible to their audience.",
      "summaryTimestamp": 1771411264176
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "Key points include:\n\nObjectives: Spray drones can provide flexibility for timely applications, reduce field traffic, and improve access to hard-to-reach areas. Farmers should clearly define their specific goals before investing.\n\nRegulations: Operators must have an FAA Part 107 Remote Pilot Certificate and Part 137 Certification for aerial pesticide application. State-level IDALS licensing is also required. Rules change frequently, so checking for updates is important.\n\nInsurance: Standard farm policies don't cover aerial application risks. Farmers need chemical, general, and physical damage liability coverage specific to drone operations.\n\nEquipment: Factors to consider include spray capacity, battery life, nozzle options, and GPS/automation features. Local dealer support is also key.\n\nTraining: Proper training on safe operation, calibration, and weather monitoring is essential. Iowa State offers educational programs on compliance and best practices.\n\nAdoption Approach: Farmers are encouraged to start small, compare results to conventional methods, and gradually scale up as they gain experience. Dry product applications can also be evaluated cautiously.\n\nResources: Iowa State University, the Digital Ag Innovation Lab, licensed dealers, and IDALS can all provide support for farmers new to spray drone technology.\n\nThe article highlights that spray drones can be a valuable addition, but successful integration requires careful planning and a thoughtful, stepwise approach. Staying up-to-date on regulations, safety, and best practices is crucial.",
      "summaryTimestamp": 1771411272467
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series meetings will be held at 12 locations across Iowa from January 6-29. The meetings are organized by Iowa State University Extension and Outreach to provide farmers and crop production professionals with the latest research-based information to help them make informed decisions for the upcoming growing season.\n\nThe meetings will feature topics tailored to local growing conditions and challenges, including crop market and climate outlooks for 2026, nitrates and drinking water, profitable nutrient management, southern rust, transition planning, and robots and drones.\n\nEarly-bird registration is $75 until the week before each meeting, and late or on-site registration is $100. The registration fee includes refreshments, lunch, certified crop advisor credits, and access to resources. Private pesticide applicator recertification will also be available at each location for a separate fee of $30.\n\nThe meeting locations and dates are:\n- Jan. 6 – Sioux Center\n- Jan. 7 – Storm Lake\n- Jan. 8 – Burlington\n- Jan. 9 – Mason City\n- Jan. 13 – Estherville\n- Jan. 15 – Waterloo\n- Jan. 16 – Davenport\n- Jan. 21 – Ankeny\n- Jan. 22 – Atlantic\n- Jan. 27 – Iowa City\n- Jan. 28 – Le Mars\n- Jan. 29 – Carroll\n\nAccording to Josh Michel, a field agronomist with ISU Extension and Outreach, the goal of the meetings is to \"prepare producers to manage potential issues when they arise, or even before they arise, by sharing the most up-to-date scientific knowledge from Iowa State University researchers.\"",
      "summaryTimestamp": 1771411276501
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10 at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5.\n\nThe event will feature research on sorghum's value as a forage crop. Sorghum is more drought-tolerant and has lower nitrogen requirements compared to corn, and does not host the tar spot pathogen. Experts will discuss sorghum's production and utilization for silage, grazing, and as a standing winter feed source.\n\nAttendees will learn about forage sorghum research from Mitch Tuinstra, Wickersham Chair of Excellence in Agricultural Research and scientific director of the Institute for Plant Sciences at Purdue. He will share plant breeding techniques to improve sorghum yield and quality. Other speakers include Brad Shelton, Jason Tower, Nick Minton, and Jeff Jackson.\n\nVenue tours will be available from 3-5 pm and 6-8 pm, and a dinner and bull test station tour will be offered from 5-6 pm.",
      "summaryTimestamp": 1771411285811
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113 in July 2024, indicating improved farmer sentiment despite declines in corn and soybean prices. The Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations rose 7 points to 119.\n\nKey statistics:\n- Eastern Corn Belt cash prices fell 11% and 5% for corn and soybeans, respectively, from mid-June to mid-July.\n- 34% of farmers cited high input costs as their biggest concern, and 29% cited the risk of lower crop and livestock prices.\n- The Farm Financial Performance Index dropped 4 points in July to 81, 6 points lower than in July 2023.\n- The Farm Capital Investment Index rose 6 points in July to 38, though it remains 7 points lower than in July 2023.\n- The Short-Term Farmland Value Expectations Index rose to 118 from 115 in June, while the Long-Term Farmland Value Expectations Index dropped 6 points to 146.\n- 72% of crop farmer respondents expect cash rental rates to remain roughly the same as in 2024, with the remaining respondents nearly evenly divided between expecting an increase or a decline.\n\nThe survey was conducted from July 15-19, 2024. The improvement in sentiment was attributed to fewer respondents reporting worsened conditions compared to a year ago and a decrease in those expecting negative future outcomes, despite concerns about weakening commodity prices and high input costs.",
      "summaryTimestamp": 1771411293837
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue researchers are adopting an interdisciplinary approach to assess the emerging tar spot disease in corn. The research team, led by C.D. Cruz, associate professor of botany and plant pathology, is using a mix of statistical, data science, epidemiology, microbiology, artificial intelligence, and computer vision methods to understand the dynamics of tar spot in corn.\n\nThe research is funded by two grants totaling nearly $1.1 million from the USDA National Institute of Food and Agriculture. The team is collaborating with researchers from Colombia, Mexico, Ecuador, South Korea, and the U.S.\n\nThe researchers have developed a digital method called the stromata contouring detection algorithm (SCDA) to quantify tar spot in corn. They have tested the algorithm under field conditions and found it to be successful in quantifying trends, but some inaccuracies persist in fully automated scenarios. The team is now refining their training methods to improve the model's accuracy and performance.\n\nAnother research effort includes the laboratory of Purdue's Mohammad Jahanshahi, associate professor in the Lyles School of Civil and Construction Engineering and the Elmore Family School of Electrical and Computer Engineering. Jahanshahi and Cruz, along with their students, are working on a proof-of-concept data fusion project that integrates drone imagery and weather data to capture crucial details about the tar spot pathosystem.\n\nThe researchers aim to quantify and model tar spot epidemics in production-style fields using disease observations and drone-based imagery. Ultimately, the team wants to quantify and model tar spot severity by referencing and integrating imagery with spatial and temporal data.\n\nThe interdisciplinary nature of the project can place greater time demands on the researchers, but it also leads to better problem-solving as each person brings their own expertise to the table.",
      "summaryTimestamp": 1771411301659
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana Sheep Association (ISA), with support from the Indiana Sheep and Wool Market Development Program (IN S&W), is hosting various sheep-themed events and competitions at the 2024 Indiana State Fair:\n\n- The Wool and Ewe Room and Ewe2 boutique will be open throughout the fair, offering wool items, livestock-themed apparel, and more.\n- On August 2 at 10 a.m., there will be an open wool judging and wool sale event in the Blue Ribbon Pavilion.\n- The Make It With Wool (MIWW) competition and fashion show will take place on August 4 at 2 p.m. in the Indiana Arts Building.\n- The Indiana State Fair Shearing Contest will be held on August 4 at 5 p.m. in the Ball State University Champions Pavilion.\n- From August 8-11, 11 a.m.-6 p.m., the Taste from Indiana Farms event in the Indiana Farm Bureau Fall Creek Pavilion will offer free samples of Indiana lamb.\n- The annual Sheep to Shawl competition, where youth teams create a wool shawl from scratch, will be on August 18 at 10 a.m. in the Indiana Arts Building.\n- Sheep will be exhibited in the Blue Ribbon Pavilion for open and 4-H shows from August 4-20.\n\nISA President Jane Smith stated that the association is \"proud to bring the spirit of our industry to the fair, and this year we will bring it in the theme of 'Art and Nature,' showcasing sheep-related art from Indiana artists in the Blue Ribbon Pavilion.\"",
      "summaryTimestamp": 1771411309252
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue Extension will have a presence at the fair, offering interactive demonstrations and activities at the Purdue Extension Building on the north side of the fairgrounds.\n\nKey Purdue Extension activities include:\n- Block Party (for children 8 months to 8 years) to enhance school-readiness skills\n- Book Party focusing on math skills\n- Captain Cash to teach financial management\n- Engaging with Purdue Extension experts in fields like entomology, human health, forestry, and animal sciences\n- Master Gardener exhibit on annuals and vegetables suited to Indiana\n- Pollinator education\n\nOther Purdue events include:\n- \"What's Growing on My Spinach?\" food safety activity on August 7, with samples of \"Cricket Rice Krispies Treats\"\n- Seed art displays in livestock barns and the Purdue Extension Building\n- Pioneer Village in the 1800s theme, sponsored by the Purdue Ag Alumni Association\n\nThe Purdue Extension exhibits will be located throughout the fairgrounds, including the 4-H Exhibit Hall, Expo Hall, Indiana Farmers Coliseum, and more.\n\nPurdue University is a public research institution ranked among the top 10 public universities in the U.S., with a focus on affordability, accessibility, and the pursuit of new innovations.",
      "summaryTimestamp": 1771411316576
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The new NPM publication \"Potassium Cycle\" provides a comprehensive visual overview of the potassium cycle in Wisconsin cropping systems. The two-page publication outlines key potassium concepts, including:\n\n- Sources of potassium, including soil minerals, organic matter, and fertilizers\n- Potassium uptake by plants and movement within the plant\n- Potassium losses from the soil through leaching, crop removal, and erosion\n- Recommended potassium application rates and timing for optimum crop yields\n\nThe publication was developed by the University of Wisconsin-Madison to help farmers better understand the potassium cycle and make informed decisions about potassium management in their operations. It is available for free download on the NPM website.",
      "summaryTimestamp": 1771411319041
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Wisconsin winter wheat is progressing at a record pace, about 10-14 days ahead of normal. As of April 17, 2022, 26% of the winter wheat crop was in the jointing stage, compared to the 5-year average of 10%. Wheat condition is rated 79% good-to-excellent, higher than the 5-year average of 71%.\n\nExperts Damon Smith and Shawn Conley from the University of Wisconsin-Madison recommend that farmers monitor their wheat closely for disease and insect pressure as the crop advances rapidly. They advise applying fungicides at flag leaf emergence to protect against Fusarium head blight and other diseases.\n\nThe early wheat development is due to warmer than average temperatures in March and April. This accelerated growth could lead to earlier wheat harvest, potentially impacting management of other summer crops. Farmers should adjust plans accordingly and be prepared to shift fieldwork schedules as needed.",
      "summaryTimestamp": 1771411321591
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Soybean fields may need replanting due to factors like freezing, hail, flooding, pests, and diseases. Before replanting, farmers should consider:\n\n1. Yield potential - Replanted soybeans may yield 5-10% less than the original stand. Yield loss is higher for replanting beyond June 1st.\n\n2. Maturity - Replanted soybeans will be 7-10 days later to maturity. This can impact harvest timing and drying costs.\n\n3. Weed control - Replanting provides a chance to change herbicide programs and manage weeds more effectively.\n\n4. Seed quality - Germination and vigor of replacement seed should be checked. Seed treatments may be needed.\n\n5. Planting date - Ideal replanting dates are before June 1st in northern climates. Yields drop significantly for plantings after June 15th.\n\n6. Stand uniformity - Uneven stands can impact harvestability and yield. Aim for a uniform 100,000-150,000 plants/acre.\n\nShawn P. Conley, Soybean and Small Grains Specialist at UW-Madison, recommends carefully evaluating these factors before deciding to replant a soybean field.",
      "summaryTimestamp": 1771411324900
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n- Farmers planning to use 2,4-D on Enlist E3 soybean in 2024 need to be aware of important updates and restrictions.\n- The use of 2,4-D on Enlist E3 soybean will be prohibited in 2024 due to regulatory changes.\n- Farmers should instead consider alternative weed control options for Enlist E3 soybean in 2024, such as glufosinate and clethodim herbicides.\n- Rodrigo Werle, a Weed Scientist and Extension Specialist at UW-Madison, advises farmers to stay informed about the latest updates and plan their weed management strategies accordingly.\n\nThe article does not provide any specific numbers, prices, statistics, or percentages. It also does not mention any deadlines, names of people/organizations/programs, or locations beyond UW-Madison. The context is the regulatory changes affecting the use of 2,4-D on Enlist E3 soybean in 2024. The main impact for farmers is the need to adjust their weed control plans for Enlist E3 soybean next year. The article recommends that farmers consider alternative herbicide options and stay informed about the latest updates.",
      "summaryTimestamp": 1771411328943
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Wisconsin CCA (Certified Crop Adviser) Board election results are as follows:\n\nRob Shields, Matt Brugger, and Chris Bandura have been elected to the Wisconsin CCA Board. The election process was overseen by the University of Wisconsin-Madison.",
      "summaryTimestamp": 1771411330612
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 25,
    "industry": 55,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 80,
  "summariesGenerated": 17,
  "updated": "2026-02-19T16:47:43.515Z"
}