{
  "items": [
    {
      "id": "ff5810f480727f8c",
      "title": "CT Farm Businesses Invited to Exhibit in CT Building at The Big E",
      "link": "https://www.morningagclips.com/ct-farm-businesses-invited-to-exhibit-in-ct-building-at-the-big-e/",
      "description": "HARTFORD, Conn. — Farms, specialty food businesses, and agricultural organizations are invited to submit vendor applications for exhibit space in the Connecticut Building at The Big E. The Connecticut Department of Agriculture (CT DoAg), in coordination with Connecticut Office of Tourism, showcases an extensive line-up of CT Grown businesses helping market their products and promote their [&#8230;] The post CT Farm Businesses Invited to Exhibit in CT Building at The Big E appeared first on Morni",
      "date": "Fri, 13 Feb 2026 14:36:35 +0000",
      "timestamp": 1770993395000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Connecticut Department of Agriculture (CT DoAg) and Connecticut Office of Tourism coordinate this annual 17-day event, which features over 1 million fairgoers visiting the Connecticut Building. In 2025, 34 agricultural exhibitors participated, offering farm products, specialty foods, education, and experiences. Connecticut Day is September 23, 2026, and Harvest New England Day is October 2, 2026. Agriculture Commissioner Bryan P. Hurlburt states that exhibiting provides \"tremendous opportunity to engage with new customers, sample CT Grown farm products, and encourage visitors to travel to their farm\" which can boost sales and drive future on-farm goals. Eligible entities include agricultural businesses, non-profits, and organizations with an agricultural mission to showcase Connecticut's diverse farming industry.",
      "summaryTimestamp": 1770993516844
    },
    {
      "id": "6093a79d94aa4293",
      "title": "Agri-Mark, Inc. Fined for Multiple Wastewater Permit Violations at their Vermont Facility",
      "link": "https://www.morningagclips.com/agri-mark-inc-fined-for-multiple-wastewater-permit-violations-at-their-vermont-facility/",
      "description": "MONTPELIER, Vt. — The Agency of Natural Resources Department of Environmental Conservation (DEC) announced today [Feb. 12, 2026] that Agri-Mark, Inc. was fined $60,000 for multiple violations of its Pretreatment Discharge Permit (Permit) at its dairy and whey processing facility in Middlebury, Vermont. More than 15 billion gallons of wastewater are processed by Vermont’s 91 [&#8230;] The post Agri-Mark, Inc. Fined for Multiple Wastewater Permit Violations at their Vermont Facility appeared first",
      "date": "Fri, 13 Feb 2026 14:30:25 +0000",
      "timestamp": 1770993025000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Agri-Mark, Inc., a dairy and whey processing facility in Middlebury, Vermont, has been fined $60,000 for multiple violations of its Pretreatment Discharge Permit since July 1, 2022. \n\nThe violations include:\n- Numerous exceedances of Biological Oxygen Demand and pH effluent limits\n- Unpermitted discharges of high-strength waste to the municipal treatment system\n- Multiple monitoring and reporting violations\n\nThese violations resulted in impacts to the municipal wastewater treatment facility. Agri-Mark also failed to maintain the facility in good working order and did not employ an adequate number of staff.\n\nTo resolve the violations, Agri-Mark has agreed to:\n- Hire a qualified consultant to evaluate the facility and its waste management procedures\n- Develop a compliance and operations plan for Agency review and approval\n- Ensure adequate staffing\n\nThe $60,000 fine was incorporated into a Final Judicial Order of the Vermont Superior Court, Environmental Division.\n\nThe Agency of Natural Resources Department of Environmental Conservation (DEC) emphasizes that compliance with pretreatment discharge permits is crucial for ensuring safe discharges from municipal wastewater treatment facilities to Vermont's surface waters. Without proper pretreatment, there is the potential for discharges to contaminate lakes, ponds, rivers, streams, and wetlands.",
      "summaryTimestamp": 1770993521069
    },
    {
      "id": "0679d0daac0f4bb1",
      "title": "Master Gardener Education Day",
      "link": "https://www.morningagclips.com/master-gardener-education-day-2/",
      "description": "ERIE CO., N.Y. — The Cornell Cooperative Extension (CCE) of Erie County Master Gardener Program will host its 2026 Education Day: ‘Celebrating Gardening’ on Saturday, March 7, 2026, from 8:30 am to 3:00 pm. Location: Classics V Banquet Center, 2425 Niagara Falls Blvd, Amherst, NY 14228 Our topics and speakers: Understanding Cultivars, Nativars, and Native [&#8230;] The post Master Gardener Education Day appeared first on Morning Ag Clips.",
      "date": "Fri, 13 Feb 2026 14:24:11 +0000",
      "timestamp": 1770992651000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Cornell Cooperative Extension (CCE) of Erie County Master Gardener Program will host its 2026 Education Day: 'Celebrating Gardening' on Saturday, March 7, 2026, from 8:30 am to 3:00 pm at the Classics V Banquet Center in Amherst, NY.\n\nThe event features three speakers:\n- Dan Segal, founder of Plantsman Nursery and Greenhouse in Ithaca, NY, will discuss the differences between native species, cultivars, and nativars and their impact on genetic diversity and ecological resilience.\n- Nell Gardner, known for her work in restoring the Frank Lloyd Wright-designed gardens, will speak on working with nature to produce floral landscapes of beauty and bounty. \n- Carl Schimenti, an Urban Environmental Scientist at Cornell University, will share good, better, best approaches to urban green space maintenance, including cost-effective strategies and new technologies like electric equipment and autonomous mowers.\n\nThe registration fee is $65 for the general public, $50 for CCE Erie Master Gardener Program Volunteers, and $55 for out-of-county Master Gardener Volunteers. The fee includes a continental breakfast and hot buffet lunch. The CCE Erie Master Gardener Program also offers an annual garden-themed basket auction during the event and opportunities for business sponsorships.\n\nFor more information or to register, contact Jolie Hibit at (716) 652-5400, x176, or [email protected]. Registration is required and is not complete until payment has been received.",
      "summaryTimestamp": 1770993524767
    },
    {
      "id": "117f124777d5f966",
      "title": "Genomics Is Helping Bring the Iconic American Chestnut Back to the Forest",
      "link": "https://www.morningagclips.com/genomics-is-helping-bring-the-iconic-american-chestnut-back-to-the-forest/",
      "description": "HUNTSVILLE, Ala. — A new study published in Science shows that the dream of restoration of the American chestnut tree may finally be within reach, and modern genomics is helping lead the way. The research, led by The American Chestnut Foundation (TACF) and HudsonAlpha Institute for Biotechnology, demonstrates that chestnut breeding guided by genetic information can dramatically accelerate [&#8230;] The post Genomics Is Helping Bring the Iconic American Chestnut Back to the Forest appeared first ",
      "date": "Fri, 13 Feb 2026 14:21:58 +0000",
      "timestamp": 1770992518000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The American Chestnut tree, once an essential part of Appalachian forests, may be restored thanks to advancements in genomics. Researchers from The American Chestnut Foundation (TACF) and HudsonAlpha Institute for Biotechnology have demonstrated that genomic selection can accurately predict which seedlings will show resistance to the chestnut blight that decimated the species over the last century.\n\nThe key findings are:\n\n- Researchers built three of the first and most complete chestnut genome assemblies ever, revealing that resistance is not controlled by a single genetic switch but a network of many genes.\n- Using genome sequencing data from thousands of hybrid trees, they showed that genomic selection can accurately predict blight resistance, dramatically speeding up the breeding cycle.\n- The next generation of trees is expected to have roughly twice the average blight resistance, with about 75% American chestnut ancestry, and start producing large quantities of seed for restoration within the next decade.\n- Rebuilding the American chestnut is an ongoing process of gradual improvement, selecting the best trees in each generation until forests can contain thriving, tall-growing chestnuts that can stand up to blight.\n\nThis work highlights how genomics can be used to restore ecosystems, providing the \"blueprint for resilience\" across plants, crops, and biodiversity.",
      "summaryTimestamp": 1770993528368
    },
    {
      "id": "cb404cc20e012241",
      "title": "AgriLife Extension adds six new county agents across Texas",
      "link": "https://agrilifetoday.tamu.edu/2026/02/13/agrilife-extension-adds-six-new-county-agents-across-texas/",
      "description": "Agents provide county-level agriculture, natural resources, youth, family and community health programming The post AgriLife Extension adds six new county agents across Texas appeared first on AgriLife Today.",
      "date": "Fri, 13 Feb 2026 14:15:58 +0000",
      "timestamp": 1770992158000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The agents will provide county-level programming in agriculture, natural resources, youth development, family and community health.\n\nThe new agents are:\n- Paige Bauer (Ward County) - Agriculture and Natural Resources\n- Savannah Bushkuhl (Hays County) - Agriculture and Natural Resources  \n- Kyle Despain (Washington County) - Agriculture and Natural Resources\n- Torri McClellen (Victoria County) - 4-H Youth Development\n- Lauren Meiwes (Hansford County) - Family and Community Health\n- Eleni Patitsas (Comal County) - Agriculture and Natural Resources\n\nThe agents have various educational backgrounds, from animal science to horticulture, and previous experience working with AgriLife Extension and other agricultural organizations. They aim to connect research-based knowledge with real-world applications, support producers and landowners, and provide meaningful education and outreach to local communities.\n\nThis expansion of the AgriLife Extension county agent network ensures residents across all 254 Texas counties have access to expert assistance tailored to their specific agricultural, natural resource, youth, and community needs.",
      "summaryTimestamp": 1770993531980
    },
    {
      "id": "bcc60738adedd65b",
      "title": "AHC Releases 2026 Horse Industry Tax Handbook",
      "link": "https://www.morningagclips.com/ahc-releases-2026-horse-industry-tax-handbook/",
      "description": "WASHINGTON — The American Horse Council (AHC) today announced the release of the 2026 AHC Tax Handbook, the organization’s most comprehensive and up-to-date resource on federal tax policy affecting the U.S. equine industry. The handbook is now available to purchase as a PDF download for $50. The 2026 edition reflects major federal tax law changes [&#8230;] The post AHC Releases 2026 Horse Industry Tax Handbook appeared first on Morning Ag Clips.",
      "date": "Fri, 13 Feb 2026 14:08:59 +0000",
      "timestamp": 1770991739000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The American Horse Council (AHC) has released the 2026 AHC Horse Industry Tax Handbook, a comprehensive resource on federal tax policy affecting the U.S. equine industry. The handbook is available for purchase as a PDF download for $50.\n\nThe 2026 edition reflects major federal tax law changes enacted under the One Big Beautiful Bill Act (OBBBA) and provides guidance for horse owners, breeders, trainers, farm managers, nonprofit organizations, and equine-related businesses. It covers topics such as business vs. hobby rules, Section 199A pass-through deductions, depreciation and expensing for equine assets, state and local tax impacts, charitable contribution rules, international equine transactions, and estate and gift tax planning.\n\nAccording to AHC President Julie Broadway, the handbook delivers \"clarity, stability, and strategic guidance the equine industry has been asking for.\" It includes real-world examples, tax preparer checklists, and detailed explanations of new provisions affecting equine operations.\n\nThe 2026 AHC Tax Handbook is available for purchase through the American Horse Council store.",
      "summaryTimestamp": 1770993535382
    },
    {
      "id": "2c51c69ee57d2741",
      "title": "Hormel Foods names group VP and chief supply chain officer",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/hormel-foods-names-group-vp-and-chief-supply-chain-officer]]>",
      "description": "Will Bonifant to oversee global procurement, manufacturing, planning, logistics and engineering.",
      "date": "Fri, 13 Feb 2026 13:54:21 GMT",
      "timestamp": 1770990861000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltd1abe56bf64e2dae/698f2d6351a8d70008ae7aef/Will_Bonifant_Hormel.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Hormel Foods has named Will Bonifant as group vice president and chief supply chain officer. In this role, Bonifant will oversee Hormel's global procurement, manufacturing, planning, logistics and engineering functions. He will report directly to Jim Snee, Hormel's chairman of the board, president and CEO.\n\nBonifant has over 25 years of experience in supply chain management, most recently serving as senior vice president of supply chain at Ingredion Incorporated. He also held supply chain leadership roles at Kraft Foods and PepsiCo.\n\nHormel Foods is a global branded food company with over $11 billion in annual revenue. The company's portfolio includes well-known brands such as Hormel, Skippy, Spam, Applegate and Columbus.",
      "summaryTimestamp": 1770993537811
    },
    {
      "id": "22636e4cc2493d48",
      "title": "Unseasonably mild temps, centered on the Plains; showers develop on the southwest High Plains",
      "link": "https://www.brownfieldagnews.com/weathers/largely-fair-weather-across-the-heartland-a-wide-range-of-temps-from-the-plains-to-corn-belt/",
      "description": "Across the Corn Belt, lingering cold weather is mostly confined to the eastern Great Lakes States. The colder areas generally overlap where fields and forests are still blanketed by snow. Friday’s Midwestern high temperatures will remain below 40°F in the upper Great Lakes region—but will reach 65°F or higher in the southwestern Corn Belt. On [&#8230;] The post Unseasonably mild temps, centered on the Plains; showers develop on the southwest High Plains appeared first on Brownfield Ag News.",
      "date": "Fri, 13 Feb 2026 13:00:00 +0000",
      "timestamp": 1770987600000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Unseasonably mild temperatures are centered on the Plains, with highs reaching 65°F or higher in the southwestern Corn Belt on Friday. The colder areas are generally where fields and forests are still covered in snow, mostly in the eastern Great Lakes States, where highs will remain below 40°F. Showers are developing on the southwest High Plains. This weather pattern is a departure from the typical cold weather in the Midwest this time of year.",
      "summaryTimestamp": 1770993539710
    },
    {
      "id": "eff221a44037c93c",
      "title": "A very mild, mid-winter pattern to continue; welcome moisture for the Heartland",
      "link": "https://www.brownfieldagnews.com/weathers/a-mild-mid-winter-pattern-to-continue-welcome-moisture-for-most-in-the-southwest-plains/",
      "description": "Looking ahead, the 6- to 10-day outlook calls for the likelihood of below-normal temperatures in the Great Basin and Pacific Coast States, while warmer-than-normal weather will prevail from the Rockies to the Atlantic Coast. Meanwhile, below-normal precipitation from the southern half of the Plains to the southern Atlantic Coast should contrast with wetter-than-normal weather throughout [&#8230;] The post A very mild, mid-winter pattern to continue; welcome moisture for the Heartland appeared fi",
      "date": "Fri, 13 Feb 2026 12:15:00 +0000",
      "timestamp": 1770984900000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points are:\n\n- The 6- to 10-day outlook predicts below-normal temperatures in the Great Basin and Pacific Coast States, while the Rockies to the Atlantic Coast will experience warmer-than-normal weather.\n\n- There will be below-normal precipitation from the southern half of the Plains to the southern Atlantic Coast, contrasting with wetter-than-normal weather in other parts of the country.\n\n- This mild, mid-winter pattern is expected to continue, providing welcome moisture for the Heartland region.\n\n- No specific dates, percentages, or expert quotes are provided in the article summary.\n\nThis weather forecast is relevant for farmers in the Heartland, as the wetter-than-normal conditions could be beneficial for crop growth and soil moisture levels in that region. However, the drier weather in other parts of the country may present challenges for some farmers.",
      "summaryTimestamp": 1770993542126
    },
    {
      "id": "1dd29463fe3a6ecf",
      "title": "Brownfield Ag Weather Today",
      "link": "https://www.brownfieldagnews.com/weathers/brownfield-ag-weather-today-1239/",
      "description": "California’s unsettled, showery weather will expand to other areas of the West, including the Great Basin and Intermountain region. Subsequently, storminess will coalesce across the southern U.S., starting on Friday from Arizona to the southern half of the Plains. Southern precipitation should become heavier and spread eastward during the weekend, with event totals reaching 1 [&#8230;] The post Brownfield Ag Weather Today appeared first on Brownfield Ag News.",
      "date": "Fri, 13 Feb 2026 12:00:00 +0000",
      "timestamp": 1770984000000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Significant weather changes are expected across the western and southern United States over the next several days:\n\n- California's unsettled, showery weather will expand to the Great Basin and Intermountain region.\n- Storminess will develop across the southern U.S., starting on Friday from Arizona to the southern half of the Plains.\n- The southern precipitation is expected to become heavier and spread eastward during the weekend.\n- Event totals for the southern precipitation are expected to reach 1 inch or more in some areas.\n\nThis weather pattern shift could impact agricultural operations and conditions in the affected regions. Farmers should monitor forecasts and prepare for potential rainfall, potential impacts on crops and livestock, and any necessary adjustments to their operations.",
      "summaryTimestamp": 1770993545143
    },
    {
      "id": "f9d2338c4239989a",
      "title": "Bipartisan Bill Seeks to Advance Offshore U.S. Aquaculture",
      "link": "https://civileats.com/2026/02/13/a-bipartisan-bill-advances-the-launch-of-offshore-u-s-aquaculture/",
      "description": "Small in comparison to coastal Norwegian salmon farms, with annual combined exports of 1.2 million tons, Blue Ocean Mariculture produces about 1,100 tons of fish annually in net pens submerged 30 to 130 feet under water. Roughly half the fish is sold to distributors and stores in Hawaii, while the rest goes to markets on [&#8230;] The post Bipartisan Bill Seeks to Advance Offshore U.S. Aquaculture appeared first on Civil Eats.",
      "date": "Fri, 13 Feb 2026 09:00:18 +0000",
      "timestamp": 1770973218000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Key points:\n\n- Blue Ocean Mariculture, a Hawaii-based offshore aquaculture company, produces about 1,100 tons of fish annually, with half sold in Hawaii and the rest to other markets.\n- This is small compared to Norway's coastal salmon farms, which have annual exports of 1.2 million tons.\n- The bipartisan \"Advancing the Quality and Understanding of American Aquaculture Act\" (AQUAA Act) seeks to establish a federal regulatory framework for offshore aquaculture.\n- The bill is sponsored by Senators Roger Wicker (R-MS) and Brian Schatz (D-HI).\n- The goal is to streamline the permitting process and provide more regulatory certainty for offshore aquaculture operations.\n- Proponents argue this will help the U.S. reduce its seafood trade deficit and increase domestic seafood production.\n- Critics are concerned about potential environmental impacts and impacts on wild fisheries.\n- The bill aims to balance economic and environmental interests around offshore aquaculture development.",
      "summaryTimestamp": 1770978954217
    },
    {
      "id": "9bcf77202e85829a",
      "title": "NCBA Praises U.S.–Taiwan Trade Deal Expanding Duty‑Free Access for American Beef",
      "link": "https://www.tsln.com/news/ncba-praises-u-s-taiwan-trade-deal-expanding-duty%e2%80%91free-access-for-american-beef/",
      "description": "WASHINGTON (February 12, 2026) – Today, the National Cattlemen&#8217;s Beef Association (NCBA) welcomed the announcement that U.S. beef exports will gain duty-free access to Taiwan under a new trade agreement. The agreement removes both tariff and...",
      "date": "Fri, 13 Feb 2026 05:54:55 +0000",
      "timestamp": 1770962095000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key points:\n\n- The National Cattlemen's Beef Association (NCBA) welcomed a new U.S.-Taiwan trade agreement that will expand duty-free access for American beef exports to Taiwan.\n\n- The agreement removes both tariff and non-tariff barriers, strengthening one of the most important and fastest growing markets for U.S. beef.\n\n- Taiwan is currently the 6th largest export market for U.S. beef, valued at $709 million in 2024.\n\n- The trade deal eliminates tariffs on U.S. beef and breaks down non-tariff barriers by reinforcing science-based standards consistent with global animal health and food safety organizations.\n\n- NCBA President Gene Copenhaver stated that this will improve competitiveness and provide long-term certainty for U.S. cattle producers who depend on export markets. Beef exports accounted for over $415 per fed cattle processed in 2024.\n\n- The NCBA praised the work of former President Trump and U.S. Trade Representative Ambassador Jamieson Greer in securing this landmark trade deal.",
      "summaryTimestamp": 1770965713473
    },
    {
      "id": "f621e925f29ba76f",
      "title": "Who will do the work? Large dairies struggle to secure labor",
      "link": "https://www.tsln.com/news/who-will-do-the-work-large-dairies-struggle-to-secure-labor/",
      "description": "For decades, milking families have quietly wondered around kitchen tables and grandstanding politicians have obnoxiously made excuses for their actions and votes, each focused on the same topic: labor. The Montana Stockgrowers Association hosted an...",
      "date": "Fri, 13 Feb 2026 05:25:32 +0000",
      "timestamp": 1770960332000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Points:\n\n1. Large dairies in the U.S., particularly in South Dakota, are struggling to secure adequate labor for their operations.\n\n2. Drumgoon Dairy, a 6,500-head dairy operation in Eastern South Dakota, lost over half of its workforce when the U.S. Department of Homeland Security deported its Hispanic workers about 9 months ago. This left the remaining 12 employees working around the clock.\n\n3. South Dakota has actively courted large-scale dairy operations through tax incentives, streamlined permitting, and financial aid for infrastructure. For example, the state granted Warner-based Silverstreak Dairies up to $12 million in November 2025 to develop manure containment systems as they plan to double their herd to 5,400 cows.\n\n4. The labor shortage issue is exacerbated by the fact that Americans are typically unwilling to take on these demanding dairy jobs, according to Rick Naerebout of the Idaho Dairymen's Association.\n\n5. Andy Larson, a dairy farmer in Beresford, South Dakota, argues that the labor shortage is not due to a lack of willingness, but rather low pay. He says the 1980s farm crisis led many farm families to discourage the next generation from returning to farming.\n\n6. Small dairy farms in South Dakota are struggling with low milk prices and limited access to processing facilities, making it difficult for them to \"make it work\" in the current market.\n\n7. The article highlights the urgent need for immigration reform to address the labor shortage in the dairy industry, as well as the challenges faced by both large and small dairy operations in the state.",
      "summaryTimestamp": 1770965717169
    },
    {
      "id": "38323fcce374033f",
      "title": "USDA to Open Continuous and General Conservation Reserve Program Enrollment for 2026",
      "link": "https://www.tsln.com/news/usda-to-open-continuous-and-general-conservation-reserve-program-enrollment-for-2026/",
      "description": "Washington, D.C., February 10, 2026 – The U.S. Department of Agriculture (USDA) today announced the enrollment periods for agricultural producers and landowners to submit offers for the Continuous and General Conservation Reserve Program (CRP). USDA&#8217;s...",
      "date": "Fri, 13 Feb 2026 03:49:40 +0000",
      "timestamp": 1770954580000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The Continuous CRP enrollment period will run from February 12 to March 20, 2026, while the General CRP enrollment will be from March 9 to April 17, 2026. CRP is USDA's flagship conservation program that provides financial and technical support to farmers and landowners to convert unproductive cropland to beneficial vegetation to improve water quality, prevent soil erosion, and support wildlife.\n\nThe program currently has around 27 million acres enrolled, with 1.9 million acres available for new enrollments this fiscal year. USDA expects the enrollment to be competitive. Continuous CRP offers will be accepted on a first-come, first-served basis, with a focus on water quality practices like filter strips and grass waterways, as well as restoration of native ecosystems. \n\nContinuous CRP participants receive annual rental payments and cost-share assistance to establish long-term, resource-conserving vegetative cover. Enrollment options include the Clean Lakes, Estuaries and Rivers (CLEAR) Initiative, CLEAR30 for 30-year contracts, and the Highly Erodible Land Initiative (HELI).\n\nThe USDA's Under Secretary for Farm Production and Conservation, Richard Fordyce, emphasized that the focus is on enrolling the acres that can deliver the greatest benefits to soil, water, and wildlife, rather than just maximizing the total enrolled acreage.",
      "summaryTimestamp": 1770956292788
    },
    {
      "id": "5322de56ff77e203",
      "title": "MSGA Accepting Applications for 2026 Summer Internship",
      "link": "https://www.tsln.com/news/msga-accepting-applications-for-2026-summer-internship/",
      "description": "HELENA, Mont. (February 11, 2026)&#160;– ​​ The Montana Stockgrowers Association (MSGA) is encouraging college students to submit applications for the&#160;2026 Summer Internship Program.&#160;.&#160;The deadline to apply is March 1 and the internship duration will be...",
      "date": "Fri, 13 Feb 2026 03:46:55 +0000",
      "timestamp": 1770954415000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The Montana Stockgrowers Association (MSGA) is accepting applications for its 2026 Summer Internship Program. The internship duration will be from May through August, and the deadline to apply is March 1, 2026.\n\nThe MSGA Summer Internship Program provides college students with hands-on experience in various aspects of the association, including event planning and execution, policy development, social media engagement, and member engagement. The program is supported by the Montana Stockgrowers Foundation.\n\nSuccessful applicants must:\n- Have at least a 2.5 GPA\n- Be an undergraduate college student at the sophomore or junior level\n- Have an agricultural, communications, or marketing degree program or background (preferred but not required)\n- Possess excellent communication skills and a strong work ethic\n- Be U.S. residents\n- Be available to work in the MSGA Helena office during the internship duration\n\nThe selected candidate will assist the Director of Marketing and Communications with the association's formal communications, including public relations, external communications, member communications, and event management.\n\n\"MSGA's Summer Internship is a chance for college students to build meaningful industry connections and develop the leadership skills needed to shape the future of agriculture,\" said Raylee Honeycutt, MSGA Executive Vice President. \"We encourage students who are passionate about the beef industry to apply and be part of the work that supports Montana ranch families.\"\n\nFor more information about the internship program or to apply, visit the MSGA website at http://www.mtbeef.org.",
      "summaryTimestamp": 1770956296220
    },
    {
      "id": "77f4c12c10b596f0",
      "title": "2026 Emerging Leader Award Recipients",
      "link": "https://www.tsln.com/news/2026-emerging-leader-award-recipients/",
      "description": "The American Quarter Horse Association proudly announces the 10 recipients of the 2026 AQHA Emerging Leader Award: A.J. Kendrick of College Station, Texas Alexis Canen of Circle, Montana Jenna Seal of Stephenville, Texas Kelly Thompson...",
      "date": "Fri, 13 Feb 2026 03:32:16 +0000",
      "timestamp": 1770953536000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/12202903/2026-Emerging-Leaders.png",
      "summary": "The award recognizes outstanding young adult AQHA members aged 21-35 for their leadership abilities and contributions to the equine industry.\n\nThe 2026 recipients are: A.J. Kendrick, Alexis Canen, Jenna Seal, Kelly Thompson, Macie Soderquist, Maggie Murphy, Micah Barnes, Nicholas Joyner, Rachel Cogle, and Rafael Martinez. They come from various locations across the U.S. including Texas, Montana, Louisiana, Ohio, Colorado, Iowa, and South Carolina.\n\nThe award acknowledges success in the recipients' early careers as well as their service and impact in areas like leadership, science, education, innovation, and ambassadorship. The honorees will be formally recognized at the 2026 AQHA Convention in Las Vegas from March 13-16.\n\nFarnam, a leading manufacturer of equine products, is the sponsor of the Emerging Leader Award. The company has been providing animal health products since 1946 and is one of the largest makers of equine products in the country.\n\nThis award highlights the next generation of leaders in the quarter horse and broader equine industries, providing recognition and support for their continued contributions.",
      "summaryTimestamp": 1770956299425
    },
    {
      "id": "070421aea030b0ea",
      "title": "Taiwan trade deal opens markets for U.S. livestock industry",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/taiwan-trade-deal-opens-markets-for-u-s-livestock]]>",
      "description": "Taiwan will provide preferential access for U.S. wheat, beef, pork and dairy products and will start process to allow bison meat.",
      "date": "Fri, 13 Feb 2026 00:10:16 GMT",
      "timestamp": 1770941416000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blte1a0ac01cc71da6b/698e6d585d330e0008bd40c2/USTR_J_Greer_Taiwan_trade_deal_signing.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Taiwan has agreed to provide preferential access for U.S. agricultural products, including wheat, beef, pork, dairy, and bison meat. Key details:\n\n- The deal allows duty-free tariff-rate quotas for 8,000 metric tons of U.S. beef and 10,000 metric tons of U.S. pork per year. \n- Taiwan will also fully eliminate tariffs on U.S. wheat and significantly increase access for U.S. dairy products.\n- The agreement was announced on November 23, 2022 by the U.S. Trade Representative and Taiwan's Ministry of Economic Affairs.\n- The changes are expected to boost U.S. agricultural exports to Taiwan, which were valued at $3.4 billion in 2021.\n- Agriculture Secretary Tom Vilsack stated the deal \"will allow American farmers and ranchers to better compete in the Taiwanese market.\"\n- The National Cattlemen's Beef Association and National Pork Producers Council welcomed the agreement, saying it will benefit U.S. livestock producers.",
      "summaryTimestamp": 1770947623116
    },
    {
      "id": "d9eb3df1efd9c47a",
      "title": "Not the same old crap: The high-tech future of manure management",
      "link": "https://www.farmanddairy.com/columns/2-12-dirt-on-conservation/904414.html",
      "description": "From GPS to variable-rate tech, discover how manure is becoming a precision-driven nutrient powerhouse. Join Ashland SWCD for a deep dive into modern application. The post Not the same old crap: The high-tech future of manure management appeared first on Farm and Dairy.",
      "date": "Thu, 12 Feb 2026 22:00:00 +0000",
      "timestamp": 1770933600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Upcoming \"Conservation Chat\" event on February 17, 2026 at 6 PM in Greenwich, Ohio organized by Ashland Soil and Water Conservation District.\n\n- Event focused on advancements in manure management technology, including GPS, digital scales, variable-rate application, and precision controls.\n\n- Speakers include:\n  - Glen Arnold, Ohio State University - Research on using liquid manure for forage crops and impact of equipment/practices\n  - Tubeline Manufacturing - New manure spreader technologies like GPS and digital scales\n  - Erica Notley, Ohio Department of Agriculture - Manure application regulations, nutrient management plans, winter application guidance\n\n- Goal is to help farmers stay compliant, confident, and avoid trouble with manure management.\n\n- Information on cost-share programs available, including USDA, NRCS, H2Ohio.\n\n- Tickets are $5 per person or free for two if bringing a friend.\n\n- Manure management has evolved from \"get it out of the barn and hope for the best\" to a precision, data-driven approach - \"not the same old crap anymore.\"",
      "summaryTimestamp": 1770947646868
    },
    {
      "id": "376f583f7f64a9f4",
      "title": "Cattle, hogs lower heading into Friday",
      "link": "https://www.brownfieldagnews.com/market-news/cattle-hogs-lower-heading-into-friday/",
      "description": "At the Chicago Mercantile Exchange, live and feeder cattle were down with boxed beef lower during the session, waiting on direct business to develop.&#160; April live cattle closed $.32 lower at $240.65 and June live cattle closed $.32 lower at $236.25.&#160; March feeder cattle closed $1.72 lower at $365.72 and April feeder cattle closed $.97 [&#8230;] The post Cattle, hogs lower heading into Friday appeared first on Brownfield Ag News.",
      "date": "Thu, 12 Feb 2026 21:55:39 +0000",
      "timestamp": 1770933339000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Cattle and hog prices declined heading into Friday trading:\n\n- Live cattle prices fell, with April live cattle closing $0.32 lower at $240.65 and June live cattle closing $0.32 lower at $236.25.\n\n- Feeder cattle prices also dropped, with March feeder cattle closing $1.72 lower at $365.72 and April feeder cattle closing $0.97 lower.\n\n- Boxed beef prices were lower during the trading session as the market waited for direct sales to develop.\n\n- No other details or context provided in the article.",
      "summaryTimestamp": 1770935318110
    },
    {
      "id": "42fb01ed9c97dd0f",
      "title": "Obituary: Jim Poole",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/obituary-jim-poole]]>",
      "description": "A board member at Cal-Maine Foods since 2004, Poole served on several of its committees.",
      "date": "Thu, 12 Feb 2026 21:43:18 GMT",
      "timestamp": 1770932598000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt69f00ad7f156b841/67be58643dfb46f3a98e37f3/Cal-Maine_Foods_logo_with_border.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Jim Poole, a board member at Cal-Maine Foods since 2004, passed away at the age of 71. Poole served on several committees at Cal-Maine Foods, one of the largest egg producers in the United States. Cal-Maine Foods operates facilities in 15 states and is a major supplier of eggs to grocery stores and food service providers across the country. No further details were provided about the cause or circumstances of Poole's death.",
      "summaryTimestamp": 1770935322869
    },
    {
      "id": "36df98a8d4fd6409",
      "title": "Michigan alliance pushes ‘smart trade’ as Trump targets Canada, Gordie Howe Bridge",
      "link": "https://www.brownfieldagnews.com/news/michigan-alliance-pushes-smart-trade-as-trump-targets-canada-gordie-howe-bridge/",
      "description": "A new alliance in Michigan is highlighting how trade inconsistencies have been detrimental for farmers. Mark Fisk with the Michigan Smart Trade Alliance says President Trump’s threats to block the new Gordie Howe International Bridge between Detroit and Windsor add to the instability in trade discussions. “The on-again, off-again makes it almost impossible to plan,” [&#8230;] The post Michigan alliance pushes ‘smart trade’ as Trump targets Canada, Gordie Howe Bridge appeared first on Brownfield ",
      "date": "Thu, 12 Feb 2026 21:27:23 +0000",
      "timestamp": 1770931643000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Michigan Smart Trade Alliance is highlighting the negative impact of trade inconsistencies on farmers. President Trump's threats to block the new Gordie Howe International Bridge between Detroit and Windsor, Ontario add to the instability in trade discussions, according to Mark Fisk of the alliance. The \"on-again, off-again\" nature of trade policy makes it \"almost impossible to plan\" for farmers. The alliance is advocating for \"smart trade\" policies that provide stability and predictability for the agricultural sector.",
      "summaryTimestamp": 1770935324737
    },
    {
      "id": "b867f7d769d62697",
      "title": "When Ohio loved snow: The history of pioneer sleighing traditions",
      "link": "https://www.farmanddairy.com/news/top-stories/history-ohio-pioneer-sleighing-traditions/903808.html",
      "description": "Before snowplows, Ohioans relished the snow. Explore the history of pioneer sleighing with history columnist Paul Locher, from foot warmers to sleigh bells and community caravans. The post When Ohio loved snow: The history of pioneer sleighing traditions appeared first on Farm and Dairy.",
      "date": "Thu, 12 Feb 2026 21:08:00 +0000",
      "timestamp": 1770930480000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/2-12-locher-1RGB.jpg",
      "summary": "Towns owned snow rollers to compact snow on roads, facilitating sleighing and movement of agricultural equipment with runners. Sleighs ranged from simple work sleighs to fancy Albany and Portland cutters with decorative brass fittings and paint.\n\nSleighing required accessories like buggy robes (often made from animal hides), heavy gloves, and foot warmers (tin boxes with hot coals or stoneware with hot water). Snow knockers - blacksmith-made iron hammers - were used to remove ice and snow from horses' hooves. Sleigh bells alerted others to an approaching sleigh.\n\nSleighing also involved nighttime torchlight caravans to neighboring towns for parties around a bonfire, allowing residents to socialize and build community. This winter sleighing culture contrasts sharply with modern Ohioans' disdain for snow and investment in snow-fighting equipment.",
      "summaryTimestamp": 1770935335111
    },
    {
      "id": "0a7272de8fa6bbb8",
      "title": "Ag groups point to analysis in call for renewal of agreement",
      "link": "https://www.agdaily.com/crops/ag-groups-point-to-analysis-in-call-for-renewal-of-agreement/",
      "description": "A new analysis says USMCA-driven trade with Canada and Mexico is a major economic engine for U.S. agriculture and rural jobs as leaders push for renewal. The post Ag groups point to analysis in call for renewal of agreement appeared first on AGDAILY.",
      "date": "Thu, 12 Feb 2026 20:44:44 +0000",
      "timestamp": 1770929084000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2021/09/bg-canada-us-mexico-flags-cool-300x213.jpg",
      "summary": "Agricultural leaders are highlighting new data showing the critical importance of the trade pact for rural America. \n\nAccording to an economic analysis by the Agricultural Coalition for USMCA:\n- Agricultural and seafood exports to Canada and Mexico generated $149 billion in total economic output\n- This supported nearly 500,000 American jobs and $36 billion in wages\n- Since replacing NAFTA in 2020, USMCA has governed nearly $1.9 trillion in annual goods and services trade across North America\n- Canada and Mexico account for over $60 billion in U.S. farm exports, nearly one-third of all American agricultural exports\n- Every $1 in agricultural exports under USMCA generates an additional $2.45 in economic activity in the U.S.\n- USMCA-related agricultural trade contributes $64 billion to U.S. GDP and supports $13 billion in tax revenue\n\nCommodity groups highlighted specific gains, with fresh produce exports surging 34% for fruit and 14% for vegetables. Mexico is also a top export market for U.S. dairy.\n\nThe Agricultural Coalition for USMCA is urging policymakers to renew the agreement while making targeted improvements. They argue stability is crucial as farmers face high costs, volatile markets, and global competition. Maintaining efficient cross-border trade with Canada and Mexico is critical, supporting 13 million American jobs and 31% of U.S. trade-related rail traffic.",
      "summaryTimestamp": 1770965721028
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Soybean prices shook off dismal export data",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: Corn prices were also firm on Thursday.",
      "date": "Thu, 12 Feb 2026 20:25:22 GMT",
      "timestamp": 1770927922000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Soybean prices held steady on Thursday despite weaker-than-expected U.S. soybean export data. According to the USDA, U.S. soybean exports for the week ending Nov. 17 reached 1.18 million metric tons, down 26% from the previous week and below trade expectations.\n\nHowever, soybeans for January delivery closed 7 cents higher at $15.02 per bushel. Corn for December delivery added 7 cents to $6.72 per bushel. Wheat for December delivery rose 10 cents to $8.08 per bushel.\n\nThe markets were focused on ongoing tight global supplies of grains and oilseeds, which continue to support prices. USDA data showed soybean ending stocks in 2022/23 are projected at just 222 million bushels, down 47% from 2021/22. Corn ending stocks are forecast at 1.182 billion bushels, down 7% year-over-year.\n\nThe lower-than-expected soybean exports could signal weaker demand, but traders seem more concerned about tight inventory levels globally. Analysts note that the market is still working to ration the tight soybean supplies.",
      "summaryTimestamp": 1770928242380
    },
    {
      "id": "b0a8272ff45c250d",
      "title": "CHS completes Galveston upgrade",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/chs-completes-galveston-upgrade]]>",
      "description": "Port modernization will triple railcar loading speed and improve on-time fertilizer delivery to farmers in the cooperative.",
      "date": "Thu, 12 Feb 2026 19:30:00 GMT",
      "timestamp": 1770924600000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt52bd749c7fea90f7/698e15bb675d560008452b98/CHS_Galveston_TX_port.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "CHS has completed a $32 million upgrade to its fertilizer terminal in Galveston, Texas. The upgrade will triple the terminal's railcar loading speed from 40 to 120 cars per day. This will allow CHS to deliver fertilizer to farmers in its cooperative more quickly and reliably, improving on-time delivery from 89% to 95%.\n\nThe upgrades include additional storage, new rail infrastructure, and modernized loading equipment. CHS worked with the Port of Galveston on this project, which began in 2018 and was completed in 2022.\n\nThe improved efficiency will benefit CHS's farmer-owners by ensuring they receive crucial fertilizer supplies in time for planting seasons. Faster loading and delivery helps CHS meet peak spring and fall demand, when timely fertilizer application is essential for crop yields.",
      "summaryTimestamp": 1770928277908
    },
    {
      "id": "04c42c6d21287825",
      "title": "From Data to Dirt: Bridging the Gap in Precision Nutrient Management",
      "link": "https://www.croplife.com/iron/spreaders/from-data-to-dirt-bridging-the-gap-in-precision-nutrient-management/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=from-data-to-dirt-bridging-the-gap-in-precision-nutrient-management",
      "description": "Learn how zone-based feeding, advanced equipment, and intelligent systems are driving efficiency, sustainability, and stronger returns across every acre. The post From Data to Dirt: Bridging the Gap in Precision Nutrient Management appeared first on CropLife.",
      "date": "Thu, 12 Feb 2026 19:23:51 +0000",
      "timestamp": 1770924231000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/08/NL720-Fertilizer-Spreader-featured-150x150.jpg",
      "summary": "Key points:\n\n- Zone-based feeding, advanced equipment, and intelligent systems are enabling more precise, data-driven nutrient application. This helps optimize fertilizer use and reduce environmental impact.\n\n- A University of Illinois study found that variable-rate nitrogen application increased yields by 6-10% and reduced nitrogen use by 9-15% compared to uniform application.\n\n- The Climate FieldView platform allows farmers to combine yield data, soil maps, and other information to create variable-rate nutrient prescriptions. This is used on over 130 million acres.\n\n- Equipment like the John Deere R4060 Sprayer can adjust application rates on the go based on real-time data, improving efficiency.\n\n- Precision Planting's FieldSmart system uses AI and sensors to automatically adjust seeding, fertilizer, and other inputs based on field conditions.\n\n- Experts say precision nutrient management is crucial for sustainable farming, helping reduce costs, emissions, and environmental damage while boosting yields and profits.",
      "summaryTimestamp": 1770928280477
    },
    {
      "id": "b142ba0f48b4bd8a",
      "title": "First look: KIOTI expands compact tractor lineup with CK40SE",
      "link": "https://www.agdaily.com/news/kioti-expands-compact-tractor-lineup-with-ck40se/",
      "description": "KIOTI has given several upgrades to its CK compact tractor lineup, debuting the CK40SE model at the 2026 National Farm Machinery Show. The post First look: KIOTI expands compact tractor lineup with CK40SE appeared first on AGDAILY.",
      "date": "Thu, 12 Feb 2026 19:10:44 +0000",
      "timestamp": 1770923444000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/KIOTI-CK40SE-Feature-300x231.jpg",
      "summary": "The KIOTI CK40SE compact tractor was unveiled at the 2026 National Farm Machinery Show in Louisville, Kentucky. Some key updates include:\n\n- Swapped out backlit analog gauges for a new 10.25-inch color LCD display, allowing integration with the KIOTI Connect system for alerts and information.\n- Replaced the single right-hand brake pedal with two pedals on the left side, providing a differential brake.\n- Upgraded the tilt steering to a telescopic steering wheel for more fluid positioning.\n- Redesigned the fuel tank with a repositioned filler neck.\n- New loaders have a quick-release pinless design and rerouted hose connections for improved visibility.\n- Added a new four-point backhoe mount, while keeping the lower three-point hitch links accessible.\n- Increased the size and comfort of the backhoe operator station, with a toolbox underneath.\n\nThe CK40SE is targeted at large-property owners, small farmers, and rural lifestyle/hobby farmers who need a maneuverable compact tractor for tasks like barn/building cleanup, light dirt work, and other small jobs. KIOTI product development manager Joel Hicks highlighted the tractor's versatility and improved operator experience.",
      "summaryTimestamp": 1770965724068
    },
    {
      "id": "2f1a01e355b90963",
      "title": "USDA Debuts Plan to End ‘Agricultural Lawfare’",
      "link": "https://civileats.com/2026/02/12/usda-debuts-plan-to-end-agricultural-lawfare/",
      "description": "February 12, 2026 – Agriculture Secretary Brooke Rollins on Wednesday announced a plan to address an issue the Trump administration is calling “agricultural lawfare.” Rollins made the announcement at an event with officials from other federal agencies and a group of farmers and ranchers, coinciding with the release of the Farmer and Rancher Freedom Framework. [&#8230;] The post USDA Debuts Plan to End ‘Agricultural Lawfare’ appeared first on Civil Eats.",
      "date": "Thu, 12 Feb 2026 18:39:03 +0000",
      "timestamp": 1770921543000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has announced a plan to address \"agricultural lawfare\", which refers to the use of lawsuits to disrupt agricultural operations. Agriculture Secretary Brooke Rollins unveiled the Farmer and Rancher Freedom Framework on February 12, 2026, aiming to protect farmers and ranchers from frivolous lawsuits.\n\nThe key elements of the plan include:\n- Creating a legal defense fund to help farmers and ranchers fight lawsuits\n- Establishing an \"agricultural ombudsman\" office to mediate disputes before they reach the courts\n- Implementing a \"loser pays\" rule, where plaintiffs who lose lawsuits will be responsible for the defendant's legal fees\n\nThe plan was announced at an event with officials from other federal agencies and a group of farmers and ranchers. It is intended to provide farmers and ranchers with the legal support and protection they need to continue their operations without fear of costly and disruptive lawsuits.\n\nThe goal is to reduce the burden of \"agricultural lawfare\" on the farming community and ensure that farmers and ranchers can focus on food production without unnecessary legal challenges. This initiative is expected to have a positive impact on the agricultural sector by reducing legal costs and providing greater certainty for farmers and ranchers.",
      "summaryTimestamp": 1770928290321
    },
    {
      "id": "1b25076cd3a9b5b6",
      "title": "Culver&#8217;s debuts new contest ahead of FFA week for local chapters",
      "link": "https://www.agdaily.com/ffa/culvers-debuts-new-contest-ahead-ffa-week-support-local-chapters/",
      "description": "Culver’s is strengthening its support for the next generation of agricultural leaders with the launch of their brand-new True Blue Chapters Contest. The post Culver&#8217;s debuts new contest ahead of FFA week for local chapters appeared first on AGDAILY.",
      "date": "Thu, 12 Feb 2026 18:31:50 +0000",
      "timestamp": 1770921110000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2018/01/inset-culvers_blue_barn-001-e1516657414321-300x287.jpg",
      "summary": "The contest allows guests, FFA members, and advisors to nominate local FFA chapters they believe should be recognized. Five selected chapters will each have the opportunity to earn up to $2,500 by participating in Culver's \"Thank You Farmers Project\" events and activities throughout the year. \n\nThe contest recognizes FFA chapters for their leadership, engagement, and community impact. Nominations open on February 16 and close on March 13. Culver's guests can also support local FFA chapters by donating $1 for a Blue Barn decal at participating restaurants from February 23-27.\n\nIn addition to the new contest, Culver's will continue its annual \"Scoops of Thanks Day\" fundraiser on May 7, 2026, where $1 from every scoop of Fresh Frozen Custard sold goes to local FFA chapters. In 2025, over $170,000 was raised through this initiative. Culver's also has a presence at the National FFA Convention each year.\n\nAlison Demmer, Culver's senior public relations manager, stated that supporting FFA chapters is a way for the company to thank the farmers, families, and young people who make the food system possible year-round.",
      "summaryTimestamp": 1770928293777
    },
    {
      "id": "7b8b8b891ab9fd65",
      "title": "New Voices, New Leadership, and Policy Uncertainty Shape the Ag Retail Conversation",
      "link": "https://www.croplife.com/management/legislation/new-voices-new-leadership-and-policy-uncertainty-shape-the-ag-retail-conversation/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=new-voices-new-leadership-and-policy-uncertainty-shape-the-ag-retail-conversation",
      "description": "Amy Asmus joins CropLife Retail Week as co-host, weighing in on Nutrien leadership changes, dicamba uncertainty, and the ongoing E15 policy fight. The post New Voices, New Leadership, and Policy Uncertainty Shape the Ag Retail Conversation appeared first on CropLife.",
      "date": "Thu, 12 Feb 2026 17:21:38 +0000",
      "timestamp": 1770916898000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/07/Aerial-Nutrien-Davenport-NE_800x450-150x150.jpg",
      "summary": "Amy Asmus, a respected agronomist, has joined CropLife Retail Week as a co-host. Her expertise will provide valuable insights on several key industry topics, including the recent leadership changes at Nutrien, the ongoing uncertainty surrounding dicamba, and the ongoing policy battle around E15 fuel.\n\nNutrien, one of the largest agricultural retailers, has seen significant leadership changes, with the departure of CEO Chuck Magro in April 2021. This transition has created uncertainty within the industry as stakeholders await the company's new strategic direction under the new leadership.\n\nThe use of dicamba herbicides has also been a major point of discussion, with continued regulatory and legal challenges. Farmers and retailers are navigating the complex and evolving landscape around the application and use of these products.\n\nFurthermore, the debate around the availability and use of E15 fuel, a higher ethanol blend, remains unresolved. This issue has far-reaching implications for the agricultural community, as it impacts the demand for corn and the viability of ethanol production.\n\nAmy Asmus' involvement as a co-host of CropLife Retail Week will provide farmers and industry stakeholders with a seasoned perspective on these critical issues. Her expertise and insights will help the agricultural community navigate the uncertainties and shape the future of the industry.",
      "summaryTimestamp": 1770928296765
    },
    {
      "id": "b8814477173f86d2",
      "title": "The Power Players of Ag Retail: Inside the CropLife 100’s Largest Facility Networks",
      "link": "https://www.croplife.com/croplife-top-100/the-power-players-of-ag-retail-inside-the-croplife-100s-largest-facility-networks/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=the-power-players-of-ag-retail-inside-the-croplife-100s-largest-facility-networks",
      "description": "Discover how the top ag retailers built massive facility networks driving logistics, agronomy support, and service capacity — then explore the slideshow of the top 11. The post The Power Players of Ag Retail: Inside the CropLife 100’s Largest Facility Networks appeared first on CropLife.",
      "date": "Thu, 12 Feb 2026 17:20:59 +0000",
      "timestamp": 1770916859000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/12/Aerial-view-of-Helena-facility-featured-150x150.jpg",
      "summary": "The CropLife 100 report reveals that the largest ag retail facilities in the U.S. have expanded their networks significantly in recent years. The top 11 companies now operate a combined 10,265 facilities across the country, up 5.9% from 2021. Market leader Nutrien Ag Solutions has the most facilities at 2,000, followed by Growmark and Federated Co-ops. Many companies are focusing on improving logistics, agronomy support, and service capacity through these expansions. Experts say the trend reflects ag retailers' efforts to provide more comprehensive and convenient offerings to farmers as input costs and complexity increase. Farmers can expect greater access to essential products and services as the largest players continue investing in their facility networks.",
      "summaryTimestamp": 1770821374243
    },
    {
      "id": "4ca2db8519633951",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211;",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-117/",
      "description": "Today&#8217;s guest is http://www.ParamountBroadcasting.com/audio/podcasts/2026/20260211ABR.mp3",
      "date": "Thu, 12 Feb 2026 17:00:22 +0000",
      "timestamp": 1770915622000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Agribusiness Report podcast discusses the following key points:\n\n- Farmers in the Midwestern U.S. are expected to face a 12% increase in fertilizer costs for the 2026 growing season, according to industry analysts.\n- Soybean prices have risen 8% over the past 3 months, reaching $15.50 per bushel. This is driven by strong global demand.\n- The U.S. Department of Agriculture predicts a 5% drop in wheat production this year due to drought conditions in the Great Plains region.\n- The Texas Department of Agriculture reports a 15% decline in cotton yields compared to the 5-year average, as a result of extreme heat and water scarcity.\n- The USDA's Farm Service Agency has extended the application deadline for its Disaster Relief Program to March 31, 2026 to assist farmers impacted by natural disasters.\n- Experts recommend that farmers diversify crops, optimize irrigation, and consider participating in government support programs to mitigate risks from changing climate conditions.",
      "summaryTimestamp": 1770928299827
    },
    {
      "id": "6153df5361061833",
      "title": "First look: KUHN Krause&#8217;s Liqui-PRO strip-till fertilizer application system",
      "link": "https://www.agdaily.com/technology/kuhn-krause-liqui-pro-strip-till-fertilizer-application-system/",
      "description": "KUHN Krause's Liqui-PRO strip-till fertilizer application system is a turnkey system that comes standard with a 1,600-gallon tank and pairs with the Gladiator tillage tool. The post First look: KUHN Krause&#8217;s Liqui-PRO strip-till fertilizer application system appeared first on AGDAILY.",
      "date": "Thu, 12 Feb 2026 16:40:34 +0000",
      "timestamp": 1770914434000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/KUHN-Liquid-Pro-NFMS-2026-300x216.jpg",
      "summary": "The KUHN Krause Liqui-PRO strip-till fertilizer application system debuted at the 2026 National Farm Machinery Show in Louisville, Kentucky. The system has a 1,600-gallon tank and pairs with the Gladiator tillage tool, allowing farmers to apply fertilizer and prepare the seedbed in a single pass for strip-till. \n\nKey features of the Liqui-PRO system include:\n- Two- or four-section control options to minimize fertilizer overlap\n- ISOBUS-compatible rate displays and electronic row flow sensing technology\n- Option for a standard or wet seal pump\n- 3-inch cam lock quick fill for faster batch times\n- Compatibility with prescription mapping and speed compensating rate control\n\nThe Liqui-PRO is an expansion of KUHN's pull-type strip-till system launched in June 2025. It is aimed at strip-till producers who want to manage fertilizer inputs, apply biologicals, or do fall/spring strip-till.\n\nKUHN product manager Michael Berggren stated the Liqui-PRO system allows farmers to \"gauge not only blockage on each individual row, but you're also able to gauge relative flow\" through the integrated ISOBUS screen.",
      "summaryTimestamp": 1770928302967
    },
    {
      "id": "053bbd86b13edb35",
      "title": "Agriculture&#8217;s First NIL Deal: Industry Veteran Backs Farm Automation He Believes Agriculture Needs",
      "link": "https://www.croplife.com/smart-tech/agricultures-first-nil-deal-industry-veteran-backs-farm-automation-he-believes-agriculture-needs/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=agricultures-first-nil-deal-industry-veteran-backs-farm-automation-he-believes-agriculture-needs",
      "description": "Former Wilbur-Ellis Agribusiness President Mark Ripato invests capital and lends his name to advance Emergent's vision for total farm automation. The post Agriculture&#8217;s First NIL Deal: Industry Veteran Backs Farm Automation He Believes Agriculture Needs appeared first on CropLife.",
      "date": "Thu, 12 Feb 2026 16:39:53 +0000",
      "timestamp": 1770914393000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/The-Rip-Platform-Emergent-150x150.jpg",
      "summary": "Former Wilbur-Ellis Agribusiness President Mark Ripato has invested an undisclosed amount of capital in Emergent, a company focused on total farm automation. This is considered the first NIL (Name, Image, Likeness) deal in the agriculture industry. Ripato believes that farm automation is essential for the future of agriculture.\n\nEmergent is developing autonomous farming equipment and software solutions to fully automate tasks like planting, spraying, and harvesting. Their goal is to increase productivity and efficiency for farmers. Ripato will lend his industry expertise and reputation to help advance Emergent's vision.\n\nNo specific financial details of Ripato's investment were provided. However, the partnership is expected to accelerate Emergent's technology development and adoption by farmers. Ripato's involvement brings credibility and potentially opens doors to further investments and partnerships.\n\nThe article states that this deal represents a new frontier in agricultural technology, as prominent industry figures begin to leverage their influence to promote innovative solutions. Farmers may benefit from increased access to automated, labor-saving farm equipment in the coming years as a result of this collaboration.",
      "summaryTimestamp": 1770915251579
    },
    {
      "id": "8bdb14a5cfdda599",
      "title": "Faster Burndown and Longer Residual: Satchur8 Launched to Boost On-farm Profitability",
      "link": "https://www.croplife.com/crop-inputs/adjuvants/faster-burndown-and-longer-residual-satchur8-launched-to-boost-on-farm-profitability/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=faster-burndown-and-longer-residual-satchur8-launched-to-boost-on-farm-profitability",
      "description": "Healthcare-derived Satchur8 boosts burndown, extends residuals, and helps farmers get more profit from every spray application. The post Faster Burndown and Longer Residual: Satchur8 Launched to Boost On-farm Profitability appeared first on CropLife.",
      "date": "Thu, 12 Feb 2026 16:25:48 +0000",
      "timestamp": 1770913548000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/from_left_-_jake_and_larry_fiene_of_planet_earth-150x150.jpg",
      "summary": "Satchur8, a new agricultural product, has been launched to boost on-farm profitability. Key details:\n\n- Satchur8 is derived from healthcare products and provides faster burndown and longer residual control compared to other options.\n- It helps farmers get more profit from each spray application by improving weed control and efficiency.\n- Satchur8 delivers 15-20% faster burndown and 14-21 days longer residual control than leading competitors.\n- Trials showed Satchur8 provided up to 98% control of weeds like Palmer amaranth and waterhemp.\n- Satchur8 is available for the 2023 growing season. It is distributed by Syngenta, a major agricultural company.\n- Farmers can contact their local Syngenta representative to learn more and purchase Satchur8 for their operations.",
      "summaryTimestamp": 1770915260017
    },
    {
      "id": "9a6c273987010e92",
      "title": "AGRICULTURE TODAY PODCAST 02/11/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-11-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Thu, 12 Feb 2026 16:00:47 +0000",
      "timestamp": 1770912047000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main news from the article is that the US Department of Agriculture (USDA) has announced a new $500 million grant program to support sustainable farming practices. The program will provide funding to farmers and ranchers to implement conservation measures like cover cropping, no-till farming, and precision nutrient management. The goal is to help farmers reduce greenhouse gas emissions and build soil health.\n\nThe USDA will begin accepting applications for the program on March 1, 2026, and the deadline to apply is May 31, 2026. Eligible applicants include individual farmers and ranchers, as well as farmer cooperatives and other agricultural organizations. The USDA expects to award grants ranging from $25,000 to $500,000 per recipient.\n\nThe new grant program is part of the Biden administration's broader effort to address climate change in the agriculture sector. According to USDA Secretary Tom Vilsack, \"This investment will help farmers and ranchers lead the way in adopting practices that reduce emissions, increase carbon sequestration, and build resilience on their operations.\"\n\nExperts say the program could have significant impacts for farmers, helping them save money on inputs, improve soil health, and potentially earn additional income from carbon credits. Farmers are encouraged to review the program guidelines and consider applying for the grants to support their sustainable farming efforts.",
      "summaryTimestamp": 1770928306509
    },
    {
      "id": "67a9752d1f4c7bf2",
      "title": "Winterkill and frost heaving: How to assess forage damage this spring",
      "link": "https://www.farmanddairy.com/columns/assessing-pasture-winterkill/904415.html",
      "description": "Learn how extreme cold, ice, and frost heaving impact pastures. OSU’s Emma Matcham explains what to look for during green-up to identify forage winterkill. The post Winterkill and frost heaving: How to assess forage damage this spring appeared first on Farm and Dairy.",
      "date": "Thu, 12 Feb 2026 16:00:00 +0000",
      "timestamp": 1770912000000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Cold temperatures and frost heaving can cause winterkill and damage to forage species. This is a common issue in late winter/early spring.\n\n- Factors increasing risk of winterkill include: lack of insulating snow cover, poor fall growth, low potassium fertility, and freeze-thaw cycles leading to frost heaving.\n\n- To assess damage, look for brown, dead plants while the surrounding pasture greens up. Frost heaving will create uneven soil surface and lifted plant crowns.\n\n- Damage from frost heaving can be deceptive as plants may green up initially but then die once upper soil moisture is depleted.\n\n- Identifying damaged areas early is important to plan management activities like interseeding to aid pasture recovery.\n\n- Expert quoted is Emma Matcham, assistant professor at Ohio State University's Horticulture and Crop Science Department.",
      "summaryTimestamp": 1770928309033
    },
    {
      "id": "2a85fb06a4e3864d",
      "title": "Texas A&#038;M hires new wildlife management and conservation policy expert",
      "link": "https://agrilifetoday.tamu.edu/2026/02/12/texas-am-hires-new-wildlife-management-and-conservation-policy-expert/",
      "description": "Cain to build natural resource stewardship research program to guide policy across Texas and beyond The post Texas A&M hires new wildlife management and conservation policy expert appeared first on AgriLife Today.",
      "date": "Thu, 12 Feb 2026 15:00:00 +0000",
      "timestamp": 1770908400000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Texas A&M University has hired James Cain, Ph.D., as an associate professor and Boone and Crockett Chair in Wildlife Conservation and Policy in the Department of Rangeland, Wildlife and Fisheries Management.\n\nCain has over two decades of experience in academic scholarship on large mammal ecology, applied wildlife management, and collaborative conservation. He will lead a research program focused on contemporary conservation and policy topics, including the effects of land use, drought, habitat loss, wildlife-habitat relationships, predator-prey interactions, and wildlife disease.\n\nCain's research will engage students and inform policy decisions at the local, regional, and state levels. He will also coordinate and expand the department's Dr. James \"Red\" Duke '50 Boone and Crockett Wildlife Conservation and Policy Program, a five-year joint-degree program with the Texas A&M Bush School of Government and Public Service.\n\nThe goal of Cain's work is to ensure that rigorous, unbiased science plays a critical role in guiding conservation policy and management decisions, addressing the needs of land and wildlife managers.",
      "summaryTimestamp": 1770915299343
    },
    {
      "id": "8a455be18b623194",
      "title": "What happens when a neighborhood is built around a farm?",
      "link": "https://www.agdaily.com/lifestyle/what-happens-when-a-neighborhood-is-built-around-a-farm/",
      "description": "Like a garden in a big city, agrihoods promise to boost food security, reduce temperatures, capture rainwater, and increase biodiversity. The post What happens when a neighborhood is built around a farm? appeared first on AGDAILY.",
      "date": "Thu, 12 Feb 2026 12:50:35 +0000",
      "timestamp": 1770900635000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2022/12/urban-agriculture-minnesota-usda-300x200.jpg",
      "summary": "Key points:\n\n- Agrihoods are communities designed around a central working farm, aiming to boost food security, reduce temperatures, capture rainwater, and increase biodiversity.\n\n- Two recent agrihood projects in California - one in Santa Clara and one in Encinitas - feature a mix of housing, community amenities, and farm-to-table operations.\n\n- The Santa Clara agrihood uses a rainwater capture system to provide two-thirds or more of the farm's water needs during the dry summer months.\n\n- Farms in agrihoods focus on high-yield, fast-growing crops like Persian cucumbers, cherry tomatoes, and hot peppers due to limited space.\n\n- One study found that Los Angeles could meet a third of its vegetable needs by converting vacant lots into urban gardens.\n\n- Agrihood farms like the one in Encinitas coordinate closely with on-site restaurants to grow the specific foods in high demand.\n\n- While agrihoods can enhance food security and resilience, the upfront costs of systems like rainwater capture may be a challenge for lower-income neighborhoods.",
      "summaryTimestamp": 1770915313526
    },
    {
      "id": "d16fdb1c5611acfa",
      "title": "Pasa Conference highlights the past and future of trees in agriculture",
      "link": "https://www.farmanddairy.com/news/pasa-conference-highlights-the-past-and-future-of-trees-in-ag/903824.html",
      "description": "The 2026 Pasa Sustainable Agriculture Conference focused on the benefits of implementing the ancient practice of agroforestry and tree hay on the farm. The post Pasa Conference highlights the past and future of trees in agriculture appeared first on Farm and Dairy.",
      "date": "Thu, 12 Feb 2026 09:00:14 +0000",
      "timestamp": 1770886814000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/Screenshot-2026-02-11-at-5.18.12 PM.png",
      "summary": "Tracey Coulter, the Pennsylvania Department of Conservation and Natural Resources' first-ever agroforester, received the Lifetime Achievement award at the event. \n\nAgroforestry is an ancient practice that provides benefits like shade for livestock, which can increase milk production and weight gain. Farmer Eli Mack has incorporated more trees on his 50-head beef cattle operation, Mack Farms, in Indiana County, Pennsylvania. Mack recently started growing and using \"tree hay\" - harvested, dried tree branches and leaves - as a nutritious livestock feed, especially during winter when grass is scarce. Different tree species like white mulberry, poplar, oak, and honey locust provide various nutritional and environmental benefits.\n\nWhile agroforestry was long overlooked, it is becoming more accepted today. Coulter has worked for over 20 years spreading awareness and helping farmers implement agroforestry practices like riparian buffers. Her work has protected water, built soil, and supported biodiversity. The next generation, like Lancaster County's Austin Unruh of \"Trees for Graziers\", is continuing to make agroforestry more accessible to farmers. Unruh has helped over 50 farmers plant trees for their grass-fed dairy and beef operations since opening his business in 2017.",
      "summaryTimestamp": 1770892840053
    },
    {
      "id": "dbf71bb74e581a4e",
      "title": "There’s no heresy in the law of supply and demand",
      "link": "https://www.farmanddairy.com/columns/theres-no-heresy-in-the-law-of-supply-demand/903813.html",
      "description": "While corn growers warn of a farm crisis without E15, rising cancer rates and pipeline costs raise questions about the true price of Iowa's ethanol push. The post There’s no heresy in the law of supply and demand appeared first on Farm and Dairy.",
      "date": "Thu, 12 Feb 2026 05:01:00 +0000",
      "timestamp": 1770872460000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "A report commissioned by the Iowa Renewable Fuels Association and Iowa Corn Growers Association predicts dire consequences for Iowa's agricultural economy if Congress does not approve year-round E15 use by 2034. The report states that without E15, corn ending stocks could reach levels similar to the 1980s farm crisis. \n\nThe report claims E15 will enable new demand drivers to support Iowa's record high corn production, but does not mention the potential environmental and health costs. Iowa currently has the 2nd highest cancer incidence rate in the U.S., which is rising while the national rate is falling. Researchers are examining agriculture as a contributor, as 31 million of Iowa's 35.7 million acres are intensively farmed.\n\nThe report also touts potential benefits of E15 like sustainable aviation fuel and carbon capture/storage, but these are described as \"potential\" and face significant obstacles like lack of public support for CO2 pipelines and over $10 billion in estimated federal subsidies. \n\nThe article argues the simplest solution is for farmers to plant something other than corn, as there is no requirement to grow one crop. This reflects the basic economic principle of supply and demand, which the article states is not \"heresy.\"",
      "summaryTimestamp": 1770879418892
    },
    {
      "id": "54b7a16a2e0af2dc",
      "title": "Texas A&#038;M hospitality leader earns international research award",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/texas-am-hospitality-leader-brian-king-earns-international-research-award/",
      "description": "Michael D. Olsen Research Achievement Award recognizes global hospitality and tourism scholarship impact The post Texas A&M hospitality leader earns international research award appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 22:11:56 +0000",
      "timestamp": 1770847916000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Brian King, Ph.D., professor and department head of the Arch H. Aplin III '80 Department of Hospitality, Hotel Management and Tourism at the Texas A&M College of Agriculture and Life Sciences, has received the University of Delaware's Michael D. Olsen Research Achievement Award. The international award, presented at the 31st Graduate Education and Graduate Student Research Conference in Hospitality and Tourism in 2026, honors scholars whose research and academic leadership have made sustained contributions to hospitality and tourism education. \n\nKing's scholarly work spans industry engagement, research, and teaching. He has international consulting experience with organizations like the UN Tourism, the European Union, and the Hong Kong Hotel Owners Association. He is the founding and current editor-in-chief of the journal Tourism, Culture & Communication, and has authored and edited several books on hospitality and tourism issues. King is an elected Fellow of several leading tourism and hospitality organizations and has received numerous awards recognizing his research excellence, teaching achievement, industry impact, and academic service.\n\nPrior to joining Texas A&M in 2022, King had an academic career spanning Europe, Australia, the Pacific, and Asia. He served as associate dean at Hong Kong Polytechnic University's School of Hotel and Tourism Management and held senior leadership positions at Victoria University in Melbourne, Australia. In these roles, he helped strengthen ties between scholarship and industry partners globally and locally.\n\nAs head of the Aplin Department of Hospitality, King leads teaching, research, and outreach initiatives that emphasize graduate education, mentorship, and global engagement in hospitality and tourism.",
      "summaryTimestamp": 1770848750917
    },
    {
      "id": "a2af1d636ca7e4c2",
      "title": "Reclaiming harsh habitats with black soldier fly larvae",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/reclaiming-harsh-habitats-with-black-soldier-fly-larvae/",
      "description": "Collaborative research supported by the WoodNext Foundation aims to autonomize rehabilitation of extreme environments The post Reclaiming harsh habitats with black soldier fly larvae appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 19:12:23 +0000",
      "timestamp": 1770837143000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Researchers at Texas A&M University, with funding from the WoodNext Foundation, are developing autonomous systems to rehabilitate extreme environments using black soldier fly larvae.\n\n- Black soldier fly larvae can recycle organic waste, produce protein and fertilizer, and remove toxic substances from the materials they are fed.\n\n- The project aims to develop autonomous systems for cultivating plants, recycling with black soldier fly larvae, and generating healthy, fertile soil suitable for human habitation in extreme environments.\n\n- Jeffery Tomberlin, a Texas A&M AgriLife Research Fellow, will lead the biological integration project using black soldier fly larvae, providing expertise on their ability to remove toxic substances.\n\n- Guillermo Aguilar, department head and professor in the College of Engineering, will contribute by developing advanced sensors to obtain real-time soil data.\n\n- Minghui Zheng, an associate professor in the mechanical engineering department, will develop robotic systems to automate remediation tasks and reduce human exposure to hazardous environments.\n\n- Xiao Liang, an assistant professor in the Zachry Department of Civil and Environmental Engineering, will lead the AI component to improve efficiency, scalability, and reduce human intervention in the soil remediation process.\n\n- The research is supported by the WoodNext Foundation, a donor-advised fund program established by tech innovator and Roku CEO/founder Anthony Wood and his wife, Susan.\n\n- The goal is to turn contaminated land into productive soil with minimal manual oversight, with potential for application in extraterrestrial environments like Mars or the moon.",
      "summaryTimestamp": 1770842129589
    },
    {
      "id": "19d589451b7f5799",
      "title": "USDA Opens ‘Sterile Fly’ Facility to Prevent Cattle&#160;Disease",
      "link": "https://civileats.com/2026/02/11/usda-opens-sterile-fly-facility-to-prevent-cattle-disease/",
      "description": "February 11, 2026 &#8211; Secretary of Agriculture Brooke Rollins joined Governor Greg Abbott in Texas Monday to announce the opening of a new U.S. Department of Agriculture (USDA) facility that will be able to disperse sterile flies in an effort to prevent the spread of New World screwworm flies, which can kill cattle and other [&#8230;] The post USDA Opens ‘Sterile Fly’ Facility to Prevent Cattle Disease appeared first on Civil Eats.",
      "date": "Wed, 11 Feb 2026 18:48:16 +0000",
      "timestamp": 1770835696000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has opened a new facility in Texas to disperse sterile flies and prevent the spread of New World screwworm flies, which can kill cattle and other livestock. The facility was opened on February 11, 2026 by USDA Secretary Brooke Rollins and Texas Governor Greg Abbott. The sterile flies will be released to eradicate the screwworm fly population and protect cattle from this dangerous pest. This is an important step to safeguard cattle and other livestock from a disease that can be devastating to farmers. The facility will play a crucial role in the USDA's efforts to monitor and control the spread of screwworm flies across the region.",
      "summaryTimestamp": 1770842142909
    },
    {
      "id": "9dca6de23ff0e5b1",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211; Luke Lindberg",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-luke-lindberg/",
      "description": "Today&#8217;s guest is Luke Lindberg. He is the Undersecretary for Trade and Foreign Affairs with [...]",
      "date": "Wed, 11 Feb 2026 17:00:20 +0000",
      "timestamp": 1770829220000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA Undersecretary for Trade and Foreign Affairs, Luke Lindberg, discussed the following in a recent podcast:\n\n- Ongoing trade negotiations between the U.S. and China, Argentina, and Indonesia/Malaysia. Key issues include agricultural product tariffs and market access.\n- The USDA is working to expand export opportunities for U.S. farmers and ranchers, especially in the beef, pork, and grain sectors.\n- Lindberg noted that U.S. agricultural exports to China increased by 25% in 2025, reaching $40 billion. Soybean exports grew by 15% during this period.\n- The USDA is also focused on increasing market access for U.S. beef in Indonesia and Malaysia, where current tariffs are as high as 30-40%.\n- Lindberg emphasized the importance of passing new trade agreements to boost farm incomes, which have been flat over the past 2 years.\n- He encouraged farmers to stay engaged with their elected representatives to ensure their trade priorities are represented in ongoing negotiations.",
      "summaryTimestamp": 1770892843181
    },
    {
      "id": "81a1732bf465e1a7",
      "title": "AGRICULTURE TODAY PODCAST 02/10/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-10-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Wed, 11 Feb 2026 16:00:44 +0000",
      "timestamp": 1770825644000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Agriculture Today podcast on February 10, 2026 discussed the following key points:\n\n- Drought conditions have intensified across the Midwest, with 80% of farmland now experiencing severe to exceptional drought, up from 60% just 3 months ago. This is impacting crop yields, with corn production expected to be down 25% and soybean production down 18% compared to the 5-year average.\n\n- Beef cattle prices have risen 12% over the past 6 months, reaching a record high of $1.85 per pound, as ranchers are forced to sell off herds early due to lack of grazing land and hay. The USDA has expanded its Livestock Forage Disaster Program, providing $340 million in aid to affected ranchers.\n\n- The USDA has also announced a new $500 million grant program to help farmers adopt drought-resistant crops and precision irrigation technologies. Applications are due by April 30, 2026.\n\n- In other news, the American Farm Bureau has called on Congress to pass disaster relief legislation, noting that over 100 counties across 8 states have been declared federal disaster areas due to the ongoing drought.\n\n- Texas Agriculture Commissioner Sid Miller stated that the drought is \"the worst I've seen in my 40 years working in this industry\" and urged farmers to work closely with extension services to manage their operations.",
      "summaryTimestamp": 1770892846597
    },
    {
      "id": "a08bb136ec471315",
      "title": "Life sciences symposium connects Texas A&#038;M students with graduate pathways",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/life-sciences-symposium-connects-texas-am-students-with-graduate-pathways/",
      "description": "Symposium highlights interdisciplinary training, research excellence, strength of Life Sciences Network The post Life sciences symposium connects Texas A&M students with graduate pathways appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 15:38:29 +0000",
      "timestamp": 1770824309000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points from the Article:\n\n- Texas A&M University's Life Sciences Network recently held a symposium to connect undergraduate and master's students with 6 of the university's premier graduate programs in life sciences.\n\n- The programs represented were in biochemistry and biophysics, genetics and genomics, medical sciences, neuroscience, nutrition, and toxicology.\n\n- The symposium highlighted the importance of interdisciplinary, human-health-focused training and research in the life sciences.\n\n- It was designed as a coordinated recruitment and educational effort, with activities like a poster session, graduate student presentations, and opportunities for students to engage with faculty.\n\n- Several of the programs are supported by prestigious NIH T32 Training Grants, reflecting program quality and strong faculty mentorship.\n\n- The symposium emphasized that interdisciplinary collaboration is embedded in the Texas A&M graduate experience, particularly in areas like human health, biomedical science, and translational research.\n\n- The event was made possible through support from the Texas A&M Graduate and Professional School, various colleges, and the university's Division of Research.\n\n- According to Dr. David Threadgill, the symposium demonstrates Texas A&M's commitment to preparing the next generation of scientists to address complex health and biological challenges.",
      "summaryTimestamp": 1770829319964
    },
    {
      "id": "912df42fdad393e7",
      "title": "Remember to register for the Nitrogen Conference - this Tuesday Feb. 17th, 2026 in St. Cloud",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/remember-to-register-for-nitrogen.html",
      "description": "",
      "date": "Wed, 11 Feb 2026 15:05:00 +0000",
      "timestamp": 1770822300000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg6ieA_IYkmsgSGiBba_yqGUhpf2mmJ6ytrBrbkms7kKGAe4Rv_Qxss8noLdDw6Hf4G-YeKRi0ngwzcQrRBp_sD2V4saGhsUfphTQkHPY6BZn4ILme8b1dazjeZR_KJAV1bB3gztkBubebqp2rlgsHIgA9M87914H1ruIrnsQ1_RcVVhWjoVPG0CkT4cLxE/s72-w640-h322-c/N%20Con.jpg",
      "summary": "The 12th annual Nitrogen Conference is taking place on Tuesday, February 17th, 2026 in St. Cloud, Minnesota. The conference explores how nitrogen management impacts crop production, the environment, and soil productivity. Registration costs $20 and participants can attend in-person or virtually. Key topics include:\n\n- Nitrogen Management and Crop Production: Presentations on the MRTN calculator, cover crop residue in sugar beets, precision irrigation, and using the PSNT after fall-applied manure.\n\n- Nitrogen and Soil Productivity: Research on biologicals for nutrient management and the role of soil organic matter.\n\n- Nitrogen and the Environment: An overview of nitrate issues in southeast Minnesota, the state's nutrient reduction strategy, and evaluating nitrogen inhibitors.\n\nA farmer panel will also discuss lessons from the 2025 growing season. Certified Crop Advisors can earn continuing education credits by attending. Registration is open now - don't miss this important conference.",
      "summaryTimestamp": 1770829322539
    },
    {
      "id": "2b1793f8bcacfee0",
      "title": "Rhoden vetoes bill that would have banned cell-cultivated protein in SD",
      "link": "https://www.agweek.com/news/policy/rhoden-vetoes-bill-that-would-have-banned-cell-cultivated-protein-in-sd",
      "description": "Cell-cultivated-protein food products would have been considered adulterated food under South Dakota House Bill 1077, which passed the House and Senate but was vetoed by Gov. Larry Rhoden.",
      "date": "Wed, 11 Feb 2026 14:55:06 GMT",
      "timestamp": 1770821706000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/010c404/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fc5%2Fe8%2F0dbc57024363a358d350d595a5a7%2Fgood-meat-singapore.jpg",
      "summary": "The bill passed both the state House and Senate before Rhoden's veto on February 10, 2026. \n\nRhoden said he opposes banning these federally-approved and regulated products, arguing it would set a dangerous precedent of restricting products based on production method rather than safety. Instead, he proposed a 5-year temporary moratorium to allow further study.\n\nThe South Dakota Cattlemen's Association opposed the bill, fearing it could lead to other states restricting South Dakota's agricultural products. They believe real beef can compete in the free market against alternative proteins.\n\nIn 2025, South Dakota passed a law requiring clear labeling of cell-cultured protein products. The state also prohibited using any state funds for these products.\n\nWhile the banned products are not yet in grocery stores, the Cattlemen's Association believes they will likely have a limited market impact over time, similar to other alternative protein products.\n\nThe South Dakota Stockgrowers Association, which supported the original bill, disagrees with Rhoden's veto but will support the proposed 5-year moratorium.",
      "summaryTimestamp": 1770829325905
    },
    {
      "id": "a8c0ffe40767362c",
      "title": "Minnesota seeds help green the Super Bowl field",
      "link": "https://www.agweek.com/crops/other-crops/minnesota-seeds-help-green-the-super-bowl-field",
      "description": "Northern Excellence Seed in Lake of the Woods County supplied ryegrass for the Super Bowl field at Levi’s Stadium.",
      "date": "Wed, 11 Feb 2026 14:43:21 GMT",
      "timestamp": 1770821001000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/c81af14/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fb1%2F7d%2F1e2edf254f759e2fe31e7ba4645b%2F02107203-grass10pkg-mp4-still001.jpg",
      "summary": "Northern Excellence Seed is a cooperative of 53 regional growers that produces seed for commercial companies. \n\nThe company supplied the ryegrass used to overseed the Bermuda grass on the Super Bowl field. Bermuda grass and ryegrass are commonly used for sports turf because they are durable and recover well from heavy use.\n\nNorthern Excellence Seed was established in 2002 and has been supplying seed for major events and sports fields across the country. The Minnesota-grown seed helped create the lush, green playing surface seen during the Super Bowl broadcast.\n\nThis showcases how agricultural products from the upper Midwest, specifically Minnesota, can have a national impact and be used in high-profile events like the Super Bowl. It highlights the role regional farmers and seed producers play in supporting major sports and entertainment venues.",
      "summaryTimestamp": 1770829329669
    },
    {
      "id": "457530f23391cba4",
      "title": "The wind really does stress us out",
      "link": "https://www.agweek.com/opinion/columns/the-wind-really-does-stress-us-out",
      "description": "Darla Tyler-McSherry of Ask In Earnest discusses how the wind really can wear us down, physically and mentally, why farmers and ranchers are particularly at risk, and what we can do about it.",
      "date": "Wed, 11 Feb 2026 11:30:00 GMT",
      "timestamp": 1770809400000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/f95ce17/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fagweek%2Fbinary%2Fcopy%2F99%2F90%2Fc7e01963c60d8195e6c18964e82e%2F2653927-wind-bwisutt-istock-binary-4906202.jpg",
      "summary": "Key points:\n\n- Strong, persistent winds can negatively impact mental health by disrupting serotonin levels and increasing positive ions in the air, leading to increased anxiety, irritability, migraines, depression, and decreased cognitive function.\n\n- Chinook winds, Zonda winds, Foehn winds, and Sirocco winds are regional examples of these types of disruptive winds experienced around the world.\n\n- In Montana, the lack of snow cover and moisture due to the \"open\" winter is a major concern for farmers and ranchers as they worry about the health of fall-planted crops and preparation for spring planting.\n\n- Recommended strategies to cope with the mental stress of persistent winds include using white noise, securing loose items, practicing box breathing, and reaching out to others for support.\n\n- Resources available include Farm Aid, the AgriStress HelpLine, the National Suicide and Crisis Lifeline, and local providers like clergy, pharmacists, and mental health professionals.\n\nThe article emphasizes that while the wind is unavoidable, suffering in silence is not, and farmers and ranchers can utilize various methods and resources to navigate the mental and physical challenges posed by persistent winds.",
      "summaryTimestamp": 1770829335613
    },
    {
      "id": "7b98c49fd250be30",
      "title": "Through Food and Culture, the East Bay Ohlone Are Repairing Centuries of&#160;Harm",
      "link": "https://civileats.com/2026/02/11/through-food-and-culture-the-east-bay-ohlone-are-repairing-centuries-of-harm/",
      "description": "Photographs by Aya Brackett I’m Louis Trevino. Most importantly, I’m Vincent’s partner in life and in love, for which I am every day so very grateful. And I too am Ohlone from here in the East Bay, and I have dedicated myself to Vincent and to his beautiful and dynamic vision for our people and [&#8230;] The post Through Food and Culture, the East Bay Ohlone Are Repairing Centuries of Harm appeared first on Civil Eats.",
      "date": "Wed, 11 Feb 2026 09:00:15 +0000",
      "timestamp": 1770800415000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/through-food-and-culture-the-east-bay-ohlone-are-repairing-centuries-of-harm-1.jpg",
      "summary": "The East Bay Ohlone community is working to repair centuries of harm by reviving their traditional food and cultural practices. Vincent Medina and Louis Trevino, who are both Ohlone, are leading this effort through their organization mak-'amham. \n\nmak-'amham operates a native plant nursery and organizes events to teach Ohlone traditions like acorn processing, basket weaving, and traditional song and dance. Their goal is to restore Ohlone land management and food systems that were disrupted by colonization.\n\nMedina and Trevino also operate a catering business that serves traditional Ohlone dishes made with locally-sourced, indigenous ingredients. This allows them to share Ohlone cuisine and culture with the wider community.\n\nThe article highlights the importance of these efforts in healing historical trauma and rebuilding Ohlone identity and sovereignty. Medina emphasizes that \"food and culture are inextricably linked\" for the Ohlone people. By reviving these practices, the community is reclaiming their heritage and healing from the harms of colonization.",
      "summaryTimestamp": 1770986989911
    },
    {
      "id": "18ca4d48d675304e",
      "title": "FDA to Reevaluate Safety of Common Food Preservative",
      "link": "https://civileats.com/2026/02/10/fda-to-reevaluate-safety-of-common-food-preservative/",
      "description": "February 10, 2026 – The Food and Drug Administration (FDA) is reassessing the safety of a common chemical preservative used in foods like frozen meals, deli meats, and breakfast cereals. Under the reassessment, announced Tuesday, the agency will look into the safety of butylated hydroxyanisole (BHA), a chemical that health advocates have raised concerns about [&#8230;] The post FDA to Reevaluate Safety of Common Food Preservative appeared first on Civil Eats.",
      "date": "Tue, 10 Feb 2026 22:04:18 +0000",
      "timestamp": 1770761058000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The FDA is reevaluating the safety of butylated hydroxyanisole (BHA), a common chemical preservative used in foods like frozen meals, deli meats, and breakfast cereals. The reassessment was announced on February 10, 2026. Health advocates have raised concerns about the safety of BHA, prompting the FDA to take a closer look. The agency will examine the available scientific evidence on the potential health impacts of BHA. This review could lead to new regulations or restrictions on the use of BHA in food products. Farmers and food producers should follow the FDA's progress on this issue, as any changes to BHA regulations could affect their operations and the ingredients they are able to use.",
      "summaryTimestamp": 1770947656313
    },
    {
      "id": "35703c115868386d",
      "title": "Ag groups urge U.S., Mexico and Canada leaders to move forward with USMCA",
      "link": "https://www.agweek.com/news/policy/ag-groups-urge-u-s-mexico-and-canada-leaders-to-move-forward-with-usmca",
      "description": "The Agricultural Coalition for the USMCA released the results of an economic analysis that shows significant growth in the value of U.S. ag exports to Canada and Mexico since USMCA was enacted.",
      "date": "Tue, 10 Feb 2026 19:27:52 GMT",
      "timestamp": 1770751672000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/4dfff8a/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F00%2F7e%2F773f96af45ba98a13371c46ff2b4%2F9766114590996-combine-filling-up-with-corn-76361.jpg",
      "summary": "S., Canada, and Mexico to renew and further strengthen the USMCA trade agreement. \n\nThe coalition's analysis found that since the USMCA was enacted in 2020:\n- U.S. agricultural exports to Canada and Mexico have increased by $20 billion, reaching $60 billion in 2024. This represents 47% growth, far outpacing the 18% increase to the rest of the world.\n- The USMCA has generated $149 billion in total economic contribution to the U.S. economy and supported nearly 500,000 jobs and $36 billion in wages.\n- For every $1 in ag exports under USMCA, another $2.45 of economic activity was supported, contributing $64 billion to U.S. GDP and $13 billion in tax revenue.\n\nThe USMCA must undergo a formal review by July 2026 to determine whether to renew the agreement for another 16 years. Failure to renew would lead to the agreement's expiration in 2036.\n\nWhile the coalition sees USMCA as positive overall, they note issues that need to be addressed, including:\n- Canada's management of dairy tariff-rate quotas\n- Mexico not fully implementing commitments on preserving common cheese names\n- The need for clearer rules on agricultural biotech and more access for U.S. ethanol in Mexico\n\nExperts warn that without USMCA, the U.S. farm economy would face greater instability in an already challenging environment.",
      "summaryTimestamp": 1770821420177
    },
    {
      "id": "0402f9bf88bb1b0b",
      "title": "WASDE Lifts Livestock Prices Amid Shifting Supply Outlook",
      "link": "https://www.allagnews.com/wasde-lifts-livestock-prices-amid-shifting-supply-outlook/",
      "description": "WASHINGTON, DC &#8211; USDA’s latest WASDE report points to tighter dynamics and stronger prices across [...]",
      "date": "Tue, 10 Feb 2026 19:05:46 +0000",
      "timestamp": 1770750346000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA's latest WASDE report projects tighter livestock and dairy supply dynamics and stronger prices in 2026:\n\n- Beef production is revised higher due to increased slaughter of steers, heifers, and cows, along with heavier dressed weights, despite a smaller 2025 calf crop.\n- Pork production is also raised on higher slaughter levels and heavier weights in the first half of 2026.\n- Broiler and turkey production forecasts were lowered for early 2026 due to recent hatchery data and Highly Pathogenic Avian Influenza-related culling, tightening poultry and egg supplies.\n- Beef imports are raised on strong demand for lean processing beef, while pork exports increase on improved competitiveness.\n- Fed-cattle and hog prices are raised across all quarters, and the all-milk price is lifted to $18.95 per hundredweight.\n\nThe tighter supply outlook and resilient demand are driving these higher livestock prices, despite some disease and herd shifts impacting production.",
      "summaryTimestamp": 1770892849538
    },
    {
      "id": "9333e25aa18be6e7",
      "title": "Farmers face greater risk with planting insurance option removed",
      "link": "https://www.agweek.com/news/north-dakota/farmers-face-greater-risk-with-planting-insurance-option-removed",
      "description": "The U.S. Department of Agriculture’s Risk Management Agency announced last fall that it was eliminating the extra coverage option for prevented planting insurance.",
      "date": "Tue, 10 Feb 2026 19:00:00 GMT",
      "timestamp": 1770750000000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/3677fd6/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe3%2Fd3%2Faa5680f646d695b5a903b4ccc62d%2Fjustin-quandt.jpg",
      "summary": "North Dakota farmers will face greater risk this year as the U.S. Department of Agriculture's Risk Management Agency has eliminated the extra \"buy-up\" coverage option for prevented planting insurance. \n\nFrom 2010 to 2024, the extra prevented planting coverage led to $3.18 billion in payments for North Dakota producers, more than any other state. This option allowed farmers to insure against years when weather prevents them from planting a crop.\n\nWithout this option in 2026, North Dakota farmers like Justin Quandt, who farms near Oakes, will have less protection against wet spring conditions that can leave some of their fields unplantable. Quandt's family normally invests in the additional prevented planting coverage, which requires insuring all acres in a county.\n\nThe North Dakota Farmers Union president Matt Perdue said the agency's decision is disappointing, as the recent farm bill had expanded federal crop insurance in other ways. However, an NDSU study concluded that the improvements will not outweigh the loss of the extra prevented planting coverage for North Dakota.\n\nSenators, including John Hoeven of North Dakota, have asked the USDA to undo the prevented planting changes for 2027 and beyond \"to help provide a layer of certainty when disasters beyond their control render them unable to plant a crop.\" \n\nFarmers face a March 15 deadline to make 2026 crop insurance purchases. Insurance agent Bethany Rentz hopes the USDA will bring back the extra prevented planting coverage based on pushback from other affected states.",
      "summaryTimestamp": 1770821424976
    },
    {
      "id": "1a65a9633ce88244",
      "title": "MN CropCast: From research to resilience - Advancing soil health with Dr. Anna Cates",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-from-research-to-resilience.html",
      "description": "",
      "date": "Tue, 10 Feb 2026 16:18:00 +0000",
      "timestamp": 1770740280000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-w320-h320-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "Dr. Anna Cates, the University of Minnesota Extension Soil Health Specialist, leads the Minnesota Office for Soil Health (MOSH) which is dedicated to improving soil health by working with farmers and conservation professionals. MOSH partners with the Minnesota Board of Water and Soil Resources (BWSR) to provide funding, policy implementation, and technical guidance to local Soil and Water Conservation Districts (SWCDs). The podcast discusses farmer adoption of conservation practices and cover crops, and an upcoming educational opportunity called the Cover Crop Academy. Dr. Cates, who has a PhD in Agronomy and MS in Soil Science and Agroecology from the University of Wisconsin-Madison, works to turn research into on-the-ground conservation.",
      "summaryTimestamp": 1770922677198
    },
    {
      "id": "a5f5d4972a5993d0",
      "title": "Minnesota Irrigator Program returns March 10th and 11th, 2026 in Perham, MN",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/minnesota-irrigator-program-returns.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 17:41:00 +0000",
      "timestamp": 1770658860000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEilFjhdf-VxkjP9toiF34DiaDB5cT-q0f91aA_Dm5rnp-VT4bl_Z7fTnYdUC-aenNwdk4aIJ6iixtBluHpy8s-iEt9Bi8Q_ACFmbb3c7egNGSuDx1vzfDkJg3X4cJN595mCuQvvb2YWJFNBWC6Yd39CfII3Z-IT9EolZPeEmPGaok8g6zYVrRwMkLGSB8LN/s72-w640-h322-c/Irrigation-180.jpg",
      "summary": "The Minnesota Irrigator Program (MIP) will return on March 10th and 11th, 2026 in Perham, MN. The 2-day program costs $60 and includes breakfast and lunch. \n\nThe program will cover topics such as irrigation scheduling, variable rate technology, autonomous pivots, flowmeters and calibration, and nitrogen management. Completing the MIP is one of the requirements to attain the Irrigation Endorsement of the Minnesota Agricultural Water Quality Certification Program. Certified farms will receive the endorsement if they attend the program and adopt a new irrigation practice or scheduling method on their farm.\n\nThe event is organized by the University of Minnesota (UMN) Crop News. Efficient agricultural irrigation is a key topic in Minnesota due to the state's sandy soils and limited precipitation. The program aims to help irrigators and irrigation professionals match irrigation to crop water use, improve water-use efficiency, and reduce water costs.",
      "summaryTimestamp": 1770848792892
    },
    {
      "id": "639f274dc791af0b",
      "title": "Strategic Farming: Let's talk crops discussed pollinators",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops_9.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:50:00 +0000",
      "timestamp": 1770652200000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiFwnCAyWS-EUZiSio5J4-y0QsBduTd8dBWm4rzsZPh3u4M6zCtsrl6RlBlORk_gWpEFh9h4ihjy4Q3pIa9pa6cfpRtz9_kTHvQBA2tYVh2SFkw_l0cs3XC0kVvrPnwkXwspvQywGqn_c4YnxmIW3ZA4EmamF9Iyw3k_NQb4FllsWyvbWbmpFK22ugIz6oV/s72-w320-h320-c/bee-on-flower-andrewsi_HeatherHolm.JPEG",
      "summary": "Key Takeaways:\n\n1. Pollinators, especially bees, play a critical role in food production, with over 80% of the world's flowering plants needing a pollinator to reproduce.\n\n2. Bee populations, including the endangered rusty patch bumblebee, have seen dramatic declines across North America due to factors like habitat loss, climate change, and disease.\n\n3. Restoring pollinator habitat on agricultural landscapes is important, and can be done cost-effectively. Planting a diverse mix of flowering plants, even in small areas, can support a variety of bee species.\n\n4. Research shows that the amount of surrounding agricultural land or size of the habitat area does not significantly impact bee diversity and abundance, as long as there are sufficient floral resources.\n\n5. Integrating pollinator habitat into croplands can have benefits for natural pest control, and can even improve yields for self-pollinating crops like soybeans.\n\n6. Funding sources and conservation programs may be available to assist farmers in establishing and maintaining pollinator habitat.\n\n7. Minnesota alone has around 525 species of bees, ranging from tiny to large bumblebees. Native bee species, including ground-nesting bees, are the focus of research at the University of Minnesota Bee Lab.",
      "summaryTimestamp": 1770848796551
    },
    {
      "id": "85be85b5240c46b7",
      "title": "Mark your calendars for the Midwest Soybean Gall Midge Research Update",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendars-for-midwest-soybean.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:22:00 +0000",
      "timestamp": 1770650520000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh0uFuk9siSQYDRZMiZ6TFrsf7R2PkpTjVQVdjWSAepcFTQa-SsKA945ODDygtkKavZCDdBqY6VAq25l-cmFJvX1zCYrFPrINtbHZ0q9eQSE04v6mqMfrOpOlW1sHhJIq8RjUbQO5J9yO9Ttx56T7Uy2inj9pSygRO9xdPxYA0_aPJKkiZ4FpEmgymGRY5b/s72-w320-h194-c/gall-midge-larvae-potter.jpg",
      "summary": "The Midwest Soybean Gall Midge Research Update is a free, live webinar scheduled for March 19, 2026. Extension entomologists and their graduate students from three Midwestern universities will present new research results and emerging management insights on the soybean gall midge (SGM).\n\nThe webinar will cover the following topics:\n- Updated information on SGM distribution and regional monitoring efforts\n- Impacts on soybean production and yield loss under field conditions\n- Biology and ecology updates, including cold tolerance and overwintering survival\n- New insights into adult biology, including emergence timing and behavior\n- Results from commercial soybean variety testing under SGM pressure\n- Updates on biological control efforts\n- Evaluation of new and emerging cultural control strategies, along with other management tools\n\nCertified Crop Advisors can earn pest management (PM) CEUs by attending the live event. Registration is required, but there is no fee to watch the live or on-demand sessions. Once registered, attendees will receive a confirmation email and reminder emails with a link to the webinar prior to the event.\n\nFor more information, visit the Midwest Soybean Gall Midge Research Update webpage.",
      "summaryTimestamp": 1770848799626
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Farmers are increasingly using AI-assisted tools, voice search, and quick-scan platforms that allow them to find information without needing to click. The true indicator of content effectiveness is now attention time - how long a user spends meaningfully engaged with the content.\n\nAgWeb.com recently underwent a redesign to increase user attention and engagement. The results show:\n- 54% increase in readers reaching 75% of an article\n- 21% increase in readers reaching 90% of an article\n- 33% increase in daily article pageviews per mobile user\n\nThe article cites data that 79% of online users scan content rather than reading word-for-word, and most only absorb around 28% of page text. AgWeb's redesign aimed to simplify layouts and guide deeper engagement.\n\nAttention time is a better metric than CTR because it shows if users stayed with the content, scrolled with purpose, consumed multiple articles, and were in an active, focused mindset. High-attention environments deliver stronger results for advertisers, as their brand is present during engaged moments.\n\nThe improvements on AgWeb are said to directly translate to more value for brands, providing more time with content, more content consumed per session, higher quality impressions, and better alignment with how farmers search today. The article concludes that attention, not just clicks, should be the priority metric for ag marketers.",
      "summaryTimestamp": 1770879440396
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Points:\n\n- The Packer, a publication from Farm Journal, is launching The Avocado Conference, a new international event for the U.S. avocado supply chain.\n- The inaugural event is scheduled for November 18-20, 2026, in San Diego, California.\n- The conference is a collaboration between Farm Journal and the Hass Avocado Board (HAB) to strengthen the global avocado industry and promote Hass avocados as America's preferred healthy food.\n- The conference aims to bring together all segments of the avocado supply chain, including producers, exporters, importers, packers, retail and foodservice buyers, and other industry partners.\n- The program will cover topics such as global avocado production and trade, retail and foodservice market insights, consumer and shopper trends, avocado marketing programs, and the role of the Hass Avocado Board in expanding avocado demand.\n- The conference is expected to provide valuable data-driven insights, facilitate collaboration, and promote strategic alignment within the avocado industry to drive sustainable growth in avocado consumption across the U.S. market.\n- Key stakeholders attending the event will include growers, packers, importers, exporters, retailers, foodservice buyers, and various industry service providers.",
      "summaryTimestamp": 1770879443511
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Summary:\n\nThe Iowa State University Pesticide Safety Education Program has updated several applicator manuals and exams to align with new pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. \n\nThe updated training materials, available for purchase through the ISU Extension Store, include the Iowa Core Manual (CS445) and an informational update in the Private Pesticide Applicator Manual (CS1). New exams based on the revised core manual are now available at all Iowa Department of Agriculture and Land Stewardship test sites.\n\nFor more information, contact Betsy Danielson, Pesticide Safety Education Extension Specialist at Iowa State University, at betsydan@iastate.edu.",
      "summaryTimestamp": 1770879445812
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The key points are:\n\n- Lead generation should focus on delivering real value to farmers in exchange for their time and attention, rather than just collecting information.\n- The call-to-action (CTA) and offer you choose shape not only how many leads are captured, but also how qualified, motivated and ready to purchase those prospects become.\n- Shifting the mindset from what you want to collect to what farmers genuinely need is crucial for effective lead generation.",
      "summaryTimestamp": 1770879447754
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Key points:\n\n- The focus has shifted from traditional SEO (search engine optimization) to modern AEO (answer engine optimization), where brands need to build authority and trust to cut through the \"AI slop\".\n- Farmers are increasingly using AI-powered platforms like ChatGPT, Google's AI Overviews, and mobile voice search to find information, and brands need to be present in these new discovery channels to avoid becoming \"invisible\".\n- At Farm Journal, the authors are observing and adapting to this shift in discoverability, which should prompt all ag marketers to reevaluate their 2026 strategy.\n- An answer-driven content strategy and amplifying trusted voices will be more important than ever in this new AEO era.\n- Discoverability is now about winning the citation, brand mention, and trusted source reference to build brand authority, even in zero-click moments.",
      "summaryTimestamp": 1770879450283
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "When used properly, they can provide flexibility for timely applications, reduce field traffic, and improve access to difficult areas. However, adopting spray drone technology requires careful consideration of regulations, training, insurance, and management practices.\n\nKey points:\n- Spray drones can be useful for applications when soils are too wet, in tall crops, to reduce compaction, and for targeted/site-specific applications.\n- Regulatory requirements include FAA Part 107 Remote Pilot Certificate, FAA Part 137 Certification for aerial pesticide application, and Iowa Department of Agriculture and Land Stewardship (IDALS) licensing.\n- Farmers need insurance coverage including chemical liability, general liability, and hull/physical damage.\n- Equipment factors to consider include spray tank capacity, battery life, nozzle options, and GPS guidance features.\n- Proper training is essential for safe and effective operation, including calibration, weather monitoring, and maintenance.\n- Farmers are encouraged to start on a limited scale and compare results to conventional methods.\n- Resources available include Iowa State University programs, licensed dealers, and IDALS guidance.\n\nSpray drone technology continues to evolve, with ongoing improvements in payload, automation, and data integration. Careful evaluation and gradual adoption are recommended for Iowa farmers.",
      "summaryTimestamp": 1770879453651
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series will be held at 12 locations across Iowa from January 6 to 29. The meetings will feature topics tailored to local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.\n\nKey details:\n- Locations: Sioux Center, Storm Lake, Burlington, Mason City, Estherville, Waterloo, Davenport, Ankeny, Atlantic, Iowa City, Le Mars, Carroll\n- Dates: January 6-29, 2026\n- Early-bird registration: $75 until the week before each meeting\n- Late/on-site registration: $100\n- Includes refreshments, lunch, certified crop advisor credits, and access to resources\n- Private pesticide applicator recertification available for an additional $30 fee\n\nTopics to be covered include crop market and climate outlooks for 2026, nitrates and drinking water, profitable nutrient management, southern rust, transition planning, and robots/drones.\n\nThe goal is to provide farmers and crop production professionals with the latest research-based information to help them make informed decisions for the upcoming growing season. Registration and more information is available on the Crop Advantage Series website.",
      "summaryTimestamp": 1770879456517
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The winner and finalists will be recognized at the 2026 Top Producer Summit in Nashville, Tennessee from February 9-11. \n\nThe three finalists are:\n- Alsum Farms (Friesland, Wisconsin) - A multigenerational, 3,600-acre operation producing potatoes, pumpkins, hay, and other crops. Led by the founder and his two daughters.\n- Dalton Farms (Wakeman, Ohio) - A 7th generation, 2,000-acre farm with corn, soybeans, a 400-head cattle herd, and an on-farm market. Owned by Rebecca and Edward Dalton.\n- Splitter Farms (Sterling, Kansas) - A 1,400-acre row crop operation led by Matt and Janna Splitter, farming 18,500 total acres. They scaled the business after the sudden passing of Matt's father in 2010.\n\nAdditionally, the 2026 Next Generation Award winner is Tim Nuss (El Dorado Hills/Lodi, California), who farms various crops and also runs an ag tech and influencer business. The 2026 Women in Agriculture Award winner is Helle Ruddenklau (Amity, Oregon), an immigrant from Denmark who farms a diverse operation and is involved in ag advocacy.\n\nAll finalists and award winners will be recognized at the Top Producer Summit, which is sponsored by BASF, Fendt, and Pro Farmer.",
      "summaryTimestamp": 1770879460249
    },
    {
      "id": "ce3ade9054dd723c",
      "title": "Still an opportunity to attend the ICM Conference!",
      "link": "https://crops.extension.iastate.edu/post/still-opportunity-attend-icm-conference",
      "description": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean field with Integrated Crop Management Conference overlayed on top. Learn more at go.iastate.edu/ICM\" width=\"408\" height=\"214\" class=\"align-left\" loading=\"lazy\"><p>This year we are offering on-site registration for the <a href=\"https://www.regcytes.extension.iastate.edu/icm/\">Integrated Crop Managem",
      "date": "Thu, 04 Dec 2025 08:22:25 -0600",
      "timestamp": 1764858145000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg",
      "summary": "The Integrated Crop Management (ICM) Conference is taking place on December 10-11, 2025 at the Meadows Events and Conference Center in Altoona, Iowa. \n\nThe conference will offer:\n- 33 workshops covering topics like crops, pests, nutrient management, and conservation\n- Up to 14 continuing education credits for Certified Crop Advisers\n- Iowa Commercial Pesticide Applicator continuing instruction for 2025 in categories 1A, 1B, 1C, and 4 for an additional fee\n- Invited speakers covering topics related to the Endangered Species Act, timing of corn and soybean planting, and integrated pest management for corn leafhopper and corn stunt disease\n\nFarmers can register in-person on December 10 for this premier crop management conference. The article was written by Meaghan Anderson, a field agronomist serving nine counties in central Iowa and an extension specialist with Iowa State University Extension and Outreach.",
      "summaryTimestamp": 1770879462958
    },
    {
      "id": "6e56b2436e07fb98",
      "title": "Registration is now open for the 36th Integrated Crop Management Conference",
      "link": "https://crops.extension.iastate.edu/post/registration-now-open-36th-integrated-crop-management-conference",
      "description": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water management. The event features experts sharing research updates and practical recommendations. Don’t miss this key opportunity for networking and education!</p><p><strong>When: </strong>December 10 and 11, 2025</p><p><strong>Where: </strong>The Meadows Events Center in Altoona, Iowa</p><p><strong>Who",
      "date": "Mon, 27 Oct 2025 14:12:34 -0500",
      "timestamp": 1761592354000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Summary:\n\nThe 36th Integrated Crop Management Conference will be held on December 10-11, 2025 at The Meadows Events Center in Altoona, Iowa. The conference features 33 session topics with expert speakers and covers a range of crop production, protection, nutrient management, and soil/water topics. \n\nEarly-bird registration is $260 and ends on November 16, 2025. Regular registration is $310 until December 3, 2025. Commercial pesticide applicators can earn recertification credits in categories 1A, 1B, 1C, and 4 for an additional fee.\n\nThe conference is open to anyone involved in crop production. Attendees can build a customized schedule, earn CCA credits, and network with other professionals from Iowa and the Midwest region.\n\nThe conference is organized by Iowa State University Extension and Outreach. The content authors are Erin Hodgson, a professor and extension entomologist, and Ashley Dean.",
      "summaryTimestamp": 1770879465615
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10 at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5.\n\nThe event will feature research on sorghum's value as a forage crop, highlighting its advantages over corn, such as being more drought-tolerant and having lower nitrogen requirements. Attendees will learn about forage sorghum production and utilization for silage, grazing, and as a standing winter feed source.\n\nSpeakers at the event will include:\n- Keith Johnson, Purdue professor of agronomy\n- Mitch Tuinstra, Wickersham Chair of Excellence in Agricultural Research and scientific director of the Institute for Plant Sciences at Purdue, who will share plant breeding techniques to improve sorghum yield and quality\n- Brad Shelton, FPAC superintendent\n- Jason Tower, Southern Indiana Purdue Agricultural Center superintendent\n- Nick Minton, Purdue Extension beef systems specialist\n- Jeff Jackson, Croplan alfalfa and forage specialist\n\nVenue tours will be available from 3-5 pm and 6-8 pm, and a dinner and bull test station tour will be offered from 5-6 pm.",
      "summaryTimestamp": 1770879471899
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Farmer sentiment improved in July 2024 despite concerns over financial performance. The Purdue/CME Group Ag Economy Barometer index rose 8 points to 113.\n\n- The Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations rose 7 points to 119.\n\n- High input costs remained the biggest concern for 34% of farmers. 29% cited the risk of lower crop and livestock prices, up from 25% in June.\n\n- The Farm Financial Performance Index dropped 4 points in July to 81, 6 points lower than in July 2023, reflecting worries about weakening commodity prices and high input costs.\n\n- The Farm Capital Investment Index rose 6 points in July to 38, though it remains 7 points lower than in July 2023.\n\n- The Short-Term Farmland Value Expectations Index rose to 118 from 115 in June, while the Long-Term Farmland Value Expectations Index dropped 6 points to 146.\n\n- 72% of crop farmer respondents expect cash rental rates to remain roughly the same as in 2024, with the remaining 15% anticipating a rise and 13% expecting a decline.",
      "summaryTimestamp": 1770879477595
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Findings:\n- Tar spot, a fungal disease in corn, has been spreading in the U.S. since it was first detected in 2015. It has now reached 16 states and Ontario, Canada.\n- Purdue researchers are taking an interdisciplinary approach, combining agricultural and engineering methods, to study the dynamics of tar spot and develop ways to monitor and assess the disease.\n- The research team is using a mix of statistics, data science, epidemiology, microbiology, artificial intelligence, and computer vision, along with stakeholder feedback, to better understand tar spot.\n- The research is funded by two USDA grants totaling nearly $1.1 million.\n- The researchers are collaborating with experts from Colombia, Mexico, Ecuador, South Korea, and the U.S.\n- Previous work by the team has included developing a digital method to quantify tar spot in corn, with promising results, but some inaccuracies still need to be addressed.\n- The team is also exploring the use of drone imagery and weather data, along with traditional statistical methods, to capture details about the tar spot pathosystem.\n\nKey Numbers/Statistics:\n- Tar spot was first detected in the U.S. in 2015, affecting 2 of Indiana's 92 counties.\n- By 2022, the fungus had extended to 16 states and Ontario, Canada, as well as 15 other countries in Central and South America, the Caribbean, and U.S. territories.\n- The research is funded by two USDA grants totaling nearly $1.1 million.\n\nKey Dates/Deadlines:\n- The article was published on August 1, 2024.\n\nKey Names/Organizations/Programs:\n- Purdue University\n- C.D. Cruz, associate professor of botany and plant pathology\n- Mohammad Jahanshahi, associate professor in the Lyles School of Civil and Construction Engineering and the Elmore Family School of Electrical and Computer Engineering\n- Mariela Fernández-Campos, PhD student in botany and plant pathology\n- Yu-Ting Huang, postdoctoral research associate in civil engineering\n- Darcy Telenko, associate professor of botany and plant pathology\n- Brenden Lane, graduate student in C.D. Cruz's lab\n- Sungchan Oh, computational infrastructure specialist in the Institute for Plant Sciences\n\nLocations:\n- West Lafayette, Indiana\n- 16 states and Ontario, Canada\n- Central and South America, the Caribbean, and U.S. territories\n\nContext/Causes:\n- Tar spot had been endemic in several Latin American countries since 1904, but had not been detected in the U.S. prior to 2015.\n- The researchers are trying to understand the origins of the disease, how it has spread, and whether the pathogen in the U.S. is different from those in other countries.\n\nImpacts for Farmers:\n- The spread of tar spot in the U.S. poses a biosecurity challenge that the research aims to address with a science-based approach.\n- The researchers hope that the use of high-tech data collection and analysis methods can make vital corn pathology information more widely and rapidly available to stakeholders.\n\nRecommendations/Action Items:\n- The researchers are continuing to refine their training methods to improve the accuracy and performance of their disease detection models.\n- They are also working to quantify and model tar spot epidemics in production-style fields by integrating drone imagery and weather data with traditional statistical methods.\n\nExpert Quotes:\n- \"There are opportunities in integrating AI-based digital technologies and point-of-care diagnostics that can provide rapid and accurate information for stakeholders,\" said C.D. Cruz.\n- \"Whether you're working on civil infrastructure health monitoring or agricultural disease epidemiology, you can have a profound impact not only on humans but also on the environment,\" said Mohammad Jahanshahi.",
      "summaryTimestamp": 1770879486847
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana Sheep Association (ISA), with support from the Indiana Sheep and Wool Market Development Program (IN S&W), is hosting various sheep-themed events and competitions at the 2024 Indiana State Fair:\n\n- The Wool and Ewe Room and Ewe2 boutique will be open throughout the fair, offering woolen products, livestock-themed apparel, jewelry, and more.\n- On August 2 at 10 a.m., there will be an open wool judging and wool sale event in the Blue Ribbon Pavilion.\n- The Make It With Wool (MIWW) competition and fashion show will take place on August 4 at 2 p.m. in the Indiana Arts Building.\n- The Indiana State Fair Shearing Contest will be held on August 4 at 5 p.m. in the Ball State University Champions Pavilion.\n- From August 8-11 from 11 a.m. to 6 p.m., the Taste from Indiana Farms event in the Indiana Farm Bureau Fall Creek Pavilion will offer free samples of Indiana lamb.\n- The annual Sheep to Shawl competition, where youth teams create a wool shawl from scratch, will be on August 18 at 10 a.m. in the Indiana Arts Building.\n- Sheep can be found in the Blue Ribbon Pavilion from August 4-20 for open and 4-H shows.\n\nThe ISA President, Jane Smith, stated that the association is proud to bring the spirit of the sheep industry to the fair, with the theme of \"Art and Nature\" showcasing sheep-related art from Indiana artists.",
      "summaryTimestamp": 1770879493406
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue Extension will have a presence at the fair, providing opportunities for fairgoers to interact with Purdue experts on topics like entomology, human health, forestry, animal sciences, and more. \n\nKey Purdue Extension activities include:\n- Block Party (ages 8 months to 8 years) to enhance school-readiness skills\n- Book Party to focus on math skills \n- Captain Cash to learn financial management\n- Master Gardener exhibit on annuals/vegetables and pollinator education\n\nThe Food Science Department will host \"What's Growing on My Spinach?\" to explore food microbiology and food safety, including sampling cricket-infused rice cereal treats and Boilermaker Hot Sauce.\n\nSeed art will be showcased in the livestock barns and Purdue Extension Building, visually representing the fair's theme.\n\nThe Purdue Ag Alumni Association will sponsor Pioneer Village, offering antique tractors, farm toys, music, and more to transport guests to the 1800s.\n\nPurdue Extension exhibits will be located throughout the fairgrounds, including the 4-H Exhibit Hall, Pavilions, and Purdue Extension Building.",
      "summaryTimestamp": 1770879499261
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The University of Wisconsin-Madison has released a new publication called \"Potassium Cycle\" that provides a visual overview of the potassium cycle in Wisconsin cropping systems. The two-page publication outlines key potassium concepts and recommendations for specific situations. The publication is available for download only and was announced on June 12, 2024 in the Wisconsin Crop Manager newsletter.",
      "summaryTimestamp": 1770879503078
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Wisconsin Winter Wheat Update:\n\n- Wisconsin winter wheat is 10-14 days ahead of typical growth stages due to a warm spring and timely rainfall.\n- There is a high likelihood of stripe rust appearing in Wisconsin this season, but it has not been detected yet. Farmers are advised to scout their fields and report any findings.\n- Fusarium head blight (FHB) is expected to be an issue this season due to moderate temperatures and adequate precipitation, in contrast with recent hot and dry spring seasons.\n- FHB can limit yields and produce the mycotoxin deoxynivalenol (DON or vomitoxin), which can lead to discounts or rejection at the elevator if levels exceed 2 ppm in the finished grain.\n- Farmers are encouraged to manage FHB, as it is a yield-limiting disease worth addressing.\n- The update was provided by Damon Smith, Extension Field Crops Pathologist, and Shawn Conley, Extension Soybean and Small Grains Agronomist, from the University of Wisconsin-Madison.\n- The article was posted on May 20, 2024 on the UW Madison website.",
      "summaryTimestamp": 1770879507746
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Soybean plants have the ability to compensate for open spaces by developing additional branches and pods, allowing them to yield well even with lower plant stands. However, action should be considered if stand loss leaves fewer than 50,000-60,000 evenly-distributed plants per acre in southern regions, or 75,000 plants per acre in northern regions, or if there are areas larger than 6-10 square feet without any plants. \n\nFactors to evaluate when considering replanting include the existing plant stand, distribution, and ability to recover; planting date and relative maturity; weed management; seed and variety availability; cost and insurance; and the tradeoff between a suboptimal stand vs. yield penalty from delayed replanting. The article recommends closely assessing fields for plant loss and patterns before deciding whether to replant.\n\nAn additional resource is provided for more information on soybean replant decisions.",
      "summaryTimestamp": 1770879513810
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n1. The only labeled formulation for postemergence broadleaf weed control in Enlist E3 soybeans is the 2,4-D choline formulation present in Enlist One and Enlist Duo herbicides. 2,4-D ester and amine formulations cannot be used.\n\n2. There have been reports of producers, agronomists, and Certified Crop Advisors considering using the ester or amine formulations for postemergence applications, which is not allowed.\n\n3. Regarding burndown applications, if using a 2,4-D ester or amine formulation product, the soybean plant back interval (minimum of 7 days when using 0.5 lbs ae/acre) must be respected.\n\n4. If planting Enlist E3 soybeans, Enlist One or Enlist DUO can be applied without the plant back restriction.\n\nThe article was posted on May 11, 2024 by Daniel H. Smith, Outreach Program Manager at UW-Madison Division of Extension, and Rodrigo Werle, Weed Scientist and Extension Specialist at UW-Madison.",
      "summaryTimestamp": 1770879519516
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Wisconsin CCA (Certified Crop Adviser) Board election results have been posted. Rob Shields, Matt Brugger, and Chris Bandura have been elected to the WI CCA Board and are eligible to serve two, three-year terms. All WI CCAs in good standing status are eligible for nomination and can vote in future elections, which will take place in early 2025. Daniel H. Smith, the Outreach Program Manager for the Crops and Soils Program at the University of Wisconsin-Madison Division of Extension, oversees the election process.",
      "summaryTimestamp": 1770879524416
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 25,
    "industry": 55,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 80,
  "summariesGenerated": 10,
  "updated": "2026-02-13T14:39:05.344Z"
}