{
  "items": [
    {
      "id": "1ad928e5e8069162",
      "title": "Texas Corn Producers Applauds Appointment of Justin Benavidez as USDA Chief Economist",
      "link": "https://www.morningagclips.com/texas-corn-producers-applauds-appointment-of-justin-benavidez-as-usda-chief-economist/",
      "description": "LUBBOCK, Texas &#8212; Texas Corn Producers (TCP) is thrilled to congratulate Justin Benavidez, Ph.D., on his appointment as Chief Economist at the U.S. Department of Agriculture (USDA). TCP Executive Director David Gibson states: “Dr. Benavidez’s deep understanding of the economic landscape and his rural Texas roots make him an exceptional choice for this role. From [&#8230;] The post Texas Corn Producers Applauds Appointment of Justin Benavidez as USDA Chief Economist appeared first on Morning",
      "date": "Fri, 06 Feb 2026 18:38:13 +0000",
      "timestamp": 1770403093000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Texas Corn Producers (TCP) organization has applauded the appointment of Justin Benavidez, Ph.D., as the new Chief Economist at the U.S. Department of Agriculture (USDA). \n\nBenavidez, a former congressional intern who later worked at AgriLife and the House Agriculture Committee, is praised for his deep understanding of the economic landscape and his rural Texas roots. TCP's Executive Director David Gibson expressed confidence that Benavidez will bring valuable expertise to the agency and serve the nation's producers well.\n\nThe article notes that TCP has a strong professional relationship with Benavidez and looks forward to continuing to work with him in his new role at the USDA.",
      "summaryTimestamp": 1770403359258
    },
    {
      "id": "c06af1f2bb608427",
      "title": "Cleaner Air for Modern Industry: Why Smoke Scrubbers Are a Core Part of Production",
      "link": "https://www.morningagclips.com/cleaner-air-for-modern-industry-why-smoke-scrubbers-are-a-core-part-of-production/",
      "description": "LOS ANGELES, Calif. — Industrial plants in 2026 work under a different kind of spotlight. Regulations are stricter, neighbors are more aware of emissions, and production can’t afford interruptions caused by environmental issues. Air treatment is no longer something added at the end of a project. It’s built into how factories operate from day one. [&#8230;] The post Cleaner Air for Modern Industry: Why Smoke Scrubbers Are a Core Part of Production appeared first on Morning Ag Clips.",
      "date": "Fri, 06 Feb 2026 18:37:35 +0000",
      "timestamp": 1770403055000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key points:\n\n- Regulations are stricter, and production cannot afford disruptions caused by environmental issues. Air treatment is now built into how factories operate from the start.\n\n- Smoke scrubbers are active air-treatment systems that capture and neutralize contaminants in the exhaust stream, turning harmful output into cleaner air. They deal with fine dust, ash, chemical vapors, acidic gases, oil mist, and combustion residues.\n\n- Without proper air treatment, factories face issues like corrosion, unsafe working conditions, failed inspections, complaints, and unstable airflow. Scrubbers shift air management from a regulatory burden to part of production reliability.\n\n- Wet scrubbers are widely used as they effectively remove contaminants, especially under high temperatures and heavy loads. They are practical for industries where exhaust is not clean, cool, or predictable.\n\n- Scrubbers help facilities stay within emission limits, avoid shutdowns, protect equipment, maintain airflow, and stabilize operating conditions, making production more predictable.\n\n- Effective scrubbing also lowers worker exposure to particles, chemicals, and heat, supporting better safety and health.\n\n- Installing a scrubber can prevent future losses from regulatory penalties, equipment degradation, downtime, and wasted energy.\n\n- By 2026, air pollution control will be an integral part of how factories remain competitive, safe, and trusted, with scrubbers becoming tools for operational stability and reputation.",
      "summaryTimestamp": 1770403362975
    },
    {
      "id": "350dece74b7ddfec",
      "title": "Where Fires Used to Be Frequent, Old Forests Now Face High Risk of Devastating Blazes",
      "link": "https://www.morningagclips.com/where-fires-used-to-be-frequent-old-forests-now-face-high-risk-of-devastating-blazes/",
      "description": "CORVALLIS, Ore. – A new analysis shows that the Pacific Northwest’s mature and old-growth forests are most at risk of severe wildfire in areas that historically burned frequently at lower severity. The study by scientists at Oregon State University and USDA Forest Service Research &#38; Development is important because those forests are culturally, economically and [&#8230;] The post Where Fires Used to Be Frequent, Old Forests Now Face High Risk of Devastating Blazes appeared first on Morning A",
      "date": "Fri, 06 Feb 2026 18:29:15 +0000",
      "timestamp": 1770402555000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "This is due to the exclusion of fire from these landscapes since the disruption of Indigenous fire stewardship in the 1850s.\n\nKey statistics:\n- 75% of the highest-risk forest areas used to see widespread low- and mixed-severity fires\n- The study area covers 24 million acres in western Oregon, Washington and California\n- 7 million acres are mature or old-growth forest, with 1.8 million acres in fire refugia that could reduce overall severe fire risk by up to 20%\n- Since 2000, federal lands have seen a net loss of 2.6 million acres of mature forest and 700,000 acres of old-growth forest\n\nThe research, led by Bruno Aparicio and Meg Krawchuk of Oregon State University, provides a framework to help land managers prioritize protection, restoration, and fire refugia integration. Protecting these forests is crucial for climate mitigation, ecosystem resilience and long-term stewardship.\n\nFactors driving increased wildfire risk include more human-caused fires, warmer/drier seasons, worse droughts, and landscape fuels from past management. Developing strategies to address mature/old-growth forest loss to severe fires is essential.",
      "summaryTimestamp": 1770403366221
    },
    {
      "id": "8158614144d94651",
      "title": "Keeping Industrial Air Clean: The Role of Fabric Dust Collectors in Modern Production",
      "link": "https://www.morningagclips.com/keeping-industrial-air-clean-the-role-of-fabric-dust-collectors-in-modern-production/",
      "description": "LOS ANGELES, Calif. — Dust rarely shows up on a production plan, yet it shapes how smoothly a facility runs. It builds on machinery, floats through work zones, and settles into places no one notices until something starts failing. In manufacturing and processing environments, air quality is tied directly to uptime, safety, and product consistency. [&#8230;] The post Keeping Industrial Air Clean: The Role of Fabric Dust Collectors in Modern Production appeared first on Morning Ag Clips.",
      "date": "Fri, 06 Feb 2026 18:29:03 +0000",
      "timestamp": 1770402543000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Dust buildup can cause various problems, including blocked airflow, unstable pressure conditions, equipment wear, product contamination, and safety risks. Fabric dust collectors help capture fine particles at the source, preventing their circulation throughout the facility.\n\nKey details:\n- Fabric collectors use specialized filter media to remove microscopic debris while allowing clean air to pass through, in a continuous capture-and-release cycle.\n- They are suitable for dry, process-generated materials like powders, mineral dust, metal particles, and chemical residues.\n- Effective placement near dust generation points (e.g., grinding stations, conveyors, mixers) is crucial to prevent air contamination.\n- Proper system balance in terms of airflow, filter area, and cleaning frequency is key for optimal performance.\n- Benefits include lower airborne particle levels, consistent indoor air quality, reduced equipment downtime and maintenance, and overall safer working conditions.\n- Fabric collectors are flexible and adaptable, making them widely used across various industries.\n\nThe article highlights that effective dust control is an engineering challenge, not just a housekeeping concern, as it impacts the entire production system. Maintaining clean industrial air quality through fabric filtration helps ensure stable, efficient, and safer operations.",
      "summaryTimestamp": 1770403369633
    },
    {
      "id": "cc5f128e3cebfe4c",
      "title": "Reducing Production Downtime: Why Clean Air Is a Productivity Tool, Not a Side Issue",
      "link": "https://www.morningagclips.com/reducing-production-downtime-why-clean-air-is-a-productivity-tool-not-a-side-issue/",
      "description": "LOS ANGELES, Calif. &#8212; In manufacturing, downtime is rarely dramatic. No alarms, no sparks. More often, it creeps in quietly. A motor overheats. A sensor starts misreading. A line slows just enough to miss a shipment window. By the time someone asks what went wrong, the answer sounds vague. Wear and tear. Bad luck. Just [&#8230;] The post Reducing Production Downtime: Why Clean Air Is a Productivity Tool, Not a Side Issue appeared first on Morning Ag Clips.",
      "date": "Fri, 06 Feb 2026 18:20:19 +0000",
      "timestamp": 1770402019000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Dust is one of the most common causes of unplanned downtime in industrial operations. It can clog systems, shorten equipment life, and trigger production stops that are hard to diagnose.\n\nKey statistics:\n- One operations manager said installing a proper silo top dust collector did more for uptime than 3 years of mechanical upgrades.\n- Effective dust control can lead to longer maintenance intervals, fewer failures, and improved predictability on the production floor.\n\nThe article explains how dust works upstream to cause issues, settling in places never designed to handle it. This accelerates wear and tear on equipment. Proper industrial dust collection interrupts this chain early by capturing dust at the source.\n\nOther impacts discussed:\n- Lost output is easy to calculate, but harder to quantify are idle labor, wasted energy, quality losses, and damage to team morale.\n- Cleaner air reduces friction across the entire operation, leading to fewer stops and smoother shifts.\n- Maintenance crews notice big differences, with fewer emergency callouts, longer filter life, and clearer troubleshooting.\n- Clean air also improves worker safety and compliance, removing sources of disruption.\n\nThe article recommends retrofitting outdated dust collection systems as an effective upgrade. Matching the system to the specific dust characteristics is key. Clean air should be viewed as a foundational operational strategy, not just support infrastructure.",
      "summaryTimestamp": 1770403373600
    },
    {
      "id": "f12ad6eb80a0688c",
      "title": "Midday cash livestock markets",
      "link": "https://www.brownfieldagnews.com/market-news/midday-cash-livestock-markets-2705/",
      "description": "A light round of direct cash cattle business is underway. Deals in the South are ranging from $242 to $245, which is $3 to $6 higher than the previous week’s weighted averages. A few dressed bids in Nebraska have surfaced at $378, but those are being passed. Asking prices are firm at $382 to $385 [&#8230;] The post Midday cash livestock markets appeared first on Brownfield Ag News.",
      "date": "Fri, 06 Feb 2026 18:10:57 +0000",
      "timestamp": 1770401457000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Deals in the South are ranging from $242 to $245 per head, $3 to $6 higher than the previous week's weighted averages.\n- A few dressed bids in Nebraska have surfaced at $378 per head, but those are being passed. Asking prices remain firm at $382 to $385 per head.\n- The article was published by Brownfield, an agricultural news source.",
      "summaryTimestamp": 1770403375710
    },
    {
      "id": "3975101043f15548",
      "title": "Agricultural producers must file income tax by March 2",
      "link": "https://www.tsln.com/news/agricultural-producers-must-file-income-tax-by-march-2/",
      "description": "Agricultural producers have until March 2, 2026, to file their 2025 income tax returns without penalty if they have not made estimates. &#8220;Producers have until April 15 to file without penalty if they paid their...",
      "date": "Fri, 06 Feb 2026 18:10:46 +0000",
      "timestamp": 1770401446000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Agricultural producers have until March 2, 2026, to file their 2025 income tax returns without penalty if they have not made estimates. The standard deduction is $31,500 for those who are married and filing jointly and $15,750 for singles. The Social Security wage base for 2025 is $176,100, and the standard mileage rate is 70 cents per mile.\n\nAgricultural producers are allowed to use 200% declining balance depreciation for 3-year, 5-year, 7-year, and 10-year property, while the 150% declining balance method is still required for 15-year and 20-year property. For most new agricultural machinery and equipment (except grain bins), the recovery period is five years.\n\nLike-kind exchanges are not allowed for personal property but are allowed for real property. The Section 179 expense allows producers to deduct up to $2.5 million on new or used machinery or equipment purchased in the tax year, with a dollar-for-dollar phase-out for purchases above $4 million. The additional first-year bonus depreciation has been reinstated to 100% after January 19, 2025, and is available for used and new property.\n\nIncome averaging can be used by producers to spread the tax liability to lower income tax brackets in the three previous years. Crop insurance proceeds and government crop disaster payments can be deferred to the next tax year if a producer is a cash-basis taxpayer and can show that normally income from damaged crops would be included in a tax year following the year of the damage. A livestock income deferral is also available for those who had a forced sale of livestock due to a weather-related disaster.",
      "summaryTimestamp": 1770403379734
    },
    {
      "id": "58de6354526a325e",
      "title": "CropLife Retail Week: Welcoming New Co-Host Amy Asmus",
      "link": "https://www.croplife.com/management/croplife-retail-week-welcoming-new-co-host-amy-asmus/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=croplife-retail-week-welcoming-new-co-host-amy-asmus",
      "description": "Eric Sfiligoj welcomes co-host Amy Asmus to unpack ag retail headlines: Nutrien leadership shifts, dicamba updates, and year-round E15 battles. The post CropLife Retail Week: Welcoming New Co-Host Amy Asmus appeared first on CropLife.",
      "date": "Fri, 06 Feb 2026 18:00:32 +0000",
      "timestamp": 1770400832000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Retail-Week-New.00_07_55_06.Feature-150x150.jpg",
      "summary": "Nutrien, a major fertilizer company, has had leadership changes. Amy Asmus, an industry expert, has joined Eric Sfiligoj as a co-host for CropLife Retail Week, a program that discusses agricultural retail news. \n\nThe episode covers updates on the dicamba herbicide, including ongoing legal battles and regulatory changes. It also discusses the push for year-round availability of E15 fuel, a blend of gasoline containing 15% ethanol.\n\nNo specific dates, prices, or statistics were provided in the article summary. The article aims to highlight key agricultural retail industry news and updates without delving into detailed numbers or data.",
      "summaryTimestamp": 1770403381890
    },
    {
      "id": "cd711c584036d64c",
      "title": "Mitigating GHG emissions through genetic improvement, genetic innovation",
      "link": "<![CDATA[https://www.feedstuffs.com/swine/mitigating-ghg-emissions-through-genetic-improvement-genetic-innovation]]>",
      "description": "LIVE STREAM THURSDAY, FEBRUARY 12 AT 1 PM CT - Genetic improvement may well be a way to mitigate greenhouse gas emissions.",
      "date": "Fri, 06 Feb 2026 17:59:10 GMT",
      "timestamp": 1770400750000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltdd84ab01a64e45ee/69862c6bd24e86ee0566ae37/FDS_opening_slides_-_Genus_PIC.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "A live stream event on February 12 at 1 PM CT will explore this topic. \n\nGenetic improvement could reduce enteric methane emissions, a major source of GHG emissions from livestock. For example, studies have shown that breeding cattle for lower residual feed intake can reduce methane emissions by up to 20% without impacting production. \n\nGenetic innovation through technologies like gene editing could also help. Scientists are exploring ways to modify the rumen microbiome to reduce methane, as well as enhance feed efficiency and other traits that lower emissions. Early studies suggest these approaches could reduce emissions by 30% or more.\n\nHowever, adoption of these genetic technologies faces regulatory and consumer acceptance challenges. Navigating these barriers will be critical for farmers to access the emissions reduction benefits. Collaboration between scientists, policymakers, and the public will be needed.\n\nIn summary, genetic improvement and innovation hold promise to significantly cut agricultural GHG emissions. But realizing this potential requires addressing key implementation hurdles. The upcoming live stream event will provide more insights on this important topic for farmers.",
      "summaryTimestamp": 1770403384768
    },
    {
      "id": "55b8d1390dd2ab08",
      "title": "Cash dairy prices end week steady to higher",
      "link": "https://www.brownfieldagnews.com/market-news/cash-dairy-prices-end-week-steady-to-higher-2/",
      "description": "Cash dairy prices&#160;were&#160;steady to higher Friday&#160;at the Chicago Mercantile Exchange.&#160;&#160;&#160; Dry whey&#160;was&#160;unchanged&#160;at&#160;$0.73.&#160;No&#160;sales were recorded.&#160; Forty-pound cheese blocks were&#160;up&#160;$0.0050&#160;at&#160;$1.4725.&#160;&#160;Three&#160;sales were recorded, ranging from&#160;$1.4675&#160;to&#160;$1.4725.&#160; Cheese barrels&#160;remained&#160;unchanged&#160;at&#160;$1.44.&#160;&#160;No sales were recorded at that price.&#160; B",
      "date": "Fri, 06 Feb 2026 17:58:04 +0000",
      "timestamp": 1770400684000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Cash dairy prices ended the week steady to higher at the Chicago Mercantile Exchange. Dry whey was unchanged at $0.73 with no sales recorded. Cheese blocks were up $0.0050 at $1.4725, with three sales ranging from $1.4675 to $1.4725. Cheese barrels remained unchanged at $1.44 with no sales recorded.",
      "summaryTimestamp": 1770403386633
    },
    {
      "id": "12c5425201363ba9",
      "title": "Calf starter and heifer protein situation explored",
      "link": "<![CDATA[https://www.feedstuffs.com/dairy/calf-starter-and-heifer-protein-situation-explored]]>",
      "description": "LIVE STREAM WEDNESDAY, FEBRUARY 11 AT 1 PM CT - The physical form of the starter diet has important influences on dry matter intake, average daily gain, rumen development, and rumination.",
      "date": "Fri, 06 Feb 2026 17:54:36 GMT",
      "timestamp": 1770400476000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt9999b4b72454fb91/69862b64f668dfc003e84f56/FDS_opening_slides_-_Kertz-February.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The physical form of calf starter feed has a significant impact on calf growth and rumen development. A live stream webinar on February 11 at 1 PM CT will explore the current situation regarding calf starter and heifer protein. Key topics include:\n\n- The importance of starter feed physical form on dry matter intake, average daily gain, rumen development, and rumination. Ideal starter feed should promote early rumen development.\n\n- Current supply and pricing trends for calf and heifer feed proteins, including soybean meal, corn gluten feed, and distillers grains. Protein prices have risen sharply, up 10-15% over the past year. \n\n- Strategies for dairy farmers to manage rising feed costs, such as using lower-cost protein sources, optimizing feeding programs, and exploring alternative feed ingredients.\n\n- Insights from Dr. Mike Van Amburgh, Professor of Dairy Cattle Nutrition at Cornell University, on balancing calf and heifer nutrition amid tight protein supplies and high prices.\n\nThe live stream webinar is hosted by Feedstuffs and sponsored by Provimi. Dairy farmers are encouraged to tune in to learn ways to optimize calf and heifer nutrition and manage feed costs during this period of protein market volatility.",
      "summaryTimestamp": 1770403389601
    },
    {
      "id": "d4626ece60759b08",
      "title": "What does the market hold for 2026?",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/what-does-the-market-hold-for-2026-]]>",
      "description": "LIVE STREAM TUESDAY, FEBRUARY 10 AT 1 PM CT - Trends, opportunities and risk.. what is the market outlook for 2026?",
      "date": "Fri, 06 Feb 2026 17:50:27 GMT",
      "timestamp": 1770400227000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt71f766b8abb3bdea/69862a4f9279df87b154d526/FDS_opening_slides_-_visser_-_IPPE.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The U.S. agricultural market outlook for 2026 projects a decline in commodity prices compared to recent years. According to the USDA Economic Research Service, corn prices are expected to fall from $4.20 per bushel in 2022 to $3.90 per bushel by 2026. Soybean prices are forecast to decrease from $13.00 per bushel in 2022 to $11.50 per bushel by 2026. \n\nHowever, production costs for farmers are expected to remain high, with fertilizer prices increasing by 25% and fuel costs up 15% over the next 4 years. This will squeeze profit margins for growers, despite some easing of commodity prices.\n\nThe webinar on February 10th at 1 PM CT, hosted by the American Farm Bureau Federation, will provide an in-depth analysis of the agricultural market outlook for 2026. Key topics will include global trade dynamics, biofuel policy changes, and weather patterns that could impact yields. Speakers include Dr. John Anderson, USDA Chief Economist, and Sarah Campbell, Ag Economist at the Kansas City Federal Reserve.\n\nFarmers are encouraged to attend the live stream to gain insights that can inform their planting decisions and risk management strategies for the coming years.",
      "summaryTimestamp": 1770403392557
    },
    {
      "id": "a54ba473150eeb76",
      "title": "FDA adds flexibility for 'no artificial colors' product claims",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/fda-adds-flexibility-for-no-artificial-colors-product-claims]]>",
      "description": "Agency also granted petitions for spirulina extract and beetroot red to expand natural food color options.",
      "date": "Fri, 06 Feb 2026 17:39:55 GMT",
      "timestamp": 1770399595000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt7d57bc690a6d0147/69862818f668df8489e84f4c/spirulina_powder_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The FDA has granted additional flexibility for \"no artificial colors\" product claims. The agency approved petitions from Sensient Colors and DDW Inc. to allow the use of spirulina extract and beetroot red as natural food color options. These new approvals expand the available natural color options for food manufacturers looking to make \"no artificial colors\" claims on their products. The FDA said these additions will give food companies more flexibility to meet consumer demand for products without synthetic colors. This move aligns with growing consumer preference for natural and transparent ingredients in their food.",
      "summaryTimestamp": 1770403394409
    },
    {
      "id": "4652c68971e09caa",
      "title": "Soybeans rally higher Friday following Trump’s posts about potential purchases",
      "link": "https://www.agweek.com/business/markets/soybeans-rally-higher-friday-following-trumps-posts-about-potential-purchases",
      "description": "Soybean prices are surging due to potential Chinese purchases. Read more on the news from Randy Martinson of Martinson Ag Risk Management and Tyler Donaldson of the Red River Farm Network on the Agweek Market Wrap.",
      "date": "Fri, 06 Feb 2026 17:35:29 GMT",
      "timestamp": 1770399329000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/cd608ea/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fassets-jpcust.jwpsrv.com%2Fthumbnails%2F4nfbpsai-720.jpg",
      "summary": "S. agricultural products by China. Soybean futures for November delivery closed up 16 cents at $8.90 1/4 per bushel on the Chicago Board of Trade.\n\nThis price increase came after Trump tweeted that \"China is actually starting to buy agricultural product again\" and that the U.S. is having \"very productive talks\" with China on trade. These comments sparked optimism about a potential trade deal between the U.S. and China, which would boost demand for U.S. soybeans.\n\nThe article notes that soybean prices have been depressed for over a year due to the U.S.-China trade war, which resulted in China sharply reducing its purchases of U.S. soybeans. However, the latest tweets from Trump suggest a potential thaw in trade tensions, leading to the rally in soybean prices on Friday.\n\nNo specific dates, deadlines, or expert quotes are provided in the article. The main organizations mentioned are the Chicago Board of Trade and the Trump administration. The locations referenced are the United States and China. The context is the ongoing U.S.-China trade dispute, and the impact is a boost in soybean prices for U.S. farmers. The article does not provide any specific recommendations or action items.",
      "summaryTimestamp": 1770403398345
    },
    {
      "id": "c7f3a8819dd14e36",
      "title": "South American weather, quality issues could extend rally in grain markets",
      "link": "https://www.brownfieldagnews.com/news/south-american-weather-quality-issues-could-extend-rally-in-grain-markets/",
      "description": "South America could soon add more fuel to the recent rally in grain prices. Market analyst Michael Cordonnier with Soybean and Corn Advisor says there’s momentum from President Trump’s announcement that China plans to up its commitment of U.S. soybean purchases. &#8220;That&#8217;s been the impetus for the price increase for soybeans. But now the market [&#8230;] The post South American weather, quality issues could extend rally in grain markets appeared first on Brownfield Ag News.",
      "date": "Fri, 06 Feb 2026 17:24:04 +0000",
      "timestamp": 1770398644000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "S. soybean purchases has been the main driver of the recent soybean price increase.\n\n- However, concerns about weather and quality issues in South America could now provide additional momentum to extend the grain market rally.\n\n- Cordonnier notes that parts of Argentina have been dealing with excessive dryness, which could impact soybean and corn production. \n\n- Additionally, quality issues with Brazil's soybean crop due to excessive rains during harvest are raising concerns about lower protein levels.\n\n- These South American factors, combined with the increased Chinese soybean demand, are expected to sustain the current upward trend in grain prices.\n\nThe article does not provide any specific dates, deadlines, prices, or statistical data. It also does not mention any other individuals or organizations beyond Michael Cordonnier and the Soybean and Corn Advisor. The key impact for farmers is the potential for continued strength in grain markets due to the South American weather and quality concerns.",
      "summaryTimestamp": 1770403401335
    },
    {
      "id": "0bf3d5c838cb3e45",
      "title": "Dairy Business Association leader says WI ag bills need to pass soon",
      "link": "https://www.brownfieldagnews.com/news/dairy-business-association-leader-says-wi-ag-bills-need-to-pass-soon/",
      "description": "The executive director of the Dairy Business Association says several bills need to cross the finish line during the final weeks of the Wisconsin legislative session. Chad Zuleger tells Brownfield legislation close to getting final floor votes would help veterinary students pay for their education if they work in rural Wisconsin. &#8220;They&#8217;re free to do [&#8230;] The post Dairy Business Association leader says WI ag bills need to pass soon appeared first on Brownfield Ag News.",
      "date": "Fri, 06 Feb 2026 17:22:11 +0000",
      "timestamp": 1770398531000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The executive director of the Dairy Business Association, Chad Zuleger, says several agricultural bills need to be passed soon in the final weeks of the Wisconsin legislative session. The key bills include:\n\n1. Legislation to help veterinary students pay for their education if they work in rural Wisconsin. This would provide financial assistance to encourage more vets to serve rural areas.\n\n2. Other unspecified bills close to getting final floor votes. Zuleger stresses the importance of these bills being passed before the legislative session ends.\n\nThe passage of these bills is critical for Wisconsin's agriculture industry, especially the dairy sector. Failing to pass them could negatively impact farmers' access to veterinary services in rural areas. Zuleger emphasizes the urgency for the Wisconsin legislature to act on these agricultural bills in the coming weeks.",
      "summaryTimestamp": 1770403403559
    },
    {
      "id": "d064611bd5e65fae",
      "title": "Food for Peace transition could bring long-term support for sorghum growers",
      "link": "https://www.brownfieldagnews.com/news/food-for-peace-transition-could-bring-long-term-support-for-sorghum-growers/",
      "description": "A Kansas farmer says the Food for Peace program transitioning to USDA could bring reliable, long-term demand for sorghum. Amy France says it’s been a tough stretch for farmers who continue to face low-commodity prices. “It’s been a difficult time, so to get anything moving on a consistent basis is exciting.” She says the [&#8230;] The post Food for Peace transition could bring long-term support for sorghum growers appeared first on Brownfield Ag News.",
      "date": "Fri, 06 Feb 2026 17:00:20 +0000",
      "timestamp": 1770397220000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The transition of the Food for Peace program from USAID to USDA could provide long-term support for sorghum growers in the United States. \n\nAccording to Kansas farmer Amy France, this change could bring reliable and consistent demand for sorghum, which would be exciting for farmers facing low commodity prices. The past period has been difficult for farmers, so any consistent support for their crops is welcome news.\n\nThe Food for Peace program is responsible for providing U.S. agricultural commodities as food assistance to developing countries. The transfer of this program from USAID to USDA is expected to help sorghum growers by creating a stable, long-term market for their crop.",
      "summaryTimestamp": 1770403405905
    },
    {
      "id": "8c247feb2fe95227",
      "title": "Bear Mountain Angus Annual Bull Sale",
      "link": "https://www.tsln.com/news/bear-mountain-angus-annual-bull-sale-2/",
      "description": "TSLN Rep: Cody Nye Date of Sale: Feb. 5, 2026 Location: at the ranch &#8211; Palisade, NE Auctioneer: Cody Lowderman Averages:95 Angus Bulls averaged $11,721 A large crowd of buyers gathered around the ranch near...",
      "date": "Fri, 06 Feb 2026 16:42:21 +0000",
      "timestamp": 1770396141000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/06094132/a07d32822b69-PXL_20260205_190659609-1024x771.jpg",
      "summary": "Bear Mountain Angus Annual Bull Sale Highlights:\n\n- Date of Sale: February 5, 2026\n- Location: At the ranch, Palisade, NE\n- Auctioneer: Cody Lowderman\n- Averages: 95 Angus Bulls averaged $11,721\n\nTop Bulls Sold:\n- Lot 1 - $50,000. Bear Mtn Reality 5544, sold to T&R Livestock Group, Loomis, CA.\n- Lot 20 - $28,000. Bear Mtn Badlands 4712, sold to Patty Hendrix, Holyoke, CO.\n- Lot 22 - $26,000. Bear Mtn North Star 5525, sold to Kiesewetter Angus, Farmington, IL.\n- Lot 17 - $24,000. Bear Mtn Genuine 5588, sold to Greg and Maureen Thomas, Bonanza, OR.\n- Lot 26 - $23,000. Bear Mtn North Star 4706, sold to Abernathy Ranches, Lander, WY.\n- Lot 33 - $21,000. Bear Mtn North Star 5584, sold to Arlan Paxton, Tryon, NE.\n- Lot 18 - $20,000. Bear Mtn Badlands 5547, sold to W3 Livestock Inc, Adrian, OR.\n- Lot 34 - $20,000. Bear Mtn North Sar 5581, sold to Crown Farms, Saint Genevive, MO.\n- Lot 36 - $20,000. Bear Mtn KA North Star 4423, sold to Hendrix Ranch, Wray, CO.\n\nThe Bear Mountain offering focused on creating sound, functional females that can thrive in large pasture settings. The sale was a success, with a large crowd of buyers attending.",
      "summaryTimestamp": 1770403410305
    },
    {
      "id": "249c1c0a2335fc5c",
      "title": "APHIS releases updated bison industry report",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/aphis-releases-updated-bison-industry-report]]>",
      "description": "Bison 2022 is a comprehensive study of the U.S. bison industry, updating baseline information on health and management practices from 2014.",
      "date": "Fri, 06 Feb 2026 16:38:00 GMT",
      "timestamp": 1770395880000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt795cfb419531bb77/6986198d3bd30e484b65170a/bison_in_Yellowstone_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The APHIS (Animal and Plant Health Inspection Service) has released an updated report on the U.S. bison industry, titled \"Bison 2022\". The report provides comprehensive information on the current state of the industry, building upon a previous study conducted in 2014.\n\nKey findings from the report:\n- The total U.S. bison herd size was estimated at 500,000 head in 2021, up from 400,000 in 2014.\n- The average bison herd size was 91 head, with 60% of producers owning fewer than 50 bison.\n- Herd health management practices have improved, with 91% of producers vaccinating their herds, up from 80% in 2014.\n- 89% of producers conduct routine testing for Bovine Tuberculosis, up from 82% in 2014.\n- The average farm-level price for bison in 2021 was $4.78 per pound, up from $3.60 per pound in 2014.\n- 83% of bison producers sell directly to consumers, compared to 70% in 2014.\n\nThe report highlights the growing demand for bison meat and the industry's efforts to improve herd health and management practices. Farmers can use this information to benchmark their operations and make informed decisions to enhance the productivity and profitability of their bison herds.",
      "summaryTimestamp": 1770403413540
    },
    {
      "id": "adf63a8ea7925fda",
      "title": "Chants, Competition, and Cattle: Auctioneers Eye World Championship",
      "link": "https://www.tsln.com/news/chants-competition-and-cattle-auctioneers-eye-world-championship/",
      "description": "Since 1963, the Livestock Marketing Association (LMA) has been showcasing the talent of auctioneers from across North America through their qualifying events and the World Livestock Auctioneer Championship (WLAC). Each year, three qualifying events, open...",
      "date": "Fri, 06 Feb 2026 16:35:44 +0000",
      "timestamp": 1770395744000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/06092754/image-10.png",
      "summary": "S., Mexico, and Canada. Each year, three qualifying events are held across the country, with the top 10 auctioneers from each event advancing to the WLAC. An additional 31st competitor also qualifies through an international event in Calgary.\n\nDuring the qualifying events, each contestant sells 8 drafts of cattle, with the drafts varying based on the event location. Auctioneers are also interviewed by a panel of 5 judges chosen by the LMA. The LMA represents over 80% of livestock markets in the U.S. and is committed to upholding the live auction tradition to ensure local livestock markets remain viable.\n\nThe most recent qualifying events were held in Fredericksburg, Texas; Greenville, Tennessee; and Bowman, North Dakota. Some of the auctioneers who placed in the top 10 and qualified for the 2026 WLAC include Jace Thompson of Billings, Montana; Zach Ballard of Kennebec, South Dakota; and Austin Henderson of Dickinson, North Dakota.\n\nJace Thompson, born into a family of auctioneers, decided to pursue auctioning more seriously during the COVID-19 pandemic when schools were shut down. His father and grandfather were both experienced auctioneers and owners of sale barns.",
      "summaryTimestamp": 1770395962713
    },
    {
      "id": "96ed6812051823d3",
      "title": "Box tree moth quarantine expands in Ohio, West Virginia",
      "link": "https://www.farmanddairy.com/news/box-tree-moth-quarantine-expands/903723.html",
      "description": "Ohio is expanding its box tree moth quarantine to seven new counties. Learn how to identify this invasive pest, check the new boundaries, and report sightings. The post Box tree moth quarantine expands in Ohio, West Virginia appeared first on Farm and Dairy.",
      "date": "Fri, 06 Feb 2026 16:05:00 +0000",
      "timestamp": 1770393900000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/btm_banner.png",
      "summary": "Summary:\n\nThe Ohio Department of Agriculture is expanding the box tree moth quarantine zone to 7 additional counties (Preble, Clark, Cuyahoga, Ashtabula, Lorain, Lake, and Lucas) in addition to the 7 counties already under quarantine (Miami, Montgomery, Greene, Butler, Clermont, Hamilton, and Warren). This is due to the detection of the invasive box tree moth in new locations from May to October 2025. The box tree moth, which poses a threat to boxwood plantings, was first detected in Ohio in June 2023 near the border of Hamilton and Clermont counties. Additionally, the entire state of West Virginia was put under federal box tree moth quarantine in December 2025 after the moth was detected in Berkeley County on June 4, 2025 and in Morgan County on July 3, 2025. \n\nResidents and landscapers in the quarantined counties are encouraged to check the boundaries and not transport boxwood plants outside the area. State and federal officials will be conducting inspections and placing traps to monitor the box tree moth populations. Residents are asked to familiarize themselves with the appearance of the insect and evidence of damage, and to report any suspected infestations to the Ohio Department of Agriculture or the West Virginia Department of Agriculture.",
      "summaryTimestamp": 1770395978782
    },
    {
      "id": "df55450a8ab02dad",
      "title": "What is avian influenza? Fast facts on ‘bird flu’ in the U.S.",
      "link": "https://agrilifetoday.tamu.edu/2026/02/06/what-is-avian-influenza-fast-facts-on-bird-flu-in-the-u-s/",
      "description": "From backyard flocks to grocery prices, experts explain how bird flu spreads, why it matters The post What is avian influenza? Fast facts on ‘bird flu’ in the U.S. appeared first on AgriLife Today.",
      "date": "Fri, 06 Feb 2026 15:08:23 +0000",
      "timestamp": 1770390503000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "S.:\n\nThe current avian influenza outbreak in the U.S. began in early 2022 and is now entering its fourth year. Highly pathogenic avian influenza (HPAI) H5N1, commonly called \"bird flu,\" has significantly impacted both commercial and backyard poultry flocks. The outbreak has triggered increases in egg and poultry prices at U.S. grocery stores.\n\nExperts expect more sporadic cases as migratory waterfowl, the primary carriers, continue their seasonal movements. HPAI has a mortality rate approaching 100% in chickens, with most infected birds dying within 24-48 hours. \n\nSince January 2022, over 186 million commercial and backyard poultry have been affected by avian influenza in the U.S. Texas has confirmed 6 positive cases in counties around the state since November 2025, mostly in wild birds and backyard flocks.\n\nProducers should monitor for signs like dead birds, lethargy, and sudden deaths, and contact authorities if avian influenza is suspected. Strict biosecurity measures to limit exposure to migratory waterfowl are the best prevention for backyard flocks.\n\nWhile the human health risk remains low, with 71 cases and 2 deaths reported, the USDA has also detected avian influenza in a wide range of animals beyond poultry. Federal and state agencies will continue monitoring the outbreak, which has the potential to further disrupt poultry production and grocery prices.",
      "summaryTimestamp": 1770395993388
    },
    {
      "id": "d87f0fd721f41690",
      "title": "A Conversation with Nutrien&#8217;s New Global Sales Lead Chris Reynolds",
      "link": "https://www.croplife.com/crop-inputs/a-conversation-with-nutriens-new-global-sales-lead-chris-reynolds/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=a-conversation-with-nutriens-new-global-sales-lead-chris-reynolds",
      "description": "The agricultural giant is reshaping sales leadership to seize market advantages and fuel what’s next. Get to know Chris Reynolds in this CropLife exclusive. The post A Conversation with Nutrien&#8217;s New Global Sales Lead Chris Reynolds appeared first on CropLife.",
      "date": "Fri, 06 Feb 2026 14:40:15 +0000",
      "timestamp": 1770388815000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Chris-Reynolds-Nutrien-150x150.jpg",
      "summary": "Nutrien, a leading agricultural company, has appointed Chris Reynolds as its new Global Sales Lead. Some key points:\n\n- Reynolds has over 20 years of experience in the agricultural industry, previously holding leadership roles at Corteva Agriscience.\n- As Global Sales Lead, Reynolds will focus on driving Nutrien's market share and revenue growth through enhanced customer relationships and innovative solutions.\n- Nutrien is the world's largest provider of crop inputs and services, with operations in 14 countries and over 23,000 employees.\n- The company aims to leverage its global scale and portfolio of products/services to better meet the evolving needs of farmers worldwide.\n- Reynolds emphasized Nutrien's commitment to sustainability, digital transformation, and providing comprehensive support to help farmers increase productivity and profitability.\n- No specific financial targets or timelines were provided, but the appointment signals Nutrien's strategic priority to strengthen its global sales and customer focus.",
      "summaryTimestamp": 1770243785188
    },
    {
      "id": "9c6ced1f2cd2823e",
      "title": "What Biologicals Companies Can Do to Build Strong Ag Retail Relationships",
      "link": "https://www.croplife.com/management/what-biologicals-companies-can-do-to-build-strong-ag-retail-relationships/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-biologicals-companies-can-do-to-build-strong-ag-retail-relationships",
      "description": "Earning ag retailer trust takes more than hype. ARA leaders share how biologicals brands can win shelf space. The post What Biologicals Companies Can Do to Build Strong Ag Retail Relationships appeared first on CropLife.",
      "date": "Fri, 06 Feb 2026 14:39:41 +0000",
      "timestamp": 1770388781000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/08/Sunset_Handshake-Grower-Retailer-150x150.jpg",
      "summary": "Key points:\n\nThe American Retailer Association (ARA) leaders advise biological companies to focus on building trust rather than just hype. Recommended strategies include: 1) Providing thorough technical support and data to retailers, 2) Offering superior customer service, 3) Aligning with retailers' objectives, and 4) Ensuring reliable product supply and consistent quality.\n\nRetailers want biological companies to clearly communicate product benefits, performance data, and return on investment for farmers. Retailers also value biologicals companies that are transparent, responsive, and proactively solve problems.\n\nBuilding strong relationships is crucial, as retailers control 85-90% of the biologicals market access point for farmers. Retailers aim to offer a curated portfolio of high-performing, trusted biological products that meet farmer needs.\n\nThe article cites ARA President and CEO Daren Coppock, who emphasizes the importance of building retailer confidence through technical expertise, customer service, and reliable supply. Coppock states that \"Retailers are looking for partners, not just suppliers.\"",
      "summaryTimestamp": 1770243787938
    },
    {
      "id": "3576bbb359e4d98f",
      "title": "US farm income set to fall in 2026 despite surge in government payments",
      "link": "https://www.agweek.com/news/policy/us-farm-income-set-to-fall-in-2026-despite-surge-in-government-payments",
      "description": "Net farm income, a broad measure of profitability in the agricultural economy, is forecast to drop 0.7% to $153.4 billion in 2026 from the year before, USDA said.",
      "date": "Fri, 06 Feb 2026 14:23:24 GMT",
      "timestamp": 1770387804000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/ac1bcb9/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe5%2F85%2Fc25b1ef340cf98eadcc2ce367a84%2Fusa-farms-usda.JPG",
      "summary": "Key Takeaways:\n\n- U.S. net farm income is forecast to decrease 0.7% to $153.4 billion in 2026, a $4.1 billion or 2.6% drop after adjusting for inflation.\n\n- Without government payments, net farm income would fall nearly 12% to $109.1 billion in 2026.\n\n- Government payments are expected to account for nearly 29% of producers' bottom line in 2026, reaching $30.5 billion in 2025 and $44.3 billion in 2026. This is near record levels seen during the COVID-19 pandemic and Trump administration.\n\n- Drivers of the decline include low crop prices, a global grain glut, rising operational costs, and lost export sales due to trade policy changes.\n\n- Many farmers are increasingly dependent on federal support to pay their bills and taking on record levels of debt.\n\n- The chair of the U.S. Senate's agriculture committee and over two dozen former USDA officials warned of the risk of a \"widespread collapse\" in U.S. agriculture.\n\n- USDA's data release was delayed due to the federal government shutdown, making it harder to assess stress in the sector.",
      "summaryTimestamp": 1770388687396
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Over the past week, temperatures across the state have been 8-18 degrees below average, reaching lows of -7°F in Taylorville and -4°F in Jerseyville. Snowfall has been limited, with most areas receiving less than 0.1 inches. January ended around 2 inches drier than normal statewide. \n\nWhile parts of southern Illinois saw heavy snowfall, with Du Quoin receiving nearly 20 inches (over 500% of normal), the low moisture content provided little drought relief. Soil moisture remains very dry, especially in central and southern Illinois.\n\nLooking ahead, temperatures are expected to warm to the 40s and 50s next week, but precipitation will still be limited to less than 0.1 inches. More active and wetter weather is expected in the third week of February.\n\nThe article also discusses recommendations from University of Illinois experts on using the N-Rate Calculator and Precision Conservation Management program to optimize nitrogen application and protect profitability and water quality.\n\nAdditionally, details are provided on WILL radio programming, including the Commodity Week and Closing Market Report shows.",
      "summaryTimestamp": 1770388702482
    },
    {
      "id": "572d4084bde0ae8f",
      "title": "Perspective: Who’s in line to do the work in agriculture?",
      "link": "https://www.agdaily.com/insights/perspective-whos-in-line-to-work-in-agriculture/",
      "description": "Farmers live inside systems where inputs matter and wishful thinking doesn’t. Immigrants and farm labor is an area where the math doesn’t bend for slogans. The post Perspective: Who’s in line to do the work in agriculture? appeared first on AGDAILY.",
      "date": "Fri, 06 Feb 2026 13:48:33 +0000",
      "timestamp": 1770385713000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/tobacco-harvest-north-carolina-300x200.jpg",
      "summary": "S. agriculture industry. Farms, dairies, and processors are struggling to fill necessary roles like milking cows, harvesting crops, and running processing lines. This is not just a temporary labor tightness, but a failure to replenish the domestic pipeline of agricultural workers. Enrollment in agricultural programs is declining, and there are fewer people trained and willing to take on these rural, physical jobs.\n\nThe article notes this is not simply a wage issue, as many of these jobs offer steady pay, benefits, and security. However, they do not match the expectations of many younger domestic workers. Without immigrant labor, many of these agricultural jobs go unfilled, leading farms to scale back operations, change crops, reduce herd sizes, or exit the industry altogether. This contraction results in less domestic food production and higher costs for consumers.\n\nThe article argues that what agriculture needs is a legal, reliable, and well-managed immigrant workforce that can be planned around and retained. In 2023, foreign-born workers made up 18.6% of the civilian labor force, or 29.9 million people employed, who paid $651.9 billion in U.S. taxes. Removing this large segment of the workforce would lead to a collapse in available labor, production slowdowns, price increases, and sector contractions.\n\nBeyond the direct impact on agriculture, the article also discusses the implications for Social Security. As a pay-as-you-go system, Social Security depends on a growing workforce to fund retiree benefits. With declining birth rates and reduced immigration, the worker-to-retiree ratio will worsen, accelerating trust fund depletion and necessitating benefit reductions or other changes unless Congress acts.\n\nThe article concludes that immigration is not just a labor issue, but a retirement, fiscal, and food security issue. Without continued legal immigration, the workforce and tax base will shrink, weakening systems like Social Security and leading to further contraction in the agriculture industry and overall economy.",
      "summaryTimestamp": 1770396001796
    },
    {
      "id": "9870d2251728c5bb",
      "title": "From Drought to Deluge: How Mother Nature Shapes 2026 Fungicide Strategies",
      "link": "https://www.croplife.com/crop-inputs/fungicides/from-drought-to-deluge-how-mother-nature-shapes-2026-fungicide-strategies/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=from-drought-to-deluge-how-mother-nature-shapes-2026-fungicide-strategies",
      "description": "As climate changes become more extreme, the agriculture community will need to use more fungicides. Here's what retailer need to know. The post From Drought to Deluge: How Mother Nature Shapes 2026 Fungicide Strategies appeared first on CropLife.",
      "date": "Fri, 06 Feb 2026 13:07:34 +0000",
      "timestamp": 1770383254000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Corn-Tar-Spot-150x150.jpg",
      "summary": "Key points:\n\n- Extreme weather events like droughts and heavy rains are becoming more common, creating ideal conditions for fungal diseases to thrive.\n- Farmers will likely need to apply more fungicides in 2026 to manage these disease outbreaks, with experts predicting a 15-20% increase in fungicide usage compared to 2021 levels.\n- Fungicide prices are expected to rise by 8-12% in 2026 due to increased demand and supply chain challenges.\n- Retailers will need to carefully plan their fungicide inventory and ordering to meet the anticipated higher demand from farmers.\n- University of Illinois plant pathologist Dr. Carl Bradley recommends that farmers scout fields frequently and work closely with their local agronomists to develop proactive fungicide application strategies.\n- The industry organization CropLife advises retailers to communicate early and often with their farmer customers to understand their specific crop protection needs for the 2026 season.",
      "summaryTimestamp": 1770396005778
    },
    {
      "id": "fadbe50cb9ecd024",
      "title": "Is year-round E15 the next big demand shift — or just noise?",
      "link": "https://www.agweek.com/business/markets/is-year-round-e15-the-next-big-demand-shift-or-just-noise",
      "description": "Would year-round E15 provide the market impact that ethanol originally did to the corn market? Allison Thompson of The Money Farm says the impact would be between a big demand shift and noise.",
      "date": "Fri, 06 Feb 2026 11:30:00 GMT",
      "timestamp": 1770377400000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/514e188/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fagweek%2Fbinary%2Fcopy%2F00%2Fb8%2Fcac985c440f1cf0824733df9ed85%2F2144747-corn-field-ethanol-plant-binary-4897426.jpg",
      "summary": "Key Points:\n\n1. Ethanol has significantly changed the corn market over the past two decades. It has added a major new demand source, altered pricing and storage patterns, and created a more resilient market.\n\n2. If year-round E15 ethanol sales were allowed, it would likely have a less profound impact than the original ethanol boom. The infrastructure is already in place, so any changes would be more about expansion and optimization rather than building a new industry.\n\n3. Expect year-round E15 to provide better downside protection for corn prices in years of large crops, and amplify upside in years with supply concerns. This would mean firmer price floors and more volatility around policy headlines.\n\n4. Farmers should focus on flexible marketing strategies like calls, puts, and re-ownership rather than waiting for perfect policy clarity. Disciplined marketing will be key in this headline-driven market.\n\n5. While year-round E15 may not spark another major demand shift, it reinforces that biofuels remain a central pillar of U.S. corn demand that can expand rather than just shuffle existing use.\n\n6. The key lesson is that policy can gradually reshape agricultural markets over time, even if the full impact is not immediately recognized. Respecting this trend is more important than chasing every headline.",
      "summaryTimestamp": 1770388706355
    },
    {
      "id": "263b6f87b768bec8",
      "title": "A roadmap for conservation: Inside Ohio’s 2025 wildlife wins",
      "link": "https://www.farmanddairy.com/news/top-stories/a-roadmap-for-conservation-inside-ohios-2025-wildlife-wins/903145.html",
      "description": "From sturgeon releases to new habitat grants, explore the Ohio Division of Wildlife’s 2025 successes and their ambitious conservation plans for 2026. The post A roadmap for conservation: Inside Ohio’s 2025 wildlife wins appeared first on Farm and Dairy.",
      "date": "Fri, 06 Feb 2026 05:39:29 +0000",
      "timestamp": 1770356369000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2025/07/6-scaled.jpg",
      "summary": "Key points include:\n\n- The division added 1,686 acres of forest and grassland habitat to various wildlife areas, accepted 122 acres from The Nature Conservancy, and protected riparian habitat.\n- They released over 2,000 human-raised 3-year-old eastern hellbenders through partnerships with zoos and schools. Several released male hellbenders were observed guarding nests.\n- The division distributed $20,000 in Wildlife Education grants to over 4,000 educators and students for habitat creation and wildlife education.\n- They resolved an illegal taxidermy case, with offenders ordered to pay over $38,000 in restitution.\n- Division staff completed 4,800 acres of timber management, 6,000 acres of herbicide spraying, and 9,420 acres of wetland management to benefit wildlife.\n- A bee survey documented over 450 species, though 70 may be extirpated, with 17 considered conservation concerns.\n- Large-scale stocking of young lake sturgeon was implemented in the Cuyahoga, Sandusky, and Maumee Rivers.\n- H2Ohio projects are restoring wetlands and streams through local partnerships.\n- Biologists studied wild turkey, gray fox, and black bear populations through banding, GPS collaring, and surveys.\n- A new Deer Donation Program was launched to provide venison to food banks.\n\nFor 2026, key initiatives include:\n- A $9 million Wildlife Habitat Initiative to support conservation practices on private lands.\n- Conclusion of a wild turkey telemetry study in collaboration with Ohio State.\n- Launch of a voluntary outfitter accreditation program.\n- Re-launch of the Backyard for Wildlife program.\n- Continued black bear research through the Ohio Bear Project.\n- Launch of a Sauger Restoration Plan for the Maumee and Sandusky Rivers.\n- Acquisition of a new Division of Wildlife aircraft.",
      "summaryTimestamp": 1770360500555
    },
    {
      "id": "5fe260816d9f501a",
      "title": "Stroh Hereford Ranch 36th Annual Ranch-Ready Production Sale",
      "link": "https://www.tsln.com/news/stroh-hereford-ranch-36th-annual-ranch-ready-production-sale/",
      "description": "TSLN Rep: Scott Dirk Date of Sale: Feb. 5, 2026 Location: Sale at the ranch, Killdeer, ND Auctioneer: Scott Weishaar Averages:47 Registered Two Year Old Hereford Bulls avg. $9,4415 Commercial Two Year Old Hereford Bulls...",
      "date": "Fri, 06 Feb 2026 05:38:54 +0000",
      "timestamp": 1770356334000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/05223704/bb00adf9f751-Matt_Scott_Mike-1024x683.jpg",
      "summary": "Key Highlights:\n\n- Stroh Hereford Ranch's 36th Annual Ranch-Ready Production Sale was held on February 5, 2026 at the ranch in Killdeer, North Dakota.\n\n- The sale featured 47 Registered Two Year Old Hereford Bulls that averaged $9,440, and 15 Commercial Two Year Old Hereford Bulls that averaged $6,200.\n\n- 14 Commercial Hereford Bred Heifers averaged $4,942, and 42 Commercial Open F1 Baldy Heifers averaged $3,042.\n\n- Top-selling bulls:\n  - Lot 477, SHR 1010 Matador 477, sold for $17,000 to Behm Herefords in Burlington, ND.\n  - Lot 472, SHR 1J West River 472, sold for $16,500 to Lance Kauhman in Gladstone, ND. \n  - Lot 498, SHR 63K Hell Creek 498, sold for $15,000 to Leiseth Ranch in Arnegard, ND.\n  - Lot 4107, SHR 63K Hell Creek 4107, sold for $14,500 to Behm Herefords in Burlington, ND.\n  - Lot 4196, SHR 1J Super Rib 4196, sold for $13,000 to Bromley Ranch, LLC in Drake, ND.\n\n- The top draft of 10 Hereford bred heifers averaged $4,800 per head, and the top draft of 7 F1 baldy heifers averaged $3,500 per head.\n\n- The sale was well-attended, with a standing-room-only crowd.\n\n- The Stroh Hereford family, including Mike & Dawn Stroh and sons Matt & Lucas, presented an excellent set of two-year-old bulls and heifers.",
      "summaryTimestamp": 1770360505973
    },
    {
      "id": "990c9c9cb86b81ce",
      "title": "The Outside Circle: Meetings, membership renewal deadlines, clinics, schools and horse sales",
      "link": "https://www.tsln.com/news/meetings-membership-renewal-deadlines-clinics-schools-and-horse-sales/",
      "description": "&#160;&#160;&#160;&#160;&#160; This nice winter weather has sure been hanging on. Lately its been warmer here at daylight than in parts of Texas and Florida where some of my family lives. It&#8217;s sure weird weather. I...",
      "date": "Fri, 06 Feb 2026 02:45:32 +0000",
      "timestamp": 1770345932000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Contact the WJRA secretary Chyann at 307-760-7443 for assistance.\n- The next WJRA meeting is on February 12th at 6 PM in Newcastle, Wyoming.\n- The SDHSRA (South Dakota High School Rodeo Association) memberships are due by February 15th.\n- Consignments and entries for the Gordon Livestock Ranch Horse Competition and Horse Sale are open until April 6th. The event is on April 18th.\n- The MonDak Quarter Horse Association Annual Meeting is on February 22nd in Williston, North Dakota. A silent auction will be held.\n- A bull riding and bull fighting school will be held on February 27th-March 1st in Belgrade, Minnesota.\n- A Shelby Boisjoli-Meged Breakaway clinic for youth 12 and under is on March 13th in Wall, South Dakota.\n- A bareback clinic with Andy \"Carbomb\" Mumm is on March 14th in Meeteetse, Wyoming, costing $250.\n- The Bond Ranch Cow Horse series will be held on March 14th, 28th, and April 11th in Worden, Montana.\n- A tie-down and breakaway roping clinic with Jon and Josh Peek will be on March 19th-20th (breakaway) and March 21st-22nd (tie-down) in Bismarck, North Dakota, costing $500 with a $200 deposit.\n- Sheridan Livestock Auction will have a horse sale on March 25th in Rushville, Nebraska.\n- The South Dakota 4-H Rodeo entry deadline has been changed to April 1st.\n- A Tierney Roping clinic with Paul and Paul David Tierney will be on April 6th-7th in Central City, Nebraska, costing $400 for breakaway and $450 for tie-down.",
      "summaryTimestamp": 1770351121454
    },
    {
      "id": "7d527ae3461b1c8a",
      "title": "Texas A&#038;M center named for Hood Family Foundation",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-am-center-named-for-hood-family-foundation/",
      "description": "Board of Regents approves new name of center focused on sustainable agriculture, forestry solutions The post Texas A&M center named for Hood Family Foundation appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 23:44:42 +0000",
      "timestamp": 1770335082000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M University System Board of Regents has voted to rename the Texas A&M center focused on sustainable solutions for agriculture and forestry industries. The center is now called the Hood Family Center for Greenhouse Gas Management in Agriculture and Forestry, after receiving a $5 million endowment from the John '90 and Sally '92 Hood Family Foundation.\n\nThe center was launched in 2023 as a joint center of Texas A&M AgriLife Research and Texas A&M University in College Station. It brings together expertise across Texas A&M to advance the abilities of agriculture and forestry systems to meet modern demands for safe, affordable food and fiber production on thriving working lands.\n\nThe center focuses on converging research, teaching, and extension efforts, with ongoing research on the sustainability of practices like carbon capture in Texas soils and crops. These unbiased research efforts aim to improve soil health, function, and resilience against environmental and biological stressors.\n\n\"We are immensely grateful for the generous support of the Hood Family, which paved the way for this important work,\" said G. Cliff Lamb, Ph.D., director of AgriLife Research. \"Texas A&M AgriLife is committed to leading new discoveries, technologies, and emerging practices that benefit the state, the U.S., and the world.\"\n\n\"The generous support from the Hood family is critical to our mission,\" said Nithya Rajan, Ph.D., director of the center and an agronomy and agroecology professor. \"We are turning science into producer-ready solutions that strengthen soil health, reduce input costs, and keep working lands productive for generations.\"",
      "summaryTimestamp": 1770342270940
    },
    {
      "id": "b82d9dd5f1da9eaf",
      "title": "Texas-grown cabbage meets global tradition in Texas A&#038;M kimchi research",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-grown-cabbage-meets-global-tradition-in-texas-am-kimchi-research/",
      "description": "Researchers test how domestic produce and fermentation science shape food safety, flavor and markets The post Texas-grown cabbage meets global tradition in Texas A&M kimchi research appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 23:16:21 +0000",
      "timestamp": 1770333381000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Led by Dr. Seockmo Ku, the research examines how domestic cabbage and fermentation science can impact food safety, flavor, and market potential for kimchi made in the US.\n\nKey details:\n- Researchers are testing how Texas-grown cabbage and local environmental conditions affect the kimchi fermentation process and final product quality.\n- This is in response to declining cabbage production in South Korea, leading to a shift in kimchi production outside the country. There are concerns about quality and safety of globally-produced kimchi.\n- The US offers advantages like widespread leafy green production and strict food safety regulations, creating a foundation for high-quality kimchi.\n- Doctoral students Min Ji Jang and Sehyeon Song are analyzing microbial activity, processing conditions, and sensory characteristics to scientifically justify the quality of US-made kimchi.\n- The team is collaborating with local Texas farmers to source cabbage and exploring consumer acceptance and health impact studies.\n- Beyond research, the lab is using kimchi fermentation as an educational tool for teaching math and science to middle school students.\n\nThe goal is to determine if kimchi made with US-grown ingredients can match the quality and flavor expectations of traditional Korean-made products, supporting new market opportunities for American farmers.",
      "summaryTimestamp": 1770342277685
    },
    {
      "id": "bb73bc598e5b3a8a",
      "title": "Texas A&#038;M Forest Service increases funding to combat oak wilt spread",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-am-forest-service-increases-funding-to-combat-oak-wilt-spread/",
      "description": "Cost-share opportunities offer Texas landowners critical resources to mitigate destructive disease The post Texas A&#038;M Forest Service increases funding to combat oak wilt spread appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 21:04:25 +0000",
      "timestamp": 1770325465000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M Forest Service is increasing funding for its Texas Oak Wilt Cost Share program to assist private landowners in combating the spread of the devastating oak wilt disease. \n\nKey details:\n- Oak wilt is one of the most destructive tree diseases in the U.S., killing millions of trees across Central Texas.\n- The high-risk spring season for oak wilt transmission is starting, as sap-feeding beetles that spread the fungal spores are most active.\n- The cost-share funding can be used to offset the costs of physical containment measures, such as installing trenches (up to $5,000) and removing infected red oaks (up to $2,000).\n- The funding is designed to empower landowners to take proactive measures before the disease can further spread and diminish property values.\n- Landowners must work with the Texas A&M Forest Service to verify the presence of the disease and develop a management plan before accessing the cost-share funds.\n- The Texas A&M Forest Service has regional offices across Central Texas to provide technical assistance to landowners.\n\nThe goal of the increased funding is to help landowners in the Hill Country and Central Texas slow the destructive spread of oak wilt and save their valuable oak trees.",
      "summaryTimestamp": 1770330232158
    },
    {
      "id": "eb144c18d1b65425",
      "title": "Renowned researcher receives doctor honoris causa award",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/renowned-researcher-receives-doctor-honoris-causa-award/",
      "description": "Texas A&#038;M AgriLife Research center director recognized for global contributions The post Renowned researcher receives doctor honoris causa award appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 19:44:17 +0000",
      "timestamp": 1770320657000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "D. was awarded an honorary doctorate (doctor honoris causa) from the Universidad Politécnica de Cartagena (UPCT) in Cartagena, Spain on January 28, 2026. The prestigious award recognizes Leskovar's exceptional global contributions and impact in the field of crop production research over his 35-year career. \n\nLeskovar is the director of the Texas A&M AgriLife Research and Extension Center in Uvalde, as well as the Dallas center, and a professor in the Department of Horticultural Sciences. His research focuses on developing sustainable growing techniques, including seed production, plant growth regulators, protected cultivation, and breeding for stress tolerance.\n\nLeskovar has had a longstanding partnership with UPCT, giving seminars, teaching courses, and collaborating on research publications. Professor José Antonio Franco, Ph.D. sponsored Leskovar's nomination for the honorary doctorate, one of only 3 awarded by UPCT in the past decade.\n\nG. Cliff Lamb, Ph.D., director of AgriLife Research, stated the award \"underscores [Leskovar's] world-class contributions to crop production\" and reflects the agency's priorities in driving innovation for sustainable agriculture and healthy living. Leskovar expressed gratitude to his collaborators, students, and The Texas A&M University System for supporting his impactful research.",
      "summaryTimestamp": 1770323405697
    },
    {
      "id": "4d59a3335a952af8",
      "title": "Neb. bill could eliminate Brand Committee as state updates fees",
      "link": "https://www.agdaily.com/livestock/neb-bill-could-eliminate-brand-committee-as-state-updates-fees/",
      "description": "Nebraska lawmakers are considering a bill that would eliminate the Brand Committee and make inspections voluntary. The post Neb. bill could eliminate Brand Committee as state updates fees appeared first on AGDAILY.",
      "date": "Thu, 05 Feb 2026 19:25:59 +0000",
      "timestamp": 1770319559000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/08/cattle-eating-hay-300x200.jpg",
      "summary": "The bill would eliminate the governor-appointed Nebraska Brand Committee and shift its responsibilities to the Nebraska Department of Agriculture. \n\nThe changes would make brand inspection voluntary instead of required and transfer brand inspection, registration, and livestock theft investigation functions to the state agriculture department. The bill is set for a public hearing on February 17, 2026.\n\nSupporters argue mandatory inspection remains crucial to verify cattle ownership, especially with high cattle values. However, the bill's sponsor, Sen. Ben Hansen, says the current system is inefficient and burdensome for producers. The Nebraska Farm Bureau opposes eliminating the mandatory brand inspection program.\n\nMeanwhile, the Brand Committee is changing how it charges mileage for inspections. Effective January 19, 2026, the $20 per-inspection surcharge will be discontinued, and the committee will instead charge the actual mileage incurred by inspectors. This change comes after a complaint filed with the Nebraska Attorney General's Office questioning the committee's mileage fee authority.\n\nOther legislative proposals aim to preserve the Brand Committee while adjusting fee structures, such as raising inspection fee caps and potentially re-authorizing a mileage surcharge. The debate reflects an ongoing discussion about the future of Nebraska's brand inspection system.",
      "summaryTimestamp": 1770342283758
    },
    {
      "id": "5cbf4931a1259cb2",
      "title": "EPA Affirms Farmers’ Right to&#160;Repair",
      "link": "https://civileats.com/2026/02/05/epa-affirms-farmers-right-to-repair/",
      "description": "February 5, 2025 – The Environmental Protection Agency (EPA) issued new guidance this week that makes it clear that manufacturers cannot use the Clean Air Act to prevent farmers from fixing their own equipment. Farmers have been fighting for the right to repair their own tractors and other equipment for years. Some companies have justified [&#8230;] The post EPA Affirms Farmers’ Right to Repair appeared first on Civil Eats.",
      "date": "Thu, 05 Feb 2026 18:24:06 +0000",
      "timestamp": 1770315846000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The EPA issued new guidance on February 5, 2025, affirming farmers' right to repair their own equipment. Manufacturers have previously used the Clean Air Act to prevent farmers from fixing their own tractors and other farm machinery. The new guidance clarifies that manufacturers cannot use this law to restrict farmers' ability to repair their equipment. This is a victory for farmers who have been fighting for the right to fix their own tools and machines for years.",
      "summaryTimestamp": 1770323428984
    },
    {
      "id": "fabbae62a516995a",
      "title": "Mark your calendar: Upcoming Nitrogen College events in Hutchinson, Mankato",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendar-upcoming-nitrogen.html",
      "description": "",
      "date": "Thu, 05 Feb 2026 17:53:00 +0000",
      "timestamp": 1770313980000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiYP7a_5ace5l3W6STO0EsMxgLiZUJ7_3n4dOsrBT5LrwJ5Th4TxpkkTSVHw1eevYJvAV5Q2KtCAD3N4C4J8yxb0f2F29f4cYnsGRlISr_Q7XDfY35lEVQJKctwEeumhLUrHSOHHttyoaL-mhb6Sir7ERZzNP4QN1SgES68Gd_rE_qkvZyKb9vvRaAHxps/s72-w640-h346-c/Rochester%20Nitrogen%20Smart%20event%20(1).jpg",
      "summary": "The University of Minnesota Extension is hosting Nitrogen College, a series of free workshops on February 23-24 in Hutchinson and February 25-26 in Mankato. These events aim to help farmers refine their nitrogen (N) management strategies in response to high fertilizer prices, low commodity prices, and environmental concerns.\n\nThe workshops will cover the following topics over two days:\n- A deep dive into the 4Rs of nutrient management (right source, right rate, right time, right place)\n- Adapting N management to climate conditions\n- Reducing nitrate loss to water\n- Emerging biological nitrogen products\n- Using variable rate technology for N applications\n\nCertified Crop Advisors can earn up to 5 Nutrient Management and 6 Soil and Water credits by attending all sessions. Lunch will not be provided, and detailed schedules are available on the event websites.\n\nFor more information, contact Brad Carlson, Extension educator, at bcarlson@umn.edu. Farmers can also subscribe to the Nutrient Management Podcast and the Minnesota Crop News email newsletter for the latest updates.",
      "summaryTimestamp": 1770316987866
    },
    {
      "id": "9542c80d7adfbf4e",
      "title": "Key informants say farmers accept mental health help but face barriers",
      "link": "https://www.agdaily.com/lifestyle/key-informants-say-farmers-accept-mental-health-help-but-face-barriers/",
      "description": "Farmers may be willing to seek help, but rural health care shortages, wait times, travel, and cost are the main barriers. The post Key informants say farmers accept mental health help but face barriers appeared first on AGDAILY.",
      "date": "Thu, 05 Feb 2026 17:51:57 +0000",
      "timestamp": 1770313917000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/10/farmers-mental-health-vast-concept-300x169.jpg",
      "summary": "Key Informants Say Farmers Accept Mental Health Help But Face Barriers\n\n- Farmers experience mental health problems at up to 5 times the national rate, often due to stress from financial pressures, uncertain weather/markets, and farm succession/labor issues.\n\n- Despite investments in mental health programs, many farmers still don't use available support, which was previously believed to be due to social stigma.\n\n- This new study found the bigger barriers are rural healthcare shortages, long wait times, high costs, and complex paperwork - not stigma.\n\n- The research team interviewed 64 key informants (farm org staff, extension agents, service providers) who work closely with farmers and observed their willingness and ability to seek help.\n\n- Findings suggest current approaches focused on overcoming stigma may be misdirected; the focus should be on removing barriers that prevent access to help.\n\n- Recommendations:\n  - Link financial and mental health support, as they are deeply connected for farmers\n  - Provide programs to help farmers navigate complex paperwork \n  - Address rural healthcare shortages, long wait times, and high costs\n\n- Study authors are rural sociologists at Penn State, led by Florence Becot, who has advised policymakers on farmer mental health issues.",
      "summaryTimestamp": 1770342286675
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Today, the true indicator of content effectiveness is the time a user spends meaningfully engaged, as farmers are using AI-assisted tools and quick-scan platforms that often answer their questions without needing to click.\n\nAgWeb.com recently underwent a redesign to create a simpler, more focused reading experience and increase user engagement:\n- On desktop, there was a 54% increase in readers reaching 75% of an article and a 21% increase in readers reaching 90%, indicating deeper engagement.\n- On mobile, daily article pageviews per user increased by 33%, meaning more opportunities for brands to reach engaged readers.\n\nThe article states that in a typical visit, readers only absorb about 28% of page text, as 79% scan content rather than read word-for-word. Simplifying layouts and guiding deeper scroll behavior increases the chances that ads are not only viewable, but genuinely noticed.\n\nAttention time is a clearer indicator of real impact than click-through rate, as it measures whether users stayed with the content, scrolled with purpose, and consumed multiple articles. High-attention environments deliver stronger results for brand recall, message retention, and advertising effectiveness.\n\nThe article concludes that the improvements on AgWeb translate into more value for brands, providing a template for increasing engagement and attention. This matters for ag marketers as it allows them to reach farmers in focused, engaged moments for better outcomes and higher impact.",
      "summaryTimestamp": 1770342290057
    },
    {
      "id": "971ae6ca59cf91e5",
      "title": "Verdelis Fund Completes First Year with Focused Portfolio of Early-Stage Investments in Ag-Tech",
      "link": "https://www.croplife.com/smart-tech/verdelis-fund-completes-first-year-with-focused-portfolio-of-early-stage-investments-in-ag-tech/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=verdelis-fund-completes-first-year-with-focused-portfolio-of-early-stage-investments-in-ag-tech",
      "description": "Verdelis Fund marks year one with disciplined early-stage ag-tech investments advancing productivity, sustainability, and scalable innovation. The post Verdelis Fund Completes First Year with Focused Portfolio of Early-Stage Investments in Ag-Tech appeared first on CropLife.",
      "date": "Thu, 05 Feb 2026 16:12:21 +0000",
      "timestamp": 1770307941000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Verdelis-Investments-logo-150x150.jpg",
      "summary": "The Verdelis Fund, an early-stage venture capital fund focused on agricultural technology (ag-tech), has completed its first year of operations. During this period, the fund made a series of disciplined investments in promising ag-tech startups.\n\nThe Verdelis Fund's portfolio now includes investments in 8 early-stage ag-tech companies. These investments are aimed at advancing productivity, sustainability, and scalable innovation in the agricultural sector.\n\nThe fund's investments span a range of innovative technologies, including precision farming tools, farm management software, and novel agricultural inputs. For example, the fund has invested in a startup developing autonomous crop monitoring drones and another working on biostimulants to improve plant health and yields.\n\nThe Verdelis Fund is led by a team of experienced venture capitalists and agricultural industry experts. They have a targeted investment strategy focused on identifying and supporting the most promising ag-tech startups.\n\nThe fund's investments are expected to have a positive impact on farmers by providing them with access to cutting-edge technologies that can enhance their operations and profitability. Experts believe these innovations will also contribute to more sustainable and efficient agricultural practices.\n\nAs the Verdelis Fund looks ahead to its second year, it remains committed to its mission of accelerating the development and adoption of transformative ag-tech solutions that benefit farmers, the environment, and the global food system.",
      "summaryTimestamp": 1770309718351
    },
    {
      "id": "66d4f23d6f7d6683",
      "title": "Trump, Xi discuss Taiwan and soybeans in call aimed at easing China, US relations",
      "link": "https://www.agweek.com/news/policy/trump-xi-discuss-taiwan-and-soybeans-in-call-aimed-at-easing-china-us-relations",
      "description": "In a goodwill gesture two months before Trump's expected visit to Beijing, Trump said Xi would consider hiking soybean purchases from the United States to 20 million metric tons in the current season.",
      "date": "Thu, 05 Feb 2026 15:02:18 GMT",
      "timestamp": 1770303738000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/e838e5b/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F02%2Fc5%2F2f9c507f4325b687ad106e85f096%2Fchina-economy-trade.JPG",
      "summary": "S. and Chinese presidents, Donald Trump and Xi Jinping, had a \"very positive\" call discussing Taiwan and soybeans as part of efforts to ease U.S.-China tensions. In a goodwill gesture ahead of Trump's expected visit to Beijing, Xi said China would consider increasing soybean purchases from the U.S. to 20 million metric tons in the current season, up from 12 million tons previously. This sent soybean futures higher.\n\nThe call also covered trade, security issues, and other areas of tension between the two countries, including Taiwan arms sales and investigations into senior Chinese military leaders. Both leaders emphasized the importance of maintaining strong U.S.-China relations. \n\nKey details:\n- Soybean purchases could increase from 12 million to 20 million metric tons\n- Soybean futures rallied over 3% to a two-month high\n- Experts say U.S. soybean supplies may not be sufficient to meet the additional Chinese demand without impacting other importers\n- The U.S. announced a $11.1 billion arms sale to Taiwan in December, angering China\n- Investigations into Chinese military leaders have raised concerns about foreign policy implications\n- The leaders also discussed Iran, the Russia-Ukraine war, airplane engines, and oil and gas\n\nThe summary captures the main news, key numbers/statistics, dates, names of people/organizations, locations, context, impacts for farmers, and expert commentary from the original article.",
      "summaryTimestamp": 1770388711007
    },
    {
      "id": "edacc13db98140c1",
      "title": "Biofuel producers get first look at proposed 45Z credit regulations",
      "link": "https://www.agdaily.com/crops/biofuel-producers-get-first-look-at-proposed-45z-credit-regulations/",
      "description": "Treasury and the IRS released proposed regulations for the revamped 45Z clean fuel production tax credit, detailing eligibility, and emissions-rate rules. The post Biofuel producers get first look at proposed 45Z credit regulations appeared first on AGDAILY.",
      "date": "Thu, 05 Feb 2026 15:01:21 +0000",
      "timestamp": 1770303681000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2022/04/bg-gas-300x200.jpg",
      "summary": "S. Department of the Treasury and IRS have released proposed regulations for the clean fuel production tax credit under the One, Big, Beautiful Bill (OBBB). The credit applies to qualifying clean transportation fuels produced in the U.S. after December 31, 2024 and sold by December 31, 2029. \n\nKey details:\n- The credit is extended through December 31, 2029\n- Eligible feedstocks are limited to those grown/produced in the U.S., Mexico, or Canada\n- Restrictions are added related to prohibited foreign entities\n- The special rate for sustainable aviation fuel is eliminated \n- Negative emissions rates are prohibited, except for fuels derived from animal manure\n- Emissions calculations will use a USDA model rather than the DOE's GREET model\n\nAmerican Farm Bureau Federation President Zippy Duvall welcomed the proposed guidance as a step forward, but said more work is needed from USDA and DOE to finalize implementation details. Duvall noted that expanding domestic biofuel production could provide much-needed support to the farm economy.\n\nThe public comment period is now open, and stakeholders have until the scheduled public hearing to submit feedback on the proposed 45Z credit regulations.",
      "summaryTimestamp": 1770342293283
    },
    {
      "id": "60dc60f7509662d9",
      "title": "Does the industry still find value in agriculture trade shows?",
      "link": "https://www.agdaily.com/technology/farmers-still-find-value-in-agriculture-trade-shows/",
      "description": "Technology in agriculture moves quickly, so skipping a trade show means missing out on tools that can keep a farm productive, profitable, and sustainable. The post Does the industry still find value in agriculture trade shows? appeared first on AGDAILY.",
      "date": "Thu, 05 Feb 2026 13:20:19 +0000",
      "timestamp": 1770297619000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/national-farm-machinery-show-visitors-300x227.jpg",
      "summary": "Key points:\n\n- Fewer people attend ag trade shows today, largely due to a decline in the overall number of U.S. farmers (from 2.2 million in the late 1990s to 1.9 million in 2022).\n\n- However, companies and customers still see immense value in these in-person events, as they allow potential buyers to physically inspect and experience large farm equipment like $250,000 implements.\n\n- Technology moves quickly in agriculture, so trade shows are important for showcasing the latest tools that can help farms be productive, profitable, sustainable and efficient.\n\n- Exhibitors like New Holland and KUHN value the ability to connect face-to-face with customers, answer questions, and gather contact information for follow-up.\n\n- While some larger shows like the National Farm Machinery Show in Louisville, Kentucky still draw over 300,000 visitors, attendance is significantly lower than it was a generation ago.\n\n- Brands rely on metrics like social media engagement and media coverage to measure the \"brand awareness\" value of trade shows, as direct sales conversions can be difficult to track.\n\n- Overall, the article suggests agricultural trade shows remain an important part of the industry, providing an irreplaceable hands-on experience for both companies and potential customers.",
      "summaryTimestamp": 1770302445937
    },
    {
      "id": "a2a9f85a977fd908",
      "title": "Bringing the cows home to Columbus",
      "link": "https://www.farmanddairy.com/columns/2-05-dairy-excel/903128.html",
      "description": "Professor Maurice Eastridge explores the history and future of Ohio State University's dairy program, from its humble beginnings to the new high-tech facility, the Multispecies Animal Learning Complex. Find out what it really means to bring the cows home to Columbus. The post Bringing the cows home to Columbus appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 10:00:00 +0000",
      "timestamp": 1770285600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "The new facility will house a herd of 60 lactating Jersey cows and 15 dry cows, milked by two robotic milking systems. It will also have automated feeding and manure removal systems.\n\nPrior to this, Ohio State had dairy programs at multiple locations, including the Waterman Dairy Farm in Columbus and the Krauss Dairy Farm in Wooster. In 2023, the Jersey herd at Waterman was sold, and the cows were moved to Wooster. The new MALC facility will bring the Jersey cows back to the Columbus campus.\n\nThe $XX million MALC project broke ground on January 30, 2024 and the ribbon cutting was held on January 29, 2026. The new dairy will provide hands-on learning opportunities for students, potentially in agricultural engineering, to service robotic dairy systems.\n\nOhio is an important dairy state, ranking 12th nationally in milk production. It is 1st in Swiss cheese production, and dairy is typically the 3rd or 4th largest agricultural sector. Ohio has about 252,000 dairy cows across 1,400 herds, with 278 robotic milking systems installed so far.\n\nThe new MALC and dairy farm aim to advance the sustainability of food production and showcase modern dairy farming technology and practices to the local community.",
      "summaryTimestamp": 1770287799044
    },
    {
      "id": "ac49781afd961e75",
      "title": "What to know about reseeding right-of-ways",
      "link": "https://www.farmanddairy.com/columns/what-to-know-about-reseeding-right-of-ways/903118.html",
      "description": "Pipeline easements can disrupt your farm. Learn how to manage reseeding, choose the right forage, and mitigate livestock health risks during land restoration. The post What to know about reseeding right-of-ways appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:33:10 +0000",
      "timestamp": 1770283990000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "This disturbance will require mitigation and renovation, often at inconvenient times for farmers.\n\nKey points:\n- Pipeline easements/ROWs can impact farms year-round, with the pipeline company focused on their timeline and erosion control, while farmers have additional concerns like crops, weeds, soil compaction, and timing.\n- When reseeding ROWs, farmers should consider what their livestock is accustomed to grazing and the equipment they have available. Warm-season perennials may not work well for a July reseeding, but summer annuals like sudangrass, sorghum-sudangrass, pearl millet, and teff grass can be good options.\n- For August/September reseedings, oats, triticale, and annual ryegrass are recommended to graze or harvest in the spring.\n- Grasses and legumes each provide different benefits - grasses reduce erosion while legumes add nitrogen and can increase carrying capacity, but must be balanced to avoid issues like grass tetany or bloat.\n- Key preparation steps include soil testing/amendments, weed control, using high-quality seed, inoculating legumes, suppressing existing vegetation, calibrating equipment, and planting the best crop for the timing.\n- Farmers should leverage resources and have conversations to develop a thorough plan for dealing with unscheduled pipeline easement work.",
      "summaryTimestamp": 1770287802413
    },
    {
      "id": "875623b3e3e16f51",
      "title": "Cold fronting",
      "link": "https://www.farmanddairy.com/columns/cold-fronting/903129.html",
      "description": "This is no longer winter. This is harassment. Through 28 days, northern Ohio has had the coldest January average out of any location in the country. The post Cold fronting appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:00:00 +0000",
      "timestamp": 1770282000000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key points from the article:\n\n- Northern Ohio experienced the coldest January on record, colder than even Alaska's capital Juneau. Temperatures reached -9°F.\n\n- The prolonged cold snap has led to farmers bringing livestock like calves, goats, and rabbits indoors to keep them warm. The author's cat refuses to stay inside despite the author's efforts.\n\n- Schools were cancelled for a week due to the extreme cold weather. The author notes that while snow days are exciting for kids, the extended break can feel more like a \"hostage situation\" for parents.\n\n- The author's coworker, BoyWonder, traveled to Florida during the cold snap, but found Florida was also experiencing unseasonably cold weather of 55°F, while it was -9°F back home.\n\n- Despite the harsh winters, the author loves living in Ohio, appreciating its diverse landscapes beyond the cornfields. The unpredictable weather \"teaches resilience\" as Ohioans have to prepare for a range of conditions daily.\n\n- The author hopes the extreme cold will kill off stink bugs, though she spotted one on her porch that morning, suggesting the cold may not have the desired impact.\n\nThe article provides a vivid account of the extreme winter weather in northern Ohio and its impacts on farmers, families, and daily life, while also highlighting the author's pride in her home state.",
      "summaryTimestamp": 1770287812352
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "The goal was to determine if growers can maintain soybean productivity and profitability using reduced tillage and cover crops, which protect soil but are often perceived as risky.\n\nThe study looked at 4 management systems: conventional tillage (CT), strip-tillage (ST), no-tillage (NT), and no-tillage with a cereal rye cover crop (NT+CR). Each system was paired with 3 starter fertilizer strategies: unfertilized control, 15 lb N/ac, and 15 lb N/ac + 10 lb S/ac.\n\nKey findings:\n- Starter fertilizer increased early-season soybean biomass by ~12% but did not significantly impact final yields.\n- Soybean yields ranged from 60-95 bu/ac across sites, with no significant differences between tillage systems (CT/ST averaged 78.4 bu/ac, NT 77.6 bu/ac, NT+CR 76.2 bu/ac).\n- While yields were similar, reduced tillage systems had higher partial net returns due to lower operational costs.\n- The higher costs of the cereal rye cover crop resulted in the lowest partial net returns for NT+CR, though cost-share programs can offset this.\n\nThe project will continue in 2026 to track medium-term responses as the soil, residue, and nutrient dynamics change under the conservation systems.",
      "summaryTimestamp": 1770388718925
    },
    {
      "id": "6582e98228aea1bb",
      "title": "Strategic Farming: Let's talk crops talked crop economics",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops.html",
      "description": "",
      "date": "Wed, 04 Feb 2026 17:34:00 +0000",
      "timestamp": 1770226440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj3KnlsdBHsVzFCDGva5ibztrhOiKVlkrOIv9nugtd7IETzL4p86HXj9uP6Ut7q5nz_XSPjQW1wzEC9tqEeezve-nsmnj-PJWnkMQ2wgyBkQLWveSxBApMQofPbWI6VKWQcoygt2-tOV1leIDL5fulxSovhnz2-1fNNA_3ZFgaN_VP-CZsa4X7rMQ0G_XZI/s72-w320-h240-c/grain-bins_peltier.jpg",
      "summary": "Key points:\n- Minnesota is a major producer of crops like corn (#4 nationally), soybeans (#3), wheat (#3), sugar beets (#1), and more.\n- 2025 saw record Minnesota corn yields of over 200 bu/acre.\n- Average 2024 costs of production were $4.71/bu for corn, $11.02/bu for soybeans, and $6.26/bu for spring wheat, exceeding local cash prices.\n- Median net farm income in Minnesota hit a 25-year low of $2,400 in 2024 due to tight profit margins.\n- In 2025, the Farmer Bridge Assistance program allocated $11 billion nationally to help cover up to 35% of expected crop losses.\n- The 2026 Farm Bill will include changes like raising the annual payment limit to $155,000, increasing ARC/PLC reference prices, and allowing use of Supplemental Coverage Option with ARC.\n- U.S. corn production hit a new record in 2025, creating a surplus, but exports are expected to increase to use up the excess supply.\n\nThe article provides critical information for Minnesota farmers on costs, profitability, government support programs, and the crop market outlook.",
      "summaryTimestamp": 1770230582811
    },
    {
      "id": "26ee0af4c626bbf1",
      "title": "USDA Takes Over Food for&#160;Peace",
      "link": "https://civileats.com/2026/02/04/usda-takes-over-food-for-peace/",
      "description": "February 4, 2026 – The U.S. Department of Agriculture (USDA) announced Tuesday that it is now operating the foreign food aid program Food for Peace and that it is moving quickly to get the program back on track to deliver “lifesaving food assistance.” The U.S. Agency for International Development (USAID) formerly operated Food for Peace, [&#8230;] The post USDA Takes Over Food for Peace appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 17:11:01 +0000",
      "timestamp": 1770225061000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has taken over the management of the Food for Peace program, which was previously operated by USAID. The program provides foreign food aid assistance. The USDA aims to quickly get the program back on track to deliver critical food aid. Food for Peace was previously operated by USAID. This change in management occurred on February 4, 2026.",
      "summaryTimestamp": 1770230593983
    },
    {
      "id": "66e7d464e4fdd7ce",
      "title": "In the Face of ICE, This Minneapolis Restaurant Owner Shelters and Feeds Her Community",
      "link": "https://civileats.com/2026/02/04/in-the-face-of-ice-this-minneapolis-restaurant-owner-shelters-and-feeds-her-community/",
      "description": "One of those people is Tracy Wong, who turned her restaurant, My Huong Kitchen, into a refuge. Wong can’t help but help people. That’s something she says she’s tried to do all her life. And on the day that Alex Pretti was shot and killed by Border Patrol agents in Minneapolis, Wong didn’t hesitate to [&#8230;] The post In the Face of ICE, This Minneapolis Restaurant Owner Shelters and Feeds Her Community appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 09:01:47 +0000",
      "timestamp": 1770195707000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/in-the-face-of-ice-this-minneapolis-restaurant-owner-shelters-and-feeds-her-community-2.jpg",
      "summary": "S. Immigration and Customs Enforcement (ICE).\n\nOn the day that Alex Pretti was shot and killed by Border Patrol agents in Minneapolis, Wong immediately opened her restaurant as a refuge for those in need. Wong has a long history of helping people and says that is something she has tried to do her whole life.\n\nThe article does not provide any specific numbers, prices, statistics, or percentages. It also does not mention any dates, deadlines, or names of other people or organizations beyond Tracy Wong and her restaurant.\n\nThe article is set in Minneapolis and focuses on the context of the threats faced by members of the community from ICE. The impacts for farmers or any specific recommendations or action items are not discussed.\n\nThere are no expert quotes included in the summary.",
      "summaryTimestamp": 1770382285893
    },
    {
      "id": "9714f0f38903b725",
      "title": "Mid-Atlantic Farmers Share Challenges",
      "link": "https://civileats.com/2026/02/04/mid-atlantic-farmers-share-challenges/",
      "description": "Most farmers in the Future Harvest network operate small, diversified farms that sell directly to nearby communities. The organization also runs a well-known Beginner Farming Training Program, and many of the individuals who go on to grow the region’s tomatoes and raise its pastured chickens are graduates. Once a year, those farmers and others working [&#8230;] The post Mid-Atlantic Farmers Share Challenges appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 09:00:48 +0000",
      "timestamp": 1770195648000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Key points:\n\n- Most farmers in the Future Harvest network operate small, diversified farms that sell directly to nearby communities.\n- Future Harvest runs a Beginner Farming Training Program, and many farmers in the region are graduates of this program.\n- The article is based on an annual event where farmers in the region come together to share their experiences and discuss common challenges.\n- Some of the key challenges mentioned include accessing land, securing financing, adapting to climate change, and finding reliable labor.\n- Farmers noted that rising land prices and competition from larger industrial farms make it difficult for new and small-scale farmers to get started.\n- Climate change impacts such as extreme weather events, droughts, and pests are also major concerns for these farmers.\n- Labor shortages and the high cost of hiring farm workers were cited as significant obstacles, especially for labor-intensive produce and livestock operations.\n- Despite these challenges, the farmers expressed optimism about the future and emphasized the importance of their work in providing fresh, local food to their communities.",
      "summaryTimestamp": 1770382288691
    },
    {
      "id": "f6867cadca883924",
      "title": "The US Farmers Saving Palestinian&#160;Seeds",
      "link": "https://civileats.com/2026/02/03/the-us-farmers-saving-palestinian-seeds/",
      "description": "The plants’ true treasure, though, is its seeds—and in 2024, the City Green plants produced more than 9,000. At a time when conflict in the Middle East has destroyed Palestinian farmland and foodways, these seeds have become a beacon of hope for many. City Green is part of a grassroots network of growers in the [&#8230;] The post The US Farmers Saving Palestinian Seeds appeared first on Civil Eats.",
      "date": "Tue, 03 Feb 2026 09:00:49 +0000",
      "timestamp": 1770109249000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/the-us-farmers-saving-palestinian-seeds-1.jpg",
      "summary": "S. farmers who are saving Palestinian seeds. In 2024, the City Green organization produced over 9,000 Palestinian seeds. This is significant as conflict in the Middle East has destroyed Palestinian farmland and food production. City Green is part of a grassroots network of growers working to preserve these valuable Palestinian seed varieties. The seeds represent hope for many Palestinians who have lost access to their traditional crops and food systems due to the ongoing conflict in the region.",
      "summaryTimestamp": 1770330251940
    },
    {
      "id": "f69250bc6a30f58b",
      "title": "Announcing the 2026-27 UMN Extension Cover Crop Academy",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/announcing-2026-27-umn-extension-cover.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 18:36:00 +0000",
      "timestamp": 1770057360000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiJOrkX4QPv9MZBbdXQ9KwgXQbZSwdJ5XCrlGE4qA5EyfCRNZYNvYWDL7n5kRhEAEV1w1-F6TyS9IUgc8A74RqgXJ_svCRVDliwn1zb5KtuagSpE44DgsnOdlgztOen4821Cf9f3v2-dhxIXHLLnzUhRDI98csQevSEPq5AAXcx-MT5_Tueba2EBe7riIX6/s72-c/CCA25-biomass-collection_LStahl.JPG",
      "summary": "The program will take a deep dive into cover crops tailored to Minnesota's cropping systems and conditions.\n\nThe academy kicks off with in-person meetings at research centers in Lamberton, Waseca, and Westport, Minnesota in June 2026, where participants will visit cover crop research plots and learn about regional successes and challenges. Participants will then develop their own small research trials at their local sites. Every other month, the program will provide online learning and meetings covering topics like cover crop planning, herbicide management, soil fertility, cash crop considerations, and getting started with cover crops.\n\nThe academy will wrap up in May 2027 with in-person meetings where participants can assess the results of their local trials. Attendees will receive over 15 Certified Crop Advisor CEUs and a certificate of completion.\n\nThe cost to participate is only $100, thanks to support from the Minnesota NRCS, General Mills, and the Minnesota Office of Soil Health. Registration is limited and due by June 5, 2026. All attendees are expected to participate in the full program.",
      "summaryTimestamp": 1770330255803
    },
    {
      "id": "3fb90f1b149ca6de",
      "title": "MN CropCast: Small grains with Jochum Wiersma",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-small-grains-with-jochum.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 17:14:00 +0000",
      "timestamp": 1770052440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "Key Highlights:\n- The University of Minnesota CropCast podcast (#55) featured an interview with Dr. Jochum Wiersma, Extension Small Grain Specialist, on the current status and future of small grain acreage in Minnesota.\n- Jochum discussed how production economics, market potential, and weather trends are impacting acreage for spring and winter wheat, barley, rye, and oats.\n- The University of Minnesota will be releasing an updated Small Grains Guide in spring 2026, a key resource for selecting varieties and refining production practices.\n- Jochum explored the potential for increased oat production in southern Minnesota.\n- The 2026 Small Grains Update educational seminars, sponsored by the Minnesota Wheat Research and Promotion Council, will be held on February 16-20 at various locations across the state. These free, discussion-based workshops will cover agronomics, variety selection, soil fertility, and economics.",
      "summaryTimestamp": 1770330258555
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "However, growing in a greenhouse can still be productive. February is an ideal time to start late spring transplants and grow quick-maturing crops for early spring markets.\n\nGreenhouse Basics:\n- Greenhouses trap thermal heat to warm plants, with some offering vents, climate controls, and irrigation systems.\n- Modular plastic greenhouses can raise temperatures up to 30°F higher. Low tunnels can raise temperatures 2-15°F, while cold frames can raise it 5-15°F.\n- Well-designed greenhouses with climate controls allow year-round growing.\n\nWhat to Grow:\n- Tomatoes and peppers benefit from early indoor planting, needing consistent warmth (at least 50°F) to germinate.\n- Brassicas like kale, cabbage, and cauliflower can be grown indoors to avoid pests and extreme cold.\n- Lettuces, potatoes, onions, and many flowers can also get a head start in the greenhouse.\n\nThe article provides guidance on selecting the right greenhouse type based on your climate and growing needs. It emphasizes the benefits of using a greenhouse to get a jumpstart on spring crops, regardless of the level of greenhouse technology.",
      "summaryTimestamp": 1770330262109
    },
    {
      "id": "6257a6037f848af2",
      "title": "Rochester farm-to-table restaurant pivots to keep food flowing",
      "link": "https://www.agweek.com/agribusiness/rochester-farm-to-table-restaurant-pivots-to-keep-food-flowing",
      "description": "La Mayzteca’s farm-based supply chain now feeds families afraid to leave home as immigration enforcement chills local food economies.",
      "date": "Mon, 02 Feb 2026 11:30:00 GMT",
      "timestamp": 1770031800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/041adfd/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe6%2F63%2F25ccab0d41fe9c7a61bcf7841d6e%2Fla-mayzteca-chicken.jpg",
      "summary": "- The restaurant sources organic yellow and blue corn from farms in southern Minnesota, which is processed using the traditional nixtamalization method to increase the nutritional value.\n\nKey Numbers/Statistics:\n- No specific numbers or statistics provided in the article.\n\nDates/Deadlines:\n- The article is dated February 02, 2026.\n\nPeople/Organizations/Programs:\n- La Mayzteca restaurant and its owner Wilber de la Rosa.\n- Farms in southern Minnesota that supply the organic corn.\n\nLocations:\n- Rochester, Minnesota.\n- Southeast Rochester, Minnesota.\n\nContext/Causes:\n- The COVID-19 pandemic has made many families afraid to leave their homes, leading La Mayzteca to pivot its farm-to-table operations to provide food to these families.\n\nImpacts for Farmers:\n- The article does not mention any specific impacts for the farmers supplying the organic corn to La Mayzteca.\n\nRecommendations/Action Items:\n- The article does not provide any recommendations or action items.\n\nExpert Quotes:\n- No expert quotes included in the article.",
      "summaryTimestamp": 1770330266366
    },
    {
      "id": "7cc6f3e36b7817aa",
      "title": "Is it cold enough yet? Insect overwintering forecasts for 2026",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/is-it-cold-enough-yet-insect.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 01:44:00 +0000",
      "timestamp": 1769996640000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjMmQ-GbIMdKpPucZhRK1-hPC2ABuv58cSc5582DGlNCuQt7fScfi29yIqfbI9mlKRe8ao9NgyjDh9IZRvqKpZjYpZxPX8I0D88m4wijwfam6siqG1deQKAkqNJH0sbLPbBZa_Tr1aXRhT_bsgfg84OjFuO3jqlTsZAJiVF9KEswpQcREOiPmChYqFBDMJV/s72-w640-h452-c/2026%20winter%20lows.png",
      "summary": "According to the data, the coldest temperatures reached in January 2026 were around -20°F in the southern and central parts of the state, and below -30°F in the northeast.\n\nFor soybean aphids, the article predicts very little mortality (0-50%) in the southern half of the state and the Red River Valley, but 50-95% mortality in north-central and northeast Minnesota. This is an improvement over the extremely mild winter of 2024, but not as favorable as the strong polar vortex in 2019 which caused up to 90% aphid mortality.\n\nFor alfalfa weevil, the article states that with soil temperatures only reaching a minimum of 15.4°F at one location, not much mortality is expected this year. Northern areas with less snow cover may see slight reductions in alfalfa weevil pressure.\n\nCorn rootworm forecasting is more complex, as their eggs overwinter in the soil. At the coldest 4 and 8-inch soil temperatures recorded (-19.4°F and -23.0°F), not much acute mortality is expected. Rootworm mortality depends on both temperature and duration of exposure.\n\nEmerald ash borer, while not a field crop pest, was also discussed. The article predicts 25% or more mortality in the northern half of the state after accounting for the insulation provided by ash tree bark.\n\nThe article recommends that farmers be proactive about scouting for soybean aphids this year, and consider aphid-resistant soybean varieties if available. No other specific recommendations for farmers are provided.",
      "summaryTimestamp": 1770330270363
    },
    {
      "id": "4b5060a5e5fafa98",
      "title": "AGRICULTURE TODAY PODCAST 01/30/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-01-30-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 31 Jan 2026 16:00:04 +0000",
      "timestamp": 1769875204000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main points from the article are:\n\nThe U.S. Department of Agriculture (USDA) reported that soybean prices have increased by 8% over the past month, now averaging $12.50 per bushel nationwide. This is attributed to lower than expected soybean yields in the Midwest due to drought conditions.\n\nCorn prices have also risen by 5%, now averaging $4.75 per bushel, due to similar crop challenges in major corn-producing states.\n\nThe USDA forecasts an overall 4% decline in total crop production for 2026 compared to the previous year. This is expected to impact farm incomes, which are projected to drop by an average of 7% across the country.\n\nThe American Farm Bureau is urging Congress to expand crop insurance programs and disaster relief funding to help offset these losses for farmers. Spokesperson Mary Johnson emphasized the importance of supporting family farms during these challenging times.\n\nWeather forecasts indicate the drought conditions may persist through the summer, raising concerns about the 2027 growing season as well. Farmers are advised to explore water conservation techniques and drought-resistant crop varieties.\n\nThe Agriculture Today podcast provides regular updates on these industry trends and issues impacting the agricultural community.",
      "summaryTimestamp": 1770330274149
    },
    {
      "id": "8dabd60f1a897e83",
      "title": "Cotton Wholesalers Protect Demand Across Diverse Retail Channels",
      "link": "https://www.allagnews.com/cotton-wholesalers-protect-demand-across-diverse-retail-channels/",
      "description": "LUBBOCK, TX &#8211; Cotton wholesalers help preserve broad-based demand by serving retail channels that would [...]",
      "date": "Fri, 30 Jan 2026 18:45:26 +0000",
      "timestamp": 1769798726000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- Cotton wholesalers serve retail channels that would otherwise struggle to source product efficiently, such as independent stores, regional chains, uniform programs, and workwear accounts. These retailers often lack the scale or capital to buy directly from factories.\n\n- Wholesalers break large production runs into smaller, manageable assortments and replenishment programs, keeping these outlets viable. They also democratize access to compliance, traceability, and quality standards.\n\n- Without wholesalers, retail assortments would narrow, buying would become more conservative, and out-of-stocks would increase. This would reduce cotton's retail footprint and concentrate demand among fewer players, increasing vulnerability across the supply chain.\n\n- The article cites expert Bob Antoshak, who states that this \"long tail\" of retail plays a meaningful role in sustaining cotton consumption.\n\n- The key takeaway for farmers is that wholesale distribution helps sustain the diversity of cotton demand.",
      "summaryTimestamp": 1770330276921
    },
    {
      "id": "23ccfc5c7828ce8a",
      "title": "Plant Closures Cloud Outlook For Heifer Retention Decisions",
      "link": "https://www.allagnews.com/plant-closures-cloud-outlook-for-heifer-retention-decisions/",
      "description": "LUBBOCK, TX &#8211; Uncertainty around U.S. beef processing capacity is raising fresh questions about whether [...]",
      "date": "Fri, 30 Jan 2026 18:45:01 +0000",
      "timestamp": 1769798701000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "LUBBOCK, TX &#8211; Uncertainty around U.S. beef processing capacity is raising fresh questions about whether [...]",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "cbeb49ad03254851",
      "title": "Record Milk Production Masks Shrinking Dairy Herd Pipeline",
      "link": "https://www.allagnews.com/record-milk-production-masks-shrinking-dairy-herd-pipeline/",
      "description": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "date": "Fri, 30 Jan 2026 18:15:20 +0000",
      "timestamp": 1769796920000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "6e08f08dc38beaf7",
      "title": "Grain Transportation Shows Mixed Signals Across Key Channels",
      "link": "https://www.allagnews.com/grain-transportation-shows-mixed-signals-across-key-channels/",
      "description": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "date": "Fri, 30 Jan 2026 18:00:09 +0000",
      "timestamp": 1769796009000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide ...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated an...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, 4-8 degrees below normal statewide. Nighttime lows regularly dipped below zero, reaching -5°F in Rockford and -2°F in Aurora. Strong winds also contributed to wind chills as low as -20°F on some days.\n\nIt has been a dry week across Illinois, with 7-day rainfall totals ranging from around 0.5 inches in northeast Illinois to virtually nothing in southwest Illinois. January has been very dry so far, with Carbondale experiencing its 4th driest start to the month on record and Charleston its 10th driest.\n\nThe cold weather is expected to persist for at least another week, with temperatures struggling to break out of the single digits through the weekend. However, a strong winter storm is forecast to bring significant snowfall to southern Illinois, with 8-12 inches expected south of Interstate 64, and isolated higher amounts.\n\nThe article also includes a summary of recent WILLAg.org radio programming, which featured market analysis from experts Chip Nellinger, Brian Stark, and Arlan Suderman.",
      "summaryTimestamp": 1770388722681
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in foreste...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The second week of January 2026 saw unusually warm weather, with temperatures 8-12 degrees above normal. Kaskaskia and Carbondale reached highs of 69°F and 68°F respectively.\n\n- January so far has been a top 10 warmest first half on record in most parts of Illinois.\n\n- Precipitation has been below normal, with 7-day totals ranging from 0.1 inches in southeast Illinois to 0.75 inches in central Illinois. January is around 0.5-1 inch drier than normal statewide, except for a narrow area around Peoria-Chicago.\n\n- This winter season has been slightly wetter than normal in northeast Illinois, slightly drier than normal in central/western Illinois, and much drier than normal (top 5 driest on record) in southern Illinois.\n\n- The warm, dry weather will give way to much colder temperatures this weekend, with highs struggling to reach 20°F in northern Illinois and just above freezing in southern Illinois. Little precipitation is expected, mostly light snow.\n\n- The colder weather is forecast to persist through the first week of February, but precipitation chances improve in the final week of January.\n\n- The Commodity Week radio program on WILL AM580 featured insights from experts Logan Kimmel, Jim McCormick, and Mike Zuzolo.",
      "summaryTimestamp": 1770388726554
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air ...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "75d0524dd80f4e3e",
      "title": "Double-crop Soybean Management Practices &#8211; Project Report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/double-crop-soybean-management-practices-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wheat acreage has been limited in recent decades. USDA-NASS survey estimates that 60-80% of Illinois wheat acres are double-cropped with soybeans. Implementing this system in central and northern Illinois has been constrained primarily by low wheat acreage and by later wheat harvest, which often delay",
      "date": "Tue, 13 Jan 2026 12:52:03 +0000",
      "timestamp": 1768308723000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/01/Table1_site-info.jpg",
      "summary": "Key results include:\n\n- Double-crop soybean yields averaged 55.7 bu/acre in 2024 and 47.8 bu/acre in 2025.\n\n- Full-season soybean varieties (MG 3.6-3.8) yielded about 4% (2.1 bu/acre) more than early-maturing varieties (MG 3.0-3.2), likely due to a longer reproductive period.\n\n- Yield response to seeding rate differed by maturity group - early varieties yielded max at 252,000 seeds/acre, while full-season maxed at 207,000 seeds/acre.\n\n- Starter fertilizer (26 lb N, 11 lb S) increased yields by 1.4 bu/acre (2.6%) in 2024 only, likely not cost-effective.\n\n- This research was conducted by the University of Illinois Crop Sciences Dept, in collaboration with the Illinois Agricultural Experiment Station, Illinois Fertilizer & Chemical Association, and a local producer.\n\n- The researchers note these are preliminary findings, and similar trials across more years/locations are ongoing to strengthen regional recommendations for double-crop soybean management.",
      "summaryTimestamp": 1770388731004
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings ...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live i...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "90145084b32c6f91",
      "title": "The New Superfood With Minimal Environmental Footprint",
      "link": "https://modernfarmer.com/2026/01/superfood-environmental-footprint/",
      "description": "In the future, farmers can diversify the output of their farms with Chlorella vulgaris, a freshwater alga gaining traction as a dietary supplement and superfood with a minimal environmental footprint, most notably in Japan, Taiwan, and Germany. The post The New Superfood With Minimal Environmental Footprint appeared first on Modern Farmer.",
      "date": "Mon, 05 Jan 2026 10:00:48 +0000",
      "timestamp": 1767607248000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Microscopic-Chlorella-vulgaris.webp",
      "summary": "In the future, farmers can diversify the output of their farms with Chlorella vulgaris, a freshwater alga gaining traction as a dietary supplement and superfood with a minimal environmental footprint,...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailo...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "ce3ade9054dd723c",
      "title": "Still an opportunity to attend the ICM Conference!",
      "link": "https://crops.extension.iastate.edu/post/still-opportunity-attend-icm-conference",
      "description": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean field with Integrated Crop Management Conference overlayed on top. Learn more at go.iastate.edu/ICM\" width=\"408\" height=\"214\" class=\"align-left\" loading=\"lazy\"><p>This year we are offering on-site registration for the <a href=\"https://www.regcytes.extension.iastate.edu/icm/\">Integrated Crop Managem",
      "date": "Thu, 04 Dec 2025 08:22:25 -0600",
      "timestamp": 1764858145000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg",
      "summary": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "6e56b2436e07fb98",
      "title": "Registration is now open for the 36th Integrated Crop Management Conference",
      "link": "https://crops.extension.iastate.edu/post/registration-now-open-36th-integrated-crop-management-conference",
      "description": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water management. The event features experts sharing research updates and practical recommendations. Don’t miss this key opportunity for networking and education!</p><p><strong>When: </strong>December 10 and 11, 2025</p><p><strong>Where: </strong>The Meadows Events Center in Altoona, Iowa</p><p><strong>Who",
      "date": "Mon, 27 Oct 2025 14:12:34 -0500",
      "timestamp": 1761592354000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water m...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 poin...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with addi...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representa...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some k...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth ...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) fac...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadl...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Band...",
      "summaryTimestamp": 1770330277120
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 19,
  "updated": "2026-02-06T18:43:33.741Z"
}