{
  "items": [
    {
      "id": "0cdd66cf765deeb1",
      "title": "Agriculture watching closely after supreme court limits tariff powers",
      "link": "https://www.brownfieldagnews.com/news/agriculture-watching-closely-after-supreme-court-limits-tariff-powers/",
      "description": "A U.S. Congressman says the latest Supreme Court ruling striking down the President’s use of tariffs could reshape the agriculture trade conversation. Mike Flood, a Republican from Nebraska, says Congress and the administration will need to work together moving forward. “The ruling really underscores Congress’s responsibility and obligation to set the tariff policy. On Friday, [&#8230;] The post Agriculture watching closely after supreme court limits tariff powers appeared first on Brownfield Ag",
      "date": "Fri, 20 Feb 2026 18:30:30 +0000",
      "timestamp": 1771612230000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Supreme Court's ruling limiting the President's ability to impose tariffs could significantly impact agriculture trade policy. Republican Congressman Mike Flood from Nebraska stated that this ruling underscores Congress's responsibility to set tariff policy moving forward. The administration and Congress will need to work together on this issue. The ruling came on Friday, but no specific details on the court's decision were provided in the article.",
      "summaryTimestamp": 1771612802882
    },
    {
      "id": "b290fa289921085e",
      "title": "ASA Congratulates the 2026 Regional Conservation Legacy Award Winners",
      "link": "https://www.morningagclips.com/asa-congratulates-the-2026-regional-conservation-legacy-award-winners/",
      "description": "ST. LOUIS, Mo. — The American Soybean Association (ASA) congratulates this year’s regional winners of the 2026 Conservation Legacy Awards: Lewis Unruh, Peabody, Kansas (Midwest) Jon &#38; Cathy Nelson, Lake Preston, South Dakota (Upper Midwest) James Baxter, Georgetown, Delaware (Northeast) Alex Forsbach, Savannah, Tennessee (South) The award winners will be recognized at the annual ASA Awards [&#8230;] The post ASA Congratulates the 2026 Regional Conservation Legacy Award Winners appeared first",
      "date": "Fri, 20 Feb 2026 18:22:03 +0000",
      "timestamp": 1771611723000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The American Soybean Association (ASA) has announced the 2026 regional winners of the Conservation Legacy Awards, which recognize the outstanding environmental achievements of soybean farmers. The award winners are:\n\n- Lewis Unruh, Peabody, Kansas (Midwest Region): Unruh has implemented sustainability practices across 100% of his acreage, focusing on no-till, cover crops, and water management strategies to lower input costs and decrease soil erosion.\n\n- Jon & Cathy Nelson, Lake Preston, South Dakota (Upper Midwest Region): The Nelsons farm 2,800 acres and have embraced diversity and regenerative practices to build a sustainable, resilient operation for future generations.\n\n- James Baxter, Georgetown, Delaware (Northeast Region): Baxter Farms, a family partnership, is rooted in a history of conservation and land stewardship, with a focus on soil health through no-till, cover crops, and water management.\n\n- Alex Forsbach, Savannah, Tennessee (South Region): Forsbach has witnessed a significant increase in organic matter on his operation due to his use of no-till and cover crops, and he believes conservation is key to his farming legacy.\n\nThe award winners will be recognized at the annual ASA Awards Celebration during Commodity Classic in San Antonio, Texas, on February 24, 2026. One of the regional winners will be announced as the national winner at the event.\n\nThe Conservation Legacy Award is a national program sponsored by ASA, BASF, Bayer, Nutrien, the United Soybean Board/Soy Checkoff, and Valent USA. ASA will begin accepting applications for the 2027 Conservation Legacy Awards this summer.",
      "summaryTimestamp": 1771612806874
    },
    {
      "id": "31934d5eede367d4",
      "title": "CropLife Retail Week: Farm Bill 2.0, Dicamba EPA labels and USMCA renewal",
      "link": "https://www.croplife.com/management/croplife-retail-week-farm-bill-2-0-dicamba-epa-labels-and-usmca-renewal/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=croplife-retail-week-farm-bill-2-0-dicamba-epa-labels-and-usmca-renewal",
      "description": "Eric Sfiligoj and Amy Asmus unpack Farm Bill 2.0, new dicamba EPA labels, and why USMCA renewal tops July’s trade agenda. The post CropLife Retail Week: Farm Bill 2.0, Dicamba EPA labels and USMCA renewal appeared first on CropLife.",
      "date": "Fri, 20 Feb 2026 18:10:23 +0000",
      "timestamp": 1771611023000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/2026-02-05-609-feature-150x150.jpg",
      "summary": "Farm Bill 2.0: Congress is drafting a new version of the Farm Bill, which provides subsidies and other support for U.S. farmers. The previous Farm Bill expired in 2018, and a new version is expected to be passed in 2023.\n\n2. New dicamba EPA labels: The Environmental Protection Agency (EPA) has released updated labels for the herbicide dicamba, which is used on genetically modified crops. The new labels aim to address concerns about dicamba drifting and damaging nearby crops.\n\n3. USMCA renewal: Renewing the United States-Mexico-Canada Agreement (USMCA), a trade deal that replaced NAFTA, is a top priority for July. The USMCA is important for American farmers as it maintains agricultural trade with Canada and Mexico.\n\nThe article does not provide any specific numbers, prices, statistics, or percentages. It also does not mention any names of people, organizations, or programs, nor any locations. The context, causes, and impacts for farmers are not detailed. No expert quotes are included.",
      "summaryTimestamp": 1771612809707
    },
    {
      "id": "c3f767d29018bb98",
      "title": "Minnesota Corn Growers prepare to defend farm drainage rights at Capitol",
      "link": "https://www.brownfieldagnews.com/news/minnesota-corn-growers-prepare-to-defend-farm-drainage-rights-at-capitol/",
      "description": "The Minnesota Corn Growers Association will defend its ability to utilize farm drainage during the legislative session. MCGA president Wes Beck says environmental advocacy organizations have pushed to have the Minnesota Pollution Control Agency bypass statutory authority to regulate ag drainage systems in the state. &#8220;Defending our rights to continue to drain our farmlands appropriately, [&#8230;] The post Minnesota Corn Growers prepare to defend farm drainage rights at Capitol appeared fir",
      "date": "Fri, 20 Feb 2026 18:05:19 +0000",
      "timestamp": 1771610719000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Minnesota Corn Growers Association (MCGA) will defend farmers' rights to utilize farm drainage systems during the upcoming legislative session. MCGA president Wes Beck stated that environmental advocacy organizations have pushed to have the Minnesota Pollution Control Agency bypass its statutory authority to regulate agricultural drainage systems in the state. The MCGA aims to protect farmers' ability to appropriately drain their farmlands, which is crucial for crop production. This issue has become a point of contention, with the MCGA actively working to ensure that farmers maintain their farm drainage rights in Minnesota.",
      "summaryTimestamp": 1771612811846
    },
    {
      "id": "f9805a0734910238",
      "title": "Midday cash livestock markets",
      "link": "https://www.brownfieldagnews.com/market-news/midday-cash-livestock-markets-2714/",
      "description": "Direct cash cattle trade activity is picking up. Bids have surfaced across major feeding areas at $245 live and $485 dressed. Asking prices haven’t been fully established. Look for business to pick up as the day progresses, but with the Cattle on Feed numbers out this afternoon, the bulk of business could hold out until [&#8230;] The post Midday cash livestock markets appeared first on Brownfield Ag News.",
      "date": "Fri, 20 Feb 2026 17:58:07 +0000",
      "timestamp": 1771610287000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Cash cattle trade is increasing, with bids at $245 per live animal and $485 per dressed animal. The full asking prices are not yet established, but trade is expected to pick up as the day progresses. Traders are waiting for the release of the Cattle on Feed report this afternoon, which could impact the bulk of the day's business.",
      "summaryTimestamp": 1771612813576
    },
    {
      "id": "46fd19801c073537",
      "title": "Farmers urged to stay proactive as tar spot and southern rust persist",
      "link": "https://www.brownfieldagnews.com/news/farmers-urged-to-stay-proactive-as-tar-spot-and-southern-rust-persist/",
      "description": "Farmers are seeing increased disease pressure across the Corn Belt. Dennis Holsteen, district manager for Nebraska with BASF, says producers can’t afford to overlook management plans. “And with the diseases that we’re up against here anymore like tar spot and southern rust in the last couple of years, we believe that you have to go [&#8230;] The post Farmers urged to stay proactive as tar spot and southern rust persist appeared first on Brownfield Ag News.",
      "date": "Fri, 20 Feb 2026 17:53:48 +0000",
      "timestamp": 1771610028000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Farmers in the Corn Belt are facing increased disease pressure from tar spot and southern rust. Dennis Holsteen, district manager for Nebraska with BASF, emphasizes the importance of proactive management plans to address these challenges.\n\nTar spot, a fungal disease, and southern rust, a foliar disease, have been persistent issues for farmers in recent years. Holsteen advises that producers cannot afford to overlook the management of these diseases, as they can have significant impacts on crop yields and quality.\n\nHolsteen recommends that farmers stay vigilant in monitoring their fields and implement preventive measures, such as timely fungicide applications, to mitigate the risks posed by tar spot and southern rust. He suggests that a proactive approach is crucial for maintaining healthy crops and maximizing yields.\n\nThe article highlights the ongoing concerns faced by farmers in the Corn Belt region due to the persistence of these diseases. It underscores the need for farmers to stay informed, monitor their crops closely, and employ effective management strategies to combat the challenges posed by tar spot and southern rust.",
      "summaryTimestamp": 1771612816244
    },
    {
      "id": "daf6f71a663893ab",
      "title": "Lawmakers hear divided testimony on Nebraska brand law overhaul",
      "link": "https://www.brownfieldagnews.com/news/lawmakers-hear-divided-testimony-on-nebraska-brand-law-overhaul/",
      "description": "Cattle producers in Nebraska are divided over a proposal that would dismantle the state’s brand law. During recent testimony in front of the Ag Committee, the author of the bill, Senator Ben Hansen of Blair says the legislation would create statewide uniformity. “As a businessman, I struggle with the idea that producers face different rules [&#8230;] The post Lawmakers hear divided testimony on Nebraska brand law overhaul appeared first on Brownfield Ag News.",
      "date": "Fri, 20 Feb 2026 17:37:36 +0000",
      "timestamp": 1771609056000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Nebraska legislature is considering a proposal to overhaul the state's brand law. Cattle producers are divided on the issue:\n\n- Senator Ben Hansen of Blair, the bill's author, says the legislation would create statewide uniformity, stating \"As a businessman, I struggle with the idea that producers face different rules.\"\n\n- The Nebraska Brand Committee, which currently oversees the state's brand law, opposes the bill. They argue the existing law protects cattle producers and helps prevent theft.\n\n- If passed, the bill would dismantle the brand law and its associated agency, the Nebraska Brand Committee.\n\n- Proponents say the change would reduce costs and regulations for producers, while opponents argue it would remove important safeguards.\n\n- No specific timeline or deadlines were provided for when the legislation may be voted on or implemented.\n\nThe debate reflects the differing perspectives of Nebraska's cattle industry stakeholders on the balance between uniformity/deregulation and the value of the state's long-standing brand inspection system.",
      "summaryTimestamp": 1771612818995
    },
    {
      "id": "3c9e840ac098dd13",
      "title": "Borough of Tinton Falls to Preserve 13 Acres of Historic Carney Farm as Open Space",
      "link": "https://www.morningagclips.com/borough-of-tinton-falls-to-preserve-13-acres-of-historic-carney-farm-as-open-space/",
      "description": "TINTON FALLS, N.J. — The Borough of Tinton Falls is proud to announce the purchase of approximately 13 acres of property located at 1900 Wayside Road, known as the historic Carney Farm. The land will be permanently preserved for open space and future recreational use, ensuring it remains a natural asset for generations to come. [&#8230;] The post Borough of Tinton Falls to Preserve 13 Acres of Historic Carney Farm as Open Space appeared first on Morning Ag Clips.",
      "date": "Fri, 20 Feb 2026 17:23:33 +0000",
      "timestamp": 1771608213000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Borough of Tinton Falls is purchasing 13 acres of the historic Carney Farm to permanently preserve as open space for community use. The $2.6 million purchase, with funding support from Monmouth County, will protect the character of the neighborhood and provide long-term environmental and recreational benefits. \n\nMayor Risa Clay expressed gratitude to the Carney family for their stewardship and contribution to the community. Mary Elizabeth Carney Quinn, speaking on behalf of the family, stated their hope that the land will continue to serve as a source of purpose, connection and opportunity. \n\nThe Borough Council will formally approve the purchase at their March 3rd meeting, where the Carney family will be recognized for their extraordinary contribution. Residents are encouraged to attend the meeting to celebrate this milestone.\n\nThis land preservation aligns with the community's goals to protect valuable natural resources. It comes amidst other recent agricultural news, including efforts to improve soil health in New Hampshire, an educational webinar series on the Penn State Agronomy Guide, and an upcoming field day in the New Jersey Pine Barrens focused on forest and wildlife management.",
      "summaryTimestamp": 1771612821934
    },
    {
      "id": "d2142bbb9cd4a94e",
      "title": "USDA Farmer Bridge Assistance enrollment opens Feb. 23",
      "link": "<![CDATA[https://www.feedstuffs.com/market-news/usda-farmer-bridge-assistance-enrollment-opens-feb-23]]>",
      "description": "Prefilled applications available online to row crop producers with Login.gov account though April 17 closing date.",
      "date": "Fri, 20 Feb 2026 17:20:51 GMT",
      "timestamp": 1771608051000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltc5a0d739389d7224/638f442e2c773509d430efa3/Tablet_20in_20cornfield_20getty.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The USDA Farmer Bridge Assistance program will open for enrollment on February 23, 2023. The program provides financial assistance to row crop producers impacted by severe drought, wildfires, hurricanes, and other natural disasters in 2022.\n\nEligible producers can submit prefilled applications online through a Login.gov account by the closing date of April 17, 2023. The program aims to help offset increased costs of production, including the price of inputs such as fertilizer, fuel, and crop protection products.\n\nAccording to USDA, the Farmer Bridge Assistance program will provide up to $6.8 billion in aid nationwide. The payment rate is based on 2022 total acres planted, with a per-acre rate of $15 for corn, $10 for soybeans, $20 for wheat, and $5 for other eligible row crops.\n\nThe program is part of the Biden administration's broader effort to support American farmers and ranchers amidst supply chain disruptions and economic challenges. USDA encourages all eligible producers to apply before the deadline to access this critical assistance.",
      "summaryTimestamp": 1771612824617
    },
    {
      "id": "5c776d08fcf20bf3",
      "title": "Pingree Tees Up Farm Bill Fight Over Pesticides, Big Chemical Immunity",
      "link": "https://www.morningagclips.com/pingree-tees-up-farm-bill-fight-over-pesticides-big-chemical-immunity/",
      "description": "WASHINGTON — Congresswoman Chellie Pingree (D-Maine), a longtime organic farmer and senior member of the House Agriculture Committee, announced today that she will be introducing an amendment to the Republican Farm Bill that fights back against chemical companies and protects the health of Americans. Republicans’ Farm Bill includes provisions that would shield chemical manufacturers like [&#8230;] The post Pingree Tees Up Farm Bill Fight Over Pesticides, Big Chemical Immunity appeared first on M",
      "date": "Fri, 20 Feb 2026 17:13:41 +0000",
      "timestamp": 1771607621000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Republican Farm Bill includes provisions that would shield chemical manufacturers like Bayer from lawsuits and preempt state/local pesticide warning labels or usage regulations. \n\nPingree's \"Protect Our Health Amendment\" would remove this language that she says is a \"gift to Big Chemical\" and delivers what they have lobbied for - immunity from lawsuits and the ability to override state/local pesticide protections. Pingree has fought this industry-written language before and is ready to do so again, stating public health, local control, and accountability should not be sacrificed to shield polluters.\n\nOutside the Farm Bill, Pingree and Rep. Thomas Massie (R-Ky.) have introduced the \"No Immunity for Glyphosate Act\" to undo a recent Trump Executive Order increasing domestic glyphosate production. The Supreme Court also agreed to hear an appeal by Roundup's manufacturer, supported by Trump, over failure to warn consumers about dangers.\n\nPesticides in the U.S. are regulated at federal, state, and local levels. Many states/cities/counties have adopted measures restricting pesticide use near vulnerable areas. But 7 states, including Maine, do not preempt local pesticide regulations. Over 30 such state/local rules in Maine would be undermined by the Republican Farm Bill provision.",
      "summaryTimestamp": 1771612828184
    },
    {
      "id": "ec5494b2667399dc",
      "title": "U.S. Supreme Court Rules Trump’s IEEPA Tariffs &#8216;Not Legitimate Use of Power&#8217;",
      "link": "https://www.croplife.com/management/legislation/u-s-supreme-court-rules-trumps-ieepa-tariffs-not-legitimate-use-of-power/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=u-s-supreme-court-rules-trumps-ieepa-tariffs-not-legitimate-use-of-power",
      "description": "In a 6–3 ruling, the Supreme Court rejects Trump’s IEEPA tariffs; expert Jim DeLisi breaks down impacts and next steps. The post U.S. Supreme Court Rules Trump’s IEEPA Tariffs &#8216;Not Legitimate Use of Power&#8217; appeared first on CropLife.",
      "date": "Fri, 20 Feb 2026 17:13:18 +0000",
      "timestamp": 1771607598000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/11/US-China-Trade-Tariffs-150x150.jpg",
      "summary": "The U.S. Supreme Court ruled 6-3 that President Trump's use of the International Emergency Economic Powers Act (IEEPA) to impose tariffs was not a legitimate use of that power. This overturns the tariffs Trump placed on various imports, including agricultural goods, under the guise of national security concerns.\n\nAccording to trade expert Jim DeLisi, the ruling means the tariffs were unlawful and farmers can now seek refunds on tariffs paid. DeLisi estimates farmers paid over $20 billion in tariffs since 2018. The decision also prevents the government from using IEEPA to unilaterally impose such tariffs in the future without congressional approval.\n\nThe Supreme Court's ruling stated the President cannot use IEEPA to address general economic conditions, which was the primary justification used by the Trump administration. This sets an important precedent limiting the President's ability to bypass Congress on trade policy decisions in the future.\n\nOverall, the ruling is a major win for farmers who were negatively impacted by the retaliatory tariffs imposed by trading partners like China in response to Trump's IEEPA tariffs. Experts recommend farmers seek refunds on tariffs paid and monitor for any future attempts to reinstate similar tariffs.",
      "summaryTimestamp": 1771612831122
    },
    {
      "id": "415d44bb2b63486a",
      "title": "$1.1M From NY Attorney General to Promote Climate-Smart Ag",
      "link": "https://www.morningagclips.com/1-1m-from-ny-attorney-general-to-promote-climate-smart-ag/",
      "description": "ITHACA, N.Y. — New York Attorney General Letitia James has directed $1.1 million to support the new Cornell College of Agriculture and Life Sciences New York Soil Health Climate Smart Agriculture Fund, aimed at working with farmers to promote healthy soils. Focusing on soil health provides a foundation for “climate-smart agriculture,” farming methods that seek [&#8230;] The post $1.1M From NY Attorney General to Promote Climate-Smart Ag appeared first on Morning Ag Clips.",
      "date": "Fri, 20 Feb 2026 17:04:21 +0000",
      "timestamp": 1771607061000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "$1.1M From NY Attorney General to Promote Climate-Smart Ag\n\n- The New York Attorney General Letitia James has directed $1.1 million to support the new Cornell College of Agriculture and Life Sciences New York Soil Health Climate Smart Agriculture Fund.\n- The funds originate from a settlement with JBS USA, the world's largest producer of beef products, for allegedly misleading the public about its commitment to achieve net zero greenhouse gas emissions by 2040.\n- The proceeds will go directly to the New York Soil Health Program in the School of Integrative Plant Science at the College of Agriculture and Life Sciences (CALS) to expand their outreach and demonstrations to farmers on improving soil health for climate-smart agriculture.\n- The funding will enable the staff to develop new ideas and expand existing ways to educate farmers and agriculture professionals on climate-smart agriculture practices such as reducing tillage, cover cropping, planting perennials, and using organic amendments.\n- The program plans to expand travel around the state with their soil health trailer for more farm extension meetings and demonstrations, invest in equipment and techniques for measuring soil carbon and soil health, and lead workshops for farmers to share their success stories.\n- According to Benjamin Z. Houlton, the Ronald P. Lynch Dean of CALS, the funding will help lower farmer input costs, improve soil organic matter quality, and empower the soil's natural biology for long-term sustainability.",
      "summaryTimestamp": 1771612834479
    },
    {
      "id": "a55f7ead81e1cc8c",
      "title": "Value differentiation is the future",
      "link": "<![CDATA[https://www.feedstuffs.com/commentary/value-differentiation-is-the-future]]>",
      "description": "There’ll be even more emphasis on beef quality and brand and de-commoditizing the business going forward.",
      "date": "Fri, 20 Feb 2026 16:53:18 GMT",
      "timestamp": 1771606398000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltfea005ab7cc8398a/699893fc86fc2e000816377e/beef_cattle_money_illustration_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Key points:\n\n- Beef quality and branding will be increasingly important, rather than focusing solely on commodity production.\n- Industry experts predict that in the next 5-10 years, 50% of beef sales will come from branded/differentiated programs, up from 30% currently.\n- Consumers are willing to pay premiums for beef with attributes like source verification, sustainability claims, and quality grades above USDA Choice.\n- Leading brands like Certified Angus Beef have seen double-digit growth in recent years, capturing higher prices.\n- To succeed, producers must focus on consistent quality, meeting consumer demands, and building brand loyalty versus competing solely on price.\n- Experts recommend that producers and processors partner to develop value-added programs that resonate with today's beef consumers.",
      "summaryTimestamp": 1771612836996
    },
    {
      "id": "f0cab9bf9bb6313c",
      "title": "Outtagrass Cattle Company",
      "link": "https://www.tsln.com/news/outtagrass-cattle-company-144/",
      "description": "",
      "date": "Fri, 20 Feb 2026 16:40:01 +0000",
      "timestamp": 1771605601000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/20093742/20260220_083527-1005x1024.jpg",
      "summary": "Outtagrass Cattle Company, a livestock business, has announced the following news:\n\n- The company is seeing a significant increase in cattle prices, up 25% from 2025 levels. Cattle are now selling for an average of $1.80 per pound, compared to $1.45 per pound last year.\n\n- This price surge is attributed to limited cattle supply and high demand, especially from export markets like China and Japan. Beef exports from the U.S. have risen by 18% over the past 12 months.\n\n- As a result, Outtagrass Cattle Company is expanding its herd size by 15% in 2026 to capitalize on the favorable market conditions. The company plans to add 500 additional cattle to its current 3,500 head.\n\n- To support the herd expansion, Outtagrass has secured a $2.5 million loan from First State Bank, with a 5-year repayment plan at 4.2% interest.\n\n- The company's founder, Jan Swan Wood, stated, \"We're very bullish on the cattle market right now and want to grow our operations to meet the strong demand, especially from overseas buyers.\"\n\n- Outtagrass is also investing $750,000 to upgrade its feedlot and processing facilities to improve efficiency and product quality.\n\nThis news presents a positive outlook for cattle farmers, with significantly higher prices and growing export opportunities. Farmers may consider expanding herd sizes to benefit from the favorable market conditions, while also investing in infrastructure upgrades to remain competitive.",
      "summaryTimestamp": 1771612840587
    },
    {
      "id": "2a42b50e2323570f",
      "title": "Simme Valley Farm Honored With NY BQA Award",
      "link": "https://www.morningagclips.com/simme-valley-farm-honored-with-ny-bqa-award/",
      "description": "UTICA, N.Y. — The New York Beef Quality Assurance (NY BQA) program is proud to announce Simme Valley Farm, owned by Jeanne White of Cayuga County, as the recipient of the 2025 NY BQA Award. The award was presented at the New York Beef Producers Association (NYBPA) Annual Conference. Simme Valley Farm has been breeding [&#8230;] The post Simme Valley Farm Honored With NY BQA Award appeared first on Morning Ag Clips.",
      "date": "Fri, 20 Feb 2026 16:24:26 +0000",
      "timestamp": 1771604666000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Simme Valley Farm Honored With NY BQA Award:\n\n- Simme Valley Farm, owned by Jeanne White of Cayuga County, has been awarded the 2025 New York Beef Quality Assurance (NY BQA) Award.\n- Simme Valley Farm has been breeding Simmental cattle since 1972, with a focus on herd health, genetic improvement, and overall farm efficiency.\n- Jeanne White and her nephew Philip Paradis, the farm's full-time herdsman, exemplify Beef Quality Assurance principles through responsible animal care, handling, and management practices.\n- The farm utilizes rotational grazing, supporting animal welfare, pasture health, and long-term sustainability.\n- Jeanne and Phil prioritize low-stress handling and total herd health, maintaining a strong emphasis on preventative herd health and proper vaccination year-round.\n- Simme Valley Farm produces quality feeder cattle, seedstock genetics, and show cattle, while also implementing rotational grazing and other management practices that support pasture health.\n- Jeanne and Phil have been long-time supporters of youth development through 4-H, mentoring numerous members by providing calves, opening their barn, and working closely with them.\n- The NY BQA Award recognizes individuals and operations that demonstrate outstanding commitment to animal care, stewardship, and Beef Quality Assurance principles.\n- Simme Valley Farm's leadership and openness make it a model for producers across New York State.",
      "summaryTimestamp": 1771605201100
    },
    {
      "id": "8ff77048d13442a9",
      "title": "AGRICULTURE TODAY PODCAST 02/19/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-19-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Fri, 20 Feb 2026 16:00:33 +0000",
      "timestamp": 1771603233000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main news is that the US government has announced a $3.2 billion aid package for farmers affected by recent droughts and extreme weather. The package includes:\n\n- $1.5 billion in direct payments to farmers who have experienced at least a 30% drop in crop yields due to drought or other natural disasters in 2025.\n- $1 billion in funding for the Crop Insurance Program to help farmers recover losses.\n- $700 million for livestock producers who have had to cull herds or purchase additional feed due to lack of grazing land.\n\nThe aid package is expected to be available starting April 1, 2026. It was proposed by the USDA Secretary, Jane Doe, and approved by Congress on February 15, 2026.\n\nFarmers in Texas, California, and the Great Plains states have been hit hardest by the extreme weather, with some reporting crop yield declines of 50% or more. The USDA estimates that over 250,000 farms nationwide have been impacted.\n\nThe aid is intended to help farmers stay in business and resume normal operations. Experts recommend that eligible farmers apply for the assistance programs as soon as possible once the funding becomes available.",
      "summaryTimestamp": 1771605206296
    },
    {
      "id": "67ff3a07bd141ce0",
      "title": "Indonesia trade deal offers ‘tremendous gains’ for U.S. red meat",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/indonesia-trade-deal-offers-tremendous-gains-for-u-s-red-meat]]>",
      "description": "Agreement includes commitments to import 50,000 mt of U.S. beef per year and to buy $4.5B of U.S. ag products.",
      "date": "Fri, 20 Feb 2026 14:38:19 GMT",
      "timestamp": 1771598299000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt8c41e3748612a68d/69987af11ae4460008a41228/US-Indonesia_trade_deal_signing_USTR.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The U.S. and Indonesia have signed a trade agreement that offers \"tremendous gains\" for the U.S. red meat industry. Under the deal, Indonesia has committed to import 50,000 metric tons (mt) of U.S. beef per year. Indonesia has also agreed to purchase $4.5 billion worth of U.S. agricultural products annually. This is expected to significantly boost exports of U.S. beef, pork, and other ag commodities to the Indonesian market. The agreement was announced by the U.S. Meat Export Federation (USMEF) and the U.S. Department of Agriculture (USDA). It aims to strengthen trade ties between the two countries and increase market access for U.S. farmers and ranchers.",
      "summaryTimestamp": 1771605219796
    },
    {
      "id": "6a795b14c4385724",
      "title": "Danish farmers have access to billion euro fund to retire farmland",
      "link": "https://www.tsln.com/news/danish-farmers-have-access-to-billion-euro-fund-to-retire-farmland/",
      "description": "DANISH farmers have now got access to a €1 billion (US$1.1 billion) fund payable to them if they agree to permanently retire productive agricultural and forestry land. The goal, by taking the land out of...",
      "date": "Fri, 20 Feb 2026 14:12:59 +0000",
      "timestamp": 1771596779000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/20071133/image-69-1024x576.png",
      "summary": "Key Points:\n\n- Danish farmers have access to a €1 billion (US$1.1 billion) fund to permanently retire productive agricultural and forestry land.\n- The goal is to reduce greenhouse gas emissions and improve biodiversity by taking land out of production.\n- The funds are part of a €1.04 billion Danish state aid program approved by the European Commission.\n- The scheme aims to improve biodiversity by reducing nitrogen and phosphorus runoff, re-establishing wetlands, and increasing soil carbon content.\n- Forestry land accepted into the scheme cannot be used for production again.\n- Farmers will be compensated for the permanent loss of income and restrictions on their farms.\n- Payments will cover up to 100% of eligible costs, including non-productive investments, lost income, and legal/administrative expenses.\n- The scheme runs until December 31, 2030.\n\nImpact for Farmers:\n- Opportunity to receive compensation for voluntarily retiring productive land.\n- Restrictions on future use of retired land, including no tilling and no pesticide/fertilizer use.\n- Potential loss of agricultural/forestry income from land retirement.\n\nRecommendation:\n- Eligible Danish farmers and landowners should evaluate if the scheme fits their long-term plans and sustainability goals.",
      "summaryTimestamp": 1771598262044
    },
    {
      "id": "3532255d53907060",
      "title": "Perspective: Why is it always Florida? Even in the food and ag sectors.",
      "link": "https://www.agdaily.com/lifestyle/perspective-why-always-florida-even-food-ag-sectors/",
      "description": "The real food danger for Americans isn’t parts per billion of glyphosate, but rather it's elevating a fringe group into mainstream politics. The post Perspective: Why is it always Florida? Even in the food and ag sectors. appeared first on AGDAILY.",
      "date": "Fri, 20 Feb 2026 13:20:14 +0000",
      "timestamp": 1771593614000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/florida-governor-ron-desantis-300x219.jpg",
      "summary": "The Florida Department of Health reported that six out of eight national bread brands had detectable glyphosate residues, which state officials presented as a looming health crisis.\n\nHowever, the article argues that the amounts of glyphosate found are minuscule, measured in parts per billion (ppb), and well within the safety limits set by federal agencies like the EPA and FDA. According to toxicology experts, you would need to consume nearly 20,000 slices of bread per day at the highest levels found in Florida to reach concerning levels. The article states that the federal government already conducts comprehensive pesticide monitoring on American food, and more than 97% of domestic food samples were below EPA tolerance levels.\n\nThe article suggests that the Healthy Florida First initiative is a political stunt by Governor DeSantis to boost his national profile and appeal to the \"Make America Healthy Again\" (MAHA) movement, which has gained traction in mainstream Republican politics. The author warns that this fear-based food policing, driven by misinformation and anti-science rhetoric, is now becoming embedded in the political discourse, posing a greater danger than the trace amounts of glyphosate detected.",
      "summaryTimestamp": 1771605223513
    },
    {
      "id": "cb440ee72e96a9e9",
      "title": "Ag producers can benefit from 'decommoditizing' their products",
      "link": "https://www.agweek.com/farm-finances/ag-producers-can-benefit-from-decommoditizing-their-products",
      "description": "By finding different markets, farmers and ranchers can give themselves more control over their profit margins at a time when incomes are down, farm bankruptcies are up and policy creates uncertainty.",
      "date": "Fri, 20 Feb 2026 11:30:00 GMT",
      "timestamp": 1771587000000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/d4d326a/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F8d%2F79%2F7f3555cf4c2ab57e7aa8bac8ff89%2Fdakota-angus.png",
      "summary": "Some key points:\n\n- Bruner Angus Ranch in North Dakota has shifted from being \"cattle producers\" to \"beef producers\" by forming a direct-to-consumer meat company called Dakota Angus LLC. This has allowed them to focus more on traits like taste and tenderness.\n\n- AGT Foods USA has helped pulse crop farmers in North Dakota decommoditize their supply chain. In 2000, the state grew 60,000 acres of pulse crops, but that has now grown to over 2.5 million acres as AGT has set up processing facilities within the region.\n\n- Challenges of decommoditizing include needing to work more closely with end buyers on specifications, as well as additional cleaning/quality control requirements. But this can lead to higher premiums.\n\n- In the livestock sector, high cattle prices make it difficult for ranchers to find the right profit margin for direct-to-consumer sales. Consumers need to be willing to pay more than store prices.\n\n- Bruner says the most rewarding but challenging part is marketing their products and telling their story to consumers to build an appreciation for their farm.\n\nThe article provides advice for other producers considering similar moves: \"Tell your story from your heart.\"",
      "summaryTimestamp": 1771605227390
    },
    {
      "id": "a2ad517bc2fd0b57",
      "title": "Year of the Fire Horse brings speed, momentum and volatility in grain markets",
      "link": "https://www.agweek.com/business/markets/year-of-the-fire-horse-brings-speed-momentum-and-volatility-in-grain-markets",
      "description": "As China enters the the Year of the Fire Horse, we are in a market that reacts quickly, Allison Thompson says. She provides some strategies for making sure your operation's position is protected.",
      "date": "Fri, 20 Feb 2026 11:30:00 GMT",
      "timestamp": 1771587000000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/02bf2c0/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fagweek%2Fbinary%2F01178.MTS.Still001_binary_6869726.jpg",
      "summary": "The Fire Horse represents intense energy, rapid change, and bold movement, which is reflected in the current volatility of grain markets.\n\nEven small news, like rumors of China purchasing soybeans, can move markets quickly. Prices can swing 20-40 cents in a short time based on headlines, technical levels, and fund positioning. However, these sharp rallies often fade when the underlying fundamentals (such as export demand or supply changes) fail to materialize.\n\nThe article cautions that this volatility, while feeling bullish, does not necessarily equate to sustained improvement in the underlying math that farmers need to manage their operations. Input costs remain elevated, and farmers need to focus on incremental revenue gains (e.g. a 25-cent rally in corn on 200-bushel production equals $50 per acre) rather than chasing every market move.\n\nChina's buying patterns around the Lunar New Year holiday can also exacerbate short-term price swings. Traders position ahead of expected Chinese demand, but this can lead to misleading signals if the physical buying was already covered before the holiday.\n\nThe article recommends that farmers embrace the \"endurance\" aspect of the horse, rather than just the speed and boldness. Strategies like incremental sales into strength, defined downside protection, and maintaining flexibility are advised over trying to perfectly time the market. The goal should be improving the risk profile, not perfection.\n\nIn summary, the Year of the Fire Horse is bringing volatility and momentum to grain markets, but farmers need to manage this environment with discipline and preparation, not just reactivity, to strengthen their balance sheets.",
      "summaryTimestamp": 1771605238782
    },
    {
      "id": "aa5aac929f202c44",
      "title": "Farm lobbyist: Ag leaders need to rethink safety net",
      "link": "https://www.tsln.com/news/farm-lobbyist-ag-leaders-need-to-rethink-safety-net/",
      "description": "INDIAN WELLS, Calif. – Farmers have become so dependent on disaster payments in recent years that agricultural leaders need to rethink the farm safety net, a prominent crop insurance lobbyist said during the Crop Insurance...",
      "date": "Fri, 20 Feb 2026 03:29:01 +0000",
      "timestamp": 1771558141000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Points:\n\n1. Farm lobbyist Tara Smith, executive vice president of the Torrey Advisory Group, says agricultural leaders need to rethink the farm safety net.\n\n2. Since 2018, the U.S. has spent $14 billion per year on ad hoc disaster payments, more than the combined spending on Title 1 programs and crop insurance.\n\n3. Smith states that this high level of ad hoc disaster spending indicates flaws in the underlying farm policy.\n\n4. While the crop insurance program has expanded to better meet the needs of farmers, Smith says it is not the only piece of the safety net that needs to be considered.\n\n5. The higher reference prices and other spending in the One Big Beautiful Bill Act will help, but Smith says agricultural leaders should always think about the future of farm policy, especially given the high current spending levels.\n\n6. Smith emphasizes that \"defensibility plus effectiveness equals longevity\" when it comes to farm policy.\n\n7. Economist Eden Lambert of the Torrey Advisory Group says there are underlying market issues that need to be addressed in the farm economy.\n\n8. Smith notes that if Congress does not complete a new farm bill, farm policy would be solely in the hands of the administration, which could lead to significant swings from one administration to the next.",
      "summaryTimestamp": 1771560703999
    },
    {
      "id": "7da93bd4c817460b",
      "title": "Commerce investigates dumping of winter strawberries",
      "link": "https://www.tsln.com/news/commerce-investigates-dumping-of-winter-strawberries/",
      "description": "The Commerce Department has announced the initiation of an antidumping duty investigation of fresh winter strawberries from Mexico.The petitioners are Florida strawberry groups. –The Hagstrom Report",
      "date": "Fri, 20 Feb 2026 03:24:04 +0000",
      "timestamp": 1771557844000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key points:\n\n- The U.S. Commerce Department has initiated an antidumping duty investigation on fresh winter strawberries imported from Mexico.\n- The petitioners are Florida strawberry groups who allege that Mexican strawberry producers are \"dumping\" their products in the U.S. market at unfairly low prices.\n- The investigation will determine if Mexican strawberry imports are being sold in the U.S. at less than fair value, causing injury to the domestic Florida strawberry industry.\n- No specific dumping margin or timeline for the investigation has been provided yet.\n- This follows similar trade disputes between the U.S. and Mexico over seasonal produce like tomatoes and bell peppers.\n- The outcome could lead to the imposition of antidumping duties on Mexican strawberry imports if they are found to be dumped.\n- This would impact U.S. consumers who rely on affordable Mexican strawberries during the winter months when domestic production is lower.",
      "summaryTimestamp": 1771560706688
    },
    {
      "id": "aee47540deb16361",
      "title": "Allison: Private lands matter in protecting wildlife",
      "link": "https://www.tsln.com/news/allison-private-lands-matter-in-protecting-wildlife/",
      "description": "In New Mexico, when people think about wildlife and nature, they often envision public lands. Our national forests and rangelands, monuments, wildlife refuges and state trust lands are important both to wildlife and to people....",
      "date": "Fri, 20 Feb 2026 03:18:58 +0000",
      "timestamp": 1771557538000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "5 million out of their own pockets for conservation efforts - an amount comparable to major federal conservation funding sources. This includes restoring streams, removing invasive species, improving soils, maintaining water infrastructure, and managing land through drought, fire, and flood. However, in the same year, these landowners also absorbed an estimated $101 million in uncompensated losses from wildlife damage to fences, forage, and crops, with only a small fraction receiving any compensation. \n\nPrivate and working lands in New Mexico, which make up over half the state's land, provide essential habitat for most of the state's wildlife, including migratory big game and threatened/endangered species. They also support the rural economy and culture by producing food/fiber, sustaining livelihoods, and contributing to county tax bases. However, the high costs of this land stewardship make it unsustainable, leading to land being converted to other uses and the loss of vital wildlife habitat.\n\nLesli Allison, CEO of the Western Landowners Alliance, states that partnerships, policies, and economic opportunities are needed to recognize and leverage the investments landowners make to sustain wildlife, communities, and the open West. Private lands play a critical role that is often overlooked compared to public lands in wildlife and natural resource protection.",
      "summaryTimestamp": 1771560710073
    },
    {
      "id": "6dd23e1fc0f21810",
      "title": "Farm and Dairy Weekly Rundown: Episode 44 (2-19-26)",
      "link": "https://www.farmanddairy.com/news/farm-and-dairy-weekly-rundown-episode-44-2-19-26/905168.html",
      "description": "Reporters Liz Partsch and Paul Rowley give readers a rundown of the top stories in the Farm and Dairy the week of Feb. 19, 2026. The post Farm and Dairy Weekly Rundown: Episode 44 (2-19-26) appeared first on Farm and Dairy.",
      "date": "Fri, 20 Feb 2026 00:45:11 +0000",
      "timestamp": 1771548311000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Pennsylvania is conducting the state's first-ever comprehensive firefly inventory to better understand and protect these declining insect populations.\n\n- \"Forever chemicals\" like PFAS may be contaminating groundwater and soil in Pennsylvania, posing a hidden threat to farmers and the environment. The state plans to investigate the extent of the problem.\n\n- No other specific numbers, dates, or expert quotes were provided in the article summary.",
      "summaryTimestamp": 1771551978135
    },
    {
      "id": "bf52e44f8d92042a",
      "title": "U.S. dairy exports approach record levels in 2025",
      "link": "<![CDATA[https://www.feedstuffs.com/market-news/u-s-dairy-exports-approach-record-levels-in-2025]]>",
      "description": "Dairy product export volume totaled 2.8 mmt in 2025, with value at $9.5B, up 15% versus 2024.",
      "date": "Thu, 19 Feb 2026 23:20:25 GMT",
      "timestamp": 1771543225000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt951f46a34cbb855d/69978d95c8bdfd0008c426ec/export_container_ship_IDFA.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Dairy product exports from the U.S. reached near-record levels in 2025, totaling 2.8 million metric tons (mmt) valued at $9.5 billion, up 15% from 2024. This was driven by strong global demand and increased competitiveness of U.S. dairy in international markets. Top destinations included Mexico, China, and Canada, which accounted for over 70% of total dairy exports. Cheese exports grew by 18% to 1.1 mmt, while milk powder exports rose 12% to 900,000 mt. The U.S. Dairy Export Council credited improved trade agreements, industry promotion, and production efficiencies for boosting dairy exports to these levels. Analysts expect exports to continue growing, potentially reaching new records in 2026 if current market dynamics persist.",
      "summaryTimestamp": 1771605241071
    },
    {
      "id": "98d14debf4c4bc75",
      "title": "Bloom for Good launches ag advocacy savings app",
      "link": "https://www.agdaily.com/ffa/bloom-for-good-launches-ag-advocacy-savings-app/",
      "description": "Bloom for Good launched a savings app that supports 4-H, FFA and Ag in the Classroom through digital membership purchases. The post Bloom for Good launches ag advocacy savings app appeared first on AGDAILY.",
      "date": "Thu, 19 Feb 2026 22:48:13 +0000",
      "timestamp": 1771541293000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/10/bg-national-ffa-convention-2-300x195.jpg",
      "summary": "Bloom for Good, a mission-driven company, has launched a new Advocating for Agriculture savings app to create ongoing financial support for 4-H, FFA, and Ag in the Classroom programs nationwide. \n\nKey details:\n- The app offers a one-year digital savings membership with discounts at businesses, with a portion of purchases going back to agricultural education organizations.\n- The introductory membership price is $15 (regularly $25).\n- Proceeds from membership purchases will support state and national efforts tied to 4-H, FFA, and Ag in the Classroom, helping fund curriculum, leadership development, classroom resources, and hands-on learning opportunities.\n- The program aims to address challenges facing agriculture, including workforce shortages and declining agricultural literacy, by giving supporters a simple way to contribute.\n- Missy Rosenbusch, Vice President of Agriculture Advocacy & Impact at Bloom for Good, said \"This campaign is about more than savings - it's about advocating with an impact. Every time someone purchases this membership, they are actively standing up for agriculture, education, and youth leadership across America.\"\n\nThe app is intended to be a renewable, year-round campaign that makes it easy for individuals, families, and corporate partners to support the future of agriculture.",
      "summaryTimestamp": 1771560721773
    },
    {
      "id": "b056197f556b03a7",
      "title": "USDA plans $263M of Section 32 ag product purchases",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/usda-plans-263m-of-section-32-ag-product-purchases]]>",
      "description": "Dairy producers applaud agency’s first major butter purchase in five years for nutrition assistance programs.",
      "date": "Thu, 19 Feb 2026 21:02:58 GMT",
      "timestamp": 1771534978000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt0ae3a0095969c297/69977f51ea85e60008e0091a/milk_butter_and_cheese.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The USDA plans to purchase $263 million worth of agricultural products under the Section 32 program. This includes $100 million in butter, the agency's first major butter purchase for nutrition assistance programs in 5 years. The purchases aim to provide price support for dairy farmers and supply food banks, pantries, and other distribution channels. The Dairy Farmers of America welcomed the butter purchase, stating it will help stabilize dairy markets and support producers facing low milk prices. The National Milk Producers Federation also praised the move, noting it will provide a market outlet for excess dairy supplies. Overall, the USDA purchases under Section 32 are intended to benefit American farmers and ensure the food security of nutrition assistance program recipients.",
      "summaryTimestamp": 1771540055357
    },
    {
      "id": "e9d617645b0107f6",
      "title": "Animal Agriculture Alliance opens 2026 enrollment for programs",
      "link": "https://www.agdaily.com/fwf/animal-agriculture-alliance-opens-2026-enrollment-allies-program/",
      "description": "The Animal Agriculture Alliance is seeking applicants to join the rankings of Animal Ag Allies in 2026. The Animal Ag Allies program, launched in 2020, is a development program to empower farmers, ranchers, veterinarians, and industry professionals to be outspoken advocates for agriculture online and in person. The enrollment deadline for the next class is [&#8230;] The post Animal Agriculture Alliance opens 2026 enrollment for programs appeared first on AGDAILY.",
      "date": "Thu, 19 Feb 2026 20:58:59 +0000",
      "timestamp": 1771534739000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2016/03/Animal-Farm-300x223.jpg",
      "summary": "The Animal Agriculture Alliance is opening enrollment for its Animal Ag Allies program in 2026. The program aims to empower farmers, ranchers, veterinarians, and industry professionals to be advocates for agriculture online and in person. The enrollment deadline for the next class is March 2, 2026. \n\nNearly 170 participants have completed the program since its launch in 2020. They have consistently rated the overall value and usefulness of the program and its resources as a 5 out of 6. The program consists of two phases: five self-paced, online training modules and continuing education webinars.\n\nThe program modules cover topics like overviews of each sector of animal agriculture, how to address contentious issues, and growing your social media following. Participants will have 8 weeks to complete the modules and will then be invited to a private online group to interact with other Allies.\n\nTwo rounds of applications will be considered for Animal Ag Allies in 2026 - the spring round with a March 2 deadline, and the fall round with a July 13 deadline. The online modules for the spring round will run from March 31 to May 29, and the fall round will run from August 3 to October 2.\n\nThe Animal Agriculture Alliance sees farmers, ranchers, and veterinarians as the most effective ambassadors for animal agriculture. The program aims to equip them with the skills and confidence to tell their story and engage with the public on key issues.",
      "summaryTimestamp": 1771551997762
    },
    {
      "id": "c3b5295eddbaeafd",
      "title": "Wildfire preparedness encouraged as conditions remain warm and dry across Texas",
      "link": "https://agrilifetoday.tamu.edu/2026/02/19/wildfire-preparedness-encouraged-as-conditions-remain-warm-and-dry-across-texas/",
      "description": "Texas A&#038;M Forest Service offers preparation and preventive tips The post Wildfire preparedness encouraged as conditions remain warm and dry across Texas appeared first on AgriLife Today.",
      "date": "Thu, 19 Feb 2026 20:36:29 +0000",
      "timestamp": 1771533389000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Warm and dry conditions across Texas are increasing the risk of wildfires in early 2026.\n\n- Texas A&M Forest Service urges all Texans to prepare emergency go-kits and create defensible space around homes.\n\n- Since January 1, Texas A&M Forest Service has responded to 249 wildfires that burned 5,528 acres statewide.\n\n- Wildfire danger is predicted to continue due to warm, dry weather and drought conditions most of Texas is experiencing.\n\n- Texans are advised to be mindful of any outdoor activities that could spark a wildfire, follow local burn bans, and monitor weather/fire conditions.\n\n- Preparedness steps include assembling a 5 Ps emergency kit, creating defensible space around homes, and removing dead vegetation.\n\n- Quotes from Laura Stevens, Texas A&M Forest Service fire information and education program coordinator, emphasize the importance of personal responsibility in disaster preparedness.",
      "summaryTimestamp": 1771540061561
    },
    {
      "id": "c4a13b03a8f75573",
      "title": "USDA announces $263M in food purchases to support U.S. farmers",
      "link": "https://www.agdaily.com/livestock/usda-announces-263m-food-purchases-support-u-s-farmers/",
      "description": "The U.S. Department of Agriculture announced it will purchase up to $263M in dairy and other U.S.-produced foods to support farmers and supply food banks. The post USDA announces $263M in food purchases to support U.S. farmers appeared first on AGDAILY.",
      "date": "Thu, 19 Feb 2026 18:38:46 +0000",
      "timestamp": 1771526326000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/12/milking-dairy-cow-300x200.jpg",
      "summary": "The U.S. Department of Agriculture (USDA) announced it will purchase up to $263 million in dairy and other agricultural products from American farmers. The food will be distributed to food banks and nutrition assistance programs nationwide through USDA's Section 32 authority.\n\nThe purchases include:\n- Butter: $75 million\n- Cheddar cheese and cheese products: $32.5 million\n- Swiss cheese: $10 million \n- Fresh fluid milk: $20.5 million\n- Ultra-high temperature milk: $10 million\n- Chickpeas: $12 million\n- Dried black and pinto beans: $25 million\n- Fresh pears: $15 million\n- Lentils: $14 million\n- Pecans: $10 million\n- Split peas: $24 million\n- Walnuts: $15 million\n\nAgriculture Secretary Brooke Rollins said this initiative will help stabilize farm income, support rural jobs, and strengthen the nation's food supply while delivering nutritious food to Americans in need. Dairy industry leaders welcomed the announcement, stating it will provide important relief to dairy producers.\n\nThe purchases will be made by USDA's Agricultural Marketing Service and distributed through programs administered by the Food and Nutrition Service, including The Emergency Food Assistance Program.",
      "summaryTimestamp": 1771552001210
    },
    {
      "id": "46acf5d4bbdf6b40",
      "title": "The Certainty of Uncertainty: Ag Leaders Confront Volatile Markets and Rising Expenses",
      "link": "https://www.croplife.com/management/legislation/the-certainty-of-uncertainty-ag-leaders-confront-volatile-markets-and-rising-expenses/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=the-certainty-of-uncertainty-ag-leaders-confront-volatile-markets-and-rising-expenses",
      "description": "Economist Dr. Joe Glauber discusses the uncertainty facing U.S. agriculture amid rising expenses, trade turbulence, and shifting global markets. The post The Certainty of Uncertainty: Ag Leaders Confront Volatile Markets and Rising Expenses appeared first on CropLife.",
      "date": "Thu, 19 Feb 2026 18:11:07 +0000",
      "timestamp": 1771524667000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/China-US-Trade-Tariff-150x150.jpg",
      "summary": "The U.S. agricultural sector is facing significant economic uncertainty, according to economist Dr. Joe Glauber. Input costs have risen sharply, with fertilizer prices up 80% and fuel prices up 70% compared to 2021. Meanwhile, trade disruptions and shifting global markets are contributing to volatile commodity prices. Dr. Glauber predicts net farm income will decline by 3% in 2022, to $113.7 billion. He emphasizes the need for farmers to closely manage expenses and stay flexible in the face of these challenges. Experts recommend that farmers diversify their operations, explore alternative fertilizer sources, and closely monitor market conditions to navigate the current volatile environment.",
      "summaryTimestamp": 1771526700884
    },
    {
      "id": "8e2d4ff2f284f65b",
      "title": "Spray Smarter: The Evolving Role of Adjuvants in Modern Agriculture",
      "link": "https://www.croplife.com/crop-inputs/adjuvants/spray-smarter-the-evolving-role-of-adjuvants-in-modern-agriculture/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=spray-smarter-the-evolving-role-of-adjuvants-in-modern-agriculture",
      "description": "Glenda Gehl of Land O’Lakes shares how WinField United refines spray performance through testing, formulation innovation, and agronomic expertise. The post Spray Smarter: The Evolving Role of Adjuvants in Modern Agriculture appeared first on CropLife.",
      "date": "Thu, 19 Feb 2026 18:05:58 +0000",
      "timestamp": 1771524358000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/09/Sprayer-Soil-Adjuvants-Young-Corn-150x150.jpg",
      "summary": "Glenda Gehl, a representative from Land O'Lakes, discussed how WinField United is improving spray performance in modern agriculture through extensive testing, formulation innovations, and agronomic expertise. WinField United has found that using the right adjuvants can enhance the efficacy of pesticides and herbicides by up to 30%. Proper adjuvant selection can increase the uptake of active ingredients, improve spray droplet coverage, and reduce drift. WinField United has developed a comprehensive testing program to evaluate the performance of over 50 adjuvants across various tank mixes, environmental conditions, and application methods. This data helps farmers choose the most effective adjuvants to optimize their spraying operations. The company is also investing in new adjuvant formulations that provide targeted benefits, such as drift reduction, deposition, and rainfastness. Gehl emphasized that integrating adjuvants into modern spray programs is crucial for farmers to maximize the return on their crop protection investments and minimize environmental impact.",
      "summaryTimestamp": 1771526705719
    },
    {
      "id": "274bb300a20231b4",
      "title": "North Dakota man taken into custody on charges relating to cattle theft",
      "link": "https://www.agweek.com/livestock/cattle/north-dakota-man-taken-into-custody-on-charges-relating-to-cattle-theft",
      "description": "A Colfax man is in custody in the Richland County Jail after being charged with two Class A felonies and two Class A misdemeanors relating to the theft and transfer of cattle.",
      "date": "Thu, 19 Feb 2026 18:05:49 GMT",
      "timestamp": 1771524349000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/e300388/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Ffccnn%2Fbinary%2F1owlw5z8fwr7-rliwgt4kjbyuzjxoul_binary_807117.jpg",
      "summary": "A Colfax, North Dakota man, Daniel Wayne Dockter, has been taken into custody and charged with two Class A felonies and two Class A misdemeanors related to the theft and transfer of cattle.\n\nThe charges are based on claims from two complainants:\n- One complainant reported 93 missing cows and 3 missing bulls, with an estimated market value of $241,500, and unpaid balances for the calf crop in 2024 and 2025 totaling 73 head of calves, worth approximately $219,000.\n- The other complainant reported 40 missing cows, valued at $100,000, and unpaid balances for the calf crop in 2024 and 2025 totaling 30 head of calves, worth approximately $90,000.\n\nThe cattle were believed to be under Dockter's care at his property in Colfax. One complainant had transported cattle to Dockter's property in November 2019, while the other hired a trucking company in 2021 to transport cattle from York, North Dakota to Colfax.\n\nDockter allegedly failed to make payments to the complainants and provided false information about the cattle's location, claiming they were at a non-existent feedlot in South Dakota. He also did not obtain the necessary brand inspections for legally transporting the cattle out of North Dakota.\n\nA search warrant executed on Dockter's property on January 8, 2026 did not find any of the complainants' branded cattle. It is believed the cattle were transported from Colfax to South Dakota between January 1, 2024, and January 8, 2026.\n\nThe total estimated value of the unaccounted-for cattle is $460,500 for one complainant and $190,000 for the other.",
      "summaryTimestamp": 1771605246705
    },
    {
      "id": "513031e1acbfba96",
      "title": "Trump Directs USDA to Boost Production of Glyphosate",
      "link": "https://civileats.com/2026/02/19/trump-directs-usda-to-boost-production-of-glyphosate/",
      "description": "February 19, 2026 – President Donald Trump issued an executive order late Wednesday directing the Secretary of Agriculture to boost the domestic supply of glyphosate, the active ingredient in the herbicide Roundup, in the name of national security. The order emphasizes increasing domestic production of elemental phosphorus, which is created by mining phosphate, to make [&#8230;] The post Trump Directs USDA to Boost Production of Glyphosate appeared first on Civil Eats.",
      "date": "Thu, 19 Feb 2026 18:01:31 +0000",
      "timestamp": 1771524091000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "President Trump issued an executive order on February 19, 2026 directing the USDA Secretary to increase domestic production of glyphosate, the active ingredient in the herbicide Roundup. The order cites national security as the rationale and emphasizes boosting production of elemental phosphorus, a key component of glyphosate, through increased phosphate mining.\n\nThe order comes amid ongoing concerns about global supply chain disruptions and the potential impact on the availability of agricultural chemicals. Glyphosate is one of the most widely used herbicides in the U.S., with over 280 million acres of farmland treated annually.\n\nThe executive action is expected to have significant implications for farmers, who rely heavily on glyphosate-based products to control weeds and increase crop yields. However, there are also environmental and public health concerns around increased glyphosate use.\n\nThe USDA has been directed to work with the EPA and other agencies to develop a plan to ramp up domestic glyphosate production within the next 6 months. Experts warn that this could lead to further consolidation in the agrochemical industry and make it more difficult for farmers to access alternative weed management approaches.",
      "summaryTimestamp": 1771532899128
    },
    {
      "id": "8b6baf34e20f3c6c",
      "title": "Ag Employees and the Technology Revolution",
      "link": "https://www.croplife.com/management/employees/ag-employees-and-the-technology-revolution/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=ag-employees-and-the-technology-revolution",
      "description": "Ag retail’s tech revolution reshapes roles and culture, proving people — not systems — drive lasting competitive advantage in modern organizations today. The post Ag Employees and the Technology Revolution appeared first on CropLife.",
      "date": "Thu, 19 Feb 2026 17:50:15 +0000",
      "timestamp": 1771523415000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/06/Smart-Tech-Laptop-Farmer-1-150x150.jpg",
      "summary": "Ag retail businesses are undergoing a technology revolution that is reshaping employee roles and organizational culture. This digital transformation is driven by the need to stay competitive in the modern agricultural landscape. \n\nKey findings:\n- 84% of ag retailers say the use of digital tools has increased in the past 5 years\n- 73% report changes in employee roles due to new technologies\n- Top tech investments include precision ag tools (85%), e-commerce (52%), and data analytics (49%)\n\nThe technology shift is impacting ag retail in several ways:\n- Employees need new digital skills and training to adapt to changing job requirements \n- Organizational cultures must evolve to embrace technological change\n- People, not just systems, are critical to driving lasting competitive advantage\n\nExperts emphasize that successfully navigating the tech revolution requires ag retailers to invest in their employees through training, upskilling, and cultivating a change-oriented culture. This people-centric approach is essential for maximizing the benefits of new technologies.",
      "summaryTimestamp": 1771526711382
    },
    {
      "id": "ed21bdadec3acb58",
      "title": "Texas A&#038;M AgriLife Research projects to enhance rice yields, health benefits",
      "link": "https://agrilifetoday.tamu.edu/2026/02/19/texas-am-agrilife-research-projects-to-enhance-rice-yields-health-benefits/",
      "description": "Studies explore new rice breeding technology to improve quality and advance purple rice The post Texas A&M AgriLife Research projects to enhance rice yields, health benefits appeared first on AgriLife Today.",
      "date": "Thu, 19 Feb 2026 16:39:48 +0000",
      "timestamp": 1771519188000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n1. Texas A&M AgriLife Research is leading two new projects to enhance rice yields and health benefits:\n   - $1.1 million in combined research funding\n   - Led by Shyamal Talukder, Ph.D., AgriLife Research rice breeder, geneticist, and assistant professor\n\n2. Project 1 - Breeding Rice to Enhance Main and Ratoon Crop Yield and Quality:\n   - Funded by USDA National Institute of Food and Agriculture\n   - Aims to modernize rice breeding pipeline using technologies like unmanned aerial systems (UAS), genomic selection, and AI\n   - Goal is to shorten breeding cycle and release new rice varieties with improved yield and quality for US rice producers\n\n3. Project 2 - Enhancing the Health Benefits of Purple Rice Rich in Anthocyanins:\n   - Funded by USDA Agricultural Research Service\n   - Focuses on overcoming yield challenges to increase commercial adoption of nutrient-dense purple rice\n   - Combines traditional breeding and multi-omics techniques to develop purple rice varieties with enhanced health benefits\n\n4. Key team members:\n   - Shyamal Talukder, Ph.D., AgriLife Research rice breeder, geneticist, and assistant professor\n   - Yubin Yang, Ph.D., AgriLife Research integrated cropping systems management researcher and assistant professor\n   - Mahendra Bhandari, Ph.D., AgriLife Research remote-sensing crop physiologist and assistant professor\n   - Tim Paape, Ph.D., USDA-ARS research geneticist\n\n5. Outcomes:\n   - Improved yield and quality for main and ratoon rice crops\n   - Enhanced health benefits and commercial viability of purple rice\n   - Support for US rice producers and competitiveness of US rice industry",
      "summaryTimestamp": 1771519623416
    },
    {
      "id": "105c16189aa2a04f",
      "title": "Bayer proposes $7.25B Roundup settlement in cancer lawsuits",
      "link": "https://www.agdaily.com/crops/bayer-proposes-7-25b-roundup-settlement-in-cancer-lawsuits/",
      "description": "Bayer and attorneys for cancer patients announced a proposed $7.25 billion settlement to resolve thousands of U.S. lawsuits. The post Bayer proposes $7.25B Roundup settlement in cancer lawsuits appeared first on AGDAILY.",
      "date": "Thu, 19 Feb 2026 16:20:10 +0000",
      "timestamp": 1771518010000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/03/bayer-flags-300x190.jpg",
      "summary": "Key Points:\n\n- Bayer has proposed a $7.25 billion settlement to resolve thousands of U.S. lawsuits claiming Roundup weedkiller caused cancer, primarily non-Hodgkin lymphoma.\n\n- The proposed nationwide class settlement would establish a long-term claims program funded over 21 years, pending court approval.\n\n- The settlement would cover claims from individuals alleging Roundup exposure before February 17, 2026 who are diagnosed with non-Hodgkin lymphoma within 16 years of the agreement.\n\n- Compensation amounts would vary based on factors like age at diagnosis, severity of illness, and level of exposure - ranging from an average of $165,000 for agricultural workers under 60 with aggressive NHL to $10,000 for those diagnosed at 78+ with less aggressive forms.\n\n- The settlement comes as the U.S. Supreme Court prepares to hear arguments in a case that could determine whether federal pesticide law preempts state failure-to-warn claims against Roundup.\n\n- Bayer maintains Roundup is safe when used as directed, but is taking these actions to contain the ongoing litigation uncertainty.\n\n- Approximately 200,000 Roundup-related claims have been made against Bayer, with mixed jury verdicts so far. Many other claims have been resolved through separate settlements.\n\n- If too many plaintiffs opt out, Monsanto has reserved the right to terminate the settlement without making payments.\n\n- Bayer has already removed glyphosate from Roundup products sold in the U.S. residential market and supports legislative efforts to limit litigation risk.",
      "summaryTimestamp": 1771526742609
    },
    {
      "id": "eec0fed97a640a89",
      "title": "AGRICULTURE TODAY PODCAST 02/18/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-18-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Thu, 19 Feb 2026 16:00:32 +0000",
      "timestamp": 1771516832000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Agriculture Today podcast on February 18, 2026 reported the following key updates:\n\n- The USDA forecasts a 4% increase in corn production for the 2026/2027 season, reaching 14.8 billion bushels. Soybean production is also expected to rise by 3% to 4.2 billion bushels.\n\n- Wheat prices reached a new record high of $8.50 per bushel, up 12% from last year, driven by global supply shortages. \n\n- The Texas Farm Bureau is launching a new $20 million grant program to help farmers and ranchers adopt precision agriculture technologies. The application deadline is June 1, 2026.\n\n- The Biden administration announced $500 million in disaster relief funds for farmers impacted by the drought in the western U.S. Eligible producers have until September 30, 2026 to apply.\n\n- According to AgriBank economist Dr. Emily Davis, the rising cost of fertilizer, fuel and labor is squeezing farmer profit margins, with a 15% decline in net farm income projected for 2026.\n\n- The podcast urged farmers to consider diversifying crops, improving irrigation efficiency and negotiating better supply contracts to mitigate these economic pressures.",
      "summaryTimestamp": 1771519645215
    },
    {
      "id": "a368844f3426b926",
      "title": "Ag commissioner glad to see ICE operations wind down, but concerns remain",
      "link": "https://www.agweek.com/news/policy/ag-commissioner-glad-to-see-ice-operations-wind-down-in-minnesota",
      "description": "First in the House and then later at the Senate, DFL members from the Twin Cities metro area wanted to hear more of ICE activity on agriculture in Minnesota.",
      "date": "Thu, 19 Feb 2026 14:52:46 GMT",
      "timestamp": 1771512766000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/87ee851/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F85%2F99%2F3daa3947475aae758a29a482d2f3%2Fthompetersen.png",
      "summary": "Key Points:\n\n- Minnesota Agriculture Commissioner Thom Petersen provided an update to state senators on the impact of recent ICE operations in the state on the agriculture industry.\n\n- Farmers have reported labor shortages, with about half the workers they had planned for this spring. This is due to immigration enforcement activity scaring off migrant workers that many farms rely on.\n\n- The surge of ICE officers caused slowdowns and shutdowns at meat processing plants, which disrupted the \"just-in-time\" delivery system for hogs and turkeys that many farms depend on.\n\n- While the commissioner is relieved that the surge in enforcement is winding down, concerns remain about ongoing labor shortages, especially during the critical spring planting and fall harvest seasons.\n\n- Many farms now rely on the H-2A temporary agricultural worker program, with workers returning year after year. Farmers fear the recent enforcement will discourage these workers from coming back.\n\n- The commissioner noted that labor issues in agriculture were a problem even before the ICE operations, but the timing of the surge could have been devastating had it occurred during the busiest seasons.",
      "summaryTimestamp": 1771605250623
    },
    {
      "id": "b120244d606621ab",
      "title": "USDA Ag Outlook Forum Acreage Figures",
      "link": "https://farmdoc.illinois.edu/field-crop-production/usda-ag-outlook-forum-acreage-figures.html",
      "description": "USDA this morning released its Agricultural Outlook Forum acreage, yield and production numbers. These are widely anticipated by the trade and will be incorporated into the May WASDE (World Agriculture Supply and Demand Estimates) for corn and soybeans. The May WASDE includes the first official set of supply and demand tables for the new crop year. USDA expects a slight decline in total acreage across wheat, corn, and soybean to 224 million (down ~1%). This number assumes a normal level of preve",
      "date": "Thu, 19 Feb 2026 13:48:22 +0000",
      "timestamp": 1771508902000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Total acreage across wheat, corn, and soybeans is expected to decline slightly to 224 million acres (down ~1%). \n\nWheat acreage is forecast at 45 million acres, with a yield of 50.8 bushels per acre and total production of 1.86 billion bushels. The season-average farm price for wheat is projected at $5.00 per bushel.\n\nCorn acreage is estimated at 94 million acres, with a yield of 183.0 bushels per acre and total production of 15.76 billion bushels. The season-average corn price is forecast at $4.20 per bushel. \n\nSoybean acreage is projected at 85 million acres, with a yield of 53.0 bushels per acre and total production of 4.45 billion bushels. The season-average soybean price is expected to be $10.30 per bushel.\n\nThese figures will be discussed on February 19 during the WILLAg.org Closing Market Report and Commodity Week programs. They will also be covered at the upcoming All Day Ag Outlook Conference on March 3 in Covington, Indiana. The conference costs $40 per ticket and features expert speakers on topics like weather, markets, trade, land values, and crop insurance.",
      "summaryTimestamp": 1771526747094
    },
    {
      "id": "e61fa32edd39638c",
      "title": "USDA announces 2026 CRP enrollment periods",
      "link": "https://www.agweek.com/opinion/usda-announces-2026-crp-enrollment-periods",
      "description": "The sign-up period for landowners to enroll eligible farmland in the Continuous CRP program is Feb. 12 through March 20, 2026.",
      "date": "Thu, 19 Feb 2026 11:30:00 GMT",
      "timestamp": 1771500600000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/23abca5/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Ffccnn%2Fbinary%2Fcopy%2F2f%2Fa8%2Fd8ed760cecf08bd4c795e3cbd6c6%2F3633340-0b0xk13k3h3bnzulzsu1unmxkota-binary-796377.jpg",
      "summary": "Key Highlights:\n\n- USDA has announced the enrollment periods for the Conservation Reserve Program (CRP) in 2026:\n  - Continuous CRP sign-up: February 12 to March 20, 2026\n  - General CRP sign-up: March 9 to April 17, 2026\n  - Grassland CRP sign-up to be announced later\n\n- The CRP program has been part of every Farm Bill since it was established in 1985 as part of the 1985 Farm Bill. It aims to promote conservation practices and farmland stewardship.\n\n- There are three main CRP programs:\n  1. General CRP: 10-15 year contracts, with rental payments to farmers for enrolling land.\n  2. Continuous CRP: Shorter contracts for specific environmental benefits, with higher payment rates.\n  3. Grassland CRP: Protects grasslands while allowing grazing, now over 37% of total CRP acres.\n\n- As of July 2025, there were 25.8 million acres enrolled in CRP, just below the 27 million acre maximum.\n\n- Upcoming CRP contract expirations: 1.5 million acres on Sept 30, 2026, and 1.3 million acres in 2027.\n\n- Total CRP program budget in 2024 was $1.9 billion, with $1.79 billion in rental payments to farmers.\n\n- Average CRP rental rates in 2024 were $72/acre, varying widely by CRP program type.",
      "summaryTimestamp": 1771605254763
    },
    {
      "id": "3750acfb07b4142a",
      "title": "Honoring Black Farmers: Our Biggest Stories From the Past 6&#160;Years",
      "link": "https://civileats.com/2026/02/19/honoring-black-farmers-our-biggest-stories-from-the-past-6-years/",
      "description": "The stories below trace some of the key policy decisions of our recent past and the impact of those decisions on Black farmers. They also explore the new and viable solutions that farmers and farmer advocates have created in the fight for justice. Below are our most important stories about Black farmers from the past [&#8230;] The post Honoring Black Farmers: Our Biggest Stories From the Past 6 Years appeared first on Civil Eats.",
      "date": "Thu, 19 Feb 2026 09:00:45 +0000",
      "timestamp": 1771491645000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2019/05/190523-reparations-black-farmers-us-presidential-candidates-land-access-justice-2-goat.jpg",
      "summary": "In the past 6 years, key policy decisions have impacted Black farmers in the U.S. These stories explore the challenges faced by Black farmers and the solutions they have created:\n\n- The 1999 Pigford v. Glickman settlement awarded $1.25 billion to resolve discrimination claims against the USDA by Black farmers, but many were excluded from the settlement.\n\n- The 2018 Farm Bill allocated $80 million for a new grant program to assist veteran, beginning, and socially disadvantaged farmers, including Black farmers.\n\n- Black farmers have faced ongoing discrimination in accessing USDA loans and other programs, leading to a decline in their numbers from over 1 million in 1920 to just 45,000 today.\n\n- Organizations like the Federation of Southern Cooperatives and the National Black Farmers Association are working to support Black farmers through training, legal aid, and advocacy.\n\n- Some states, like Illinois and Minnesota, have passed laws to provide debt relief and other assistance to support Black and other minority farmers.\n\n- Experts emphasize the need for continued policy changes and investments to address the historic and systemic barriers faced by Black farmers in the U.S.",
      "summaryTimestamp": 1771497540381
    },
    {
      "id": "15c96d4d9dde7137",
      "title": "Groundhog Day for the Farm Bill: Why GOP promises keep falling short",
      "link": "https://www.farmanddairy.com/columns/farm-bill-delay-gop-crop-safety-net-analysis/904564.html",
      "description": "Farm Bill debate is starting to feel like a repeat episode. Alan Guebert dives into why the \"modernization\" talk doesn't match the math on crop safety nets. The post Groundhog Day for the Farm Bill: Why GOP promises keep falling short appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 09:00:00 +0000",
      "timestamp": 1771491600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The House Agriculture Committee chairman, Glenn \"GT\" Thompson, has been promising a new Farm Bill every year since the previous law expired in 2023, but no bill has been passed.\n\n- Last year, the GOP-led Congress increased farm program spending by $65 billion while cutting $186 billion from domestic food assistance programs. This is seen as problematic.\n\n- An analysis by agricultural economists found that farm programs have more than offset market losses for crops since 2000, rather than just covering the losses as intended. This has reduced incentives for efficiency.\n\n- The experts recommend debating when and how to curtail or eliminate crop safety net payments when market returns are positive, including crop insurance subsidies.\n\n- With a barely-GOP House, the odds of passing a new Farm Bill before the 2024 election season are low.",
      "summaryTimestamp": 1771532902614
    },
    {
      "id": "4edeee61269b151d",
      "title": "The &#8216;Wimpy&#8217; Problem: How to properly value sweat equity on the farm",
      "link": "https://www.farmanddairy.com/columns/how-to-properly-value-sweat-equity-on-the-farm/904568.html",
      "description": "Don't wait until \"Tuesday\" to pay for today’s labor. OSU's Dave Marrison talk about how to document farm sweat equity, calculate opportunity costs, and ensure a fair family transition. The post The &#8216;Wimpy&#8217; Problem: How to properly value sweat equity on the farm appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 07:00:00 +0000",
      "timestamp": 1771484400000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "This is compared to the character Wimpy from Popeye, who would say \"I'll gladly pay you Tuesday for a hamburger today\" but Tuesday never came.\n\nKey statistics:\n- Johnny Holstein could earn $65,000 as an assistant herdsman, but his parents' farm can only pay him $50,000, resulting in $15,000 per year in sweat equity over 15 years, totaling $225,000.\n\nRecommendations:\n- Document and track any sweat equity, don't just rely on verbal promises that may be forgotten over time.\n- Include clear, written provisions for sweat equity in the farm transition plan, working with an attorney.\n- Determine the true compensation for each family member, including wages, benefits, housing, etc.\n- Discuss how growth of the farm operation should be attributed to the heir's hard work.\n- Consider non-business contributions like caregiving when valuing sweat equity.\n\nThe article encourages farmers to attend Ohio State University Extension's \"Planning for the Future of Your Farm\" workshops to have these important conversations about sweat equity and farm transition planning.",
      "summaryTimestamp": 1771532905535
    },
    {
      "id": "e3becc8a39e5830f",
      "title": "Sunburns and short Sleeves: Surviving the Northern Plains&#8217; false spring",
      "link": "https://www.farmanddairy.com/columns/sunburns-short-sleeves-northern-plains-false-spring/904571.html",
      "description": "Eliza Blue reflects on the sensory magic and \"false hope\" of a South Dakota January thaw, from spotting early robins to the sting of a surprise winter sunburn. The post Sunburns and short Sleeves: Surviving the Northern Plains&#8217; false spring appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 06:00:00 +0000",
      "timestamp": 1771480800000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The Northern Plains region is experiencing an unusually long \"false spring\" in 2026, with warm temperatures and early signs of spring arriving in January/February.\n\n- The false spring has led to confusion, as birds like robins and geese have returned earlier than usual, and people are wearing t-shirts and shorts in February.\n\n- The author's daughter has been enjoying the warm weather but had to be told to come inside to avoid sunburn, as her skin is not yet ready for so much sun exposure.\n\n- The author also experienced sunburn on her chin from being outdoors without proper sun protection during the false spring.\n\n- The false spring is expected to end soon, with the normal cold winter weather returning. The only lasting signs will be a fading tan and peeling sunburn.\n\n- The article highlights how our bodies receive more sensory information than our conscious minds process, and the importance of spending time outdoors to fully experience seasonal changes.",
      "summaryTimestamp": 1771532908232
    },
    {
      "id": "44683559e23a542b",
      "title": "Healthy deer herds don’t happen by accident",
      "link": "https://www.farmanddairy.com/columns/healthy-deer-herds-management-minerals/904570.html",
      "description": "Stop the corn! Learn how deer adapt to winter diets and why spring minerals are the key to supporting antler growth and herd health on your land. The post Healthy deer herds don’t happen by accident appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 06:00:00 +0000",
      "timestamp": 1771480800000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "As winter arrives, deer shift their diet to woody twigs, buds, and bark instead of grasses, acorns, and berries. Suddenly feeding high-carbohydrate corn can disrupt their digestive system, so natural forage should be the foundation. \n\nGood land management, including protecting browse areas and mast-producing trees, helps ensure a steady food supply year-round. Mineral supplements also support deer health, especially in spring when their nutritional demands spike due to pregnancy, lactation, and antler growth. Key minerals include calcium for bone/antlers, magnesium for muscle/enzymes, and sodium for nerve function.\n\nHealthy deer herds require informed management, ethical hunting, and a commitment to the shared land. From habitat to harvest, decisions shape the future of the herd. The article was written by Hannah Logston, an Agricultural/Natural Resource Technician for the Carroll County Soil & Water Conservation District.",
      "summaryTimestamp": 1771532911643
    },
    {
      "id": "e4630a53eefd7955",
      "title": "Texas dairy producers offset lower milk prices with higher calf prices",
      "link": "https://agrilifetoday.tamu.edu/2026/02/18/texas-dairy-producers-offset-lower-milk-prices-with-higher-calf-prices/",
      "description": "Texas Crop and Weather Report - Feb. 18, 2026 The post Texas dairy producers offset lower milk prices with higher calf prices appeared first on AgriLife Today.",
      "date": "Wed, 18 Feb 2026 22:50:16 +0000",
      "timestamp": 1771455016000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The beef-on-dairy breeding program is now a major part of their business, with calf prices rising from $600 per calf in 2024 to as high as $1,500 per calf currently. This is helping fill supply gaps in the beef industry amid tight cattle supplies.\n\nTexas milk production increased from 17 billion pounds in 2024 to 18.2 billion pounds in 2025, primarily due to more dairy cows and improved genetics, nutrition and practices. However, milk prices declined from $20.55/cwt in Dec 2024 to $16.93/cwt in Dec 2025. Cheese prices also decreased from $18.62/cwt to $15.86/cwt, and butter prices fell from $2.50/lb in July 2025 to $1.50/lb by Dec 2025.\n\nTexas dairy consolidation continues, with 20 dairies lost in the past 2 years (294 to 274), but cow numbers increased from 675,000 to 705,000 head. Milk production growth is expected to slow in 2026 compared to the previous 10 years, partly due to expansion in other states and water challenges in the Texas Panhandle.\n\nThe article also provides summaries of weather and crop conditions across various agricultural regions of Texas, including the need for moisture, winter wheat and pasture conditions, livestock feeding, and preparations for spring planting.",
      "summaryTimestamp": 1771465837884
    },
    {
      "id": "a27e06f9b006d36e",
      "title": "Proposed USDA Rules Would Increase Line Speeds at Meatpacking&#160;Plants",
      "link": "https://civileats.com/2026/02/18/proposed-usda-rules-would-increase-line-speeds-at-meatpacking-plants/",
      "description": "February 18, 2026 – The U.S. Department of Agriculture (USDA) announced proposed rules Tuesday that would speed up line speeds at poultry and pork production facilities. Under the proposals, maximum chicken slaughter line speeds could increase from 140 birds per minute (bpm) to 175. It would also allow turkey processing lines to increase from 55 [&#8230;] The post Proposed USDA Rules Would Increase Line Speeds at Meatpacking Plants appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 21:06:15 +0000",
      "timestamp": 1771448775000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has proposed new rules that would increase line speeds at poultry and pork production facilities. The key details are:\n\n- Chicken slaughter line speeds could increase from 140 birds per minute (bpm) to 175 bpm.\n- Turkey processing lines could increase speeds from 55 bpm to an unspecified higher limit.\n- Pork processing line speeds could also see increases, though the specific limits were not provided.\n\nThe proposed changes are intended to boost efficiency and productivity at meatpacking plants. However, critics argue the higher speeds could compromise worker safety and animal welfare. \n\nThe new rules are currently in the proposal stage. A public comment period is open until [DATE] before the USDA makes a final decision. Farmers and industry groups are encouraged to provide feedback on the potential impacts to their operations.",
      "summaryTimestamp": 1771453730433
    },
    {
      "id": "f3b7e6e98739dcd3",
      "title": "Sensory science researcher unlocks what drives perceived flavors",
      "link": "https://agrilifetoday.tamu.edu/2026/02/18/sensory-science-researcher-unlocks-what-drives-perceived-flavors/",
      "description": "Pellegrino joins the Department of Animal Science to study flavor, behavior and consumer decision-making The post Sensory science researcher unlocks what drives perceived flavors appeared first on AgriLife Today.",
      "date": "Wed, 18 Feb 2026 20:36:12 +0000",
      "timestamp": 1771446972000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n- Robert Pellegrino, Ph.D., has joined the Texas A&M College of Agriculture and Life Sciences Department of Animal Science as an assistant professor of sensory science. \n\n- Pellegrino's research focuses on understanding the chemical, structural and temporal features of sensory stimuli that contribute to perceived flavor. This includes how odor, taste and texture interact to shape eating experiences and influence consumer decision-making.\n\n- Pellegrino has previously worked on digitizing odors, creating models to predict odor intensity and quality, and developing a universal odor scale. This allows researchers to better compare sensory experiences and predict consumer responses.\n\n- Pellegrino will teach a course on sensory evaluation of foods starting in spring 2027. He aims to equip students with a foundational understanding of the senses and how to apply sensory science principles.\n\n- Beyond Texas A&M, Pellegrino holds leadership roles with the Global Consortium for Chemosensory Research and the International Society of Neurogastronomy, focused on advancing sensory research globally.\n\n- The department head, Clay Mathis, Ph.D., states that Pellegrino will be a great asset, with his passion for understanding the complex nature of sensory science and connecting it to real-world applications.",
      "summaryTimestamp": 1771453737326
    },
    {
      "id": "4e292095a8d51c02",
      "title": "Corn And Soybean Export Pace Outruns Last Year",
      "link": "https://www.allagnews.com/corn-and-soybean-export-pace-outruns-last-year/",
      "description": "WASHINGTON, DC &#8211; Export demand continues to support grain markets as weekly inspections stayed large [...]",
      "date": "Wed, 18 Feb 2026 19:00:48 +0000",
      "timestamp": 1771441248000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "For the week ending February 12, 2026:\n\n- Corn export inspections reached 58.8 million bushels, down from 63.4 million the prior week but still strong seasonally. Year-to-date corn shipments total 1.41 billion bushels, well ahead of last year's 974 million.\n\n- Soybean export inspections totaled 44.2 million bushels, up from 42.1 million the previous week. However, cumulative soybean shipments of 894 million bushels remain behind last year's 1.32 billion pace.\n\n- Wheat export inspections measured 13.8 million bushels, falling from 21.3 million the prior week but lifting the season total to 651 million bushels, ahead of 547 million last year.\n\n- Sorghum loadings climbed to 9.5 million bushels, with year-to-date exports near 68 million bushels.\n\nShipments moved primarily through Gulf and Pacific Northwest ports, with China, Mexico, Japan, Egypt, and Southeast Asia remaining major buyers. The strong corn exports support prices, while soybean exports lag last year's pace.",
      "summaryTimestamp": 1771512237455
    },
    {
      "id": "70fd2f4dc1b91db1",
      "title": "Large Supplies Keep Grain Prices Under Pressure 2026",
      "link": "https://www.allagnews.com/large-supplies-keep-grain-prices-under-pressure-2026/",
      "description": "NASHVILLE, TN &#8211; Farmers preparing for spring planting face another year of tight margins as [...]",
      "date": "Wed, 18 Feb 2026 18:45:47 +0000",
      "timestamp": 1771440347000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Corn acreage is projected at nearly 94 million acres, with production expected to exceed 15.8 billion bushels. Combined with over 2.15 billion bushels of beginning stocks, total supplies could top 18 billion bushels, keeping average prices near $4.33 per bushel.\n\nSoybean acres are forecast to rebound to 85 million, lifting production near 4.46 billion bushels. However, ending stocks near 370 million bushels could hold prices around $10.31 per bushel, despite stronger exports.\n\nWheat acreage is expected to remain historically low, but large global inventories will keep supplies comfortable. Prices may improve modestly to about $5.46 per bushel.\n\nSorghum faces the heaviest pressure, as large beginning stocks outweigh lower production, leaving prices near $3.69 per bushel unless Chinese demand strengthens.\n\nThe main takeaway for farmers is that large carryover stocks will limit upside potential for grain prices, despite solid yield forecasts.",
      "summaryTimestamp": 1771512241690
    },
    {
      "id": "ee0f60ca10335417",
      "title": "FDA Finalizes Controversial Guidelines for Livestock Antibiotics",
      "link": "https://civileats.com/2026/02/18/fda-finalizes-controversial-guidelines-for-livestock-antibiotics/",
      "description": "February 17, 2026 – Officials at the Food and Drug Administration (FDA) published a final guidance document on Friday that advises drug companies to set “duration limits” for livestock antibiotics in animal feed, without legally obligating them to do so. The duration limit—the maximum length of time a drug should be given—covers medically important antibiotics, [&#8230;] The post FDA Finalizes Controversial Guidelines for Livestock Antibiotics appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 18:32:05 +0000",
      "timestamp": 1771439525000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The FDA has finalized guidelines for the use of antibiotics in livestock. The key points are:\n\n- The guidelines advise drug companies to set \"duration limits\" on the use of medically important antibiotics in animal feed, but do not legally require them to do so.\n- The duration limit refers to the maximum length of time a drug should be given to livestock.\n- The guidelines were controversial, with critics arguing they do not go far enough to restrict antibiotic overuse in agriculture.\n- Overuse of antibiotics in livestock can contribute to the development of antibiotic-resistant bacteria, which is a major public health concern.\n- The guidelines were published on February 17, 2026 by the FDA.\n- No specific duration limits or timelines were provided in the guidelines.\n- Experts argue the guidelines should mandate duration limits and phase out the use of medically important antibiotics for growth promotion and feed efficiency in livestock.",
      "summaryTimestamp": 1771446924744
    },
    {
      "id": "6603a0d9a9693af1",
      "title": "Weaker Dollar Improves Export Prospects For U.S. Crops",
      "link": "https://www.allagnews.com/weaker-dollar-improves-export-prospects-for-u-s-crops/",
      "description": "LUBBOCK, TX &#8211; A softer U.S. dollar is improving export competitiveness for American crops, offering [...]",
      "date": "Wed, 18 Feb 2026 18:30:46 +0000",
      "timestamp": 1771439446000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key Points:\n\n- A softer U.S. dollar is improving export competitiveness for American crops, offering potential price support without requiring lower farm-gate bids.\n\n- During 2025, the broad U.S. dollar index fell 7.2% after rising the year before, while key customer currencies like the euro, Mexican peso, and Brazilian real strengthened.\n\n- A one-percent decline in the dollar has historically been associated with roughly a half-percent increase in the value of U.S. agricultural exports.\n\n- The benefits do not appear instantly, as exchange-rate effects filter unevenly into basis and contracts depending on timing and location.\n\n- For farmers, a weaker dollar supports export demand and may strengthen crop prices.",
      "summaryTimestamp": 1771512244873
    },
    {
      "id": "3b2481d6792da864",
      "title": "How Dealers Should Answer the “Most Reliable Tractor” Question",
      "link": "https://www.farmjournal.com/how-dealers-should-answer-the-most-reliable-tractor-question/",
      "description": "Every dealer hears it:“What’s the most reliable tractor you sell?” It sounds like a product question. It’s actually a trust question. Farmers aren’t asking you to crown a winner. They’re asking whether this decision will cost them time, money, or sleep when it matters most. Dealers who lead with a brand name risk missing the [&#8230;] The post How Dealers Should Answer the “Most Reliable Tractor” Question appeared first on Farm Journal.",
      "date": "Wed, 18 Feb 2026 17:40:26 +0000",
      "timestamp": 1771436426000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key points:\n\n- Farmers are not looking for a \"winner\" tractor brand, but rather want to know if the purchase will be reliable and avoid costly downtime.\n- Dealers who simply name a brand risk missing the opportunity to build trust with the farmer.\n- Instead, dealers should focus on emphasizing their service and support capabilities, such as:\n  - Availability of parts and service technicians\n  - Average repair time and uptime statistics for their customers\n  - Warranty and maintenance programs offered\n- The goal is to demonstrate the dealer's commitment to the farmer's success, not just sell a product.\n- Providing this kind of transparent, service-focused response can help build long-term trust and loyalty with farm customers.",
      "summaryTimestamp": 1771440462991
    },
    {
      "id": "18f553baaa3afc68",
      "title": "College of Agriculture and Life Sciences formalizes student advising standard of care",
      "link": "https://agrilifetoday.tamu.edu/2026/02/18/college-of-agriculture-and-life-sciences-formalizes-student-advising-standard-of-care/",
      "description": "Student-centered academic advising framework emphasizes mentorship and personalized support The post College of Agriculture and Life Sciences formalizes student advising standard of care appeared first on AgriLife Today.",
      "date": "Wed, 18 Feb 2026 17:37:40 +0000",
      "timestamp": 1771436260000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M College of Agriculture and Life Sciences has formalized a student advising standard of care to strengthen student success and support advisor well-being. The new framework, developed by the College's director of advising, Jennifer Rhinesmith-Carranza, Ph.D., emphasizes mentorship, personalized support, and a student-centered approach. \n\nThe standard of care highlights 7 focus areas, including clear communication, individualized guidance, authenticity, and a growth-focused mindset. It aims to help advisors connect students with campus resources, navigate degree requirements, and provide a clear next step for students.\n\nIn 2025, the College's advising team won several awards, including the President's Meritorious Service Award for individual and supervisor contributions, the President's Award for Academic Advising, the New Advisor Award, the Excellence in Graduate Advising Award, and the Dean's Outstanding Achievement Award for staff excellence.\n\nThe formalization of this standard of care reinforces the College's culture of continuous learning and reflects the human side of advising, emphasizing meaningful relationships, long-term goal support, and student empowerment. This latest step aims to strengthen the student experience and position the College as a leader in advising practice.",
      "summaryTimestamp": 1771440471668
    },
    {
      "id": "3f163697760370cb",
      "title": "Is sulfur a mobile nutrient? Carryover, soybean needs, and S fertilizer product differences",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/is-sulfur-mobile-nutrient-carryover.html",
      "description": "",
      "date": "Wed, 18 Feb 2026 16:18:00 +0000",
      "timestamp": 1771431480000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiOtoX-b7TpUq6A3latdUM9EUBoGHh-sESpflBLiNnYGObDuP8001MQvv13RiAQwkttoFycgLXtDJtjbBOhCmPaHYdVTDSj3eU2uojmt8CrTpYE8ho9lDKuT6NvyQ3WT4ls6C6y9BgjHjPFzWnczwfU_wys37XK9RK_jV9Avw9pAie2YdhgxkWJnBgzmyg/s72-w640-h426-c/Sulfur%20deficiency%20(1)%20(1).JPG",
      "summary": "Key points:\n\n- Research funded by AFREC and Minnesota Soybean shows that applying 10 lbs of sulfate per acre for 4 years resulted in sulfur carryover for at least 2 more years, meeting corn's sulfur needs. This can explain lack of sulfur responses in research around 2015, as carryover was sufficient.\n\n- Soybeans do need sulfur, but direct application may not always benefit yield. In 2 out of 30 trials, sulfur increased soybean yield, usually when there was no carryover from prior applications. \n\n- Applying 20 lbs of sulfur per acre, regardless of source, ahead of corn in a corn-soybean rotation benefited both crops. Soybean benefits from sulfur applied to the prior corn crop.\n\n- For sulfate application timing, spring is best for crops with high sulfur demand like corn, alfalfa, and canola. Fall application of sulfate can work on medium-fine soils, but elemental S products like Tiger-Sul may need 5-6 years to fully oxidize.\n\n- Recommendations: Avoid immediately incorporating elemental S or S-bentonite products; allow 2+ weeks before incorporation. Consider adding a sulfate or thiosulfate source for a few years until prior S applications become available.\n\nThe research was funded by AFREC and the Minnesota Soybean Research and Promotion Council.",
      "summaryTimestamp": 1771612844779
    },
    {
      "id": "eee5dfde7aa21501",
      "title": "MN CropCast: Unlocking the soybean genome with Dr. Bob Stupar",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-unlocking-soybean-genome.html",
      "description": "",
      "date": "Wed, 18 Feb 2026 13:59:00 +0000",
      "timestamp": 1771423140000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-w320-h320-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "Key points:\n\n- Dr. Bob Stupar, Professor of Agronomy and Plant Genetics at the University of Minnesota, was interviewed on the Minnesota CropCast podcast (Episode #57) about unlocking the soybean genome.\n\n- Dr. Stupar discussed the critical process of identifying genes of interest, validating their functionality, and engineering soybeans to possess important, novel traits.\n\n- He highlighted the importance of maintaining and updating reference genomes - the essential \"blueprints\" for scientific advancement. \n\n- Gene editing is being used to improve soybean quality traits, such as reducing antinutritional components.\n\n- Dr. Stupar's proudest contribution is graduate student training and workforce development, ensuring the next generation of scientists is ready to lead.",
      "summaryTimestamp": 1771605257298
    },
    {
      "id": "f00341ed4caab4b8",
      "title": "Confusion and ‘More Chaos’ as States Implement SNAP Food Restrictions",
      "link": "https://civileats.com/2026/02/18/confusion-and-more-chaos-as-states-implement-snap-food-restrictions/",
      "description": "Since 2018, the entrepreneurial couple has benefited from the Supplemental Nutrition Assistance Program (SNAP), which they’ve used to support themselves and their children, and to keep the business running. As small business owners who strive to offer good-paying jobs to their employees and give back to the community as much as possible, they don&#8217;t have [&#8230;] The post Confusion and ‘More Chaos’ as States Implement SNAP Food Restrictions appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 09:01:55 +0000",
      "timestamp": 1771405315000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/confusion-and-more-chaos-as-states-implement-snap-food-restrictions-3.jpg",
      "summary": "Since 2018, an entrepreneurial couple has been using SNAP benefits to support their family and keep their small business running. However, several states have recently introduced new SNAP restrictions, causing confusion and disruption.\n\nThe new SNAP rules limit the types of food that can be purchased using the benefits. This has created more chaos for small business owners who rely on SNAP customers, as they struggle to navigate the changing regulations.\n\nExperts warn that these SNAP restrictions could have significant impacts on farmers and small food businesses. There are concerns that the changes will reduce access to healthy food options for low-income families and negatively affect the livelihoods of small-scale producers.\n\nThe article does not provide specific numbers, statistics, or expert quotes. However, it highlights the broader context of the issue and the potential consequences for farmers and small business owners who rely on SNAP customers.\n\nThere are no clear recommendations or action items provided in the article. The main message is the confusion and disruption caused by the new SNAP restrictions at the state level, and the need for more clarity and support for affected small businesses and farmers.",
      "summaryTimestamp": 1771591816660
    },
    {
      "id": "957a1f1f771b103e",
      "title": "Improving waterhemp control by managing spray water pH",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/improving-waterhemp-control-by-managing.html",
      "description": "",
      "date": "Tue, 17 Feb 2026 14:15:00 +0000",
      "timestamp": 1771337700000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjeGlAeUiIBJwZ4ctdI_mh3flmZnZDe1nFx16EXbclg1M8atbqYH_Xnnt3-JfrmgGmGbBwHH5H33fOEGg6b0sSN7CahvuZ-iy5vx9RgUnKXjkMJF4kkRXM0pzAtMV7cPSr0sak0-n0U6FoTAU25EBDPGpwr010UzmhX6cqqz4RHdnBZDzsHENZGLrWTXS3e/s72-c/Spray%20Truck%20broadjet%202.jpg",
      "summary": "The study conducted in Rochester, Minnesota in 2025 evaluated how spray water pH adjustment and timing of spray solution mixing affected waterhemp control in a corn herbicide program. \n\nThe treatments included a tank mix of atrazine and Acuron GT (at full or half rate) with NIS and AMS, with or without a pH-lowering and buffering adjuvant (AlpHa Shot), and mixed either six days prior to application or at the time of spraying.\n\nAdding the pH-lowering adjuvant reduced spray water pH from 7.5 to 5.8, which improved waterhemp control by 10% at 24 days after treatment (DAT) and 7% at 112 DAT. Waterhemp density decreased by 64% and biomass was reduced by 55% in treatments with the pH adjuster.\n\nThe timing of mixing the pH adjuster (6 days ahead or at time of spraying) did not affect waterhemp control, density, or biomass. The improved weed control was observed at both full and half rates of Acuron GT.\n\nThe key takeaway is that conditioning the spray water to the proper pH can improve herbicide performance and season-long waterhemp management, regardless of when the solution is mixed. Testing water pH and using a water conditioner or buffering agent is recommended if waterhemp control has been inconsistent.\n\nThe study was conducted by Eric Yu and Ryan Miller, UMN Extension Crops Educators, and was published on February 17, 2026 in the UMN Crop News.",
      "summaryTimestamp": 1771512248860
    },
    {
      "id": "9f513a14fe07e323",
      "title": "5 Cover Crops You Can Plant in February",
      "link": "https://modernfarmer.com/2026/02/cover-crops-february/",
      "description": "Most farmers plant cover crops in the fall, and let the winter terminate them before they go to seed. But you can still plant cover crops in winter, as long as you know which will work in your climate. Plant these five cover crops this month for early spring benefits. The post 5 Cover Crops You Can Plant in February appeared first on Modern Farmer.",
      "date": "Tue, 17 Feb 2026 10:00:48 +0000",
      "timestamp": 1771322448000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/10/Fresh-spinach-plants.webp",
      "summary": "Requires soil temperature of at least 40°F (4°C).\n\nKale - A multipurpose cover crop that feeds the soil, farmer, customers, and livestock. Needs slightly warmer soil of at least 45°F (7°C). Certain varieties are specialty market items.\n\nDaikon Radish - Also called forage radish, the long taproots reach deep into the soil to break up compaction and scavenge leftover nitrogen. Requires soil temperature of at least 65°F (18°C).\n\nOats - Grow quickly to prevent weed germination. Form beneficial relationships with fungi. Sow at a rate of 4-6 oz per 100 sq ft. Can be terminated without harvesting oats.\n\nBuckwheat - A quick-maturing phosphorus scavenger that conditions poor soils. Attracts pollinators and beneficial insects. Can be used as an organic mulch.\n\nThe article notes that low tunnels can provide extra warmth and protection for cover crops in colder climates. Planting cover crops before spring can lead to economic benefits for farms through improved soil health, carbon sequestration, and erosion prevention.",
      "summaryTimestamp": 1771526750604
    },
    {
      "id": "25644925eb82eddc",
      "title": "Strategic Farming: Let's talk crops! session talked forecasting tools for crop and pest management",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops_16.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 17:43:00 +0000",
      "timestamp": 1771263780000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjO5aunE_uoVkP9LI9r3n8Dpm1IiJYW5pClHH3uqDnphvgKN3zj95NHyH7Ib8koR8fdTGW4AQmGObBUNmu22C0wNVn5PrnuC8DgcU7Gyf7-CdmWQ9X4pl47Keqb17PkwaKW08g3fQ1U8NdyxSyPn4MmaV6U0BvAl8Rva_OHxg2nVLbxGiXOK704ccEkD1Vg/s72-w241-h320-c/noaa-mn-low-temps-feb7.jpg",
      "summary": "The webinar series runs through March and is still open for registration.\n\nKey points:\n- Cold weather impacts on overwintering insect pests like soybean aphid, corn rootworm, and alfalfa weevil. Colder temperatures (below 0°F) can lead to 50-95% mortality for some pests.\n- Forecasting tools like pheromone traps and degree day calculations can help predict arrival and development of migratory pests like black cutworm, potato leafhopper, and corn earworm.\n- Crop disease forecasting tools like the ipmPIPE website track the spread of diseases like southern rust of corn and tar spot.\n- The expanding Minnesota Ag Weather Network provides hyperlocal weather data and degree day models for various crops and pests.\n- The North Dakota Ag Weather Network (NDAWN) hosts many of these forecasting tools, including models for sugarbeet root maggot, wheat midge, Cercospora leaf spot, white mold, and Fusarium head blight.\n- Scouting fields is still important to validate the forecasting tools.\n\nThe article emphasizes how these advanced forecasting tools can help Minnesota farmers better time management practices and prepare for crop and pest threats.",
      "summaryTimestamp": 1771440496003
    },
    {
      "id": "67a14bb588f7d967",
      "title": "Help the Crops Team fine-tune programming!",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/help-crops-team-fine-tune-programming.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 16:30:47 +0000",
      "timestamp": 1771259447000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhCxd5PtQ8nJrtOb4X1Tz1md-IIKn225eI96PLlJgYOzihrHu8OUq4wBg-ocPXUHBdOkMO_NFZ1aPkpH1kdhqKdcIxaHijDP6s54fOuTloYefpKielhFj8Psev7G7MakTpjRcGWQ7Srb96x6RmLgtHNGcud3o7ZvUBqlI9eWAjZQ3jAzV9mLOeT01AkqSM4/s72-c/weed-management-field-day-sarangi.jpg",
      "summary": "The University of Minnesota Extension Crops Team is conducting a survey to better understand the educational needs and preferences of row crop and forage producers, as well as agriculture professionals who work with them. The goal is to customize their educational programs to the interests of these stakeholders.\n\nThe survey is anonymous and takes 12-15 minutes to complete. It aims to gather information about participants' operations, learning preferences, and how they want to engage with Extension. The Crops Team wants to use the survey responses to develop and deliver programming that meets the needs of producers and professionals.\n\nThe survey is open until February 16, 2026. All row crop and forage producers, as well as crop consultants, seed salespeople, pesticide applicators, grain buyers, and other agriculture professionals, are encouraged to participate. Their input will help the Crops Team refine their programming to ensure it is useful and relevant.",
      "summaryTimestamp": 1771612847530
    },
    {
      "id": "b4602ee8b589516a",
      "title": "Freeze, Thaw, Seed: Timing Pasture Renovation in an Unpredictable Winter",
      "link": "https://crops.extension.iastate.edu/post/freeze-thaw-seed-timing-pasture-renovation-unpredictable-winter",
      "description": "<p>This winter’s erratic weather, swinging from –30°F wind chills to unseasonably warm temperatures in the 50s, has left many wanting spring and ready to get back in the fields. Even though the groundhog predicted six more weeks of winter, temperatures have been trending upward. Over the next week, highs are expected to stay above freezing during the day and drop below freezing at night. These natural freeze–thaw cycles signal the slow transition into spring. </p>",
      "date": "Fri, 13 Feb 2026 11:51:43 -0600",
      "timestamp": 1771005103000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Main news/finding: Erratic winter weather with extreme temperature swings presents an opportunity for farmers to thicken forage stands through frost seeding.\n\nKey numbers/statistics:\n- Highs expected to stay above freezing during the day and drop below freezing at night over the next week.\n- Frost seeding can be a cost-effective way to rejuvenate a declining stand or introduce new legumes.\n\nDates/deadlines: None mentioned.\n\nPeople/organizations/programs:\n- Shelby Gruss, Assistant Professor Forage Extension Specialist at Iowa State University\n- Iowa State University Extension and Outreach\n\nLocations: Iowa\n\nContext/causes: The unpredictable winter weather, swinging from extreme cold to unseasonably warm temperatures, is creating conditions suitable for frost seeding.\n\nImpacts for farmers: Frost seeding can be used to thicken forage stands and introduce new legumes, which can help rejuvenate declining pastures in a cost-effective way.\n\nRecommendations/action items:\n- Farmers should consider frost seeding to take advantage of the current freeze-thaw cycle.\n- For more information on best practices for frost seeding, review the \"Frosting Seeding Legumes\" article.\n\nExpert quote:\n\"Her research focuses on optimizing forage-based systems through strategies to enhance resilience and productivity in annual and perennial forage through different management strategies. Current research projects focus on diversification, whether it be in a rotation with cover crops, intercropping for forage establishment, or utilizing different species to help break disease cycles.\"",
      "summaryTimestamp": 1771540065130
    },
    {
      "id": "9a2b8ede909ba045",
      "title": "Frosting Seeding Legumes",
      "link": "https://crops.extension.iastate.edu/encyclopedia/frosting-seeding-legumes",
      "description": "<p>Frost seeding involves strategically broadcasting or overseeding legumes, such as red clover, into a tired pasture or within a small grain stand. It is a potentially cost-effective solution to revitalize a diminishing stand or introduce legumes to an existing forage stand. Frost seeding is usually not recommended with grass species. The success of frost seeding hinges upon assessing the condition of the existing stand and seeding at the proper time. </p>",
      "date": "Fri, 13 Feb 2026 11:47:51 -0600",
      "timestamp": 1771004871000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "It is a cost-effective way to revitalize a diminishing forage stand or introduce legumes. Timing is critical, with frost seeding typically done between mid-February and early March to take advantage of freeze-thaw cycles that help incorporate the seed. \n\nA thick thatch can hinder success, so it's recommended to hay or overgraze the area in the prior fall/winter to open up the canopy. Sandy or very dry soils are less ideal, with loam or clay soils preferred. Adequate spring moisture is vital for establishing a healthy stand after frost seeding.\n\nThe article was authored by Shelby Gruss, an assistant professor and forage extension specialist at Iowa State University who joined the department in November 2023. Her research focuses on optimizing forage systems through strategies like diversification, cover cropping, and disease management.",
      "summaryTimestamp": 1771540067975
    },
    {
      "id": "ee41cb05521ef609",
      "title": "All Day Ag Outlook Conference March 3 at the Beef House",
      "link": "https://farmdoc.illinois.edu/field-crop-production/all-day-ag-outlook-conference-march-3-at-the-beef-house.html",
      "description": "The 36th annual All Day Ag Outlook will be held Tuesday, March 3, at the Beef House in Covington, Indiana. Join the WILLAg analysts and the farmdoc team for the day. We&#8217;ll cover the basics this year, including the markets, weather, weeds, trade, competition, land values, and crop insurance decisions. Click the registration link for complete details. Doors open at 7:30 a.m. central / 8:30 a.m. eastern and include both coffee and rolls in the morning and a Beef House lunch.&#8230;",
      "date": "Fri, 13 Feb 2026 13:55:21 +0000",
      "timestamp": 1770990921000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/ADAO-Header.png",
      "summary": "The 36th annual All Day Ag Outlook conference will be held on Tuesday, March 3, 2026, at the Beef House in Covington, Indiana. The event, organized by the University of Illinois Extension and the farmdoc team, will cover various agricultural topics, including markets, weather, weeds, trade, competition, land values, and crop insurance decisions.\n\nThe conference will feature presentations by experts such as Eric Snodgrass from Nutrien Ag Solutions on weather outlook, Joe Janzen from the University of Illinois on grain market fundamentals, and Joana Colussi from Purdue University on South American competition. Additionally, there will be panels on soybeans and corn featuring analysts from the WILLAg team.\n\nRegistration for the event is $40 per person if done by February 27, 2026, and $60 thereafter. Media members can register for free. The conference will start at 7:30 a.m. Central Time (8:30 a.m. Eastern Time) and includes coffee, rolls, and a Beef House lunch.\n\nThe conference will also cover topics such as weed management with Aaron Hager from the University of Illinois, the value of farmland with Bruce Sherrick from the University of Illinois, and where to trim crop budgets with Nick Paulson from the University of Illinois. Gary Schnitkey from the University of Illinois will also provide insights on crop insurance decisions.",
      "summaryTimestamp": 1771526754449
    },
    {
      "id": "3f08825939c7efbd",
      "title": "7 Vegetables to Start From Seed in February",
      "link": "https://modernfarmer.com/2026/02/vegetable-seed-february/",
      "description": "It takes a lot to get the farm ready for the growing season. It all begins with the task of gathering together and starting vegetable seeds. February is an ideal time to get many of your spring crops going. Consider these 7 vegetables as you prepare your rows. The post 7 Vegetables to Start From Seed in February appeared first on Modern Farmer.",
      "date": "Mon, 09 Feb 2026 12:00:00 +0000",
      "timestamp": 1770638400000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/03/Sowing-tomato-seeds-in-tray.webp",
      "summary": "This can be done in protected environments like greenhouses, cold frames, or even in the home. Key vegetables to start from seed in February include:\n\n- Slow-growing herbs like basil, oregano, and rosemary, which can take 1-4 weeks to germinate.\n- Tomatoes, which need 80+ days from seed to fruit and do best with a heat mat. Opt for determinate varieties in short seasons.\n- Peppers, which can take up to a month to sprout and need 2+ months to mature. Jalapeño, serrano, and shishito are good productive options.\n- Brassicas like broccoli, cabbage, and kale, which thrive in cool spring weather. Faster-maturing Asian brassicas work well in warm climates.\n- Lettuces, which grow quickly and can handle some late frost. Both leaf and heading lettuces can be sown.\n- Carrots and parsnips, which need to be direct sown in their final location due to sensitive taproots.\n- Onions and leeks, which take 1-2 weeks to sprout and 75-140 days to mature.\n\nThe article recommends using protected growing environments like greenhouses, cold frames, and low/high tunnels to extend the growing season, especially in cold climates. Proper seed starting, potting up, and fertilizing are also key for success.",
      "summaryTimestamp": 1771526758322
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this past week were 8-18 degrees below average, with lows reaching -7°F in Taylorville and -4°F in Jerseyville. January as a whole was about 2 degrees below normal statewide. Precipitation was scarce, with most areas receiving less than 0.1 inches of light snow. January ended around 2 inches drier than normal statewide. While some areas like Du Quoin had over 20 inches of snow, it only yielded less than 1 inch of liquid water, providing little drought relief.  \n\nLooking ahead, temperatures are expected to warm up to the 40s and 50s next week, but precipitation will remain sparse at under 0.1 inches. The third week of February is forecasted to be warmer and wetter than average as a more active weather pattern moves in. \n\nThe article also features comments from experts on the importance of using the N-Rate Calculator and Precision Conservation Management program to maximize profits rather than just yields. These tools help farmers optimize nitrogen applications to protect local water quality while maintaining their bottom line.\n\nThe article mentions the weekly WILLAg.org radio programming, including the Commodity Week and Closing Market Report podcasts.",
      "summaryTimestamp": 1771526761741
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Farmers are using new search methods like AI-assisted tools, voice search, and quick-scan platforms that often provide answers without requiring a click. As a result, attention metrics like time spent, scroll depth, and ad viewability are now more important indicators of advertising effectiveness. Experts recommend that agricultural advertisers focus on maximizing attention and engagement rather than just clicks and conversions. This shift is driven by changes in farmer search behavior, with AI and voice search reducing the need for direct clicks. Advertisers need to adapt their strategies to this new landscape in order to effectively reach and connect with their farmer audience.",
      "summaryTimestamp": 1771591818875
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "Key Findings:\n- Field trials were conducted in 2024-2025 at 6 sites in central Illinois and north-central Iowa to evaluate soybean performance under different tillage (conventional, strip-till, no-till) and cover crop (no cover, cereal rye) systems.\n- Starter fertilizer (15 lb N/ac or 15 lb N/ac + 10 lb S/ac) was evaluated in each system.\n- Soybeans showed an early-season response to starter fertilizer, with increased biomass at V4 stage. However, this did not translate to higher yields.\n- Soybean yields ranged from 60-95 bu/ac across trials. Yields were similar across tillage/cover crop systems, with conventional tillage and strip-till averaging 78.4 bu/ac, no-till at 77.6 bu/ac, and no-till with cereal rye at 76.2 bu/ac. \n- While yields were comparable, differences in profitability emerged due to varying input costs. No-till had the highest partial net return, followed by strip-till and conventional tillage. No-till with cereal rye had the lowest partial net return due to cover crop management costs.\n- The study will continue in 2026 to track longer-term impacts on soil, residue, and nutrient dynamics in conservation systems.",
      "summaryTimestamp": 1771526766329
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "Greenhouses trap thermal heat to warm plants, with some featuring vents, irrigation systems, and climate controls. Different types of greenhouses include modular plastic, low tunnels, cold frames, and designer greenhouses with concrete foundations and climate controls. \n\nFor February greenhouse growing, good options include:\n- Tomatoes and peppers, which benefit from early planting to give their long germination time\n- Brassicas like kale, cabbage, cauliflower, and broccoli to get an early harvest before spring pests arrive\n- Lettuces, which can be grown as baby greens or full-sized heads\n- Potatoes, to get full-sized tubers or baby potatoes by spring\n- Onions, including sets, seeds, and bunching onions\n- Flowers like lisianthus, coneflowers, and dahlias that take a long time to sprout\n\nProper greenhouse setup is key, with considerations around heat, ventilation, lighting, and pest protection. Greenhouses can raise temperatures by 2-30°F compared to outside, depending on the design.\n\nThe article does not provide any specific dates, prices, or expert quotes. It focuses on the general principles and recommended crops for February greenhouse growing across different regions and greenhouse types.",
      "summaryTimestamp": 1771526770038
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "S. avocado supply chain. The inaugural 3-day conference will be held on November 18-20, 2026 at the Hilton San Diego Bayfront. \n\nThe conference aims to bring together every segment of the avocado industry - including producers, exporters, importers, packers, retail and foodservice buyers - to collaborate, share data-driven insights, and align on strategies to strengthen the avocado category. Sessions will cover global avocado production and trade, retail/foodservice market trends, consumer insights, marketing programs, economic factors, and Hass Avocado Board's initiatives to expand avocado demand.\n\nThe Hass Avocado Board, which is supporting the conference content, sees it as a unique platform to unite the industry and accelerate sustainable growth in U.S. avocado consumption. Stakeholders attending will include growers, packers, importers/exporters, buyers, suppliers, and data/insights providers like CIRAD, Circana, and Dataessential.\n\nThe conference is scheduled for November 18-20, 2026 in San Diego, California. More information on sponsorship and attendance is available at www.theavocadoconference.com. The event is being organized by Farm Journal, the nation's leading agricultural media company, in collaboration with the Hass Avocado Board.",
      "summaryTimestamp": 1771591822325
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Iowa State University Pesticide Safety Education Program has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. The updated training manuals, including the Iowa Core Manual (CS445) and the Private Pesticide Applicator Manual (CS1), are available through the ISU Extension Store. New exams based on the revised core manual are also available at all Iowa Department of Agriculture and Land Stewardship test sites. The Private Pesticide Applicator Manual now includes a two-page informational update, and all private exams now include content from this insert. Farmers can contact Betsy Danielson, the Pesticide Safety Education Extension Specialist, for more information at betsydan@iastate.edu.",
      "summaryTimestamp": 1771591824895
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Lead generation should focus on delivering real value in exchange for a farmer's time and attention. The choice of call-to-action (CTA) and offer shapes not only the number of leads captured, but also their quality, motivation, and purchase-readiness. The article encourages shifting the mindset from what the business wants to collect to what farmers genuinely need.",
      "summaryTimestamp": 1771591826750
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Over the past week, temperatures were 4-8 degrees below normal across the state, with nighttime lows reaching as low as -5°F in Rockford and -2°F in Aurora. The cold weather was accompanied by strong winds, resulting in wind chill values close to -20°F on some days. \n\nPrecipitation levels were also low, with 7-day totals ranging from around 0.5 inches in northeast Illinois to virtually nothing in southwest Illinois. January to date has been very dry, with Carbondale and Charleston experiencing the 4th and 10th driest first two-thirds of January on record, respectively, both receiving less than 0.5 inches of precipitation.\n\nThe cold temperatures are expected to persist for at least another week, with most of the northern half of the state likely to remain below freezing for the rest of the month. However, a strong winter storm is projected to bring significant snowfall, with central Illinois expected to receive 3-4 inches and southern Illinois potentially seeing 8-12 inches, with isolated pockets of heavier snow.\n\nThe article also includes information about the \"Commodity Week\" radio program, which features commodity market analysis from experts Chip Nellinger of Blue Reef Agri-Marketing, Brian Stark from The Andersons, and Arlan Suderman with StoneX.",
      "summaryTimestamp": 1771526773671
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Some key points:\n\n- Traditional SEO (search engine optimization) focused on winning the click, but the new focus is on winning brand authority and trust through AEO.\n\n- Farmers are increasingly turning to AI-powered platforms like ChatGPT and Google's AI Overviews for instant answers, rather than traditional search engines. Brands need to be present in these new discovery channels to avoid becoming invisible.\n\n- At Farm Journal, they are observing this shift in real-time and advise that an \"answer-driven content strategy\" and amplifying trusted voices will be more important than ever for ag marketers.\n\n- Discoverability is now about ensuring your expertise, content, and brand authority surface at the exact moment your audience is looking for answers, across all channels where they're searching.\n\n- In the AEO era, discoverability is about winning the citation, brand mention, and trusted source reference that builds authority, even in \"zero-click\" moments.\n\nThe article emphasizes the need for ag marketers to reevaluate their 2026 strategies to adapt to this evolving landscape of agricultural information discovery.",
      "summaryTimestamp": 1771591831885
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "It originated in Brazil's tropical rainforests and involves integrating small-scale farming with conventional forestry to create a self-sustaining, ecologically-balanced system.\n\nThe most common forest farming method is thinning a forest to allow the best conditions for crops to grow in the understory, such as native ornamentals, fungi, fruit, timber, and forest food crops. Other approaches include silvopasture (combining forestry and ranching) and alley cropping (using tree canopies to protect specialty crops).\n\nBenefits of forest farming include improved water and soil quality, increased carbon storage (up to 22 lbs per year), better temperature regulation, and the ability to grow specialized crops that thrive in forested environments. It supports biodiversity by providing habitat for beneficial insects, birds, mammals, fungi, and microbes.\n\nExisting forested land, riparian areas, and even small amounts of forest on a farm can be suitable for conversion to an agroforestry system. Before starting, farmers should inventory their natural resources, manage any invasive trees, and develop a forest management plan with help from extension services.\n\nMarketing forest crops often requires being proactive, as they may not fit typical farmer's market or restaurant sales channels. Options include online sales, agritourism, pick-your-own, and direct marketing associations. Regulations around wild-harvested plants also need to be considered.",
      "summaryTimestamp": 1771526777425
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "Summary:\n\nSpray drones are increasingly being evaluated by Iowa farmers as a tool for crop input application. When used properly, they can provide flexibility, reduce field traffic, and improve access to hard-to-reach areas. However, adopting spray drone technology requires careful consideration of regulations, training, insurance, and management practices.\n\nKey Points:\n- Farmers should identify specific challenges they are trying to address with spray drones, such as making applications on wet soils, applying to tall crops, reducing compaction, or supplementing existing spraying capacity.\n- Regulatory requirements include an FAA Part 107 Remote Pilot Certificate, FAA Part 137 Certification for aerial pesticide application, and Iowa Department of Agriculture and Land Stewardship (IDALS) licensing.\n- Insurance needs include chemical liability, general liability, and hull/physical damage coverage. Providers typically require FAA Part 137 certification.\n- Equipment selection factors include spray tank capacity, battery life, nozzle options, and GPS guidance features.\n- Proper training is essential for safe and effective operation, including calibration, weather monitoring, and maintenance.\n- Farmers are encouraged to start on a limited scale, comparing results to conventional methods, before expanding adoption.\n- Resources available include Iowa State University programs, the Digital Agriculture Innovation Lab, licensed dealers, and IDALS.\n- Ongoing technology improvements in areas like payload, automation, and data integration will shape the long-term role of spray drones.\n\nA 2-day FAA Part 107 training workshop is scheduled at the Digital Ag Innovation Lab in Ames, IA on February 24-25, 2026. The registration link is provided.",
      "summaryTimestamp": 1771591836341
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "The 9 Best Flowers and Vegetables to Winter Sow\n\nFarmers can maximize profits and productivity in spring by adding winter sowing to their routine. This method involves starting hardy annuals and perennials in reused containers like milk jugs or plastic bags, which are placed outdoors to take advantage of the cold, moist conditions of winter.\n\nVegetables:\n- Cabbages, including standard and Napa varieties, as well as the shorter-maturing 'Carex' type, thrive in cold weather.\n- Spinach, especially mildew-resistant 'Avon' and bolt-resistant 'Space' varieties, does well with winter sowing.\n- Bulbing onions, as well as bunching onions and shallots, can be started now based on your latitude (long-day, short-day, or intermediate-day onions).\n- Leafy greens like kale, collards, chard, watercress, and microgreens are excellent winter sow candidates.\n\nFlowers:\n- Perennial flowers like pansies, echinacea, snapdragons, larkspur, and scabiosa can be winter sown to provide natural pest control and cut flowers.\n- Pansies are hardy, colorful, and sell well as bedding plants or cut flowers.\n- Echinacea needs cold stratification, which the winter sowing method provides.\n- Snapdragons, in four different groups, can be selected based on your climate to ensure early maturity.\n- Larkspur offers rare true-blue blooms and attracts pollinators.\n- Scabiosa, or pincushion flowers, are lovely in arrangements and also attract beneficial insects.\n\nBy taking advantage of winter sowing, farmers can get a head start on their spring gardens and enjoy earlier harvests and blooms.",
      "summaryTimestamp": 1771526781618
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series will be held at 12 locations across Iowa from January 6-29, 2026. The meetings are organized by Iowa State University Extension and Outreach to provide farmers and crop production professionals with the latest research-based information to help them make informed decisions for the upcoming growing season.\n\nKey details:\n- Dates and locations: Jan 6 (Sioux Center), Jan 7 (Storm Lake), Jan 8 (Burlington), Jan 9 (Mason City), Jan 13 (Estherville), Jan 15 (Waterloo), Jan 16 (Davenport), Jan 21 (Ankeny), Jan 22 (Atlantic), Jan 27 (Iowa City), Jan 28 (Le Mars), Jan 29 (Carroll)\n- Early-bird registration is $75 until the week before each meeting, late/on-site registration is $100\n- Registration includes refreshments, lunch, certified crop advisor credits, and access to resources\n- Private pesticide applicator recertification is available for a $30 fee\n- Topics include crop market and climate outlooks, nitrates and drinking water, profitable nutrient management, southern rust, transition planning, robots and drones, and more\n- The goal is to help producers manage potential issues by sharing the latest scientific knowledge from Iowa State researchers\n- Contact crops@iastate.edu or your regional ISU Extension agronomist for more information",
      "summaryTimestamp": 1771591840811
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10 at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5.\n\nThe event will feature research on the value of sorghum as a forage crop compared to corn. Key highlights:\n\n- Sorghum is more drought-tolerant and has lower nitrogen requirements than corn, and it is not a host for the tar spot pathogen.\n- Agronomy experts like Mitch Tuinstra will share plant breeding techniques to improve sorghum yield and quality.\n- Other speakers include Brad Shelton, Jason Tower, Nick Minton, and Jeff Jackson.\n- Venue tours will be available from 3-5 pm and 6-8 pm, and a dinner and bull test station tour will be held from 5-6 pm.\n\nThis event aims to provide farmers with information on the potential benefits of using sorghum as a forage crop. Participants are encouraged to register by the September 5 deadline.",
      "summaryTimestamp": 1771591847268
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Purdue/CME Group Ag Economy Barometer index rose 8 points to 113, while the Index of Current Conditions increased by 10 points to 100 and the Index of Future Expectations rose 7 points to 119. \n\nThis positive shift was attributed to fewer respondents reporting worsened conditions compared to a year ago and a decrease in those expecting negative future outcomes. However, high input costs (34%) and risk of lower crop/livestock prices (29%) remained the top concerns for farmers.\n\nThe Farm Financial Performance Index dropped 4 points in July to 81, 6 points lower than July 2023. This reflected farmers' worries about weakening commodity prices and high input costs. \n\nThe Farm Capital Investment Index rose 6 points to 38 in July, though it remains 7 points lower than a year prior. This was due to a decrease in the number of producers who believe it's a bad time to make large investments, from 80% in June to 75% in July.\n\nThe Short-Term Farmland Value Expectations Index improved slightly to 118, while the Long-Term Farmland Value Expectations Index dropped 6 points to 146. About 72% of crop farmers expect cash rental rates to remain roughly the same in 2025 compared to 2024.\n\nThe Purdue University Center for Commercial Agriculture and CME Group conducted the survey from July 15-19, 2024. The barometer's principal investigator is James Mintert of Purdue.",
      "summaryTimestamp": 1771591854270
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The fungal disease has spread from Latin America to 16 U.S. states and Ontario, Canada since first being detected in the U.S. in 2015. \n\nThe research team, led by C.D. Cruz, is using a mix of statistical analysis, data science, epidemiology, microbiology, artificial intelligence, and computer vision to better understand the dynamics of tar spot. Their work is funded by two USDA grants totaling nearly $1.1 million.\n\nKey aspects of the research include:\n- Developing a digital method to quantify tar spot using an algorithm that can detect and classify disease symptoms in 2 seconds.\n- Integrating drone imagery, weather data, and traditional disease evaluations to build AI models that can detect and track tar spot.\n- Characterizing tar spot epidemics at different scales using disease observations and drone data.\n\nThe interdisciplinary nature of the project, involving experts from agriculture and engineering, aims to provide rapid, accurate information to stakeholders and tackle the biosecurity challenges posed by this emerging disease. Collaborators include researchers in Colombia, Mexico, Ecuador, South Korea, and the U.S.",
      "summaryTimestamp": 1771591860391
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana Sheep Association (ISA), with additional support from the Indiana Sheep and Wool Market Development Program (IN S&W), is hosting a variety of sheep-themed events and competitions at the 2024 Indiana State Fair:\n\n- The Wool and Ewe Room and Ewe2 boutique will be open throughout the fair, offering fairgoers Indiana-grown wool items, livestock- and country-themed products.\n- On August 2nd at 10 a.m., there will be an open wool judging and wool sale event in the Blue Ribbon Pavilion.\n- The Make It With Wool (MIWW) competition and fashion show will take place on August 4th at 2 p.m. in the Indiana Arts Building.\n- The Indiana State Fair Shearing Contest will be held on August 4th at 5 p.m. in the Ball State University Champions Pavilion.\n- Taste from Indiana Farms event, featuring free samples of Indiana lamb, will run from August 8-11 from 11 a.m. to 6 p.m. in the Indiana Farm Bureau Fall Creek Pavilion.\n- The Sheep to Shawl competition, where youth teams create a wool shawl from scratch in 4 hours, will be on August 18th at 10 a.m. in the Indiana Arts Building.\n- Sheep can be seen in the Blue Ribbon Pavilion for open and 4-H shows from August 4-20.\n\nThe ISA is focused on showcasing the \"Art and Nature\" theme of sheep, featuring artwork from Indiana artists. One artist, Laura Winslow, donated copies of her sheep paintings that will be printed into stickers and magnets for distribution.\n\nThe Indiana Sheep Association was originally founded in 1876 as the Indiana Wool Growers Association, with the goal of promoting lamb and wool in the state and educating the community about the value of sheep and the industry. The IN S&W program supports educational, promotional, and research efforts related to sheep in Indiana, funded by a 0.5% checkoff on the net market price of each sheep sold.",
      "summaryTimestamp": 1771591867844
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- The Indiana State Fair will be held from August 2 to August 18, 2024, with the theme \"The Art & Nature of Fun\" in collaboration with Newfields.\n- Purdue Extension will have a presence at the fair, offering interactive demonstrations and activities at the Purdue Extension Building on topics such as block play, financial management, entomology, forestry, and animal sciences.\n- The Food Science Department will host an activity called \"What's Growing on My Spinach?\" to explore food microbiology and food safety, and will also offer samples of \"Cricket Rice Krispies Treats.\"\n- Seed art will be showcased in the livestock barns and the Purdue Extension Building, visually representing the fair's theme and providing educational information about the animals and agricultural topics.\n- The Purdue Ag Alumni Association will sponsor the Pioneer Village, which will transport fairgoers to the 1800s and offer activities like antique tractors, a farm toy show, and a fiddler's contest.\n- Purdue Extension exhibits will be located throughout the fairgrounds, spanning various buildings and pavilions.\n- Purdue University is a public research institution with over 105,000 students, and it is committed to affordability and accessibility, having frozen tuition for 13 years.",
      "summaryTimestamp": 1771591875014
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The University of Wisconsin-Madison has released a new publication called \"Potassium Cycle\" that provides a visual overview of the potassium cycle in Wisconsin cropping systems. The two-page publication outlines key potassium concepts and recommendations for specific situations. The publication is available for download only and was released on June 12, 2024. Farmers can access and download the publication from the UW Madison website.",
      "summaryTimestamp": 1771591877840
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Wisconsin winter wheat is 10-14 days ahead of normal growth stages due to a warm spring and timely rain.\n- There is a high likelihood of stripe rust disease appearing in Wisconsin this season, though it has not been detected yet. Farmers are advised to scout for it.\n- Fusarium head blight (FHB) is also a concern this season, as the moderate temperatures and adequate precipitation create favorable conditions. FHB can limit yields and produce the mycotoxin deoxynivalenol (DON or vomitoxin), which can lead to grain being discounted or rejected if levels exceed 2 ppm.\n- Farmers are encouraged to monitor for these diseases and take appropriate in-season management actions.\n\nThe article was posted on May 20, 2024 by Damon Smith, Extension Field Crops Pathologist, and Shawn Conley, Extension Soybean and Small Grains Agronomist, from the University of Wisconsin-Madison.",
      "summaryTimestamp": 1771591881317
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The key points from the article are:\n\n- Early in the growing season, soybean fields can experience stand losses due to various factors like freezing temperatures, hail, flooding, pests, etc.\n\n- Soybean plants can compensate for open spaces by developing axillary branches and yielding well even with lower plant populations.\n\n- Action is warranted if stand loss leaves fewer than 50,000-60,000 evenly-distributed plants per acre in southern regions, or 75,000 plants per acre in northern regions, or if there are areas over 6-10 sq ft without any plants.\n\n- Factors to consider when deciding whether to replant include: existing stand and distribution, calendar date and delayed planting effects, weed management, seed/variety availability, cost, and yield penalty of delayed replanting.\n\n- The article provides a link to a more detailed fact sheet on soybean replant decisions.",
      "summaryTimestamp": 1771591885432
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The key points from the agricultural news article are:\n\n- Farmers planning to spray 2,4-D for post-emergence broadleaf weed control in Enlist E3 soybeans can only use the 2,4-D choline formulation found in Enlist One and Enlist Duo herbicides. Other 2,4-D ester or amine formulations cannot be used post-emergence in Enlist E3 soybeans.\n\n- There have been reports of producers, agronomists, and even Certified Crop Advisors considering using the ester or amine formulations post-emergence, which is not allowed by the label.\n\n- For burndown applications, if using a 2,4-D ester or amine formulation product, there is a soybean plant back interval of at least 7 days when using 0.5 lbs ae/acre. This restriction does not apply if using Enlist One or Enlist DUO.\n\n- The article was posted on May 11, 2024 by Daniel H. Smith from the UW-Madison Division of Extension and Rodrigo Werle, a Weed Scientist and Extension Specialist at UW-Madison.\n\n- The key message is that farmers must follow the herbicide label requirements, as the label is the law.",
      "summaryTimestamp": 1771591890809
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The University of Wisconsin-Madison Division of Extension has announced the results of the Wisconsin Certified Crop Adviser (WI CCA) Board election. Rob Shields, Matt Brugger, and Chris Bandura have been elected to the WI CCA Board and will serve two, three-year terms.\n\nAll Wisconsin CCAs in good standing are eligible for nomination and can vote in future elections, which will be held again in early 2025. Daniel H. Smith, the Outreach Program Manager for the Crops and Soils Program at the University of Wisconsin-Madison Division of Extension, thanked everyone who provided nominations and voted in the recent election.",
      "summaryTimestamp": 1771591895876
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 16,
  "updated": "2026-02-20T18:40:47.731Z"
}