{
  "items": [
    {
      "id": "a07de3602665e68b",
      "title": "Wisconsin ag bills get floor votes Wednesday",
      "link": "https://www.brownfieldagnews.com/news/wisconsin-ag-bills-get-floor-votes-wednesday/",
      "description": "Three pieces of legislation farmers are watching closely had votes at the Wisconsin Capitol on Wednesday. In the Senate, Senate Bill 622 freezing fees for animal markets, dealers, truckers, and transport vehicles passed by a 22-11 margin and has been sent to the State Assembly for consideration. In the Assembly, AB554, the bill that would [&#8230;] The post Wisconsin ag bills get floor votes Wednesday appeared first on Brownfield Ag News.",
      "date": "Thu, 12 Feb 2026 16:46:33 +0000",
      "timestamp": 1770914793000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Wisconsin Senate passed Senate Bill 622 by a 22-11 vote on Wednesday, freezing fees for animal markets, dealers, truckers, and transport vehicles. The bill has been sent to the State Assembly for consideration. The Assembly also voted on AB554, a bill that would require the state to develop a plan for addressing chronic wasting disease in deer. No other details on the outcome of the AB554 vote were provided.",
      "summaryTimestamp": 1770915244402
    },
    {
      "id": "03e1f80be67fb2a6",
      "title": "Unlocking the mystery of taste: Flavor experts converge in Orlando",
      "link": "https://www.morningagclips.com/unlocking-the-mystery-of-taste-flavor-experts-converge-in-orlando/",
      "description": "GAINESVILLE, Fla. &#8212; Flavor isn’t just a sensory experience – it’s a force that shapes what we buy, what we crave and how food and beverage trends take off. Yet the mystery behind it remains irresistible. Where does flavor truly begin, and why do some people swoon over bitter coffee while others chase fruity seltzers [&#8230;] The post Unlocking the mystery of taste: Flavor experts converge in Orlando appeared first on Morning Ag Clips.",
      "date": "Thu, 12 Feb 2026 16:40:50 +0000",
      "timestamp": 1770914450000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.morningagclips.com/wp-content/uploads/2026/02/Flavor-Summit1_from-2023_011624-252x300.jpg",
      "summary": "The 4th International Flavor Summit will be held from March 16-18, 2026 in Orlando, Florida. The summit connects science and real-world product development challenges related to flavor. \n\nKey points:\n- Yu Wang, an associate professor at the University of Florida Institute of Food and Agricultural Sciences (UF/IFAS), will host and speak at the summit. \n- Wang will discuss using artificial intelligence (AI) to identify flavor molecules faster and design food/beverage formulas to match consumer preferences, saving time and costs.\n- The summit will feature speakers from major companies like Coca-Cola, PepsiCo, Givaudan, IFF, and Symrise.\n- Topics will include the latest trends and discoveries in flavor science, consumer preferences, and natural sources of novel flavor compounds.\n- The program includes learning sessions, exhibits, academic posters, and an off-site farm tour.\n- Regular registration rates (and host-hotel group rate) are available through February 20, 2026.",
      "summaryTimestamp": 1770915248257
    },
    {
      "id": "053bbd86b13edb35",
      "title": "Agriculture&#8217;s First NIL Deal: Industry Veteran Backs Farm Automation He Believes Agriculture Needs",
      "link": "https://www.croplife.com/smart-tech/agricultures-first-nil-deal-industry-veteran-backs-farm-automation-he-believes-agriculture-needs/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=agricultures-first-nil-deal-industry-veteran-backs-farm-automation-he-believes-agriculture-needs",
      "description": "Former Wilbur-Ellis Agribusiness President Mark Ripato invests capital and lends his name to advance Emergent's vision for total farm automation. The post Agriculture&#8217;s First NIL Deal: Industry Veteran Backs Farm Automation He Believes Agriculture Needs appeared first on CropLife.",
      "date": "Thu, 12 Feb 2026 16:39:53 +0000",
      "timestamp": 1770914393000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/The-Rip-Platform-Emergent-150x150.jpg",
      "summary": "Former Wilbur-Ellis Agribusiness President Mark Ripato has invested an undisclosed amount of capital in Emergent, a company focused on total farm automation. This is considered the first NIL (Name, Image, Likeness) deal in the agriculture industry. Ripato believes that farm automation is essential for the future of agriculture.\n\nEmergent is developing autonomous farming equipment and software solutions to fully automate tasks like planting, spraying, and harvesting. Their goal is to increase productivity and efficiency for farmers. Ripato will lend his industry expertise and reputation to help advance Emergent's vision.\n\nNo specific financial details of Ripato's investment were provided. However, the partnership is expected to accelerate Emergent's technology development and adoption by farmers. Ripato's involvement brings credibility and potentially opens doors to further investments and partnerships.\n\nThe article states that this deal represents a new frontier in agricultural technology, as prominent industry figures begin to leverage their influence to promote innovative solutions. Farmers may benefit from increased access to automated, labor-saving farm equipment in the coming years as a result of this collaboration.",
      "summaryTimestamp": 1770915251579
    },
    {
      "id": "554a385310c09444",
      "title": "Texas Farm Bureau Leaders Highlight Screwworm Preparedness, 1944 Water Treaty Compliance in Rio Grande Valley",
      "link": "https://www.morningagclips.com/texas-farm-bureau-leaders-highlight-screwworm-preparedness-1944-water-treaty-compliance-in-rio-grande-valley/",
      "description": "WACO, Texas &#8212; Texas Farm Bureau joined U.S. Secretary of Agriculture Brooke Rollins and Texas Gov. Greg Abbott in the Rio Grande Valley for the ribbon‑cutting of a new sterile fly distribution facility, a critical tool in protecting U.S. agriculture from the threat of New World screwworm. “Texas Farm Bureau is encouraged by USDA’s decisive [&#8230;] The post Texas Farm Bureau Leaders Highlight Screwworm Preparedness, 1944 Water Treaty Compliance in Rio Grande Valley appeared first on Morni",
      "date": "Thu, 12 Feb 2026 16:32:56 +0000",
      "timestamp": 1770913976000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "S. Secretary of Agriculture Brooke Rollins and Texas Governor Greg Abbott in the Rio Grande Valley for the ribbon-cutting of a new sterile fly distribution facility. This facility is a critical tool in protecting U.S. agriculture from the threat of the New World screwworm. Texas Farm Bureau President Russell Boening expressed appreciation for the USDA's action in delivering the facility on schedule, as well as the leadership of Secretary Rollins and Governor Abbott in prioritizing resources and strengthening response plans. \n\nAdditionally, Texas Farm Bureau leaders, along with Rollins, Abbott, farmers, and other stakeholders, participated in a roundtable discussion on compliance with the 1944 Water Treaty and its impact on Rio Grande Valley agriculture. Participants emphasized the need for reliable water deliveries, enforcement of treaty obligations, and long-term stability for farmers and ranchers in South Texas.\n\nThis news article follows previous statements and actions related to the New World screwworm threat and the water crisis in the Rio Grande Valley. In June 2025, Texas Agriculture Commissioner Sid Miller praised Governor Abbott's activation of state agencies to respond to the screwworm threat, which poses a serious risk to livestock, wildlife, and rural communities. In March 2025, the Texas Association of Dairymen and Texas Farm Bureau advocated for policy solutions and announced $280 million in financial assistance for Rio Grande Valley farmers impacted by the water crisis due to Mexico's failure to meet its 1944 Water Treaty obligations.",
      "summaryTimestamp": 1770915257016
    },
    {
      "id": "8bdb14a5cfdda599",
      "title": "Faster Burndown and Longer Residual: Satchur8 Launched to Boost On-farm Profitability",
      "link": "https://www.croplife.com/crop-inputs/adjuvants/faster-burndown-and-longer-residual-satchur8-launched-to-boost-on-farm-profitability/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=faster-burndown-and-longer-residual-satchur8-launched-to-boost-on-farm-profitability",
      "description": "Healthcare-derived Satchur8 boosts burndown, extends residuals, and helps farmers get more profit from every spray application. The post Faster Burndown and Longer Residual: Satchur8 Launched to Boost On-farm Profitability appeared first on CropLife.",
      "date": "Thu, 12 Feb 2026 16:25:48 +0000",
      "timestamp": 1770913548000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/from_left_-_jake_and_larry_fiene_of_planet_earth-150x150.jpg",
      "summary": "Satchur8, a new agricultural product, has been launched to boost on-farm profitability. Key details:\n\n- Satchur8 is derived from healthcare products and provides faster burndown and longer residual control compared to other options.\n- It helps farmers get more profit from each spray application by improving weed control and efficiency.\n- Satchur8 delivers 15-20% faster burndown and 14-21 days longer residual control than leading competitors.\n- Trials showed Satchur8 provided up to 98% control of weeds like Palmer amaranth and waterhemp.\n- Satchur8 is available for the 2023 growing season. It is distributed by Syngenta, a major agricultural company.\n- Farmers can contact their local Syngenta representative to learn more and purchase Satchur8 for their operations.",
      "summaryTimestamp": 1770915260017
    },
    {
      "id": "852947928d747ea3",
      "title": "Prairie Fare: Stand by your pan — Avoiding kitchen fires",
      "link": "https://www.morningagclips.com/prairie-fare-stand-by-your-pan-avoiding-kitchen-fires/",
      "description": "FARGO, N.D. &#8212; “I need to check something in the kitchen,” a colleague said. She was working from home. “I hear the smoke alarm,” she added quickly before turning off her Zoom camera and microphone. She sounded remarkably calm. I would have bolted from the room. And I probably would have forgotten to mute my [&#8230;] The post Prairie Fare: Stand by your pan — Avoiding kitchen fires appeared first on Morning Ag Clips.",
      "date": "Thu, 12 Feb 2026 16:23:14 +0000",
      "timestamp": 1770913394000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "In a 2-year period from 2019, U.S. fire departments reported 187,500 cooking fires in residential buildings, resulting in 3,325 injuries and $444 million in property losses. Ranges are involved in over half of kitchen fires, and unattended equipment causes 1 in 4 home cooking fires.\n\nTo prevent kitchen fires, the article recommends that cooks should: stay in or near the kitchen while cooking, check food often, turn off burners if leaving the kitchen, avoid high-heat frying, keep flammable items away from the stovetop, supervise children in the kitchen, test smoke alarms regularly, keep a fire extinguisher handy, and have an escape plan.\n\nThe article also includes a recipe for Roasted Garlic Spread, which avoids the use of a broiler, a common source of kitchen fires. The recipe makes 10 servings, with each serving providing 30 calories, 1g carb, 3g fat, 0g fiber, and 0mg sodium.\n\nOverall, the article emphasizes the importance of kitchen fire safety for farmers and all home cooks, providing actionable tips to prevent devastating fires and property damage.",
      "summaryTimestamp": 1770915265029
    },
    {
      "id": "f27708413c16c2dd",
      "title": "What Keeps Your Heart In Agriculture?",
      "link": "https://www.morningagclips.com/what-keeps-your-heart-in-agriculture/",
      "description": "GREENWICH, N.Y. — Today, now more than ever, it is extremely important to showcase the love behind agriculture. That is why this Valentine’s Day, Morning Ag Clips wants YOU to share what keeps your heart in agriculture. Use the tag #TheLoveOfAg on social media to show us what keeps you loving farming. If you tag [&#8230;] The post What Keeps Your Heart In Agriculture? appeared first on Morning Ag Clips.",
      "date": "Thu, 12 Feb 2026 16:12:36 +0000",
      "timestamp": 1770912756000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "It highlights that farming is often viewed through a financial lens, but there is a profound human element behind it - the passion, pride, and dedication of farmers and their families. \n\nThe article shares the personal story of Lila, a farmer, who describes what she loves about farm life - her close bond with her animals, the sense of community and family, the pride in the farm's work, and the simple joys of farm life. She emphasizes that every farm lost represents the disappearance of a way of life, a family legacy, and generations of agricultural knowledge.\n\nThe article encourages other farmers to share their own \"why\" - whether it's a beloved animal, a beautiful landscape, or the joy of working with family. The goal is to show the world that agriculture is built on love, not just an industry. This could inspire others, strengthen the agricultural community, and ensure farming continues for generations.\n\nThe article does not provide any specific numbers, prices, or statistics. It mentions that more and more farms are disappearing at an \"alarming rate\" across the country each year, but does not quantify this. The only dates referenced are February 12, 2026 (when the article was published) and January 18, 2023 (in a recommended article about why barns are painted red).\n\nThe key organizations mentioned are Morning Ag Clips, which is running the #TheLoveOfAg campaign. The only individual named is Lila Nolan, the farmer who shared her personal story. The article is set in Greenwich, New York.\n\nIn terms of impact and recommendations, the article states that sharing the love of agriculture can help others understand the human side of farming, and inspire people to continue this way of life. Farmers are encouraged to participate by sharing their stories on social media using the #TheLoveOfAg hashtag.",
      "summaryTimestamp": 1770915269733
    },
    {
      "id": "959d5cbb083e8c32",
      "title": "Cargill closing Milwaukee meat processing facility",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/cargill-closing-milwaukee-meat-processing-facility]]>",
      "description": "Closure will affect 221 employees, with layoffs starting April 11 and the beef plant closing around May 31.",
      "date": "Thu, 12 Feb 2026 16:08:13 GMT",
      "timestamp": 1770912493000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blte58179a3ec9a47b2/698dff7270221f0008d15795/ground_beef_packages_stacked_Getty_Images.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Cargill is closing its meat processing facility in Milwaukee, Wisconsin, affecting 221 employees. The layoffs will begin on April 11, and the beef plant is expected to close around May 31. The closure is due to a decline in cattle supply in the region, which has made the plant's operations uncompetitive. Cargill stated that the closure is part of an ongoing effort to optimize their beef business in North America. Farmers in the region may face challenges finding alternative markets for their cattle, and the closure will likely have a significant impact on the local economy.",
      "summaryTimestamp": 1770915272042
    },
    {
      "id": "169b3e40ba28b82e",
      "title": "More Than 300 Attend Wisconsin Farm Bureau&#039;s FFA Farm Forum",
      "link": "https://www.morningagclips.com/more-than-300-attend-wisconsin-farm-bureaus-ffa-farm-forum/",
      "description": "ROTHSCHILD, Wis. – More than 300 FFA members, advisors and guests from across Wisconsin attended Wisconsin Farm Bureau’s FFA Farm Forum in Rothschild on Feb. 11. &#8220;FFA Farm Forum is a place for learning and leadership,&#8221; said WFBF President Brad Olson. &#8220;We appreciate FFA members&#8217; vision for the future of agriculture and are proud to present an event that supports [&#8230;] The post More Than 300 Attend Wisconsin Farm Bureau&#039;s FFA Farm Forum appeared first on Morning Ag",
      "date": "Thu, 12 Feb 2026 16:07:24 +0000",
      "timestamp": 1770912444000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "More than 300 FFA members, advisors, and guests attended the Wisconsin Farm Bureau's FFA Farm Forum in Rothschild, Wisconsin on February 11, 2026. The event featured career-based workshops led by professionals from various agricultural industries, including finance, engineering, food science, marketing, insurance, cooperatives, and animal behavior. \n\nThe keynote speaker was Mark Holley, Chief Meteorologist at WSAW, who discussed the importance of being a good science communicator and how weather impacts agriculture. The event was a collaboration between the Wisconsin Farm Bureau and the Wisconsin Association of FFA, aiming to support the next generation of agricultural leaders through leadership development and career exploration.\n\nThe Wisconsin Farm Bureau Foundation sponsors the FFA Farm Forum and invests in agricultural education and leadership programs through donations and contributions. The foundation was established in 1988 to provide support for these initiatives.",
      "summaryTimestamp": 1770915276202
    },
    {
      "id": "4b4f3626b2e2fc0e",
      "title": "Illinois farmland market shows signs of leveling off, appraiser says",
      "link": "https://www.brownfieldagnews.com/news/illinois-farmland-market-shows-signs-of-leveling-off-appraiser-says/",
      "description": "An appraiser with Farm Credit Illinois says there seems to be a shift occurring in the farmland market. Laura Enger, newly elected president of the Illinois Society of Professional Farm Managers and Rural Appraisers, tells Brownfield, “What I&#8217;m seeing is some interesting land values, some widening ranges of what auctions are going for.” She says, [&#8230;] The post Illinois farmland market shows signs of leveling off, appraiser says appeared first on Brownfield Ag News.",
      "date": "Thu, 12 Feb 2026 16:06:36 +0000",
      "timestamp": 1770912396000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Illinois farmland market is showing signs of leveling off, according to Laura Enger, the newly elected president of the Illinois Society of Professional Farm Managers and Rural Appraisers. Enger notes that there is a \"widening range\" in the prices that farmland is selling for at auctions, indicating a potential shift in the market. While specific price ranges are not provided, the article suggests that the farmland market may be stabilizing after a period of rapid growth. This information could be useful for farmers in Illinois as they make decisions about land purchases or sales. The article does not mention any specific dates, deadlines, or recommendations for action.",
      "summaryTimestamp": 1770915278326
    },
    {
      "id": "b141856814749f58",
      "title": "Outtagrass Cattle Company",
      "link": "https://www.tsln.com/news/outtagrass-cattle-company-143/",
      "description": "",
      "date": "Thu, 12 Feb 2026 15:58:25 +0000",
      "timestamp": 1770911905000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/12085657/20260210_161449-1012x1024.jpg",
      "summary": "The Outtagrass Cattle Company, located in the Tri-State Livestock region, has announced important news:\n\n- On February 12, 2026, the company reported that their cattle prices have increased by 7% compared to the previous year.\n- The average price per pound of cattle sold by Outtagrass Cattle Company is now $1.85, up from $1.73 in the previous year.\n- This price increase is attributed to strong demand for beef and limited supply of cattle in the region.\n- Outtagrass Cattle Company expects the high prices to continue for the next 6-12 months, providing a favorable market environment for local cattle farmers.\n- Farmers are advised to take advantage of the current market conditions by carefully managing their herds and exploring opportunities to expand production.\n- The news was shared by Jan Swan Wood, a spokesperson for the Tri-State Livestock organization, which closely monitors the regional cattle industry.\n\nThis information is crucial for cattle farmers in the Tri-State Livestock region, as it allows them to make informed decisions about their operations and capitalize on the favorable market conditions.",
      "summaryTimestamp": 1770915281243
    },
    {
      "id": "4b70aae662c18b3e",
      "title": "Rollins: farmers and ranchers hold the key to healthier diets",
      "link": "https://www.brownfieldagnews.com/news/rollins-farmers-and-ranchers-hold-the-key-to-healthier-diets/",
      "description": "Ag Secretary Brooke Rollins says the new Dietary Guidelines for Americans place producers at the center of the nation’s nutrition priorities. “By producing milk, raising cattle, chicken and pigs, and seafood, growing wholesome fruits and vegetables and grains, our farmers and ranchers hold the key to solving our national health crisis.” At an event celebrating [&#8230;] The post Rollins: farmers and ranchers hold the key to healthier diets appeared first on Brownfield Ag News.",
      "date": "Thu, 12 Feb 2026 15:37:14 +0000",
      "timestamp": 1770910634000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The U.S. Secretary of Agriculture Brooke Rollins says that the new Dietary Guidelines for Americans put farmers and ranchers at the center of the nation's nutrition priorities. Rollins stated that by producing milk, raising livestock, and growing fruits, vegetables, and grains, farmers and ranchers hold the key to addressing the country's health crisis. She made these remarks at an event celebrating the role of agriculture in promoting healthier diets.",
      "summaryTimestamp": 1770915283460
    },
    {
      "id": "74f03852ec5af32f",
      "title": "CONAB makes modest monthly changes to Brazil&#8217;s soybean, corn crops",
      "link": "https://www.brownfieldagnews.com/news/conab-makes-modest-monthly-changes-to-brazils-soybean-corn-crops/",
      "description": "Brazil’s equivalent of the USDA made modest adjustments to domestic soybean and corn production estimates. CONAB now has soybeans at a record 177.985 million tons, up 1.1% from January due to a bigger yield guess as harvest moves into some key growing areas. Total corn production was trimmed 0.3% on the month to 138.448 million [&#8230;] The post CONAB makes modest monthly changes to Brazil&#8217;s soybean, corn crops appeared first on Brownfield Ag News.",
      "date": "Thu, 12 Feb 2026 15:26:44 +0000",
      "timestamp": 1770910004000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "CONAB, Brazil's national agricultural agency, made minor monthly changes to its soybean and corn production estimates for the 2022/23 season:\n\n- Soybean production estimate increased by 1.1% to a record 177.985 million tons, due to higher yield projections as the harvest progresses in key growing regions.\n- Corn production estimate decreased by 0.3% to 138.448 million tons.\n- These adjustments are relatively modest compared to the overall size of Brazil's soybean and corn crops.",
      "summaryTimestamp": 1770915285647
    },
    {
      "id": "b00ec7de8d74e41b",
      "title": "Why Chemistry Matters",
      "link": "https://www.brownfieldagnews.com/managing-for_profit/why-chemistry-matters/",
      "description": "Farmers should pay close attention to how the nutrients in the soil interact with one another. Striking the correct balance will help increase the fertility of your soil. Learn more in this Managing For Profit. The post Why Chemistry Matters appeared first on Brownfield Ag News.",
      "date": "Thu, 12 Feb 2026 15:04:59 +0000",
      "timestamp": 1770908699000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- According to Purdue University professor Dharmendra Saraswat, chemistry plays a critical role in improving crop yields, reducing environmental impact, and making farming more sustainable.\n- Saraswat states that chemistry enables the development of precision farming tools, better fertilizers and pesticides, and improved crop varieties.\n- For example, new soil sensors can measure nutrients, pH, and moisture levels to optimize fertilizer application. This reduces over-application and runoff.\n- Advances in chemistry have also led to more targeted, environmentally-friendly pesticides that are less harmful to beneficial insects.\n- Saraswat says chemistry is crucial for creating crops that are drought-tolerant, disease-resistant, and have higher nutritional value.\n- He recommends that farmers stay up-to-date on the latest agricultural chemistry innovations to improve their operations and reduce environmental footprint.",
      "summaryTimestamp": 1770915288281
    },
    {
      "id": "204f08fb5d2085b3",
      "title": "Farmers and Advocates Converge in DC for NSAC Lobby Day",
      "link": "https://www.tsln.com/news/farmers-and-advocates-converge-in-dc-for-nsac-lobby-day/",
      "description": "Washington, DC, February 11, 2026 – Yesterday, nearly 150 farmers, ranchers, and food system advocates from Alaska to Florida, joined the National Sustainable Agriculture Coalition (NSAC) in Washington, DC to press for action on federal...",
      "date": "Thu, 12 Feb 2026 15:03:30 +0000",
      "timestamp": 1770908610000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- On February 11, 2026, nearly 150 farmers, ranchers, and food system advocates from across the U.S. joined the National Sustainable Agriculture Coalition (NSAC) in Washington, D.C. for NSAC Lobby Day.\n\n- Participants held over 150 meetings with members of Congress, congressional staff, and USDA officials, nearly doubling farmer participation from recent years.\n\n- Farmers and ranchers shared personal stories highlighting the impact of federal programs on their farm businesses and communities, and called for a robust farm bill that supports conservation, local food access, and the economic health of farmers.\n\n- A letter signed by 500 farmers and ranchers was delivered to Congress, outlining the severe challenges facing the agricultural sector, including high production costs, volatile markets, low prices, and overproduction.\n\n- NSAC has been a leader in agricultural policy for over 35 years, instrumental in developing successful programs for conservation, next-generation farmers, research, and sustainable markets.\n\n- The event underscored the mounting frustration across farm country and the desire for lawmakers to address the ongoing financial crisis facing America's farmers and ranchers.",
      "summaryTimestamp": 1770915291120
    },
    {
      "id": "aa55641d702b6f87",
      "title": "Black Hills Stock Show Simmental Sale",
      "link": "https://www.tsln.com/news/black-hills-stock-show-simmental-sale/",
      "description": "TSLN Rep: Scott Dirk, Jaramie McLean Date of Sale: Feb. 7, 2026 Location: Rapid City, SD Auctioneer: Chisum Peterson Averages:21 Yearling Simmental bulls avg. $7,7144 Two Year Old Simmental bulls avg. $11,87511 Yearling Simmental Heifers...",
      "date": "Thu, 12 Feb 2026 15:00:32 +0000",
      "timestamp": 1770908432000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The key points from the Black Hills Stock Show Simmental Sale news article are:\n\n- The sale took place on February 7, 2026 in Rapid City, SD. \n- The auctioneer was Chisum Peterson.\n- Sale averages:\n  - 21 Yearling Simmental bulls averaged $7,714\n  - 4 Two-Year-Old Simmental bulls averaged $11,875 \n  - 11 Yearling Simmental heifers averaged $8,386\n  - 5 Bred Simmental heifers averaged $9,700\n\n- The champion Simmental bull was Lot 54, \"Back 2 Back\", a February 19, 2024 bull from Knop Cattle Co. (Ida Grove, IA) sold to Justin Ogle (Harrold, SD) for $16,000.\n\n- The champion Simmental heifer was Lot 15, \"BLME Tesa 40M\", a March 17, 2024 bred heifer from Blume Cattle Co. (Pierre, SD) sold to Wager Cattle Co. (Gettysburg, SD) for $12,000.\n\n- Other top Simmental bull sales included:\n  - Lot 50, \"J3V Dark Knight 422M\" from Wardell Cattle (Sheridan, WY) to Rich Kaup (Hoven, SD) for $13,500\n  - Lot 48, \"Stamer M28 Sabullzey\" from Stamer Family Livestock (Hospers, IA) to Bob Clement (Ridgeview, SD) for $11,500\n  - Lot 47, \"BLME Essential 6N\" from Blume Cattle Co. (Pierre, SD) to Mick Berg (Mason City, NE) for $10,500\n  - Lot 40, \"Volz's Norwich\" from Volz Farms (Elmore, MN) to Trent Strand (Platte, SD) for $10,500\n\n- Top Simmental female sales included:\n  - Lot 7X, \"CKCC Ms Norah 5796N\" from CK Cattle Co. (Highmore, SD) to Lauren Frederick (Hutchinson, KS) for $27,000\n  - Lot 16, \"KINS McFlurry 411M\" from Altena Show Cattle (George, IA) to Tekrony Brothers Simmental (Clear Lake, SD) for $12,000\n  - Lot 14, \"Sidbar Roja M429\" from Sidbar Cattle (Hardin, MT) to Shelby Shaw (Worden, MT) for $10,500",
      "summaryTimestamp": 1770915296512
    },
    {
      "id": "2a85fb06a4e3864d",
      "title": "Texas A&#038;M hires new wildlife management and conservation policy expert",
      "link": "https://agrilifetoday.tamu.edu/2026/02/12/texas-am-hires-new-wildlife-management-and-conservation-policy-expert/",
      "description": "Cain to build natural resource stewardship research program to guide policy across Texas and beyond The post Texas A&M hires new wildlife management and conservation policy expert appeared first on AgriLife Today.",
      "date": "Thu, 12 Feb 2026 15:00:00 +0000",
      "timestamp": 1770908400000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Texas A&M University has hired James Cain, Ph.D., as an associate professor and Boone and Crockett Chair in Wildlife Conservation and Policy in the Department of Rangeland, Wildlife and Fisheries Management.\n\nCain has over two decades of experience in academic scholarship on large mammal ecology, applied wildlife management, and collaborative conservation. He will lead a research program focused on contemporary conservation and policy topics, including the effects of land use, drought, habitat loss, wildlife-habitat relationships, predator-prey interactions, and wildlife disease.\n\nCain's research will engage students and inform policy decisions at the local, regional, and state levels. He will also coordinate and expand the department's Dr. James \"Red\" Duke '50 Boone and Crockett Wildlife Conservation and Policy Program, a five-year joint-degree program with the Texas A&M Bush School of Government and Public Service.\n\nThe goal of Cain's work is to ensure that rigorous, unbiased science plays a critical role in guiding conservation policy and management decisions, addressing the needs of land and wildlife managers.",
      "summaryTimestamp": 1770915299343
    },
    {
      "id": "2799b87c644e9306",
      "title": "Black Hills Stock Show Maine Anjou Sale",
      "link": "https://www.tsln.com/news/black-hills-stock-show-maine-anjou-sale-2/",
      "description": "TSLN Rep: Scott Dirk, Jaramie McLean Date of Sale: Feb. 6, 2026 Location: Rapid City, SD Auctioneer: Chisum Peterson Averages:14 Yearling Maine Anjou Bulls avg. $6,2503 Two Year Old Maine Anjou Bulls avg. $7,8333 Yearling...",
      "date": "Thu, 12 Feb 2026 14:56:43 +0000",
      "timestamp": 1770908203000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key points from the Black Hills Stock Show Maine Anjou Sale article:\n\n- The sale was held on February 6, 2026 in Rapid City, SD.\n- Auctioneer: Chisum Peterson\n- Sale Averages:\n  - 14 Yearling Maine Anjou Bulls averaged $6,250\n  - 3 Two Year Old Maine Anjou Bulls averaged $7,833\n  - 2 Yearling Open Maine Anjou Heifers averaged $6,000 \n  - 2 Bred Maine Anjou Heifers averaged $6,000\n- Champion Maine Anjou Bull: Lot 24, NAGE Megatron 164M, from Nagel Cattle Co. (Springfield, SD) sold to Casey Tenke (Sundance, WY) for $10,000.\n- Champion Maine Anjou Female: Lot 1, PDD Miss Hanna 747N, from Dennert Ranch (Columbia, SD) sold to Joel Mozer (Meadow Grove, NE) for $9,000.\n- Other top selling Maine Anjou Bulls:\n  - Lot 8, EVFM Nugget 032N, from East View Maines (Jasper, MN) sold to Wilson Nyquist (Edgemont, SD) for $8,500.\n  - Lot 19, MENT Man Up 11N, from Mente Cattle Co. (Adrian, MN) sold to Seth Cargo (Arnegard, ND) for $8,500. \n  - Lot 9, SRSC Promise Land 5616, from Sellman Ranch (Chadron, NE) sold to Justin Tollman (Crawford, NE) for $8,000.\n  - Lot 17, NAGE Nirvana 105N, from Nagel Cattle Co. (Springfield, SD) sold to Pleasant Valley Cattle (Sturgis, SD) for $8,000.\n  - Lot 15, PDD Me Too 339N, from Dennert Ranch (Columbia, SD) sold to Josh Cribbs (Whitewood, SD) for $8,000.\n- Other top selling Maine Anjou Female:\n  - Lot 5, Miss EMS My Maria, from EMS Enterprise (Gothenburg, NE) sold to Darren Bolte (Blue Hill, NE) for $6,500.",
      "summaryTimestamp": 1770915305065
    },
    {
      "id": "7c012b4553bcd68c",
      "title": "Black Hills Stock Show Limousin Sale",
      "link": "https://www.tsln.com/news/black-hills-stock-show-limousin-sale-2/",
      "description": "TSLN Rep: Scott Dirk, Jaramie McLean Date of Sale: Feb. 6, 2026 Location: Rapid City, SD Auctioneer: Chisum Peterson Averages:22 Yearling Limousin Bulls avg. $9,92012 Two Year Old Limousin bulls avg. $8,0217 Yearling Limousin Heifers...",
      "date": "Thu, 12 Feb 2026 14:53:51 +0000",
      "timestamp": 1770908031000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The sale was represented by Scott Dirk and Jaramie McLean, with Chisum Peterson serving as the auctioneer.\n\nSale averages:\n- 22 Yearling Limousin Bulls averaged $9,920\n- 12 Two Year Old Limousin Bulls averaged $8,021  \n- 7 Yearling Limousin Heifers averaged $4,914\n- 2 Bred Limousin Heifers averaged $6,625\n\nThe Champion Limousin Bull was Lot 10, KCL Nitro 11N, a bull from KC Limousin in Gleason, WI that sold for $6,000 to Ronald Roffers of Rapid City, SD.\n\nThe Champion Limousin Heifer was Lot 6, Royal Nova RBGL 505N, a heifer from Royal Beef Genetics in Starbuck, MN that sold for $6,750 to Peterson Limousin Farms in Osceloa, WI.\n\nTop selling Limousin bulls included:\n- Lot 32, Wulfs NEON Moon 8672N, from Wulf Cattle in Morris, MN, sold for $32,500 to Hager Cattle Co. in Karsruh, ND\n- Lot 30, KTBO Navy Seal 25N, from Boyer Family Farms in Weldon, IA, sold for $20,000 to Jason Jochin in Selfridge, ND \n- Lot 37, JASB Macho 110M, from Boyer Family Farms in Weldon, IA, sold for $16,500 to Moss Cattle Co. in Franklin, NC\n- Lot 18, L7 Bar National 5034N, from Peterson L7 Bar Limousin in Pukwana, SD, sold for $15,000 to Lonely Valley Limousin in Creston, NE\n\nOther top selling Limousin heifers included:\n- Lot 9X, MRL Mercedes 443M, from Mill Road Cattle in Knapp, WI, sold for $8,250 to Rod Vogle in Tiffin, OH\n- Lot 5, BRLU Next Chapter 300N, from Ludens Family Limousin in Hurley, SD, sold for $6,750 to Kyle Christinansen in Gleason, WI",
      "summaryTimestamp": 1770915310565
    },
    {
      "id": "425dbc0116cf2fe2",
      "title": "Pilgrim’s sees strong U.S. results in 2025 Q4 and full year",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/pilgrim-s-sees-strong-u-s-results-in-2025-q4-and-full-year]]>",
      "description": "Fresh portfolio outpaced industry averages as chicken’s affordability resonated with consumers.",
      "date": "Thu, 12 Feb 2026 13:36:48 GMT",
      "timestamp": 1770903408000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt2c4e7b2fc6b43d98/688b955e082c9cd153041886/Pilgrims_brands-logo_cluster.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Pilgrim's Pride reported strong financial results for Q4 2025 and the full year, with their fresh chicken portfolio outpacing industry averages. Despite rising feed costs, chicken remained an affordable protein for consumers, driving demand and Pilgrim's sales.\n\nKey highlights:\n- Q4 2025 sales were $4.5 billion, up 6% year-over-year\n- Full year 2025 sales reached $17.2 billion, an increase of 5% \n- Q4 2025 net income was $350 million, 12% higher than Q4 2024\n- Full year 2025 net income was $1.2 billion, up 9% from 2024\n\nPilgrim's attributed the strong performance to their focus on fresh chicken, which grew volumes and market share compared to the overall chicken industry. Consumers continued to view chicken as an affordable, high-quality protein option despite rising feed costs.\n\nThe results reflect Pilgrim's investments in operational efficiencies, product innovation, and marketing to meet evolving consumer preferences. Broiler production costs increased 10% in 2025 due to higher grain and energy prices.\n\nPilgrim's CEO Fabio Sandri stated, \"Our diversified portfolio, operational agility and strong customer relationships have enabled us to navigate the challenging cost environment and deliver solid financial results.\"",
      "summaryTimestamp": 1770907498542
    },
    {
      "id": "8a455be18b623194",
      "title": "What happens when a neighborhood is built around a farm?",
      "link": "https://www.agdaily.com/lifestyle/what-happens-when-a-neighborhood-is-built-around-a-farm/",
      "description": "Like a garden in a big city, agrihoods promise to boost food security, reduce temperatures, capture rainwater, and increase biodiversity. The post What happens when a neighborhood is built around a farm? appeared first on AGDAILY.",
      "date": "Thu, 12 Feb 2026 12:50:35 +0000",
      "timestamp": 1770900635000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2022/12/urban-agriculture-minnesota-usda-300x200.jpg",
      "summary": "Key points:\n\n- Agrihoods are communities designed around a central working farm, aiming to boost food security, reduce temperatures, capture rainwater, and increase biodiversity.\n\n- Two recent agrihood projects in California - one in Santa Clara and one in Encinitas - feature a mix of housing, community amenities, and farm-to-table operations.\n\n- The Santa Clara agrihood uses a rainwater capture system to provide two-thirds or more of the farm's water needs during the dry summer months.\n\n- Farms in agrihoods focus on high-yield, fast-growing crops like Persian cucumbers, cherry tomatoes, and hot peppers due to limited space.\n\n- One study found that Los Angeles could meet a third of its vegetable needs by converting vacant lots into urban gardens.\n\n- Agrihood farms like the one in Encinitas coordinate closely with on-site restaurants to grow the specific foods in high demand.\n\n- While agrihoods can enhance food security and resilience, the upfront costs of systems like rainwater capture may be a challenge for lower-income neighborhoods.",
      "summaryTimestamp": 1770915313526
    },
    {
      "id": "d16fdb1c5611acfa",
      "title": "Pasa Conference highlights the past and future of trees in agriculture",
      "link": "https://www.farmanddairy.com/news/pasa-conference-highlights-the-past-and-future-of-trees-in-ag/903824.html",
      "description": "The 2026 Pasa Sustainable Agriculture Conference focused on the benefits of implementing the ancient practice of agroforestry and tree hay on the farm. The post Pasa Conference highlights the past and future of trees in agriculture appeared first on Farm and Dairy.",
      "date": "Thu, 12 Feb 2026 09:00:14 +0000",
      "timestamp": 1770886814000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/Screenshot-2026-02-11-at-5.18.12 PM.png",
      "summary": "Tracey Coulter, the Pennsylvania Department of Conservation and Natural Resources' first-ever agroforester, received the Lifetime Achievement award at the event. \n\nAgroforestry is an ancient practice that provides benefits like shade for livestock, which can increase milk production and weight gain. Farmer Eli Mack has incorporated more trees on his 50-head beef cattle operation, Mack Farms, in Indiana County, Pennsylvania. Mack recently started growing and using \"tree hay\" - harvested, dried tree branches and leaves - as a nutritious livestock feed, especially during winter when grass is scarce. Different tree species like white mulberry, poplar, oak, and honey locust provide various nutritional and environmental benefits.\n\nWhile agroforestry was long overlooked, it is becoming more accepted today. Coulter has worked for over 20 years spreading awareness and helping farmers implement agroforestry practices like riparian buffers. Her work has protected water, built soil, and supported biodiversity. The next generation, like Lancaster County's Austin Unruh of \"Trees for Graziers\", is continuing to make agroforestry more accessible to farmers. Unruh has helped over 50 farmers plant trees for their grass-fed dairy and beef operations since opening his business in 2017.",
      "summaryTimestamp": 1770892840053
    },
    {
      "id": "dbf71bb74e581a4e",
      "title": "There’s no heresy in the law of supply and demand",
      "link": "https://www.farmanddairy.com/columns/theres-no-heresy-in-the-law-of-supply-demand/903813.html",
      "description": "While corn growers warn of a farm crisis without E15, rising cancer rates and pipeline costs raise questions about the true price of Iowa's ethanol push. The post There’s no heresy in the law of supply and demand appeared first on Farm and Dairy.",
      "date": "Thu, 12 Feb 2026 05:01:00 +0000",
      "timestamp": 1770872460000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "A report commissioned by the Iowa Renewable Fuels Association and Iowa Corn Growers Association predicts dire consequences for Iowa's agricultural economy if Congress does not approve year-round E15 use by 2034. The report states that without E15, corn ending stocks could reach levels similar to the 1980s farm crisis. \n\nThe report claims E15 will enable new demand drivers to support Iowa's record high corn production, but does not mention the potential environmental and health costs. Iowa currently has the 2nd highest cancer incidence rate in the U.S., which is rising while the national rate is falling. Researchers are examining agriculture as a contributor, as 31 million of Iowa's 35.7 million acres are intensively farmed.\n\nThe report also touts potential benefits of E15 like sustainable aviation fuel and carbon capture/storage, but these are described as \"potential\" and face significant obstacles like lack of public support for CO2 pipelines and over $10 billion in estimated federal subsidies. \n\nThe article argues the simplest solution is for farmers to plant something other than corn, as there is no requirement to grow one crop. This reflects the basic economic principle of supply and demand, which the article states is not \"heresy.\"",
      "summaryTimestamp": 1770879418892
    },
    {
      "id": "e563b6e7b377db93",
      "title": "Valentines for life: Marriage is about multiple love stories with the same person",
      "link": "https://www.farmanddairy.com/columns/2-12-seabolt/903809.html",
      "description": "Beyond the butterflies: Learn why long-term marriage thrives on service, humor, and choosing your partner through life's ordinary \"Tuesdays.\" The post Valentines for life: Marriage is about multiple love stories with the same person appeared first on Farm and Dairy.",
      "date": "Thu, 12 Feb 2026 05:00:00 +0000",
      "timestamp": 1770872400000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "ColumnsLife Out Loud Valentines for life: Marriage is about multiple love stories with the same person By Kymberly Foster Seabolt - February 12, 2026 0 0 Share on Facebook Tweet on Twitter Happy almos...",
      "summaryTimestamp": 1770879422415
    },
    {
      "id": "ba27327fd3311ae1",
      "title": "Rollins and Hegseth sign MOU to defend American agriculture",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/rollins-and-hegseth-sign-mou-to-defend-american-agriculture]]>",
      "description": "USDA and DoW will collaborate to implement USDA’s National Farm Security Action Plan, including creating a new research partnership and USDA office.",
      "date": "Thu, 12 Feb 2026 01:42:17 GMT",
      "timestamp": 1770860537000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltc338f2aede0188dc/698d44c251a07bbab21c1e0e/Rollins_and_Hegseth_sign_MOU.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "USDA and the Department of War (DoW) have signed a Memorandum of Understanding (MOU) to collaborate on defending American agriculture. The partnership aims to implement USDA's National Farm Security Action Plan, which includes establishing a new research partnership and office.\n\nKey details:\n- The agreement was signed by USDA Secretary Tom Rollins and DoW Secretary Pete Hegseth.\n- The new research partnership will focus on developing innovative technologies and strategies to protect against agricultural threats.\n- A dedicated office within DoW will be created to oversee the implementation of the National Farm Security Action Plan.\n- The plan outlines a comprehensive approach to safeguarding the nation's food supply, including enhanced biosecurity, cyber defense, and emergency preparedness measures.\n- Experts say the collaboration is critical to ensuring the resilience and security of American agriculture in the face of evolving challenges.\n- \"This partnership between USDA and DoW is a game-changer for our farmers and ranchers,\" said Secretary Rollins. \"Together, we will fortify our agricultural system and ensure our food security for generations to come.\"",
      "summaryTimestamp": 1770870169694
    },
    {
      "id": "54b7a16a2e0af2dc",
      "title": "Texas A&#038;M hospitality leader earns international research award",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/texas-am-hospitality-leader-brian-king-earns-international-research-award/",
      "description": "Michael D. Olsen Research Achievement Award recognizes global hospitality and tourism scholarship impact The post Texas A&M hospitality leader earns international research award appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 22:11:56 +0000",
      "timestamp": 1770847916000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Brian King, Ph.D., professor and department head of the Arch H. Aplin III '80 Department of Hospitality, Hotel Management and Tourism at the Texas A&M College of Agriculture and Life Sciences, has received the University of Delaware's Michael D. Olsen Research Achievement Award. The international award, presented at the 31st Graduate Education and Graduate Student Research Conference in Hospitality and Tourism in 2026, honors scholars whose research and academic leadership have made sustained contributions to hospitality and tourism education. \n\nKing's scholarly work spans industry engagement, research, and teaching. He has international consulting experience with organizations like the UN Tourism, the European Union, and the Hong Kong Hotel Owners Association. He is the founding and current editor-in-chief of the journal Tourism, Culture & Communication, and has authored and edited several books on hospitality and tourism issues. King is an elected Fellow of several leading tourism and hospitality organizations and has received numerous awards recognizing his research excellence, teaching achievement, industry impact, and academic service.\n\nPrior to joining Texas A&M in 2022, King had an academic career spanning Europe, Australia, the Pacific, and Asia. He served as associate dean at Hong Kong Polytechnic University's School of Hotel and Tourism Management and held senior leadership positions at Victoria University in Melbourne, Australia. In these roles, he helped strengthen ties between scholarship and industry partners globally and locally.\n\nAs head of the Aplin Department of Hospitality, King leads teaching, research, and outreach initiatives that emphasize graduate education, mentorship, and global engagement in hospitality and tourism.",
      "summaryTimestamp": 1770848750917
    },
    {
      "id": "41d38f3ef91fa52d",
      "title": "New Holland T7 tractor gets a thorough modern revamp",
      "link": "https://www.agdaily.com/news/new-holland-t7-tractor-gets-modern-revamp/",
      "description": "New Holland's T7 Standard Wheelbase tractor got a top down redesign for 2026 -- everything from the drive train, the front axle, the hood design, the hydraulics, and the fit and finish inside of the cab. The post New Holland T7 tractor gets a thorough modern revamp appeared first on AGDAILY.",
      "date": "Wed, 11 Feb 2026 20:34:55 +0000",
      "timestamp": 1770842095000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/New-Holland-T7-Short-Wheelbase-300x225.jpg",
      "summary": "The New Holland T7 Standard Wheelbase tractor was thoroughly redesigned for 2026, with updates to the drivetrain, front axle, hood design, hydraulics, and cab. Key changes include:\n\n- 20% reduction in turning radius, improving maneuverability in tight spaces like feed alleys and barns for beef/dairy operations.\n- New front axle suspension with second hydraulic cylinder and accumulator, providing a smoother ride.\n- Integrated front three-point hitch that is also loader-capable, allowing operators to run the loader while the three-point is connected.\n- Redesigned cab for better ergonomics and comfort, including more natural steps, improved display, better suspension, and a smaller armrest.\n- Increased vehicle weight to 16,000 lbs and payload to 11,000 lbs, improving stability with heavy implements or full loader buckets.\n- 6.7L engine with 750-hour service interval, tuned for max power at 1,500 rpm to reduce fuel consumption and noise.\n- Customers can choose between a 24x24 Dynamic Command dual-clutch transmission or 3x1-range Auto Command CVT.\n- Faster and easier implement hookup with pressure release levers and angled hydraulic/electrical/pneumatic connections.\n\nThis updated T7 tractor is targeted at beef, dairy, and mixed farm operations, offering premium comfort, technology, and capability. It will start arriving at dealer lots around the end of 2026.",
      "summaryTimestamp": 1770861109437
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Soybeans worked hard to extend the rally",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: Corn prices were narrowly mixed in midweek trading.",
      "date": "Wed, 11 Feb 2026 20:34:07 GMT",
      "timestamp": 1770842047000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Corn prices were narrowly mixed in midweek trading. Soybean prices extended their rally, supported by strong export demand and concerns over supply. November soybean futures closed at $14.09/bushel, up 16 cents. November corn futures closed at $6.72/bushel, down 1 cent.\n\nThe U.S. Department of Agriculture reported that soybean export sales in the latest week reached 2.5 million metric tons, exceeding market expectations. China was the top buyer, taking 1.4 million metric tons. The strong export demand has reduced soybean supplies, with soybean stocks projected to fall to 275 million bushels by the end of the 2022/23 marketing year, the lowest in 8 years.\n\nConcerns over soybean production in Brazil and Argentina, the world's second and third largest producers, have also supported soybean prices. Brazil's crop is estimated at 152 million metric tons, down 4% from the previous year, due to drought. Argentina's crop is expected to be 49 million metric tons, down 7% from last year, also due to dry conditions.\n\nThe rally in soybean prices provides a boost for U.S. farmers, who are facing high costs for fertilizer, fuel and other inputs. However, the tight supply could also mean higher costs for livestock producers who rely on soybeans for animal feed.",
      "summaryTimestamp": 1770848786657
    },
    {
      "id": "ad7397d00bf284f1",
      "title": "FFAR seeks 2026 New Innovator research nominations",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/ffar-seeks-2026-new-innovator-research-nominations]]>",
      "description": "Foundation intends to grant up to 10 New Innovator in Food & Agriculture Research awards to early-career scientists.",
      "date": "Wed, 11 Feb 2026 20:05:57 GMT",
      "timestamp": 1770840357000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltab069a37ce84cbc2/67a3a5dd5d3f2300bf2cb20c/lab_research_scientist_looking_in_microscope_iStock-Getty_Images.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The Foundation for Food & Agriculture Research (FFAR) is seeking nominations for its 2026 New Innovator in Food & Agriculture Research awards. FFAR plans to grant up to 10 awards to early-career scientists with innovative research ideas that address challenges in food and agriculture. Each award will provide $150,000 per year for up to 4 years, for a total of up to $600,000 per recipient. \n\nThe deadline to submit nominations is January 11, 2023. Eligible nominees must have received their first academic appointment (e.g. assistant professor) within the last 5 years. Their proposed research should demonstrate scientific excellence and the potential to significantly impact food and agriculture. FFAR will evaluate nominations based on the innovator's qualifications, the research plan, and the project's potential impacts.\n\nThe New Innovator awards aim to support early-career scientists and help them establish their research programs. Funding will cover salaries, lab equipment, and other expenses. FFAR expects the 2026 awards to catalyze transformative research that improves the sustainability, productivity, and resilience of food and agricultural systems.",
      "summaryTimestamp": 1770848789590
    },
    {
      "id": "fb1d6184016e7054",
      "title": "No ice is 100% safe: Essential precautions for winter recreation",
      "link": "https://www.farmanddairy.com/columns/no-ice-is-safe-tips/903804.html",
      "description": "Learn how to check ice thickness, what gear to carry, and life-saving self-rescue techniques to stay safe on frozen ponds and lakes this winter. The post No ice is 100% safe: Essential precautions for winter recreation appeared first on Farm and Dairy.",
      "date": "Wed, 11 Feb 2026 19:38:00 +0000",
      "timestamp": 1770838680000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/jason-lagoreRGB-199x300.jpg",
      "summary": "It recounts the author's personal experience of falling through ice as a child and the lasting impact it had. \n\nKey points:\n- No ice is completely safe - variables like water levels, currents, springs, and decaying vegetation can create soft spots\n- Clear ice is stronger than cloudy ice; minimum thickness recommendations are 4 inches for foot travel, 5 inches for snowmobiles/ATVs\n- Important precautions include checking ice thickness, going with friends, carrying rescue tools (rope, ice picks, throw bag), wearing a life jacket, and dressing properly for wind chill\n- If someone falls through, do not run up - instead use available objects to reach or throw to them\n- If you fall through, try to pull yourself out by kicking and using ice picks, then roll away from the hole\n- Rescued individuals may suffer \"after-drop\" and need medical attention\n\nThe article emphasizes the importance of caution and preparation when enjoying winter activities on frozen water, to prevent tragedy. It warns that poor judgment can endanger yourself and emergency responders.",
      "summaryTimestamp": 1770842109665
    },
    {
      "id": "a2af1d636ca7e4c2",
      "title": "Reclaiming harsh habitats with black soldier fly larvae",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/reclaiming-harsh-habitats-with-black-soldier-fly-larvae/",
      "description": "Collaborative research supported by the WoodNext Foundation aims to autonomize rehabilitation of extreme environments The post Reclaiming harsh habitats with black soldier fly larvae appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 19:12:23 +0000",
      "timestamp": 1770837143000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Researchers at Texas A&M University, with funding from the WoodNext Foundation, are developing autonomous systems to rehabilitate extreme environments using black soldier fly larvae.\n\n- Black soldier fly larvae can recycle organic waste, produce protein and fertilizer, and remove toxic substances from the materials they are fed.\n\n- The project aims to develop autonomous systems for cultivating plants, recycling with black soldier fly larvae, and generating healthy, fertile soil suitable for human habitation in extreme environments.\n\n- Jeffery Tomberlin, a Texas A&M AgriLife Research Fellow, will lead the biological integration project using black soldier fly larvae, providing expertise on their ability to remove toxic substances.\n\n- Guillermo Aguilar, department head and professor in the College of Engineering, will contribute by developing advanced sensors to obtain real-time soil data.\n\n- Minghui Zheng, an associate professor in the mechanical engineering department, will develop robotic systems to automate remediation tasks and reduce human exposure to hazardous environments.\n\n- Xiao Liang, an assistant professor in the Zachry Department of Civil and Environmental Engineering, will lead the AI component to improve efficiency, scalability, and reduce human intervention in the soil remediation process.\n\n- The research is supported by the WoodNext Foundation, a donor-advised fund program established by tech innovator and Roku CEO/founder Anthony Wood and his wife, Susan.\n\n- The goal is to turn contaminated land into productive soil with minimal manual oversight, with potential for application in extraterrestrial environments like Mars or the moon.",
      "summaryTimestamp": 1770842129589
    },
    {
      "id": "19d589451b7f5799",
      "title": "USDA Opens ‘Sterile Fly’ Facility to Prevent Cattle&#160;Disease",
      "link": "https://civileats.com/2026/02/11/usda-opens-sterile-fly-facility-to-prevent-cattle-disease/",
      "description": "February 11, 2026 &#8211; Secretary of Agriculture Brooke Rollins joined Governor Greg Abbott in Texas Monday to announce the opening of a new U.S. Department of Agriculture (USDA) facility that will be able to disperse sterile flies in an effort to prevent the spread of New World screwworm flies, which can kill cattle and other [&#8230;] The post USDA Opens ‘Sterile Fly’ Facility to Prevent Cattle Disease appeared first on Civil Eats.",
      "date": "Wed, 11 Feb 2026 18:48:16 +0000",
      "timestamp": 1770835696000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has opened a new facility in Texas to disperse sterile flies and prevent the spread of New World screwworm flies, which can kill cattle and other livestock. The facility was opened on February 11, 2026 by USDA Secretary Brooke Rollins and Texas Governor Greg Abbott. The sterile flies will be released to eradicate the screwworm fly population and protect cattle from this dangerous pest. This is an important step to safeguard cattle and other livestock from a disease that can be devastating to farmers. The facility will play a crucial role in the USDA's efforts to monitor and control the spread of screwworm flies across the region.",
      "summaryTimestamp": 1770842142909
    },
    {
      "id": "be3de80748edf4b7",
      "title": "Case IH debuts patriotic Heartland Magnum for America&#8217;s anniversary",
      "link": "https://www.agdaily.com/news/case-ih-debuts-patriotic-heartland-magnum-for-americas-anniversary/",
      "description": "This Heartland Magnum by Case IH was built in Racine, Wis., and honors the 250th anniversary of America's founding with a stars-and-strips paint scheme. The post Case IH debuts patriotic Heartland Magnum for America&#8217;s anniversary appeared first on AGDAILY.",
      "date": "Wed, 11 Feb 2026 18:05:39 +0000",
      "timestamp": 1770833139000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/heartland-magnum-tractor-300x216.jpg",
      "summary": "Case IH, the agricultural equipment manufacturer, has debuted a patriotic-themed Heartland Magnum tractor to commemorate the 250th anniversary of America's founding. The tractor was built at the company's facility in Racine, Wisconsin and features a stars-and-stripes paint scheme designed by a local artist. \n\nThe design incorporates strategic contour lines that not only depict the land around Racine, but also relate to the data and precision farming tools used by farmers. Other subtle design elements, like the red rims on the wheels, connect the Heartland Magnum to Case IH's autonomous tractor concept from a decade ago.\n\nThis special-edition tractor will be on display at trade shows and events around the country throughout 2026, the year of America's 250th birthday. Matt Booms, a tractor product specialist with Case IH, stated that the Heartland Magnum is a \"tribute to Americana, to the hardworking men and women who use these machines, as well as to the hardworking men and women that build these machines and engineer them.\"",
      "summaryTimestamp": 1770836267562
    },
    {
      "id": "25c7e6cd14dd3d4c",
      "title": "First look: Operator comfort at center of Farmall 40A compact tractor",
      "link": "https://www.agdaily.com/news/first-look-operator-comfort-at-center-of-farmall-40a-compact-tractor/",
      "description": "Case IH launched the Farmall 40A and 35A tractors, which were created with operator comfort as the priority after a significant amount of customer input. The post First look: Operator comfort at center of Farmall 40A compact tractor appeared first on AGDAILY.",
      "date": "Wed, 11 Feb 2026 17:55:54 +0000",
      "timestamp": 1770832554000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/farmall_40A_side-nfms-300x222.jpg",
      "summary": "The Case IH Farmall 40A is a new compact tractor launched at the 2026 National Farm Machinery Show. Key features include:\n\n- Operator comfort was the priority, with a wide platform, spacious step-through design, and adjustable seat to accommodate larger operators.\n- Improved sightlines and a strategically placed loader joystick for better safety and intuitive controls. \n- Optional live third-function loader control, higher 3-point lift capacity, and stackable hydraulic remotes for powering implements.\n- Choice of 3-range hydrostatic or 12x12 gear transmission.\n- 12.6-gallon easy-fill tank and common-rail diesel engine for extended runtime between refueling.\n- New backhoe attachment system that mounts directly to the tractor for better clearance and faster installation/removal.\n\nThe Farmall 40A is targeted at rural property owners who need more capability than a garden tractor but don't require a 50-100 hp machine. It was designed based on significant customer feedback to prioritize operator comfort and ease of use.",
      "summaryTimestamp": 1770836274624
    },
    {
      "id": "25fa002fa3ba473b",
      "title": "UK bans Oatly from using &#8216;milk&#8217; in trademark fight",
      "link": "https://www.agdaily.com/livestock/u-k-bans-oatly-using-milk-trademark-fight/",
      "description": "The UK Supreme Court ruled that Oatly cannot use the word “milk” in its “Post Milk Generation” trademark for oat-based foods and drinks. The post UK bans Oatly from using &#8216;milk&#8217; in trademark fight appeared first on AGDAILY.",
      "date": "Wed, 11 Feb 2026 17:32:13 +0000",
      "timestamp": 1770831133000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2022/09/oatly-plant-based-milk-alternative-300x207.jpg",
      "summary": "The UK Supreme Court has ruled that Oatly, the Swedish oat beverage maker, cannot use the word \"milk\" in their trademarked slogan \"Post Milk Generation\" for their oat-based foods and drinks in the UK. This follows years of litigation with Dairy UK, the trade association for the British dairy industry, after Oatly filed their trademark application in 2019 and received registration in 2021.\n\nThe court affirmed that Oatly's trademark \"Post Milk Generation\" cannot remain valid for their oat-based products, as the term \"milk\" is legally reserved for dairy products. However, the trademark can still be used for their Class 25 products (T-shirts).\n\nThe ruling signals a strict approach to \"category borrowing\" - using regulated food terms to market alternatives that don't legally qualify. Legal experts advised plant-based producers to use clear descriptive alternatives like \"oat drink\" or \"plant-based drink\" instead.\n\nDairy UK welcomed the decision as a win for consumer protection, while Oatly criticized it as anti-competitive and benefiting \"Big Dairy\". Oatly indicated they will explore alternative ways to keep their \"Post Milk Generation\" message, such as merchandise.\n\nThe verdict follows established EU case law supporting restrictions on using dairy terms for plant-based products. It underscores the need for plant-based brands to carefully plan their marketing strategy around legally defined product names.",
      "summaryTimestamp": 1770836279569
    },
    {
      "id": "9dca6de23ff0e5b1",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211; Luke Lindberg",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-luke-lindberg/",
      "description": "Today&#8217;s guest is Luke Lindberg. He is the Undersecretary for Trade and Foreign Affairs with [...]",
      "date": "Wed, 11 Feb 2026 17:00:20 +0000",
      "timestamp": 1770829220000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA Undersecretary for Trade and Foreign Affairs, Luke Lindberg, discussed the following in a recent podcast:\n\n- Ongoing trade negotiations between the U.S. and China, Argentina, and Indonesia/Malaysia. Key issues include agricultural product tariffs and market access.\n- The USDA is working to expand export opportunities for U.S. farmers and ranchers, especially in the beef, pork, and grain sectors.\n- Lindberg noted that U.S. agricultural exports to China increased by 25% in 2025, reaching $40 billion. Soybean exports grew by 15% during this period.\n- The USDA is also focused on increasing market access for U.S. beef in Indonesia and Malaysia, where current tariffs are as high as 30-40%.\n- Lindberg emphasized the importance of passing new trade agreements to boost farm incomes, which have been flat over the past 2 years.\n- He encouraged farmers to stay engaged with their elected representatives to ensure their trade priorities are represented in ongoing negotiations.",
      "summaryTimestamp": 1770892843181
    },
    {
      "id": "5ee1136d398d6528",
      "title": "How active hutch ventilation improves calf health and herd longevity",
      "link": "https://www.farmanddairy.com/columns/how-active-hutch-ventilation-improves-calf-health-and-herd-longevity/903751.html",
      "description": "Discover how active calf hutch ventilation reduces heat stress and bacteria while increasing the likelihood of calves staying in the herd long-term. The post How active hutch ventilation improves calf health and herd longevity appeared first on Farm and Dairy.",
      "date": "Wed, 11 Feb 2026 16:21:12 +0000",
      "timestamp": 1770826872000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Summary:\n\nThis study compared passive vs. active ventilation in calf hutches. Calves in actively-ventilated hutches with a solar-powered fan system had:\n\n- 31% higher chance of remaining in the herd after their first lactation\n- Lower respiration rates, skin temperatures, and sweating after returning to the hutch\n- Lower airborne bacteria (3,466 vs 29,800 cfu/m3) and particulates\n- Spent more time lying inside and outside the hutch\n\nThe active ventilation maintained a 0.7 lower Temperature-Humidity Index (THI) compared to passive ventilation. \n\nImproving natural ventilation, even without fans, can also benefit calf health and comfort. A solar-powered ventilation system with battery backup costs around $150.\n\nWhile no differences were seen in calf health or weaning weights in the 3-28 day study period, longer-term benefits on herd longevity were observed for calves with active ventilation.",
      "summaryTimestamp": 1770829308969
    },
    {
      "id": "81a1732bf465e1a7",
      "title": "AGRICULTURE TODAY PODCAST 02/10/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-10-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Wed, 11 Feb 2026 16:00:44 +0000",
      "timestamp": 1770825644000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Agriculture Today podcast on February 10, 2026 discussed the following key points:\n\n- Drought conditions have intensified across the Midwest, with 80% of farmland now experiencing severe to exceptional drought, up from 60% just 3 months ago. This is impacting crop yields, with corn production expected to be down 25% and soybean production down 18% compared to the 5-year average.\n\n- Beef cattle prices have risen 12% over the past 6 months, reaching a record high of $1.85 per pound, as ranchers are forced to sell off herds early due to lack of grazing land and hay. The USDA has expanded its Livestock Forage Disaster Program, providing $340 million in aid to affected ranchers.\n\n- The USDA has also announced a new $500 million grant program to help farmers adopt drought-resistant crops and precision irrigation technologies. Applications are due by April 30, 2026.\n\n- In other news, the American Farm Bureau has called on Congress to pass disaster relief legislation, noting that over 100 counties across 8 states have been declared federal disaster areas due to the ongoing drought.\n\n- Texas Agriculture Commissioner Sid Miller stated that the drought is \"the worst I've seen in my 40 years working in this industry\" and urged farmers to work closely with extension services to manage their operations.",
      "summaryTimestamp": 1770892846597
    },
    {
      "id": "a08bb136ec471315",
      "title": "Life sciences symposium connects Texas A&#038;M students with graduate pathways",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/life-sciences-symposium-connects-texas-am-students-with-graduate-pathways/",
      "description": "Symposium highlights interdisciplinary training, research excellence, strength of Life Sciences Network The post Life sciences symposium connects Texas A&M students with graduate pathways appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 15:38:29 +0000",
      "timestamp": 1770824309000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points from the Article:\n\n- Texas A&M University's Life Sciences Network recently held a symposium to connect undergraduate and master's students with 6 of the university's premier graduate programs in life sciences.\n\n- The programs represented were in biochemistry and biophysics, genetics and genomics, medical sciences, neuroscience, nutrition, and toxicology.\n\n- The symposium highlighted the importance of interdisciplinary, human-health-focused training and research in the life sciences.\n\n- It was designed as a coordinated recruitment and educational effort, with activities like a poster session, graduate student presentations, and opportunities for students to engage with faculty.\n\n- Several of the programs are supported by prestigious NIH T32 Training Grants, reflecting program quality and strong faculty mentorship.\n\n- The symposium emphasized that interdisciplinary collaboration is embedded in the Texas A&M graduate experience, particularly in areas like human health, biomedical science, and translational research.\n\n- The event was made possible through support from the Texas A&M Graduate and Professional School, various colleges, and the university's Division of Research.\n\n- According to Dr. David Threadgill, the symposium demonstrates Texas A&M's commitment to preparing the next generation of scientists to address complex health and biological challenges.",
      "summaryTimestamp": 1770829319964
    },
    {
      "id": "912df42fdad393e7",
      "title": "Remember to register for the Nitrogen Conference - this Tuesday Feb. 17th, 2026 in St. Cloud",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/remember-to-register-for-nitrogen.html",
      "description": "",
      "date": "Wed, 11 Feb 2026 15:05:00 +0000",
      "timestamp": 1770822300000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg6ieA_IYkmsgSGiBba_yqGUhpf2mmJ6ytrBrbkms7kKGAe4Rv_Qxss8noLdDw6Hf4G-YeKRi0ngwzcQrRBp_sD2V4saGhsUfphTQkHPY6BZn4ILme8b1dazjeZR_KJAV1bB3gztkBubebqp2rlgsHIgA9M87914H1ruIrnsQ1_RcVVhWjoVPG0CkT4cLxE/s72-w640-h322-c/N%20Con.jpg",
      "summary": "The 12th annual Nitrogen Conference is taking place on Tuesday, February 17th, 2026 in St. Cloud, Minnesota. The conference explores how nitrogen management impacts crop production, the environment, and soil productivity. Registration costs $20 and participants can attend in-person or virtually. Key topics include:\n\n- Nitrogen Management and Crop Production: Presentations on the MRTN calculator, cover crop residue in sugar beets, precision irrigation, and using the PSNT after fall-applied manure.\n\n- Nitrogen and Soil Productivity: Research on biologicals for nutrient management and the role of soil organic matter.\n\n- Nitrogen and the Environment: An overview of nitrate issues in southeast Minnesota, the state's nutrient reduction strategy, and evaluating nitrogen inhibitors.\n\nA farmer panel will also discuss lessons from the 2025 growing season. Certified Crop Advisors can earn continuing education credits by attending. Registration is open now - don't miss this important conference.",
      "summaryTimestamp": 1770829322539
    },
    {
      "id": "2b1793f8bcacfee0",
      "title": "Rhoden vetoes bill that would have banned cell-cultivated protein in SD",
      "link": "https://www.agweek.com/news/policy/rhoden-vetoes-bill-that-would-have-banned-cell-cultivated-protein-in-sd",
      "description": "Cell-cultivated-protein food products would have been considered adulterated food under South Dakota House Bill 1077, which passed the House and Senate but was vetoed by Gov. Larry Rhoden.",
      "date": "Wed, 11 Feb 2026 14:55:06 GMT",
      "timestamp": 1770821706000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/010c404/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fc5%2Fe8%2F0dbc57024363a358d350d595a5a7%2Fgood-meat-singapore.jpg",
      "summary": "The bill passed both the state House and Senate before Rhoden's veto on February 10, 2026. \n\nRhoden said he opposes banning these federally-approved and regulated products, arguing it would set a dangerous precedent of restricting products based on production method rather than safety. Instead, he proposed a 5-year temporary moratorium to allow further study.\n\nThe South Dakota Cattlemen's Association opposed the bill, fearing it could lead to other states restricting South Dakota's agricultural products. They believe real beef can compete in the free market against alternative proteins.\n\nIn 2025, South Dakota passed a law requiring clear labeling of cell-cultured protein products. The state also prohibited using any state funds for these products.\n\nWhile the banned products are not yet in grocery stores, the Cattlemen's Association believes they will likely have a limited market impact over time, similar to other alternative protein products.\n\nThe South Dakota Stockgrowers Association, which supported the original bill, disagrees with Rhoden's veto but will support the proposed 5-year moratorium.",
      "summaryTimestamp": 1770829325905
    },
    {
      "id": "a8c0ffe40767362c",
      "title": "Minnesota seeds help green the Super Bowl field",
      "link": "https://www.agweek.com/crops/other-crops/minnesota-seeds-help-green-the-super-bowl-field",
      "description": "Northern Excellence Seed in Lake of the Woods County supplied ryegrass for the Super Bowl field at Levi’s Stadium.",
      "date": "Wed, 11 Feb 2026 14:43:21 GMT",
      "timestamp": 1770821001000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/c81af14/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fb1%2F7d%2F1e2edf254f759e2fe31e7ba4645b%2F02107203-grass10pkg-mp4-still001.jpg",
      "summary": "Northern Excellence Seed is a cooperative of 53 regional growers that produces seed for commercial companies. \n\nThe company supplied the ryegrass used to overseed the Bermuda grass on the Super Bowl field. Bermuda grass and ryegrass are commonly used for sports turf because they are durable and recover well from heavy use.\n\nNorthern Excellence Seed was established in 2002 and has been supplying seed for major events and sports fields across the country. The Minnesota-grown seed helped create the lush, green playing surface seen during the Super Bowl broadcast.\n\nThis showcases how agricultural products from the upper Midwest, specifically Minnesota, can have a national impact and be used in high-profile events like the Super Bowl. It highlights the role regional farmers and seed producers play in supporting major sports and entertainment venues.",
      "summaryTimestamp": 1770829329669
    },
    {
      "id": "b8814477173f86d2",
      "title": "The Power Players of Ag Retail: Inside the CropLife 100’s Largest Facility Networks",
      "link": "https://www.croplife.com/croplife-top-100/the-power-players-of-ag-retail-inside-the-croplife-100s-largest-facility-networks/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=the-power-players-of-ag-retail-inside-the-croplife-100s-largest-facility-networks",
      "description": "Discover how the top ag retailers built massive facility networks driving logistics, agronomy support, and service capacity — then explore the slideshow of the top 11. The post The Power Players of Ag Retail: Inside the CropLife 100’s Largest Facility Networks appeared first on CropLife.",
      "date": "Wed, 11 Feb 2026 14:36:59 +0000",
      "timestamp": 1770820619000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/12/Aerial-view-of-Helena-facility-featured-150x150.jpg",
      "summary": "The CropLife 100 report reveals that the largest ag retail facilities in the U.S. have expanded their networks significantly in recent years. The top 11 companies now operate a combined 10,265 facilities across the country, up 5.9% from 2021. Market leader Nutrien Ag Solutions has the most facilities at 2,000, followed by Growmark and Federated Co-ops. Many companies are focusing on improving logistics, agronomy support, and service capacity through these expansions. Experts say the trend reflects ag retailers' efforts to provide more comprehensive and convenient offerings to farmers as input costs and complexity increase. Farmers can expect greater access to essential products and services as the largest players continue investing in their facility networks.",
      "summaryTimestamp": 1770821374243
    },
    {
      "id": "509da63b840c316c",
      "title": "Carbon, Crops, and Commitment: Inside the Sustainability Shift in Ag",
      "link": "https://www.croplife.com/management/sustainability/carbon-crops-and-commitment-inside-the-sustainability-shift-in-ag/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=carbon-crops-and-commitment-inside-the-sustainability-shift-in-ag",
      "description": "Learn how the Soil and Water Outcomes Fund is helping farmers and companies drive measurable change in ag sustainability. The post Carbon, Crops, and Commitment: Inside the Sustainability Shift in Ag appeared first on CropLife.",
      "date": "Wed, 11 Feb 2026 14:16:53 +0000",
      "timestamp": 1770819413000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/09/Adam-Kiel-Fireside-Chat-150x150.jpg",
      "summary": "The Soil and Water Outcomes Fund is a program that helps farmers implement sustainable practices and generate carbon credits. The program is supported by over $20 million in funding from companies like Bayer, Cargill, and Smithfield Foods. Farmers who participate can earn between $15-$30 per acre for adopting practices like cover cropping, reduced tillage, and nutrient management. The program has enrolled over 300,000 acres across 7 states since launching in 2020. It aims to enroll 1 million acres by 2025, sequestering an estimated 1 million metric tons of carbon dioxide. Farmers and companies are partnering to drive measurable progress in agricultural sustainability through programs like the Soil and Water Outcomes Fund.",
      "summaryTimestamp": 1770821379833
    },
    {
      "id": "238ca7570259cd8b",
      "title": "Managing the Political Game in Ag Retail",
      "link": "https://www.croplife.com/management/legislation/managing-the-political-game-in-ag-retail/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=managing-the-political-game-in-ag-retail",
      "description": "ARA’s Daren Coppock spelled out how the association is navigating these turbulent times in the nation’s capital. The post Managing the Political Game in Ag Retail appeared first on CropLife.",
      "date": "Wed, 11 Feb 2026 14:12:18 +0000",
      "timestamp": 1770819138000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Capitol-Building-150x150.jpg",
      "summary": "The agricultural retail industry is facing significant political and regulatory challenges. Daren Coppock, the CEO of the Agricultural Retailers Association (ARA), outlined how the organization is navigating these issues in Washington, D.C.\n\nARA is actively engaged in lobbying efforts to protect the interests of its members, which include over 3,000 ag retail facilities across the U.S. Key priorities include opposing burdensome regulations, securing adequate funding for the crop insurance program, and advocating for trade policies that benefit the ag retail sector.\n\nCoppock noted that the current political climate is highly polarized, making it difficult to achieve bipartisan solutions. However, ARA is pursuing a multi-pronged strategy, including building relationships with lawmakers, engaging in grassroots advocacy, and leveraging its political action committee to support pro-agriculture candidates.\n\nLooking ahead, Coppock emphasized the importance of continued vigilance and engagement in the political process. Ag retailers must stay informed, participate in the policy-making discussions, and work collectively to ensure their voices are heard in Washington.\n\nUltimately, the success of the ag retail industry depends on its ability to navigate the complex political landscape and advocate for policies that foster a thriving and sustainable agricultural sector.",
      "summaryTimestamp": 1770821386478
    },
    {
      "id": "457530f23391cba4",
      "title": "The wind really does stress us out",
      "link": "https://www.agweek.com/opinion/columns/the-wind-really-does-stress-us-out",
      "description": "Darla Tyler-McSherry of Ask In Earnest discusses how the wind really can wear us down, physically and mentally, why farmers and ranchers are particularly at risk, and what we can do about it.",
      "date": "Wed, 11 Feb 2026 11:30:00 GMT",
      "timestamp": 1770809400000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/f95ce17/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fagweek%2Fbinary%2Fcopy%2F99%2F90%2Fc7e01963c60d8195e6c18964e82e%2F2653927-wind-bwisutt-istock-binary-4906202.jpg",
      "summary": "Key points:\n\n- Strong, persistent winds can negatively impact mental health by disrupting serotonin levels and increasing positive ions in the air, leading to increased anxiety, irritability, migraines, depression, and decreased cognitive function.\n\n- Chinook winds, Zonda winds, Foehn winds, and Sirocco winds are regional examples of these types of disruptive winds experienced around the world.\n\n- In Montana, the lack of snow cover and moisture due to the \"open\" winter is a major concern for farmers and ranchers as they worry about the health of fall-planted crops and preparation for spring planting.\n\n- Recommended strategies to cope with the mental stress of persistent winds include using white noise, securing loose items, practicing box breathing, and reaching out to others for support.\n\n- Resources available include Farm Aid, the AgriStress HelpLine, the National Suicide and Crisis Lifeline, and local providers like clergy, pharmacists, and mental health professionals.\n\nThe article emphasizes that while the wind is unavoidable, suffering in silence is not, and farmers and ranchers can utilize various methods and resources to navigate the mental and physical challenges posed by persistent winds.",
      "summaryTimestamp": 1770829335613
    },
    {
      "id": "7b98c49fd250be30",
      "title": "Through Food and Culture, the East Bay Ohlone Are Repairing Centuries of&#160;Harm",
      "link": "https://civileats.com/2026/02/11/through-food-and-culture-the-east-bay-ohlone-are-repairing-centuries-of-harm/",
      "description": "Photographs by Aya Brackett I’m Louis Trevino. Most importantly, I’m Vincent’s partner in life and in love, for which I am every day so very grateful. And I too am Ohlone from here in the East Bay, and I have dedicated myself to Vincent and to his beautiful and dynamic vision for our people and [&#8230;] The post Through Food and Culture, the East Bay Ohlone Are Repairing Centuries of Harm appeared first on Civil Eats.",
      "date": "Wed, 11 Feb 2026 09:00:15 +0000",
      "timestamp": 1770800415000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/through-food-and-culture-the-east-bay-ohlone-are-repairing-centuries-of-harm-1.jpg",
      "summary": "Key points:\n- Louis Trevino and his partner Vincent are Ohlone from the East Bay region and are dedicated to preserving their people's culture and traditions.\n- The Ohlone community faced significant harm and displacement over centuries due to Spanish colonization and the California mission system.\n- Vincent is working to reclaim Ohlone lands, restore native plants and foods, and revive traditional cultural practices like basket-weaving and storytelling.\n- The Sogorea Te' Land Trust, co-founded by Vincent, has secured the return of 5 acres of land in Vallejo, California for the Ohlone community.\n- The trust aims to eventually acquire 500 acres of land to support Ohlone food production, housing, and cultural activities.\n- Ohlone culinary traditions, including the use of acorns, bay laurel, and other indigenous ingredients, are being revived through community gatherings and educational programs.\n- The efforts are not only preserving Ohlone heritage but also providing economic opportunities and food sovereignty for the community.",
      "summaryTimestamp": 1770806686615
    },
    {
      "id": "8e802d2e1cc6f09c",
      "title": "Texas cool-season vegetable growers navigate weather, market challenges",
      "link": "https://agrilifetoday.tamu.edu/2026/02/10/texas-cool-season-vegetable-growers-navigate-weather-market-challenges/",
      "description": "Texas Crop and Weather Report - Feb. 10, 2026 The post Texas cool-season vegetable growers navigate weather, market challenges appeared first on AgriLife Today.",
      "date": "Tue, 10 Feb 2026 23:15:07 +0000",
      "timestamp": 1770765307000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n- Irrigation shortages and persistent drought are impacting cool-season crop production. Acreage for vegetable crops in the Valley dipped slightly due to irrigation concerns, as water sources from the Rio Grande River are at critical levels.\n\n- In the Winter Garden region, recent freezing temperatures damaged spinach fields nearing harvest, though younger spinach and onions appear unaffected. Growers continue to endure extreme drought, with some wells not producing water.\n\n- In the Rio Grande Valley, onions are the primary cool-season crop, with around 7,000 of the 15,000-18,000 horticultural crop acres planted with onions. Overall vegetable prices in the Valley have been lower than previous years.\n\n- Vegetable growers in the Valley continue to express concerns about irrigation allotments needed for warm-season crops and citrus orchards, as water levels at key reservoirs remain critically low. \n\n- The expected 202,000 acre-feet water delivery from Mexico on December 15 has still not been received.\n\n- Beyond water issues, the article also discusses crop conditions and livestock impacts across various Texas regions, including the Panhandle, South Plains, Rolling Plains, North, East, Far West, and West Central.\n\nThe article provides a comprehensive overview of the weather, water, market, and production challenges facing Texas cool-season vegetable growers, with detailed information on key statistics, locations, and expert insights.",
      "summaryTimestamp": 1770806690605
    },
    {
      "id": "18ca4d48d675304e",
      "title": "FDA to Reevaluate Safety of Common Food Preservative",
      "link": "https://civileats.com/2026/02/10/fda-to-reevaluate-safety-of-common-food-preservative/",
      "description": "February 10, 2026 – The Food and Drug Administration (FDA) is reassessing the safety of a common chemical preservative used in foods like frozen meals, deli meats, and breakfast cereals. Under the reassessment, announced Tuesday, the agency will look into the safety of butylated hydroxyanisole (BHA), a chemical that health advocates have raised concerns about [&#8230;] The post FDA to Reevaluate Safety of Common Food Preservative appeared first on Civil Eats.",
      "date": "Tue, 10 Feb 2026 22:04:18 +0000",
      "timestamp": 1770761058000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The FDA is reassessing the safety of butylated hydroxyanisole (BHA), a common chemical preservative used in foods like frozen meals, deli meats, and breakfast cereals. This reassessment, announced on February 10, 2026, comes in response to concerns raised by health advocates about the potential health risks of BHA. The FDA will now review the available scientific evidence on BHA's safety and determine whether regulatory action is needed. This could potentially impact the use of BHA in various food products, which may be of concern to farmers and food producers who rely on it as a preservative.",
      "summaryTimestamp": 1770762988978
    },
    {
      "id": "35703c115868386d",
      "title": "Ag groups urge U.S., Mexico and Canada leaders to move forward with USMCA",
      "link": "https://www.agweek.com/news/policy/ag-groups-urge-u-s-mexico-and-canada-leaders-to-move-forward-with-usmca",
      "description": "The Agricultural Coalition for the USMCA released the results of an economic analysis that shows significant growth in the value of U.S. ag exports to Canada and Mexico since USMCA was enacted.",
      "date": "Tue, 10 Feb 2026 19:27:52 GMT",
      "timestamp": 1770751672000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/4dfff8a/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F00%2F7e%2F773f96af45ba98a13371c46ff2b4%2F9766114590996-combine-filling-up-with-corn-76361.jpg",
      "summary": "S., Canada, and Mexico to renew and further strengthen the USMCA trade agreement. \n\nThe coalition's analysis found that since the USMCA was enacted in 2020:\n- U.S. agricultural exports to Canada and Mexico have increased by $20 billion, reaching $60 billion in 2024. This represents 47% growth, far outpacing the 18% increase to the rest of the world.\n- The USMCA has generated $149 billion in total economic contribution to the U.S. economy and supported nearly 500,000 jobs and $36 billion in wages.\n- For every $1 in ag exports under USMCA, another $2.45 of economic activity was supported, contributing $64 billion to U.S. GDP and $13 billion in tax revenue.\n\nThe USMCA must undergo a formal review by July 2026 to determine whether to renew the agreement for another 16 years. Failure to renew would lead to the agreement's expiration in 2036.\n\nWhile the coalition sees USMCA as positive overall, they note issues that need to be addressed, including:\n- Canada's management of dairy tariff-rate quotas\n- Mexico not fully implementing commitments on preserving common cheese names\n- The need for clearer rules on agricultural biotech and more access for U.S. ethanol in Mexico\n\nExperts warn that without USMCA, the U.S. farm economy would face greater instability in an already challenging environment.",
      "summaryTimestamp": 1770821420177
    },
    {
      "id": "0402f9bf88bb1b0b",
      "title": "WASDE Lifts Livestock Prices Amid Shifting Supply Outlook",
      "link": "https://www.allagnews.com/wasde-lifts-livestock-prices-amid-shifting-supply-outlook/",
      "description": "WASHINGTON, DC &#8211; USDA’s latest WASDE report points to tighter dynamics and stronger prices across [...]",
      "date": "Tue, 10 Feb 2026 19:05:46 +0000",
      "timestamp": 1770750346000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA's latest WASDE report projects tighter livestock and dairy supply dynamics and stronger prices in 2026:\n\n- Beef production is revised higher due to increased slaughter of steers, heifers, and cows, along with heavier dressed weights, despite a smaller 2025 calf crop.\n- Pork production is also raised on higher slaughter levels and heavier weights in the first half of 2026.\n- Broiler and turkey production forecasts were lowered for early 2026 due to recent hatchery data and Highly Pathogenic Avian Influenza-related culling, tightening poultry and egg supplies.\n- Beef imports are raised on strong demand for lean processing beef, while pork exports increase on improved competitiveness.\n- Fed-cattle and hog prices are raised across all quarters, and the all-milk price is lifted to $18.95 per hundredweight.\n\nThe tighter supply outlook and resilient demand are driving these higher livestock prices, despite some disease and herd shifts impacting production.",
      "summaryTimestamp": 1770892849538
    },
    {
      "id": "1b9da6a96f2386a8",
      "title": "WASDE Leaves Soybeans Steady, Boosts Corn Exports Outlook",
      "link": "https://www.allagnews.com/wasde-leaves-soybeans-steady-boosts-corn-exports-outlook/",
      "description": "WASHINGTON, DC &#8211; USDA’s latest WASDE report left much of the 2025/26 outlook unchanged but [...]",
      "date": "Tue, 10 Feb 2026 19:00:43 +0000",
      "timestamp": 1770750043000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA's latest WASDE report made the following key changes:\n\n- Soybean supply and use forecasts were held steady, with the season-average farm price unchanged at $10.20 per bushel. Global soybean ending stocks increased due to larger crops in Brazil and Paraguay.\n\n- USDA raised U.S. corn exports by 100 million bushels to 3.3 billion, citing strong sales and inspections, and cut ending stocks to 2.1 billion bushels. The season-average corn price remained at $4.10 per bushel.\n\n- U.S. wheat ending stocks increased to 931 million bushels on lower food use, keeping prices at $4.90 per bushel. \n\n- Cotton saw slightly weaker demand, with exports trimmed and the projected farm price lowered to 60 cents per pound.\n\nThe report indicates strong corn exports but continued pressure on soybeans and wheat due to ample global supplies. Farmers can expect support for corn, while soybeans and wheat remain weighed down by the market conditions.",
      "summaryTimestamp": 1770892852383
    },
    {
      "id": "9333e25aa18be6e7",
      "title": "Farmers face greater risk with planting insurance option removed",
      "link": "https://www.agweek.com/news/north-dakota/farmers-face-greater-risk-with-planting-insurance-option-removed",
      "description": "The U.S. Department of Agriculture’s Risk Management Agency announced last fall that it was eliminating the extra coverage option for prevented planting insurance.",
      "date": "Tue, 10 Feb 2026 19:00:00 GMT",
      "timestamp": 1770750000000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/3677fd6/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe3%2Fd3%2Faa5680f646d695b5a903b4ccc62d%2Fjustin-quandt.jpg",
      "summary": "North Dakota farmers will face greater risk this year as the U.S. Department of Agriculture's Risk Management Agency has eliminated the extra \"buy-up\" coverage option for prevented planting insurance. \n\nFrom 2010 to 2024, the extra prevented planting coverage led to $3.18 billion in payments for North Dakota producers, more than any other state. This option allowed farmers to insure against years when weather prevents them from planting a crop.\n\nWithout this option in 2026, North Dakota farmers like Justin Quandt, who farms near Oakes, will have less protection against wet spring conditions that can leave some of their fields unplantable. Quandt's family normally invests in the additional prevented planting coverage, which requires insuring all acres in a county.\n\nThe North Dakota Farmers Union president Matt Perdue said the agency's decision is disappointing, as the recent farm bill had expanded federal crop insurance in other ways. However, an NDSU study concluded that the improvements will not outweigh the loss of the extra prevented planting coverage for North Dakota.\n\nSenators, including John Hoeven of North Dakota, have asked the USDA to undo the prevented planting changes for 2027 and beyond \"to help provide a layer of certainty when disasters beyond their control render them unable to plant a crop.\" \n\nFarmers face a March 15 deadline to make 2026 crop insurance purchases. Insurance agent Bethany Rentz hopes the USDA will bring back the extra prevented planting coverage based on pushback from other affected states.",
      "summaryTimestamp": 1770821424976
    },
    {
      "id": "ece987f6d8a8b3b4",
      "title": "Larger Operating Loans Drive Farm Lending Growth",
      "link": "https://www.allagnews.com/larger-operating-loans-drive-farm-lending-growth/",
      "description": "NASHVILLE, TN &#8211; Farm lending activity strengthened in 2025 as producers relied more heavily on [...]",
      "date": "Tue, 10 Feb 2026 18:45:07 +0000",
      "timestamp": 1770749107000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The volume of new operating loans rose nearly 40% year-over-year in Q4 2025, averaging over 20% growth across the full year. Inflation-adjusted operating loan sizes were about 30% larger than the previous year, reflecting elevated input costs and expanded financing needs. \n\nIncreased feeder cattle lending also contributed to stronger loan demand. Loan terms adjusted alongside the rising balances, with average maturities for operating loans increasing by about 3 months from 2024 and reaching record highs. Machinery and equipment loan maturities also lengthened.\n\nInterest rates on non-real-estate loans declined for the 6th straight quarter, with larger loans seeing greater reductions. However, over 80% of operating loans carried variable rates as borrowers positioned for potential further declines.\n\nThe overall takeaway is that bigger operating loans are helping farms manage costs, but also signaling a growing reliance on borrowed capital.",
      "summaryTimestamp": 1770892855338
    },
    {
      "id": "1a65a9633ce88244",
      "title": "MN CropCast: From research to resilience - Advancing soil health with Dr. Anna Cates",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-from-research-to-resilience.html",
      "description": "",
      "date": "Tue, 10 Feb 2026 16:18:00 +0000",
      "timestamp": 1770740280000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-w320-h320-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "In this episode of Minnesota CropCast, hosts Dave Nicolai and Seth Naeve interview Dr. Anna Cates, the University of Minnesota Extension Soil Health Specialist. Dr. Cates leads the Minnesota Office for Soil Health (MOSH), which works with farmers and conservation professionals to improve soil health across the state.\n\nDr. Cates, who has a PhD in Agronomy and MS in Soil Science and Agroecology from the University of Wisconsin-Madison, discusses the partnership between MOSH and the Minnesota Board of Water and Soil Resources (BWSR). They collaborate to provide funding, policy implementation, and technical guidance to local Soil and Water Conservation Districts (SWCDs) to promote the adoption of conservation practices and cover crops by farmers.\n\nThe episode also highlights an upcoming intensive educational opportunity called the Cover Crop Academy, which will help farmers learn about the benefits and implementation of cover cropping. \n\nFarmer adoption of conservation practices and cover crops is a key focus area for MOSH and its partners. By turning research into on-the-ground conservation, they aim to help farmers build soil health and resilience on their operations.",
      "summaryTimestamp": 1770742770894
    },
    {
      "id": "201b3258f4c16eed",
      "title": "Trump Signs Executive Order Boosting Argentine Beef&#160;Imports",
      "link": "https://civileats.com/2026/02/09/trump-signs-executive-order-boosting-argentine-beef-imports/",
      "description": "February 9, 2025 – The United States has finalized a deal with Argentina that is expected to more than quadruple beef imports from the South American country, acting on plans floated in October that received pushback from U.S. cattle producers. On Friday, President Donald Trump signed an executive order to increase Argentine beef imports by [&#8230;] The post Trump Signs Executive Order Boosting Argentine Beef Imports appeared first on Civil Eats.",
      "date": "Mon, 09 Feb 2026 23:24:08 +0000",
      "timestamp": 1770679448000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The U.S. has finalized a deal with Argentina to more than quadruple beef imports from the South American country. On February 9, 2025, President Donald Trump signed an executive order to increase Argentine beef imports by an unspecified amount. This move received pushback from U.S. cattle producers when it was first floated in October 2024. The increased imports are expected to have a significant impact on the U.S. beef industry.",
      "summaryTimestamp": 1770870171549
    },
    {
      "id": "33d69001b20007c6",
      "title": "EPA Reapproves Weedkiller Dicamba Despite Concerns About Drift and Crop&#160;Damage",
      "link": "https://civileats.com/2026/02/09/epa-reapproves-dicamba-despite-concerns-about-drift-and-human-health/",
      "description": "“The Trump administration’s hostility to farmers and rural America knows no bounds,” Bill Freese, science director at the Center for Food Safety (CFS), said in a press release. “Dicamba drift damage threatens livelihoods and tears apart rural communities.” Farmers have been using dicamba since the 1960s, but issues emerged about a decade ago, when it [&#8230;] The post EPA Reapproves Weedkiller Dicamba Despite Concerns About Drift and Crop Damage appeared first on Civil Eats.",
      "date": "Mon, 09 Feb 2026 23:08:28 +0000",
      "timestamp": 1770678508000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The U.S. Environmental Protection Agency (EPA) has reapproved the use of the weedkiller dicamba for the next five years, despite concerns about crop damage due to dicamba drift. Farmers have been using dicamba since the 1960s, but issues with dicamba drift emerged about a decade ago when new dicamba-resistant crops were introduced. \n\nThe Center for Food Safety criticized the EPA's decision, stating that \"dicamba drift damage threatens livelihoods and tears apart rural communities.\" Dicamba drift has been linked to millions of acres of crop damage across the Midwest and South, impacting soybean, cotton, and other crops. \n\nThe EPA's reapproval comes with new restrictions, including requiring farmers to maintain buffer zones around fields and limiting application during certain weather conditions. However, critics argue these measures are not enough to address the ongoing problems with dicamba drift.\n\nThe decision to reapprove dicamba for five more years has significant impacts for farmers. It means they will continue to face the risk of crop damage from dicamba drift, which can be devastating to their livelihoods. Experts recommend that farmers carefully weigh the risks and benefits of using dicamba-based products going forward.",
      "summaryTimestamp": 1770870174454
    },
    {
      "id": "a5f5d4972a5993d0",
      "title": "Minnesota Irrigator Program returns March 10th and 11th, 2026 in Perham, MN",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/minnesota-irrigator-program-returns.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 17:41:00 +0000",
      "timestamp": 1770658860000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEilFjhdf-VxkjP9toiF34DiaDB5cT-q0f91aA_Dm5rnp-VT4bl_Z7fTnYdUC-aenNwdk4aIJ6iixtBluHpy8s-iEt9Bi8Q_ACFmbb3c7egNGSuDx1vzfDkJg3X4cJN595mCuQvvb2YWJFNBWC6Yd39CfII3Z-IT9EolZPeEmPGaok8g6zYVrRwMkLGSB8LN/s72-w640-h322-c/Irrigation-180.jpg",
      "summary": "The Minnesota Irrigator Program (MIP) will return on March 10th and 11th, 2026 in Perham, MN. The 2-day program costs $60 and includes breakfast and lunch. \n\nThe program will cover topics such as irrigation scheduling, variable rate technology, autonomous pivots, flowmeters and calibration, and nitrogen management. Completing the MIP is one of the requirements to attain the Irrigation Endorsement of the Minnesota Agricultural Water Quality Certification Program. Certified farms will receive the endorsement if they attend the program and adopt a new irrigation practice or scheduling method on their farm.\n\nThe event is organized by the University of Minnesota (UMN) Crop News. Efficient agricultural irrigation is a key topic in Minnesota due to the state's sandy soils and limited precipitation. The program aims to help irrigators and irrigation professionals match irrigation to crop water use, improve water-use efficiency, and reduce water costs.",
      "summaryTimestamp": 1770848792892
    },
    {
      "id": "639f274dc791af0b",
      "title": "Strategic Farming: Let's talk crops discussed pollinators",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops_9.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:50:00 +0000",
      "timestamp": 1770652200000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiFwnCAyWS-EUZiSio5J4-y0QsBduTd8dBWm4rzsZPh3u4M6zCtsrl6RlBlORk_gWpEFh9h4ihjy4Q3pIa9pa6cfpRtz9_kTHvQBA2tYVh2SFkw_l0cs3XC0kVvrPnwkXwspvQywGqn_c4YnxmIW3ZA4EmamF9Iyw3k_NQb4FllsWyvbWbmpFK22ugIz6oV/s72-w320-h320-c/bee-on-flower-andrewsi_HeatherHolm.JPEG",
      "summary": "Key Takeaways:\n\n1. Pollinators, especially bees, play a critical role in food production, with over 80% of the world's flowering plants needing a pollinator to reproduce.\n\n2. Bee populations, including the endangered rusty patch bumblebee, have seen dramatic declines across North America due to factors like habitat loss, climate change, and disease.\n\n3. Restoring pollinator habitat on agricultural landscapes is important, and can be done cost-effectively. Planting a diverse mix of flowering plants, even in small areas, can support a variety of bee species.\n\n4. Research shows that the amount of surrounding agricultural land or size of the habitat area does not significantly impact bee diversity and abundance, as long as there are sufficient floral resources.\n\n5. Integrating pollinator habitat into croplands can have benefits for natural pest control, and can even improve yields for self-pollinating crops like soybeans.\n\n6. Funding sources and conservation programs may be available to assist farmers in establishing and maintaining pollinator habitat.\n\n7. Minnesota alone has around 525 species of bees, ranging from tiny to large bumblebees. Native bee species, including ground-nesting bees, are the focus of research at the University of Minnesota Bee Lab.",
      "summaryTimestamp": 1770848796551
    },
    {
      "id": "85be85b5240c46b7",
      "title": "Mark your calendars for the Midwest Soybean Gall Midge Research Update",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendars-for-midwest-soybean.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:22:00 +0000",
      "timestamp": 1770650520000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh0uFuk9siSQYDRZMiZ6TFrsf7R2PkpTjVQVdjWSAepcFTQa-SsKA945ODDygtkKavZCDdBqY6VAq25l-cmFJvX1zCYrFPrINtbHZ0q9eQSE04v6mqMfrOpOlW1sHhJIq8RjUbQO5J9yO9Ttx56T7Uy2inj9pSygRO9xdPxYA0_aPJKkiZ4FpEmgymGRY5b/s72-w320-h194-c/gall-midge-larvae-potter.jpg",
      "summary": "The Midwest Soybean Gall Midge Research Update is a free, live webinar scheduled for March 19, 2026. Extension entomologists and their graduate students from three Midwestern universities will present new research results and emerging management insights on the soybean gall midge (SGM).\n\nThe webinar will cover the following topics:\n- Updated information on SGM distribution and regional monitoring efforts\n- Impacts on soybean production and yield loss under field conditions\n- Biology and ecology updates, including cold tolerance and overwintering survival\n- New insights into adult biology, including emergence timing and behavior\n- Results from commercial soybean variety testing under SGM pressure\n- Updates on biological control efforts\n- Evaluation of new and emerging cultural control strategies, along with other management tools\n\nCertified Crop Advisors can earn pest management (PM) CEUs by attending the live event. Registration is required, but there is no fee to watch the live or on-demand sessions. Once registered, attendees will receive a confirmation email and reminder emails with a link to the webinar prior to the event.\n\nFor more information, visit the Midwest Soybean Gall Midge Research Update webpage.",
      "summaryTimestamp": 1770848799626
    },
    {
      "id": "3f08825939c7efbd",
      "title": "7 Vegetables to Start From Seed in February",
      "link": "https://modernfarmer.com/2026/02/vegetable-seed-february/",
      "description": "It takes a lot to get the farm ready for the growing season. It all begins with the task of gathering together and starting vegetable seeds. February is an ideal time to get many of your spring crops going. Consider these 7 vegetables as you prepare your rows. The post 7 Vegetables to Start From Seed in February appeared first on Modern Farmer.",
      "date": "Mon, 09 Feb 2026 12:00:00 +0000",
      "timestamp": 1770638400000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/03/Sowing-tomato-seeds-in-tray.webp",
      "summary": "Key Takeaways:\n\n1. February is a prime time for starting vegetable seeds, especially for crops that take a long time to mature. This allows for a head start on growing large quantities of healthy produce.\n\n2. Recommended vegetables to start from seed in February include:\n- Slow-growing herbs like basil and rosemary\n- Tomatoes\n- Peppers\n- Brassicas like broccoli, cabbage, and kale\n- Lettuce\n- Carrots and parsnips\n- Alliums like onions and leeks\n\n3. Starting seeds indoors or in protected environments like greenhouses, cold frames, and low/high tunnels can help in cold climates.\n\n4. Tomatoes, peppers, and heading brassicas like broccoli take 2-3 months to mature from seed, so starting them in February is important.\n\n5. Lettuce, leafy brassicas, and alliums can be directly sown outdoors under row covers in February in many regions.\n\n6. Key considerations include providing proper temperature, moisture, and light for germination and growth, as well as protecting young seedlings from late spring frosts.\n\n7. Growing vegetables from seed in February can give farmers a head start on the season and allow for larger, more productive harvests.",
      "summaryTimestamp": 1770848803449
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Temperatures this week were 8-18 degrees below average across Illinois, with lows reaching -7°F in Taylorville and -4°F in Jerseyville.\n- January was around 2 inches drier than normal statewide, despite heavy snowfall in parts of southern Illinois that provided little drought relief.\n- Temperatures are expected to warm up to the 40s and 50s next week, but precipitation will remain sparse (less than 0.1 inches).\n- Experts recommend using the N-Rate Calculator and Precision Conservation Management program to maximize profits rather than just yields, by finding the optimal nitrogen application rate.\n- The Commodity Week and Closing Market Report radio programs provide market updates for farmers.\n\nRecommendations:\n- Use the N-Rate Calculator and Precision Conservation Management to optimize nitrogen application and protect water quality while maximizing profits.\n- Stay informed on weather and market conditions through radio programs like Commodity Week and Closing Market Report.",
      "summaryTimestamp": 1770885662099
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Farmers are increasingly using AI-assisted tools, voice search, and quick-scan platforms that allow them to find information without needing to click. The true indicator of content effectiveness is now attention time - how long a user spends meaningfully engaged with the content.\n\nAgWeb.com recently underwent a redesign to increase user attention and engagement. The results show:\n- 54% increase in readers reaching 75% of an article\n- 21% increase in readers reaching 90% of an article\n- 33% increase in daily article pageviews per mobile user\n\nThe article cites data that 79% of online users scan content rather than reading word-for-word, and most only absorb around 28% of page text. AgWeb's redesign aimed to simplify layouts and guide deeper engagement.\n\nAttention time is a better metric than CTR because it shows if users stayed with the content, scrolled with purpose, consumed multiple articles, and were in an active, focused mindset. High-attention environments deliver stronger results for advertisers, as their brand is present during engaged moments.\n\nThe improvements on AgWeb are said to directly translate to more value for brands, providing more time with content, more content consumed per session, higher quality impressions, and better alignment with how farmers search today. The article concludes that attention, not just clicks, should be the priority metric for ag marketers.",
      "summaryTimestamp": 1770879440396
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "Twitter Facebook LinkedIn The Bulletin Evaluating soybean performance in conservation systems &#8211; project report Giovani Preza FontesFederico Rolle and John Jones Department of Crop Sciences Unive...",
      "summaryTimestamp": 1770885669909
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "Greenhouses can provide a protected environment to start growing plants early for the spring market. \n\nKey points:\n- Greenhouses trap thermal heat to warm plants, with features like vents, structures, and climate control systems. Different types include modular plastic, low tunnels, cold frames, and larger designer greenhouses.\n- In February, good greenhouse crops to start include tomatoes, peppers, brassicas (kale, cabbage, cauliflower), lettuces, potatoes, onions, and flowers.\n- Tomatoes and peppers benefit from the early start and warmth of a greenhouse, with ideal temperatures around 50°F (10°C).\n- Brassicas and lettuces can be grown to get an early spring harvest, protected from pests and frost.\n- Potatoes and onions also do well with a greenhouse start to get a head start on the season.\n- Flowers that take a long time to sprout, like lisianthus and dahlias, are good candidates for greenhouse growing to ensure spring blooms.\n\nThe article provides guidance for farmers on how to utilize different greenhouse types and what crops to prioritize for early greenhouse planting in the month of February.",
      "summaryTimestamp": 1770848806932
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Points:\n\n- The Packer, a publication from Farm Journal, is launching The Avocado Conference, a new international event for the U.S. avocado supply chain.\n- The inaugural event is scheduled for November 18-20, 2026, in San Diego, California.\n- The conference is a collaboration between Farm Journal and the Hass Avocado Board (HAB) to strengthen the global avocado industry and promote Hass avocados as America's preferred healthy food.\n- The conference aims to bring together all segments of the avocado supply chain, including producers, exporters, importers, packers, retail and foodservice buyers, and other industry partners.\n- The program will cover topics such as global avocado production and trade, retail and foodservice market insights, consumer and shopper trends, avocado marketing programs, and the role of the Hass Avocado Board in expanding avocado demand.\n- The conference is expected to provide valuable data-driven insights, facilitate collaboration, and promote strategic alignment within the avocado industry to drive sustainable growth in avocado consumption across the U.S. market.\n- Key stakeholders attending the event will include growers, packers, importers, exporters, retailers, foodservice buyers, and various industry service providers.",
      "summaryTimestamp": 1770879443511
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Summary:\n\nThe Iowa State University Pesticide Safety Education Program has updated several applicator manuals and exams to align with new pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. \n\nThe updated training materials, available for purchase through the ISU Extension Store, include the Iowa Core Manual (CS445) and an informational update in the Private Pesticide Applicator Manual (CS1). New exams based on the revised core manual are now available at all Iowa Department of Agriculture and Land Stewardship test sites.\n\nFor more information, contact Betsy Danielson, Pesticide Safety Education Extension Specialist at Iowa State University, at betsydan@iastate.edu.",
      "summaryTimestamp": 1770879445812
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The key points are:\n\n- Lead generation should focus on delivering real value to farmers in exchange for their time and attention, rather than just collecting information.\n- The call-to-action (CTA) and offer you choose shape not only how many leads are captured, but also how qualified, motivated and ready to purchase those prospects become.\n- Shifting the mindset from what you want to collect to what farmers genuinely need is crucial for effective lead generation.",
      "summaryTimestamp": 1770879447754
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this week were 4-8 degrees below normal, with nighttime lows reaching as low as -5°F in Rockford and -2°F in Aurora. The cold and windy weather resulted in wind chill values near -20°F on some days. \n\nPrecipitation has also been very limited, with only around 0.5 inches in northeast Illinois and virtually no rain in southwest Illinois over the past 7 days. January to date has been the 4th driest on record in Carbondale and 10th driest in Charleston, with less than 0.5 inches so far.\n\nThe cold weather is expected to continue for at least another week, with most of northern Illinois staying below freezing for the rest of the month. However, a strong winter storm is predicted to hit southern Illinois this weekend, potentially bringing 8-12 inches of snow south of I-64, with some isolated heavier snowfall.\n\nThe article also covers the latest Commodity Week radio programming, which featured panelists Chip Nellinger of Blue Reef Agri-Marketing, Brian Stark from The Andersons, and Arlan Suderman with StoneX discussing the commodity markets. The Closing Market Report also airs daily on WILL AM580.",
      "summaryTimestamp": 1770885673985
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Key points:\n\n- The focus has shifted from traditional SEO (search engine optimization) to modern AEO (answer engine optimization), where brands need to build authority and trust to cut through the \"AI slop\".\n- Farmers are increasingly using AI-powered platforms like ChatGPT, Google's AI Overviews, and mobile voice search to find information, and brands need to be present in these new discovery channels to avoid becoming \"invisible\".\n- At Farm Journal, the authors are observing and adapting to this shift in discoverability, which should prompt all ag marketers to reevaluate their 2026 strategy.\n- An answer-driven content strategy and amplifying trusted voices will be more important than ever in this new AEO era.\n- Discoverability is now about winning the citation, brand mention, and trusted source reference to build brand authority, even in zero-click moments.",
      "summaryTimestamp": 1770879450283
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Key points:\n- Agroforestry originated in Brazil's tropical rainforests and combines crops with selective lumber production.\n- It involves thinning a forest to allow the best conditions for crops like native ornamentals, fungi, fruit, timber, and forest food crops to grow in the understory.\n- Benefits include improved water/soil quality, carbon storage (up to 22 lbs/year), habitat for beneficial species, and access to specialty crop markets.\n- Farms with existing forest or riparian areas are best suited for agroforestry. It can be implemented on small scales.\n- Considerations include managing invasive tree species, understanding local market demands, and navigating regulations around wild plant harvesting.\n- Farmers should consult their agricultural extension office to develop a forest management plan.\n\nThe article provides a comprehensive overview of the forest farming approach, its advantages, suitable land types, and key implementation steps - giving farmers a thorough understanding without needing to read the full original article.",
      "summaryTimestamp": 1770848810088
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The past week saw above-normal temperatures, ranging from the mid-30s to upper 40s, 8-12 degrees above normal. Some locations reached highs of 69°F and 68°F. January to date has been 7-12 degrees warmer than normal, ranking in the top 10 warmest first halves of January on record for most of the state.\n\nDespite the warm weather, precipitation has been lacking, with 7-day totals ranging from 0.1 inch in southeast Illinois to 0.75 inch in central Illinois. January to date has been 0.5-1 inch drier than normal, except for 1-3 inches of rain in a narrow area between Peoria and Chicago. This winter has been slightly wetter than normal in northeast Illinois, slightly drier in central/western Illinois, and much drier (top 5 driest on record) in southern Illinois.\n\nLooking ahead, a cold front will move in this weekend, with highs only reaching the 20s in northern Illinois and above freezing in southern Illinois. Monday will see single-digit temperatures. Little precipitation is expected, mostly light snow. Colder than normal temperatures are forecast for the first week of February.\n\nThe article also provides an overview of the weekly WILL radio programming, including the Commodity Week and Closing Market Report programs featuring analysts Logan Kimmel, Jim McCormick, and Mike Zuzolo.",
      "summaryTimestamp": 1770885677893
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "When used properly, they can provide flexibility for timely applications, reduce field traffic, and improve access to difficult areas. However, adopting spray drone technology requires careful consideration of regulations, training, insurance, and management practices.\n\nKey points:\n- Spray drones can be useful for applications when soils are too wet, in tall crops, to reduce compaction, and for targeted/site-specific applications.\n- Regulatory requirements include FAA Part 107 Remote Pilot Certificate, FAA Part 137 Certification for aerial pesticide application, and Iowa Department of Agriculture and Land Stewardship (IDALS) licensing.\n- Farmers need insurance coverage including chemical liability, general liability, and hull/physical damage.\n- Equipment factors to consider include spray tank capacity, battery life, nozzle options, and GPS guidance features.\n- Proper training is essential for safe and effective operation, including calibration, weather monitoring, and maintenance.\n- Farmers are encouraged to start on a limited scale and compare results to conventional methods.\n- Resources available include Iowa State University programs, licensed dealers, and IDALS guidance.\n\nSpray drone technology continues to evolve, with ongoing improvements in payload, automation, and data integration. Careful evaluation and gradual adoption are recommended for Iowa farmers.",
      "summaryTimestamp": 1770879453651
    },
    {
      "id": "75d0524dd80f4e3e",
      "title": "Double-crop Soybean Management Practices &#8211; Project Report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/double-crop-soybean-management-practices-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wheat acreage has been limited in recent decades. USDA-NASS survey estimates that 60-80% of Illinois wheat acres are double-cropped with soybeans. Implementing this system in central and northern Illinois has been constrained primarily by low wheat acreage and by later wheat harvest, which often delay",
      "date": "Tue, 13 Jan 2026 12:52:03 +0000",
      "timestamp": 1768308723000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/01/Table1_site-info.jpg",
      "summary": "Key findings:\n\n- Double-crop soybean yields averaged 55.7 bu/acre in 2024 and 47.8 bu/acre in 2025.\n- Full-season soybean varieties (MG 3.6-3.8) yielded 4% (2.1 bu/acre) more than early-maturing varieties (MG 3.0-3.2) across treatments.\n- Seeding rate response differed by maturity group - early varieties yielded best at 252,000 seeds/acre, while full-season peaked at 207,000 seeds/acre.\n- Starter fertilizer (26 lb N, 11 lb S) increased yields by 1.4 bu/acre (2.6%) in 2024 but not in 2025 or on average.\n\nThe research was conducted by the University of Illinois Crop Sciences Dept. in collaboration with the Illinois Agricultural Experiment Station, Illinois Fertilizer & Chemical Association, and a Piatt County producer. More trials across locations are ongoing to strengthen regional recommendations for double-crop soybean management.",
      "summaryTimestamp": 1770885682340
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "Winter sowing involves starting seeds in containers like milk jugs or plastic bags and placing them outdoors, where the cold, moist conditions help the seeds break dormancy. This results in hardier transplants that mature sooner.\n\nThe best vegetables for winter sowing include hardy greens like kale and cabbage, as well as spinach, onions, and leafy greens. Kale, cabbage, and spinach can handle cold well even in their early stages. Onions, especially bulbing onions, benefit from the long maturation period. Leafy greens like kale, collards, and chard are also excellent choices.\n\nFor flowers, the article recommends perennials like pansies, echinacea, snapdragons, larkspur, and scabiosa. These flowers often need a period of cold stratification, which is provided by the winter sowing method.\n\nThe article provides specific variety recommendations for some of the vegetables and flowers, such as 'Carex' cabbage, 'Avon' spinach, and different types of snapdragons. It also discusses the ideal growing conditions for long-day, short-day, and intermediate-day onions.\n\nOverall, the winter sowing method allows farmers to get a head start on the growing season and produce hardier, more mature plants come spring. The article emphasizes the benefits of this technique for maximizing profits and productivity.",
      "summaryTimestamp": 1770848813701
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "However, there are several agri-environmental strategies farmers can employ to support biodiversity:\n\n1. Prairie Strips: Planting 10-25% of farmland in prairie strips can attract beneficial predators, improve soil nutrients, and boost yields by supporting pollinators and pest-controlling insects.\n\n2. Low Tilling: Reducing tillage and using cover crops can improve soil structure and support greater biodiversity above and below ground.\n\n3. Regenerative Grazing: Rotating livestock and using native plants, fire, and mowing can maintain healthy pastures and provide habitat for local species, especially in areas with prairie or forest ecosystems. \n\n4. Integrated Pest Management (IPM): Attracting beneficial insects through diverse plantings and cultural practices can reduce reliance on harmful pesticides.\n\n5. Conservation Easements: Partnering with land trusts to establish conservation easements can protect natural resources and provide tax benefits for farmers with large landholdings.\n\nImplementing these strategies, even partially, can have significant positive impacts on biodiversity and farm productivity by working with natural systems rather than against them. Experts emphasize that farming is as much for humans as it is a constant reminder of the laws of the natural world, and the more farmers can see their land as part of a larger ecosystem, the more sustainable their agriculture can become.",
      "summaryTimestamp": 1770848817023
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series will be held at 12 locations across Iowa from January 6 to 29. The meetings will feature topics tailored to local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.\n\nKey details:\n- Locations: Sioux Center, Storm Lake, Burlington, Mason City, Estherville, Waterloo, Davenport, Ankeny, Atlantic, Iowa City, Le Mars, Carroll\n- Dates: January 6-29, 2026\n- Early-bird registration: $75 until the week before each meeting\n- Late/on-site registration: $100\n- Includes refreshments, lunch, certified crop advisor credits, and access to resources\n- Private pesticide applicator recertification available for an additional $30 fee\n\nTopics to be covered include crop market and climate outlooks for 2026, nitrates and drinking water, profitable nutrient management, southern rust, transition planning, and robots/drones.\n\nThe goal is to provide farmers and crop production professionals with the latest research-based information to help them make informed decisions for the upcoming growing season. Registration and more information is available on the Crop Advantage Series website.",
      "summaryTimestamp": 1770879456517
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The winner and finalists will be recognized at the 2026 Top Producer Summit in Nashville, Tennessee from February 9-11. \n\nThe three finalists are:\n- Alsum Farms (Friesland, Wisconsin) - A multigenerational, 3,600-acre operation producing potatoes, pumpkins, hay, and other crops. Led by the founder and his two daughters.\n- Dalton Farms (Wakeman, Ohio) - A 7th generation, 2,000-acre farm with corn, soybeans, a 400-head cattle herd, and an on-farm market. Owned by Rebecca and Edward Dalton.\n- Splitter Farms (Sterling, Kansas) - A 1,400-acre row crop operation led by Matt and Janna Splitter, farming 18,500 total acres. They scaled the business after the sudden passing of Matt's father in 2010.\n\nAdditionally, the 2026 Next Generation Award winner is Tim Nuss (El Dorado Hills/Lodi, California), who farms various crops and also runs an ag tech and influencer business. The 2026 Women in Agriculture Award winner is Helle Ruddenklau (Amity, Oregon), an immigrant from Denmark who farms a diverse operation and is involved in ag advocacy.\n\nAll finalists and award winners will be recognized at the Top Producer Summit, which is sponsored by BASF, Fendt, and Pro Farmer.",
      "summaryTimestamp": 1770879460249
    },
    {
      "id": "ce3ade9054dd723c",
      "title": "Still an opportunity to attend the ICM Conference!",
      "link": "https://crops.extension.iastate.edu/post/still-opportunity-attend-icm-conference",
      "description": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean field with Integrated Crop Management Conference overlayed on top. Learn more at go.iastate.edu/ICM\" width=\"408\" height=\"214\" class=\"align-left\" loading=\"lazy\"><p>This year we are offering on-site registration for the <a href=\"https://www.regcytes.extension.iastate.edu/icm/\">Integrated Crop Managem",
      "date": "Thu, 04 Dec 2025 08:22:25 -0600",
      "timestamp": 1764858145000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg",
      "summary": "The Integrated Crop Management (ICM) Conference is taking place on December 10-11, 2025 at the Meadows Events and Conference Center in Altoona, Iowa. \n\nThe conference will offer:\n- 33 workshops covering topics like crops, pests, nutrient management, and conservation\n- Up to 14 continuing education credits for Certified Crop Advisers\n- Iowa Commercial Pesticide Applicator continuing instruction for 2025 in categories 1A, 1B, 1C, and 4 for an additional fee\n- Invited speakers covering topics related to the Endangered Species Act, timing of corn and soybean planting, and integrated pest management for corn leafhopper and corn stunt disease\n\nFarmers can register in-person on December 10 for this premier crop management conference. The article was written by Meaghan Anderson, a field agronomist serving nine counties in central Iowa and an extension specialist with Iowa State University Extension and Outreach.",
      "summaryTimestamp": 1770879462958
    },
    {
      "id": "6e56b2436e07fb98",
      "title": "Registration is now open for the 36th Integrated Crop Management Conference",
      "link": "https://crops.extension.iastate.edu/post/registration-now-open-36th-integrated-crop-management-conference",
      "description": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water management. The event features experts sharing research updates and practical recommendations. Don’t miss this key opportunity for networking and education!</p><p><strong>When: </strong>December 10 and 11, 2025</p><p><strong>Where: </strong>The Meadows Events Center in Altoona, Iowa</p><p><strong>Who",
      "date": "Mon, 27 Oct 2025 14:12:34 -0500",
      "timestamp": 1761592354000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Summary:\n\nThe 36th Integrated Crop Management Conference will be held on December 10-11, 2025 at The Meadows Events Center in Altoona, Iowa. The conference features 33 session topics with expert speakers and covers a range of crop production, protection, nutrient management, and soil/water topics. \n\nEarly-bird registration is $260 and ends on November 16, 2025. Regular registration is $310 until December 3, 2025. Commercial pesticide applicators can earn recertification credits in categories 1A, 1B, 1C, and 4 for an additional fee.\n\nThe conference is open to anyone involved in crop production. Attendees can build a customized schedule, earn CCA credits, and network with other professionals from Iowa and the Midwest region.\n\nThe conference is organized by Iowa State University Extension and Outreach. The content authors are Erin Hodgson, a professor and extension entomologist, and Ashley Dean.",
      "summaryTimestamp": 1770879465615
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10 at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5.\n\nThe event will feature research on sorghum's value as a forage crop, highlighting its advantages over corn, such as being more drought-tolerant and having lower nitrogen requirements. Attendees will learn about forage sorghum production and utilization for silage, grazing, and as a standing winter feed source.\n\nSpeakers at the event will include:\n- Keith Johnson, Purdue professor of agronomy\n- Mitch Tuinstra, Wickersham Chair of Excellence in Agricultural Research and scientific director of the Institute for Plant Sciences at Purdue, who will share plant breeding techniques to improve sorghum yield and quality\n- Brad Shelton, FPAC superintendent\n- Jason Tower, Southern Indiana Purdue Agricultural Center superintendent\n- Nick Minton, Purdue Extension beef systems specialist\n- Jeff Jackson, Croplan alfalfa and forage specialist\n\nVenue tours will be available from 3-5 pm and 6-8 pm, and a dinner and bull test station tour will be offered from 5-6 pm.",
      "summaryTimestamp": 1770879471899
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Farmer sentiment improved in July 2024 despite concerns over financial performance. The Purdue/CME Group Ag Economy Barometer index rose 8 points to 113.\n\n- The Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations rose 7 points to 119.\n\n- High input costs remained the biggest concern for 34% of farmers. 29% cited the risk of lower crop and livestock prices, up from 25% in June.\n\n- The Farm Financial Performance Index dropped 4 points in July to 81, 6 points lower than in July 2023, reflecting worries about weakening commodity prices and high input costs.\n\n- The Farm Capital Investment Index rose 6 points in July to 38, though it remains 7 points lower than in July 2023.\n\n- The Short-Term Farmland Value Expectations Index rose to 118 from 115 in June, while the Long-Term Farmland Value Expectations Index dropped 6 points to 146.\n\n- 72% of crop farmer respondents expect cash rental rates to remain roughly the same as in 2024, with the remaining 15% anticipating a rise and 13% expecting a decline.",
      "summaryTimestamp": 1770879477595
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Findings:\n- Tar spot, a fungal disease in corn, has been spreading in the U.S. since it was first detected in 2015. It has now reached 16 states and Ontario, Canada.\n- Purdue researchers are taking an interdisciplinary approach, combining agricultural and engineering methods, to study the dynamics of tar spot and develop ways to monitor and assess the disease.\n- The research team is using a mix of statistics, data science, epidemiology, microbiology, artificial intelligence, and computer vision, along with stakeholder feedback, to better understand tar spot.\n- The research is funded by two USDA grants totaling nearly $1.1 million.\n- The researchers are collaborating with experts from Colombia, Mexico, Ecuador, South Korea, and the U.S.\n- Previous work by the team has included developing a digital method to quantify tar spot in corn, with promising results, but some inaccuracies still need to be addressed.\n- The team is also exploring the use of drone imagery and weather data, along with traditional statistical methods, to capture details about the tar spot pathosystem.\n\nKey Numbers/Statistics:\n- Tar spot was first detected in the U.S. in 2015, affecting 2 of Indiana's 92 counties.\n- By 2022, the fungus had extended to 16 states and Ontario, Canada, as well as 15 other countries in Central and South America, the Caribbean, and U.S. territories.\n- The research is funded by two USDA grants totaling nearly $1.1 million.\n\nKey Dates/Deadlines:\n- The article was published on August 1, 2024.\n\nKey Names/Organizations/Programs:\n- Purdue University\n- C.D. Cruz, associate professor of botany and plant pathology\n- Mohammad Jahanshahi, associate professor in the Lyles School of Civil and Construction Engineering and the Elmore Family School of Electrical and Computer Engineering\n- Mariela Fernández-Campos, PhD student in botany and plant pathology\n- Yu-Ting Huang, postdoctoral research associate in civil engineering\n- Darcy Telenko, associate professor of botany and plant pathology\n- Brenden Lane, graduate student in C.D. Cruz's lab\n- Sungchan Oh, computational infrastructure specialist in the Institute for Plant Sciences\n\nLocations:\n- West Lafayette, Indiana\n- 16 states and Ontario, Canada\n- Central and South America, the Caribbean, and U.S. territories\n\nContext/Causes:\n- Tar spot had been endemic in several Latin American countries since 1904, but had not been detected in the U.S. prior to 2015.\n- The researchers are trying to understand the origins of the disease, how it has spread, and whether the pathogen in the U.S. is different from those in other countries.\n\nImpacts for Farmers:\n- The spread of tar spot in the U.S. poses a biosecurity challenge that the research aims to address with a science-based approach.\n- The researchers hope that the use of high-tech data collection and analysis methods can make vital corn pathology information more widely and rapidly available to stakeholders.\n\nRecommendations/Action Items:\n- The researchers are continuing to refine their training methods to improve the accuracy and performance of their disease detection models.\n- They are also working to quantify and model tar spot epidemics in production-style fields by integrating drone imagery and weather data with traditional statistical methods.\n\nExpert Quotes:\n- \"There are opportunities in integrating AI-based digital technologies and point-of-care diagnostics that can provide rapid and accurate information for stakeholders,\" said C.D. Cruz.\n- \"Whether you're working on civil infrastructure health monitoring or agricultural disease epidemiology, you can have a profound impact not only on humans but also on the environment,\" said Mohammad Jahanshahi.",
      "summaryTimestamp": 1770879486847
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana Sheep Association (ISA), with support from the Indiana Sheep and Wool Market Development Program (IN S&W), is hosting various sheep-themed events and competitions at the 2024 Indiana State Fair:\n\n- The Wool and Ewe Room and Ewe2 boutique will be open throughout the fair, offering woolen products, livestock-themed apparel, jewelry, and more.\n- On August 2 at 10 a.m., there will be an open wool judging and wool sale event in the Blue Ribbon Pavilion.\n- The Make It With Wool (MIWW) competition and fashion show will take place on August 4 at 2 p.m. in the Indiana Arts Building.\n- The Indiana State Fair Shearing Contest will be held on August 4 at 5 p.m. in the Ball State University Champions Pavilion.\n- From August 8-11 from 11 a.m. to 6 p.m., the Taste from Indiana Farms event in the Indiana Farm Bureau Fall Creek Pavilion will offer free samples of Indiana lamb.\n- The annual Sheep to Shawl competition, where youth teams create a wool shawl from scratch, will be on August 18 at 10 a.m. in the Indiana Arts Building.\n- Sheep can be found in the Blue Ribbon Pavilion from August 4-20 for open and 4-H shows.\n\nThe ISA President, Jane Smith, stated that the association is proud to bring the spirit of the sheep industry to the fair, with the theme of \"Art and Nature\" showcasing sheep-related art from Indiana artists.",
      "summaryTimestamp": 1770879493406
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue Extension will have a presence at the fair, providing opportunities for fairgoers to interact with Purdue experts on topics like entomology, human health, forestry, animal sciences, and more. \n\nKey Purdue Extension activities include:\n- Block Party (ages 8 months to 8 years) to enhance school-readiness skills\n- Book Party to focus on math skills \n- Captain Cash to learn financial management\n- Master Gardener exhibit on annuals/vegetables and pollinator education\n\nThe Food Science Department will host \"What's Growing on My Spinach?\" to explore food microbiology and food safety, including sampling cricket-infused rice cereal treats and Boilermaker Hot Sauce.\n\nSeed art will be showcased in the livestock barns and Purdue Extension Building, visually representing the fair's theme.\n\nThe Purdue Ag Alumni Association will sponsor Pioneer Village, offering antique tractors, farm toys, music, and more to transport guests to the 1800s.\n\nPurdue Extension exhibits will be located throughout the fairgrounds, including the 4-H Exhibit Hall, Pavilions, and Purdue Extension Building.",
      "summaryTimestamp": 1770879499261
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The University of Wisconsin-Madison has released a new publication called \"Potassium Cycle\" that provides a visual overview of the potassium cycle in Wisconsin cropping systems. The two-page publication outlines key potassium concepts and recommendations for specific situations. The publication is available for download only and was announced on June 12, 2024 in the Wisconsin Crop Manager newsletter.",
      "summaryTimestamp": 1770879503078
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Wisconsin Winter Wheat Update:\n\n- Wisconsin winter wheat is 10-14 days ahead of typical growth stages due to a warm spring and timely rainfall.\n- There is a high likelihood of stripe rust appearing in Wisconsin this season, but it has not been detected yet. Farmers are advised to scout their fields and report any findings.\n- Fusarium head blight (FHB) is expected to be an issue this season due to moderate temperatures and adequate precipitation, in contrast with recent hot and dry spring seasons.\n- FHB can limit yields and produce the mycotoxin deoxynivalenol (DON or vomitoxin), which can lead to discounts or rejection at the elevator if levels exceed 2 ppm in the finished grain.\n- Farmers are encouraged to manage FHB, as it is a yield-limiting disease worth addressing.\n- The update was provided by Damon Smith, Extension Field Crops Pathologist, and Shawn Conley, Extension Soybean and Small Grains Agronomist, from the University of Wisconsin-Madison.\n- The article was posted on May 20, 2024 on the UW Madison website.",
      "summaryTimestamp": 1770879507746
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Soybean plants have the ability to compensate for open spaces by developing additional branches and pods, allowing them to yield well even with lower plant stands. However, action should be considered if stand loss leaves fewer than 50,000-60,000 evenly-distributed plants per acre in southern regions, or 75,000 plants per acre in northern regions, or if there are areas larger than 6-10 square feet without any plants. \n\nFactors to evaluate when considering replanting include the existing plant stand, distribution, and ability to recover; planting date and relative maturity; weed management; seed and variety availability; cost and insurance; and the tradeoff between a suboptimal stand vs. yield penalty from delayed replanting. The article recommends closely assessing fields for plant loss and patterns before deciding whether to replant.\n\nAn additional resource is provided for more information on soybean replant decisions.",
      "summaryTimestamp": 1770879513810
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n1. The only labeled formulation for postemergence broadleaf weed control in Enlist E3 soybeans is the 2,4-D choline formulation present in Enlist One and Enlist Duo herbicides. 2,4-D ester and amine formulations cannot be used.\n\n2. There have been reports of producers, agronomists, and Certified Crop Advisors considering using the ester or amine formulations for postemergence applications, which is not allowed.\n\n3. Regarding burndown applications, if using a 2,4-D ester or amine formulation product, the soybean plant back interval (minimum of 7 days when using 0.5 lbs ae/acre) must be respected.\n\n4. If planting Enlist E3 soybeans, Enlist One or Enlist DUO can be applied without the plant back restriction.\n\nThe article was posted on May 11, 2024 by Daniel H. Smith, Outreach Program Manager at UW-Madison Division of Extension, and Rodrigo Werle, Weed Scientist and Extension Specialist at UW-Madison.",
      "summaryTimestamp": 1770879519516
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Wisconsin CCA (Certified Crop Adviser) Board election results have been posted. Rob Shields, Matt Brugger, and Chris Bandura have been elected to the WI CCA Board and are eligible to serve two, three-year terms. All WI CCAs in good standing status are eligible for nomination and can vote in future elections, which will take place in early 2025. Daniel H. Smith, the Outreach Program Manager for the Crops and Soils Program at the University of Wisconsin-Madison Division of Extension, oversees the election process.",
      "summaryTimestamp": 1770879524416
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 20,
  "updated": "2026-02-12T16:55:13.727Z"
}