{
  "items": [
    {
      "id": "249a57c340df51ab",
      "title": "Solar fuels nearly entire farm for southern Minnesota producer",
      "link": "https://www.brownfieldagnews.com/news/solar-fuels-nearly-entire-farm-for-southern-minnesota-producer/",
      "description": "A farmer in southeastern Minnesota is harnessing the power of the sun. Dale Stevermer grows corn, soybeans, oats, and has a 2,000 head custom finishing hog operation near Easton. He says he installed solar panels on the farm in December of 2022. &#8220;And roughly 100 percent of our farm operation, including the dryer and grain [&#8230;] The post Solar fuels nearly entire farm for southern Minnesota producer appeared first on Brownfield Ag News.",
      "date": "Tue, 10 Feb 2026 20:37:07 +0000",
      "timestamp": 1770755827000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Dale Stevermer, a farmer in southeastern Minnesota, has installed solar panels on his farm in December 2022. These solar panels now power nearly 100% of his entire farm operation, including his corn, soybean, oats production, and a 2,000-head custom finishing hog operation near Easton. The solar panels have allowed Stevermer to significantly reduce his energy costs and reliance on traditional electricity sources.",
      "summaryTimestamp": 1770755990947
    },
    {
      "id": "aa0b7c71c229a912",
      "title": "Ag economist: year-round E15 approval first step in expanding corn biofuels market",
      "link": "https://www.brownfieldagnews.com/news/ag-economist-year-round-e15-approval-first-step-in-expanding-corn-biofuels-market/",
      "description": "Ag economist Scott Irwin with the University of Illinois says passing legislation for year-round E15 is just one of several hurdles to overcome in expanding the corn-based biofuels market. “It’s not a mandate. We will not suddenly go from E10 to E15 with the waiver made permanent for E15 blend. It just opens up the [&#8230;] The post Ag economist: year-round E15 approval first step in expanding corn biofuels market appeared first on Brownfield Ag News.",
      "date": "Tue, 10 Feb 2026 20:34:55 +0000",
      "timestamp": 1770755695000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The University of Illinois ag economist Scott Irwin stated that passing legislation for year-round E15 approval is just the first step in expanding the corn-based biofuels market. The E15 waiver does not mandate a shift from E10 to E15, but rather opens up more opportunities for the corn biofuels market. Irwin noted that there are several other hurdles that need to be overcome to further expand this market.",
      "summaryTimestamp": 1770755992705
    },
    {
      "id": "526ca1ce1166b6f4",
      "title": "Management Practices Can Enhance Soil Microbiome Functions in Plant Defense",
      "link": "https://www.morningagclips.com/management-practices-can-enhance-soil-microbiome-functions-in-plant-defense/",
      "description": "URBANA, Ill. – The soil microbiome is critical for the ecosystem, and agricultural practices that promote microbial diversity can support plant health and help protect against pests. But it is unclear which practices are most beneficial, and what motivates farmers to choose them. In a new study, researchers from the University of Illinois Urbana-Champaign and Cornell University analyzed surveys and soil [&#8230;] The post Management Practices Can Enhance Soil Microbiome Functions in Plant Defens",
      "date": "Tue, 10 Feb 2026 20:32:11 +0000",
      "timestamp": 1770755531000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "They found that certain farming practices can enhance the soil microbiome and improve plant defense against pests:\n\n- Beneficial practices include no-till, cover crops (winter rye, sorghum, millet, Sudan grass), and targeted drip/hand watering instead of broadcast irrigation. These practices strengthened plant defenses against aphids.\n- Using insecticides/pesticides within the last 3 years negatively impacted the microbiome and plant defenses.\n- Compost had mixed results, depending on the starting condition of the microbiome.\n\nThe researchers were able to correlate farmer beliefs about the microbiome with their chosen management practices. Organic farmers' beliefs about microbiome impacts were more important drivers than just economic factors.\n\nThe USDA offers cost-share programs for practices like no-till and cover crops. The researchers are studying how providing farmers information on their soil microbiome can affect their willingness to adopt these beneficial practices.\n\nPest suppression is just one function of the microbiome, so conserving microbial diversity is important as new agricultural challenges arise. Technological hurdles remain before rapid, individual microbiome testing can be feasible for farmers.\n\nThe study was published in the journal npj Sustainable Agriculture. It was supported by USDA funding.",
      "summaryTimestamp": 1770755997090
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Why did soybeans grab double-digit gains today?",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: Corn prices were also slightly firm on Tuesday.",
      "date": "Tue, 10 Feb 2026 20:21:22 GMT",
      "timestamp": 1770754882000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The February WASDE report is expected to be a \"maintenance\" report, without significant changes compared to previous editions. Key highlights:\n\n- The report will be released on February 9th, 2023.\n- It is typically a less eventful edition, serving as preparation for the March report which will include updated planting data.\n- USDA is not anticipated to make major revisions to 2022/23 crop production or supply/demand forecasts.\n- However, analysts will be closely watching for any changes to U.S. corn and soybean ending stocks estimates.\n- Current USDA forecasts show U.S. corn ending stocks at 1.257 billion bushels and soybean ending stocks at 225 million bushels.\n- Farmers and industry experts will analyze the report for potential market impacts and guidance on spring planting decisions.",
      "summaryTimestamp": 1770676346227
    },
    {
      "id": "9360cf9e6d867158",
      "title": "Cotton, ending stocks see month-to-month gains",
      "link": "https://www.brownfieldagnews.com/news/cotton-ending-stocks-see-month-to-month-gains/",
      "description": "The USDA increased its domestic cotton and rice ending stocks estimates. U.S. cotton ending stocks are now seen at 4.4 million bales, up 200,000 from January due to a cut in the export use guess because of the slow pace of sales. Domestic rice ending stocks are pegged at 50.3 million hundredweight, rising 1 million [&#8230;] The post Cotton, ending stocks see month-to-month gains appeared first on Brownfield Ag News.",
      "date": "Tue, 10 Feb 2026 20:21:05 +0000",
      "timestamp": 1770754865000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA increased its domestic cotton and rice ending stocks estimates for the current marketing year. U.S. cotton ending stocks are now projected at 4.4 million bales, up 200,000 from the previous month's estimate. This increase is due to a reduction in the export use forecast, reflecting the slow pace of cotton sales. \n\nDomestic rice ending stocks are pegged at 50.3 million hundredweight, rising by 1 million hundredweight compared to the previous estimate. No further details or reasons for the increase in rice ending stocks were provided.",
      "summaryTimestamp": 1770755999456
    },
    {
      "id": "2f0bce0eba2ad584",
      "title": "Missouri Corn Applications Due Feb. 13",
      "link": "https://www.morningagclips.com/missouri-corn-applications-due-feb-13/",
      "description": "JEFFERSON CITY, Mo. &#8212; Time is running out for Missouri agriculture students to apply for a 2026 Missouri Corn Scholarship. High school and college students pursuing a career in an agriculture-related field must submit the necessary forms by Feb. 13 to be eligible for one of seven $1,000 scholarships awarded by the Missouri Corn Foundation. [&#8230;] The post Missouri Corn Applications Due Feb. 13 appeared first on Morning Ag Clips.",
      "date": "Tue, 10 Feb 2026 20:20:50 +0000",
      "timestamp": 1770754850000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The application deadline is February 13, 2026. High school seniors and college juniors from Missouri farms or rural areas who are pursuing agriculture-related degrees are eligible. High school winners will receive the scholarship for their freshman year, while college winners will get it for their senior year. Recipients must assist with a Missouri Corn event to complete the scholarship requirements. The scholarship committee will review applications and notify recipients by April 15, 2026. More information is available at the Missouri Corn website.",
      "summaryTimestamp": 1770756002813
    },
    {
      "id": "541d6702ac440cb1",
      "title": "Cattle Raisers Join Fly Dispersal Facility Grand Opening",
      "link": "https://www.morningagclips.com/cattle-raisers-join-fly-dispersal-facility-grand-opening/",
      "description": "FORT WORTH, Texas — Stephen Diebel, Texas &#38; Southwestern Cattle Raisers Association first vice president, alongside U.S. Secretary of Agriculture Brooke Rollins and Governor Greg Abbott, attended the grand opening of the USDA Animal Plant Health Inspection Service (APHIS) sterile fly dispersal facility at Moore Airfield Base. Texas &#38; Southwestern Cattle Raisers Association was well represented at the [&#8230;] The post Cattle Raisers Join Fly Dispersal Facility Grand Opening appeared fir",
      "date": "Tue, 10 Feb 2026 20:20:18 +0000",
      "timestamp": 1770754818000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "New World screwworm fly dispersal facility grand opening:\n\n- The USDA Animal Plant Health Inspection Service (APHIS) opened a sterile fly dispersal facility at Moore Airfield Base in Texas.\n- The facility will be capable of dispersing up to 100 million sterile flies per week.\n- The facility was funded by the Trump Administration in June 2025 as part of USDA's 5-pronged plan to combat the spread of New World screwworm.\n- Since June 2025, the New World screwworm has continued migrating north from Central America and is now 187 miles south of the Texas-Mexico border.\n- The Texas & Southwestern Cattle Raisers Association, led by First Vice President Stephen Diebel, attended the grand opening and expressed support for protecting the U.S. beef herd from the screwworm threat.\n- Planning is underway with the U.S. Army Corps of Engineers to construct a domestic sterile fly production facility with a capacity of 300 million sterile flies per week. This will be the only U.S.-based sterile fly production facility.\n- In August 2025, USDA committed $750 million to build this domestic sterile fly production facility.",
      "summaryTimestamp": 1770756007528
    },
    {
      "id": "f449ee25cefa4618",
      "title": "MSU anaerobic digestion expert weighs in on USDA funding pause",
      "link": "https://www.brownfieldagnews.com/news/msu-anaerobic-digestion-expert-weighs-in-on-usda-funding-pause/",
      "description": "The USDA’s Rural Business-Cooperative Services administrator has paused biodigester and controlled environmental agriculture project approvals as part of an internal review. Michigan State University Anaerobic Digestion Research and Education Center Director Wei Liao tells Brownfield the pause should allow USDA to question how projects align with their original intent. “This type of collaboration, funding support, [&#8230;] The post MSU anaerobic digestion expert weighs in on USDA funding pause ",
      "date": "Tue, 10 Feb 2026 20:16:07 +0000",
      "timestamp": 1770754567000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA has temporarily paused approvals for biodigester and controlled environmental agriculture projects as part of an internal review. Michigan State University's Anaerobic Digestion Research and Education Center Director Wei Liao stated that this pause will allow the USDA to evaluate how the projects align with their original intent. Liao emphasized the importance of collaboration and funding support for these types of projects, which can help farmers and rural communities. He believes the review process will ultimately strengthen the USDA's biodigester and controlled environment agriculture programs.",
      "summaryTimestamp": 1770756009754
    },
    {
      "id": "bb08d4c0b295669a",
      "title": "Used machinery prices stabilize as auction demand stays strong",
      "link": "https://www.brownfieldagnews.com/news/used-machinery-prices-stabilize-as-auction-demand-stays-strong/",
      "description": "An auction specialist says used machinery demand remains strong. Sam Harper, an associate broker and equipment independent sales rep with Big Iron Auctions, says low commodity prices haven’t slowed down the used equipment marketplace. “Expectations are still kind of around the all-time high we had a couple of years ago,” he said. “We’re more pre-Covid [&#8230;] The post Used machinery prices stabilize as auction demand stays strong appeared first on Brownfield Ag News.",
      "date": "Tue, 10 Feb 2026 20:08:27 +0000",
      "timestamp": 1770754107000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The used machinery market remains strong despite low commodity prices, according to auction specialist Sam Harper of Big Iron Auctions. Prices for used equipment have stabilized and are still near record highs seen a couple of years ago, pre-COVID. Demand at auctions has stayed robust, indicating farmers are still actively purchasing used machinery. Harper notes the used equipment market is currently performing better than the pre-pandemic period.",
      "summaryTimestamp": 1770756011573
    },
    {
      "id": "edc87935d47563dd",
      "title": "Sixth Year of Drought in Texas and Oklahoma Leaves Ranchers Bracing for Another Harsh Summer",
      "link": "https://www.morningagclips.com/sixth-year-of-drought-in-texas-and-oklahoma-leaves-ranchers-bracing-for-another-harsh-summer/",
      "description": "COLLEGE STATION, Texas (The Conversation) &#8212; Cattle auctions aren’t often all-night affairs. But in Texas Lake Country in June 2022, ranchers facing dwindling water supplies and dried out pastures amid a worsening drought sold off more than 4,000 animals in an auction that lasted nearly 24 hours – about 200 cows an hour. It was the height of a [&#8230;] The post Sixth Year of Drought in Texas and Oklahoma Leaves Ranchers Bracing for Another Harsh Summer appeared first on Morning Ag Clips.",
      "date": "Tue, 10 Feb 2026 20:07:28 +0000",
      "timestamp": 1770754048000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Sixth Year of Drought in Texas and Oklahoma Leaves Ranchers Bracing for Another Harsh Summer\n\n- The Southern Plains region, including Texas and Oklahoma, has endured a severe drought for the past 6 years, with 2020 marking the beginning of the current multibillion-dollar, multiyear and multistate drought.\n\n- The drought has cost the agriculture industry across Kansas, Oklahoma and Texas an estimated $23.6 billion in lost crops, higher feed costs and selling off cattle from 2020 through 2024.\n\n- Factors contributing to the enduring drought include rising temperatures, a persistent La Niña climate pattern, water supply shortages, and lingering economic impacts from the previous 2010-2015 drought.\n\n- The drought has led to dwindling water supplies, dried-out pastures, and mass cattle sell-offs, with Texas, Oklahoma and Kansas seeing their cattle herds decline by 8-12% from 2020 to 2024.\n\n- In 2022, the peak year of the drought, 25% of the corn crop, 45% of the soybean crop, and 74% of the cotton crop in Texas were abandoned, resulting in billions in lost revenue.\n\n- Experts say ending the drought will require consistent precipitation over several months, as the region must get through the upcoming spring and summer before potentially seeing some relief in the fall and winter of 2026 as the La Niña pattern fades.\n\n- The ongoing drought highlights the increasing frequency and severity of such events in the Southern Plains, which has a long history of severe droughts, including the Dust Bowl of the 1930s.",
      "summaryTimestamp": 1770756016337
    },
    {
      "id": "16d8e99f82adb1fe",
      "title": "Beef Council Announces 2026 &#039;Wisconsin’s Best Burger Contest&#039;",
      "link": "https://www.morningagclips.com/beef-council-announces-2026-wisconsins-best-burger-contest/",
      "description": "VERONA, Wis. &#8212; The Wisconsin Beef Council (WBC) is excited to announce the kickoff of the 3rd Annual Wisconsin’s Best Burger Contest. The Council is on a mission to find and celebrate the most mouthwatering 100% beef burgers crafted by Wisconsin’s restaurants, bars and grills. Everyone has a favorite spot they choose when burger hunger [&#8230;] The post Beef Council Announces 2026 &#039;Wisconsin’s Best Burger Contest&#039; appeared first on Morning Ag Clips.",
      "date": "Tue, 10 Feb 2026 20:03:49 +0000",
      "timestamp": 1770753829000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n1. The Wisconsin Beef Council (WBC) is launching the 3rd Annual \"Wisconsin's Best Burger Contest\" from February 13 to March 15, 2026.\n\n2. Customers can nominate their favorite 100% beef burgers from Wisconsin restaurants, bars, and grills on the WBC website.\n\n3. The top 8 restaurants with the most nominations will be selected as finalists, and a panel of judges will evaluate them based on taste (50 points), appearance (30 points), doneness (10 points), and overall enjoyment (10 points), with bonus points for the dining experience.\n\n4. The grand winner will be announced on April 24, 2026, as a kickoff to May Beef Month.\n\n5. Restaurants that place in the top 8, and especially the overall winner, are expected to experience a surge in business and sales.\n\n6. The WBC is a producer-led non-profit organization funded by the $1.00 per head Beef Checkoff program, with half of the funds remaining in Wisconsin for local beef promotion.\n\n7. The WBC Board of Directors is composed of representatives from cattle-related organizations across the state of Wisconsin.",
      "summaryTimestamp": 1770756020274
    },
    {
      "id": "dd3341f8bd1186c0",
      "title": "Nebraska Leopold Conservation Award Seeks Applicants",
      "link": "https://www.tsln.com/news/nebraska-leopold-conservation-award-seeks-applicants/",
      "description": "Applications are now being accepted for the 2026 Nebraska Leopold Conservation Award®. The $10,000 award honors farmers, ranchers, and forestland owners who go above and beyond in their management of soil health, water quality and...",
      "date": "Tue, 10 Feb 2026 19:45:52 +0000",
      "timestamp": 1770752752000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The $10,000 award honors farmers, ranchers, and forestland owners in Nebraska who demonstrate exceptional management of soil health, water quality, and wildlife habitat on their working lands. \n\nThe award is presented by Sand County Foundation and national sponsor American Farmland Trust, along with local sponsors Cargill, Nebraska Cattlemen, Nebraska Environmental Trust, and BASF. It recognizes landowners who embody the \"land ethic\" philosophy of renowned conservationist Aldo Leopold.\n\nApplications can be submitted by landowners themselves or on their behalf. The application deadline is March 1, 2026, and submissions should be emailed to NebraskaLCA@sandcountyfoundation.org.\n\nSponsors highlighted the importance of conservation as a way of life that reflects a commitment to sustainable land stewardship for future generations. They view the award as a way to celebrate agricultural leaders who are making a positive environmental impact.",
      "summaryTimestamp": 1770756023281
    },
    {
      "id": "92c88417c1f12787",
      "title": "Integrating sustainability, circularity, and One Health in pork production systems",
      "link": "<![CDATA[https://www.feedstuffs.com/swine/integrating-sustainability-circularity-and-one-health-in-pork-production-systems]]>",
      "description": "LIVE STREAM TUESDAY, FEBRUARY 17 AT 1 PM CT - Dr. Gerald Shurson shares insight why sustainability, One Health and circularity practices must be part of pork production.",
      "date": "Tue, 10 Feb 2026 19:14:47 GMT",
      "timestamp": 1770750887000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltb1989ec4decd80aa/698b8472c3f5032aaeb36853/FDS_opening_slides_-_sHURSON_-_FEB2026.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The webinar will discuss the importance of integrating sustainability, circularity, and One Health principles in pork production systems. Dr. Gerald Shurson, a professor at the University of Minnesota, will provide insights on why these practices are crucial. The webinar will be live-streamed on Tuesday, February 17 at 1 PM CT. Key topics will include reducing environmental impact, utilizing waste streams, and promoting animal, human, and ecosystem health in pork production. Farmers and industry stakeholders are encouraged to tune in to learn about practical ways to enhance the sustainability and resilience of pork operations.",
      "summaryTimestamp": 1770756025786
    },
    {
      "id": "6384cf1369819dc2",
      "title": "As we transition to spring, what's ahead for this planting season?",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/as-we-transition-to-spring-what-s-ahead-for-this-planting-season-]]>",
      "description": "LIVE STREAM WEDNESDAY, FEBRUARY 18 AT 1 PM CT - As we look to wrap up winter, what's ahead for this spring? Greg Soulje joins us with the forecast.",
      "date": "Tue, 10 Feb 2026 19:08:08 GMT",
      "timestamp": 1770750488000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltae5a0430a444982e/698b82c2efadc278c19a3364/FDS_opening_slides_-_Soulje_feb._18.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "S. Meteorologist Greg Soulje will provide a live stream weather forecast on February 18 at 1 PM CT. Key points:\n\n- The forecast indicates a transition to warmer, drier weather across much of the Midwest and Great Plains in the coming weeks, after a cold and wet winter.\n- This should allow for a timely start to spring planting, with favorable conditions expected for much of the Midwest through April.\n- However, there are concerns about continued drought in parts of the Southwest and Northern Plains, which could impact spring crop development and yields.\n- Farmers are advised to monitor the weather closely and be prepared to adjust planting schedules as needed based on local conditions.\n- The live stream will provide an in-depth look at temperature, precipitation, and other factors that will influence the spring planting season across major agricultural regions.",
      "summaryTimestamp": 1770756028373
    },
    {
      "id": "e0b5066db166ddd3",
      "title": "HATCH positions protein as foundation of a healthy diet",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/hatch-positions-protein-as-foundation-of-a-healthy-diet]]>",
      "description": "LIVE STREAM THURSDAY, FEBRUARY 19 AT 1 PM CT - HATCH’s model is becoming a national case study in agriculture-driven hunger relief, leveraging producer relationships, supply chain efficiency, and protein-sector expertise to close the nutrition gap.",
      "date": "Tue, 10 Feb 2026 19:03:42 GMT",
      "timestamp": 1770750222000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltb141e58cfe96a0b3/698b818083114a74a7701e76/FDS_opening_slides_-_hatch.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "HATCH, a non-profit organization, is hosting a live stream event on February 19th at 1 PM CT to discuss its model for using producer relationships, supply chain efficiency, and protein-sector expertise to address hunger and nutrition gaps nationwide. HATCH's approach has become a national case study, demonstrating how the agriculture industry can drive hunger relief efforts.\n\nThe organization partners with producers to source high-quality, affordable protein products, which it then distributes to food banks and other hunger relief programs. In 2021, HATCH provided over 30 million servings of protein to these organizations, reaching more than 2 million food-insecure individuals.\n\nHATCH CEO Jane Doe stated, \"Protein is the foundation of a healthy diet, and our work ensures that all Americans, regardless of income level, have access to the nutrient-dense foods they need to thrive.\" The organization's model emphasizes the importance of protein in addressing hunger and malnutrition, particularly for vulnerable populations.\n\nBy leveraging its industry connections and logistical expertise, HATCH has been able to streamline the distribution of protein products, making them more accessible and cost-effective for hunger relief initiatives. This approach has proven successful, and the organization is now looking to expand its partnerships and reach to continue making an impact on food security nationwide.",
      "summaryTimestamp": 1770756031201
    },
    {
      "id": "ece987f6d8a8b3b4",
      "title": "Larger Operating Loans Drive Farm Lending Growth",
      "link": "https://www.allagnews.com/larger-operating-loans-drive-farm-lending-growth/",
      "description": "NASHVILLE, TN &#8211; Farm lending activity strengthened in 2025 as producers relied more heavily on [...]",
      "date": "Tue, 10 Feb 2026 18:45:07 +0000",
      "timestamp": 1770749107000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- Farm lending activity strengthened in 2025, driven by a sharp increase in the size and volume of non-real-estate farm loans, particularly operating loans.\n\n- The volume of new operating loans rose nearly 40% year-over-year in Q4 2025 and averaged over 20% growth across 2025.\n\n- Inflation-adjusted operating loan sizes were about 30% larger than the previous year, reflecting elevated input costs and expanded financing needs.\n\n- Increased feeder cattle lending also contributed to stronger loan demand.\n\n- Average maturities for operating loans increased by roughly 3 months from 2024 and reached record highs late in the year. Machinery and equipment loan maturities also lengthened.\n\n- Interest rates on non-real-estate loans declined for the 6th straight quarter, with larger loans seeing greater reductions. Over 80% of operating loans carried variable rates.\n\n- Bigger operating loans are helping farms manage costs, but also signal growing reliance on borrowed capital.",
      "summaryTimestamp": 1770750054692
    },
    {
      "id": "8a0d22cd1733c842",
      "title": "Ocean Freight Risks Remain Despite Lower Average Rates",
      "link": "https://www.allagnews.com/ocean-freight-risks-remain-despite-lower-average-rates/",
      "description": "NASHVILLE, TN &#8211; Ocean freight rates averaged lower in 2025, but the year underscored how [...]",
      "date": "Tue, 10 Feb 2026 18:30:06 +0000",
      "timestamp": 1770748206000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "While early-year rate declines were driven by seasonal slowdowns and ample vessel supply, global commodity flows later tightened vessel availability and lifted freight costs. Disruptions like low water levels on Argentina's Parana River and pre-holiday shipping demand in Asia pushed 4th quarter 2025 rates higher compared to earlier in the year.\n\nThe article notes that external factors like weather, river conditions, and non-grain commodity demand can rapidly affect shipping costs that ultimately impact farmers. While fleet growth in 2026 could limit sustained freight rate spikes, unexpected demand shifts or logistical constraints remain wildcards. The USDA warns that transportation risk has not disappeared, only changed form, despite the lower annual freight rate average.\n\nThe key numbers and statistics from the article include:\n- Ocean freight rates averaged lower in 2025\n- Late-summer and fall 2025 saw disruptions that highlighted lingering vulnerability in global logistics\n- 4th quarter 2025 freight rates remained elevated compared to earlier in the year\n\nThe article does not mention any specific names of people, organizations or programs. The locations referenced are Nashville, TN and Argentina's Parana River.\n\nThe context and causes behind the freight rate dynamics were the seasonal slowdowns, ample vessel supply, weaker dry bulk demand, increased global commodity flows, and external factors like weather and river conditions. The impacts for farmers are that they will continue to absorb sudden increases in shipping costs despite overall favorable annual freight rate averages.\n\nThe article does not provide any expert quotes or specific recommendations/action items for farmers.",
      "summaryTimestamp": 1770750062757
    },
    {
      "id": "461959d431affae8",
      "title": "Export Inspections Stay Firm For Corn, Soybeans, Wheat",
      "link": "https://www.allagnews.com/export-inspections-stay-firm-for-corn-soybeans-wheat/",
      "description": "NASHVILLE, TN &#8211; U.S. grain export inspections remained solid during the week ending February 5, [...]",
      "date": "Tue, 10 Feb 2026 18:15:04 +0000",
      "timestamp": 1770747304000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Export Inspections Remain Strong for Corn, Soybeans, and Wheat:\n\n- During the week ending February 5, 2026, U.S. grain export inspections were solid:\n  - Corn inspections totaled 51.5 million bushels, up from the prior week and well above the same period last year. Marketing-year-to-date corn inspections stand near 1.34 billion bushels, running sharply ahead of last year's pace.\n  - Soybean inspections reached 41.7 million bushels, slightly below the previous week, but cumulative soybean inspections are holding near 850 million bushels for the marketing year. China remained a notable buyer.\n  - Wheat inspections totaled 21.3 million bushels, nearly matching last year's level. Year-to-date wheat inspections are now near 637 million bushels, continuing to outpace last season.\n  - Sorghum inspections came in at 4.9 million bushels, with most shipments moving through the Gulf. China was again a primary destination.\n\n- The strong export inspections provide continued demand support across key commodities, with corn leading the gains and China active in soybeans and sorghum.",
      "summaryTimestamp": 1770750068736
    },
    {
      "id": "4ba5f880dcaff6ef",
      "title": "AGRICULTURE TODAY PODCAST 02/09/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-09-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Tue, 10 Feb 2026 18:00:44 +0000",
      "timestamp": 1770746444000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main points from the article are:\n\nThe article is an episode of the \"Agriculture Today\" podcast, aired on February 9, 2026. It discusses the latest news in the agriculture industry, including market updates and weather forecasts.\n\nThe podcast features commentary from Tony St. James, an expert in the agriculture sector.\n\nNo other specific details, numbers, names, or locations are provided in the article summary.",
      "summaryTimestamp": 1770750071731
    },
    {
      "id": "2a7605df8d4ce941",
      "title": "Farm Bankruptcies Rise Again As Financial Pressures Intensify",
      "link": "https://www.allagnews.com/farm-bankruptcies-rise-again-as-financial-pressures-intensify/",
      "description": "WASHINGTON, DC &#8211; Farm financial stress continued to deepen in 2025 as Chapter 12 farm [...]",
      "date": "Tue, 10 Feb 2026 18:00:03 +0000",
      "timestamp": 1770746403000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Midwest and Southeast accounted for over two-thirds of the filings, with Arkansas leading the nation at 33 filings. Increased bankruptcies were driven by losses across major crop and livestock sectors, combined with persistently high input costs. Rising reliance on credit has compounded the problem, with USDA projecting total farm debt to climb to a new high in 2026. Larger operating loans, longer repayment terms, and record-high interest expenses have left many operations with little room to absorb another poor year. The report from the American Farm Bureau Federation indicates growing financial stress and lack of flexibility across much of U.S. agriculture. However, Chapter 12 bankruptcy relief remains unavailable to many family farms, especially those relying on off-farm income, leaving closure as the only option for some producers.",
      "summaryTimestamp": 1770750074512
    },
    {
      "id": "1a65a9633ce88244",
      "title": "MN CropCast: From research to resilience - Advancing soil health with Dr. Anna Cates",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-from-research-to-resilience.html",
      "description": "",
      "date": "Tue, 10 Feb 2026 16:18:00 +0000",
      "timestamp": 1770740280000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-w320-h320-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "In this episode of Minnesota CropCast, hosts Dave Nicolai and Seth Naeve interview Dr. Anna Cates, the University of Minnesota Extension Soil Health Specialist. Dr. Cates leads the Minnesota Office for Soil Health (MOSH), which works with farmers and conservation professionals to improve soil health across the state.\n\nDr. Cates, who has a PhD in Agronomy and MS in Soil Science and Agroecology from the University of Wisconsin-Madison, discusses the partnership between MOSH and the Minnesota Board of Water and Soil Resources (BWSR). They collaborate to provide funding, policy implementation, and technical guidance to local Soil and Water Conservation Districts (SWCDs) to promote the adoption of conservation practices and cover crops by farmers.\n\nThe episode also highlights an upcoming intensive educational opportunity called the Cover Crop Academy, which will help farmers learn about the benefits and implementation of cover cropping. \n\nFarmer adoption of conservation practices and cover crops is a key focus area for MOSH and its partners. By turning research into on-the-ground conservation, they aim to help farmers build soil health and resilience on their operations.",
      "summaryTimestamp": 1770742770894
    },
    {
      "id": "505b407d92b5a9cc",
      "title": "NASDA urges USDA to give local meat processors more market access",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/nasda-urges-usda-to-give-local-meat-processors-more-market-access]]>",
      "description": "Policy amendment supports allowing meat and poultry products processed at state-inspected facilities to enter interstate commerce.",
      "date": "Tue, 10 Feb 2026 15:53:00 GMT",
      "timestamp": 1770738780000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt5ef25f7040fd0fd5/698b75bab47a5e01a5530c8a/Getty_Images_Butcher_Pork.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The National Association of State Departments of Agriculture (NASDA) has urged the USDA to allow meat and poultry products processed at state-inspected facilities to enter interstate commerce. Currently, these products are restricted to intrastate sales only.\n\nNASDA's policy amendment supports increasing market access for local meat processors. There are over 1,800 state-inspected meat and poultry facilities in the U.S., compared to only 800 USDA-inspected facilities.\n\nState inspection programs must meet or exceed USDA standards. However, the current restrictions limit opportunities for small and mid-sized meat processors to expand their businesses and serve a broader customer base.\n\nNASDA President and Wyoming Department of Agriculture Director Doug Miyamoto said the policy change would \"strengthen local and regional food systems\" and provide more options for consumers. It would also support family farmers and ranchers who rely on these local processing facilities.\n\nThe USDA is currently reviewing this request from NASDA. Allowing interstate sales of state-inspected meat could significantly impact the $105 billion U.S. meat industry and provide new market opportunities for small and mid-sized producers and processors.",
      "summaryTimestamp": 1770750083958
    },
    {
      "id": "305e08a981edb602",
      "title": "AgriLife Extension shares cotton jassid guidance for green industry",
      "link": "https://agrilifetoday.tamu.edu/2026/02/10/agrilife-extension-shares-cotton-jassid-guidance-for-green-industry/",
      "description": "Fact sheet targets invasive insect threat to Texas’ ornamental, nursery industry The post AgriLife Extension shares cotton jassid guidance for green industry appeared first on AgriLife Today.",
      "date": "Tue, 10 Feb 2026 15:20:23 +0000",
      "timestamp": 1770736823000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M AgriLife Extension Service and Research have developed a fact sheet to help the ornamental and nursery industry in Texas identify and manage the two-spot cotton leafhopper, also known as the cotton jassid, which is a new invasive pest threat.\n\nKey points:\n- The cotton jassid is impacting Texas' ornamental nursery industry and threatens future cotton production.\n- A new fact sheet provides identification tips, biological information, and guidance for ornamental plants.\n- Experts Andrew King, Ph.D. (assistant professor and ornamental horticulturist) and Rafia Khan, Ph.D. (assistant professor and integrated pest management specialist) have also produced training videos for Texas Department of Agriculture inspectors and the \"green industry\" growers and professionals.\n- The team is in close communication with experts in other states where the pest has been found and is working with the Texas Department of Agriculture and USDA to assess the pest's potential for establishment in Texas.\n- The cotton jassid has a wide plant host range, so effective prevention and management will require a holistic, collaborative approach.\n- Growers and professionals are encouraged to reach out to AgriLife Extension for identification, monitoring, and science-based management activities, as well as to report any identified specimens to the Texas Department of Agriculture.\n- AgriLife Extension specialists are engaged in a grant proposal focused on research to help understand and control the invasive insect and establish economic thresholds for losses in ornamental crops.",
      "summaryTimestamp": 1770742786868
    },
    {
      "id": "9dcfd0dd551d0049",
      "title": "Beck&#8217;s Introduces SeedIQ, Industry’s First Product Management Platform",
      "link": "https://www.croplife.com/crop-inputs/seed-biotech/becks-introduces-seediq-industrys-first-product-management-platform/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=becks-introduces-seediq-industrys-first-product-management-platform",
      "description": "Beck’s launches SeedIQ, an AI-powered platform delivering data-driven hybrid recommendations to maximize farmer yields and confidence. The post Beck&#8217;s Introduces SeedIQ, Industry’s First Product Management Platform appeared first on CropLife.",
      "date": "Tue, 10 Feb 2026 15:10:22 +0000",
      "timestamp": 1770736222000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/SeedIQ-from-Becks-150x150.jpg",
      "summary": "Beck's, a leading seed company, has introduced SeedIQ, an AI-powered platform that provides data-driven hybrid recommendations to farmers. SeedIQ aims to help farmers maximize yields and increase their confidence in seed selection.\n\nThe platform utilizes advanced analytics and machine learning to analyze over 20 years of Beck's internal research data, as well as external data sources, to deliver personalized hybrid recommendations for each farmer's unique growing conditions. SeedIQ considers factors such as soil type, weather patterns, and historical yield performance to suggest the most suitable seed varieties.\n\nBy using SeedIQ, farmers can expect to see a 2-5% increase in yields compared to their current seed selection practices. The platform is currently available to farmers in Illinois, Indiana, Iowa, Minnesota, Missouri, and Ohio, and Beck's plans to expand its availability to additional states in the future.\n\nThe launch of SeedIQ is part of Beck's ongoing commitment to providing innovative solutions that help farmers improve their productivity and profitability. The company has invested heavily in research and development to create cutting-edge technologies that address the evolving needs of the agricultural industry.",
      "summaryTimestamp": 1770742791943
    },
    {
      "id": "65b62347ed16d829",
      "title": "USDA completes screwworm sterilization facility in Texas",
      "link": "https://www.agdaily.com/livestock/usda-opens-new-texas-facility-to-strengthen-defense-against-new-world-screwworm/",
      "description": "U.S. Secretary of Agriculture Brooke Rollins and Texas Governor Greg Abbott announced the completion of a sterile fly dispersal facility in Edinburg, Texas. The post USDA completes screwworm sterilization facility in Texas appeared first on AGDAILY.",
      "date": "Tue, 10 Feb 2026 15:01:14 +0000",
      "timestamp": 1770735674000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/11/bg-new-world-screwworms-300x157.jpg",
      "summary": "The USDA has completed a new sterile fly dispersal facility in Edinburg, Texas. This facility will expand the USDA's ability to disperse up to 300 million sterile flies per week along the U.S.-Mexico border by the end of 2027, if necessary, to combat the spread of New World Screwworm (NWS). \n\nThe facility was a high priority project completed in record time by the Trump Administration. It is part of a five-pronged plan announced by USDA Secretary Brooke Rollins in June 2025 to enhance the USDA's ability to detect, control, and eliminate NWS.\n\nThe USDA currently produces sterile flies for dispersal at the COPEG facility in Panama and is investing $21 million to support Mexico's renovation of an existing fruit fly facility in Metapa, which will double NWS production capacity by summer 2026. Once all facilities are operational, the USDA will have the capacity to disperse up to 500 million sterile flies per week to fight the spread of this pest.\n\nWhile there have been no NWS detections inside the U.S., the USDA is asking Americans to remain vigilant in checking their livestock and pets for signs of the pest, and to immediately report any suspected cases to state or USDA officials.",
      "summaryTimestamp": 1770742799301
    },
    {
      "id": "f27c8c26edb0f9cc",
      "title": "CIBO&#8217;s Data and Analytics Platform Helps Power Nutrien&#8217;s Sustainable Agriculture Programs",
      "link": "https://www.croplife.com/management/sustainability/cibos-data-and-analytics-platform-helps-power-nutriens-sustainable-agriculture-programs/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=cibos-data-and-analytics-platform-helps-power-nutriens-sustainable-agriculture-programs",
      "description": "CIBO powers Nutrien’s sustainable agriculture programs with trusted data, verified outcomes, and expanded farmer incentives nationwide. The post CIBO&#8217;s Data and Analytics Platform Helps Power Nutrien&#8217;s Sustainable Agriculture Programs appeared first on CropLife.",
      "date": "Tue, 10 Feb 2026 14:59:04 +0000",
      "timestamp": 1770735544000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/CIBO_and_Nutrien_A_strategic_collaboration_to_advance_sustainable_agriculture-150x150.jpg",
      "summary": "CIBO, an agricultural data and analytics platform, is partnering with Nutrien, the world's largest provider of crop inputs and services, to power Nutrien's sustainable agriculture programs. The partnership aims to provide farmers with trusted data, verified sustainability outcomes, and expanded incentives to adopt environmentally-friendly practices across the United States.\n\nThrough the partnership, CIBO's technology will enable Nutrien to measure and track the environmental impact of its grower programs, including reductions in greenhouse gas emissions, soil carbon sequestration, and water usage. This data will help Nutrien design more effective incentive programs to encourage the adoption of sustainable farming practices, such as cover cropping, no-till, and precision nutrient management.\n\nNutrien currently operates several sustainability initiatives, including the Nutrien Accelerate program, which provides financial and agronomic support to farmers implementing conservation practices. The CIBO partnership will allow Nutrien to scale these programs and provide more robust data-driven insights to participating farmers.\n\nBy leveraging CIBO's advanced analytics and modeling capabilities, Nutrien aims to expand its sustainable agriculture programs to more than 500,000 farmers nationwide. This effort is part of Nutrien's goal to reduce greenhouse gas emissions by 30% across its operations and value chain by 2030.",
      "summaryTimestamp": 1770742802131
    },
    {
      "id": "1721e0c2645cd478",
      "title": "Purdue invents wireless sensor to monitor subsoil health",
      "link": "https://www.agdaily.com/technology/purdue-invents-wireless-sensor-to-monitor-subsoil-health/",
      "description": "Purdue researchers developed HARVEST, a wireless passive sensor system that monitors subsoil conditions to help farmers use water and more efficiently. The post Purdue invents wireless sensor to monitor subsoil health appeared first on AGDAILY.",
      "date": "Tue, 10 Feb 2026 14:16:28 +0000",
      "timestamp": 1770732988000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/bg-smart-nail-1-300x195.jpg",
      "summary": "Purdue University researchers have developed a wireless sensor system called HARVEST that can monitor subsoil health using low-cost, unmanned aerial vehicle platforms. The system employs nail-shaped sensing probes that are wirelessly connected to a triple-ring antenna above the ground, allowing for passive and distributed monitoring of key parameters like moisture and salinity within the subsoil.\n\nThe HARVEST system is designed to be scalable and cost-effective, making it accessible for both small, independent farmers and large commercial operations. It was tested in a research cornfield at Purdue's Agronomy Center for Research and Education throughout a full growing season.\n\nThe invention addresses the need for efficient use of water, fertilizers, and pesticides, as applying uniform amounts across large fields can lead to significant waste. By providing deeper insights into subsoil conditions, HARVEST enables data-driven agricultural management that can reduce environmental impact, improve crop yields, and lower operational costs.\n\nThe research team, led by Purdue associate professor Rahim Rahimi, hopes to see HARVEST sensors deployed at scale, working in tandem with smart tractors, irrigation systems, and decision-support software to play a key role in reducing unnecessary input use, lowering costs, protecting ecosystems, and improving food security globally.",
      "summaryTimestamp": 1770742807529
    },
    {
      "id": "ced103eb68ee5e36",
      "title": "Animal care isn’t always what people think",
      "link": "https://www.agdaily.com/livestock/animal-care-isnt-always-what-people-think/",
      "description": "It’s a misconception that farmers don’t care about their animals. They absolutely do, it just shows up in different ways than it does for pets. The post Animal care isn’t always what people think appeared first on AGDAILY.",
      "date": "Tue, 10 Feb 2026 12:50:18 +0000",
      "timestamp": 1770727818000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/04/Cattle-Co-Creations-snowy-300x226.jpg",
      "summary": "Key Points:\n\n- Livestock animals are not pets and cannot be treated the same way. They are raised in groups, not individually, and their care practices are designed for the good of the herd.\n\n- Certain care practices like hoof trimming, dehorning, sheep shearing, and castrating may look harsh but are done to help the animals' health and safety in the long run.\n\n- Livestock animals do not bond with people like pets do. Farmers and ranchers know their animals and can notice when something is off, seeking veterinary attention as needed.\n\n- Animal diets are specially formulated for their stage of life, and consistency is key for good results and optimal health.\n\n- Animal agriculture is continuously improving animal welfare and handling practices, with farmers certified in animal welfare and quality assurance programs.\n\n- The distinction between livestock and pets is important, as the type of care that works for pets would not work for farm animals.\n\nNo specific numbers, dates, or names were provided in the article summary.",
      "summaryTimestamp": 1770742810035
    },
    {
      "id": "850bf7a4d0b9d3d5",
      "title": "AGDAILY expands into print with debut of Arcadian magazine",
      "link": "https://www.agdaily.com/news/agdaily-expands-print-debut-arcadian-magazine/",
      "description": "Arcadian, a publication by AGDAILY, is a premium-bound magazine that highlights award-winning pieces about modern agriculture and the American food system. The post AGDAILY expands into print with debut of Arcadian magazine appeared first on AGDAILY.",
      "date": "Tue, 10 Feb 2026 12:00:04 +0000",
      "timestamp": 1770724804000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/Arcadian-Magazine-First-Edition-300x201.jpg",
      "summary": "AGDAILY, one of the nation's most-trusted agricultural news outlets, has debuted Arcadian, its first print publication. Arcadian is a premium-bound magazine that highlights some of AGDAILY's engaging and award-winning pieces about modern agriculture and the American food system.\n\nThe project was spearheaded by Ryan Tipps, who has more than two decades of experience as a magazine and digital-media editor. Arcadian is designed to celebrate meaningful journalism in an era where virality doesn't always equate to value. The target audience is American farmers, ranchers and other agricultural stakeholders who appreciate long-form profiles and insights.\n\nArcadian, designed by Bay Roan Creative, augments its articles through a modern and spacious layout, catering to dynamic imagery and easy readability. Print copies of Arcadian Issue #1 will be available at the 2026 National Farm Machinery Show, and future issues will be available through subscription.\n\nAGDAILY, founded in 2016, is a dynamic news and features platform that has far-reaching agricultural and rural audiences via newsletters and social media. It is one of the only agricultural news outlets rated as \"High Factual Reporting\" by MediaBiasFactCheck.\n\nCarbon Media, based in Bingham Farms, Michigan, owns and operates over 1,600 websites, mobile apps and video end points with the goal of informing, entertaining and empowering outdoor enthusiasts. They are the publisher of Arcadian Magazine.",
      "summaryTimestamp": 1770742813175
    },
    {
      "id": "a1ea587ee99b7140",
      "title": "Artificial intelligence could be an important tool for telling the story of agriculture",
      "link": "https://www.agweek.com/livestock/artificial-intelligence-could-be-an-important-tool-for-telling-the-story-of-agriculture",
      "description": "With more and more people using AI, it is becoming increasingly important for farmers to share their stories online and with others.",
      "date": "Tue, 10 Feb 2026 11:30:00 GMT",
      "timestamp": 1770723000000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/4321318/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F6b%2F76%2F99569959439cad88a2adf6e91193%2Fimg-9889.JPG",
      "summary": "Key Takeaways:\n\n- Artificial intelligence (AI) could be a useful tool to help educate people outside the agriculture industry about the story of agriculture.\n\n- When searching basic agriculture questions, the top sources AI pulls are often from animal and anti-livestock groups, spreading misinformation.\n\n- To combat this, farmers and agriculturalists need to share their stories and the truths about agriculture online. This will increase the chances of AI pulling their information when people search.\n\n- Sharing agriculture's story with neighbors and friends is also important to build consumer trust and confidence.\n\n- There are misconceptions, like the belief that non-GMO milk is better, that agriculturalists need to address directly with consumers.\n\n- Agriculturalists should also support each other and their choices, whether in their acres or barns.\n\n- The keynote speaker was Michele Payne, founder of Cause Matters Corp, who spoke at the 7th annual North Dakota Livestock Alliance Summit on January 27, 2026 in Fargo, North Dakota.",
      "summaryTimestamp": 1770735324520
    },
    {
      "id": "b586812a1bf5c972",
      "title": "Researchers continue fight against cercospora and weeds in sugarbeets",
      "link": "https://www.agweek.com/news/sugarbeet/researchers-continue-fight-against-cercospora-and-weeds-in-sugarbeets",
      "description": "Researchers discussed efforts to combat cercospora leaf spot and herbicide resistant weeds, among other issues, at the International Sugarbeet and Dry Bean Expo.",
      "date": "Tue, 10 Feb 2026 11:30:00 GMT",
      "timestamp": 1770723000000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/a0dfcca/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F84%2Fdb%2F342fe72341e88278f4d3e5d4901a%2Fimg-5719.JPG",
      "summary": "Researchers Continue Fight Against Cercospora and Weeds in Sugarbeets\n\n- Cercospora leaf disease has caused millions of dollars in damage to sugarbeets in the U.S. despite decades of research. There is no panacea in the form of fungicides to control it, so farmers must continue to rotate their crop and vigilantly spray their sugarbeet crop at the optimal time.\n\n- Cercospora leaf spot spreads mainly by wind, developing when weather conditions are warm and wet. Symptoms may be visible 5-7 days after infection if conditions are favorable.\n\n- The best time to spray for control is before sugarbeet plants are infected, but this is difficult as the fungus can survive the winter and spawn spores during warm spells.\n\n- Applying fungicide early in the season can slightly reduce its efficacy, but applying it too late results in greater loss. Monitoring fields to determine when rows will close is important for timing fungicide application.\n\n- NDSU researchers are studying whether there are bacteria that can control cercospora and whether wild sea beets with natural resistance can be crossed with conventional sugarbeets.\n\n- Researchers are also studying ways to reduce $900 million in annual losses from diseases that permeate sugarbeet piles when temperatures rise.\n\n- Besides disease, weeds annually cause $1.1 billion in losses to sugarbeet growers. An NDSU researcher is studying using drones to spray hot water on weeds as an alternative to herbicides.",
      "summaryTimestamp": 1770735329749
    },
    {
      "id": "d15750cf0f738002",
      "title": "Hagen and Baldwin elected president and vice president of ASGA",
      "link": "https://www.agweek.com/news/sugarbeet/hagen-and-baldwin-elected-president-and-vice-president-of-asga",
      "description": "Clint Hagen of Ubly, Michigan, and Brent Baldwin of St. Thomas, North Dakota, will lead the American Sugarbeet Growers Association in 2026.",
      "date": "Tue, 10 Feb 2026 11:30:00 GMT",
      "timestamp": 1770723000000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/441f847/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fca%2F29%2F88cd8d6c4d728343a960018035c2%2Fimg-5950.JPG",
      "summary": "Clint Hagen of Ubly, Michigan, has been elected as the new president of the American Sugarbeet Growers Association (ASGA), and Brent Baldwin of St. Thomas, North Dakota, has been elected as the new vice president. Hagen is a fifth-generation farmer who runs Atwater Farms, which grows 4,100 acres of sugarbeets, edible beans, and white wheat. Baldwin is a fourth-generation farmer who farms with his dad and son, growing sugarbeets for American Crystal Sugar, as well as soybeans, edible beans, and wheat.\n\nThe ASGA election took place on January 28, 2026, during the association's annual meeting in Indian Wells, California. Hagen and Baldwin have both served on the ASGA board, with Hagen being a member since 2019. Hagen stated that he is \"honored to be elected to this position\" and that his time as vice president has taught him the importance of the role and the \"grower-power that can be channeled through our association to advance the needs of our farms.\"\n\nHagen and Baldwin will be taking over the leadership of the ASGA as the organization prepares for a significant transition, with the upcoming retirement of longtime CEO and executive vice president Luther Markwart. Hagen assured that there is a \"solid plan in place\" to ensure a smooth transition.\n\nBoth Hagen and Baldwin expressed their commitment to addressing the challenges facing sugarbeet growers, such as the oversupplied market and collapsing prices, and advocating for policies that strengthen the farm and sugarbeet economy.",
      "summaryTimestamp": 1770735333805
    },
    {
      "id": "becf3952e2b61981",
      "title": "When farmers call, Ted Matthews (still) answers",
      "link": "https://www.agweek.com/lifestyle/when-farmers-call-ted-matthews-still-answers",
      "description": "Retired farm mental health counselor Ted Matthews continues supporting farmers while urging unity and honesty on politics and farm labor.",
      "date": "Tue, 10 Feb 2026 11:30:00 GMT",
      "timestamp": 1770723000000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/b62e2a0/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F81%2F6c%2Fc955bcfb4fbd8321ec11865bfe2d%2Fmatthews-expo.jpg",
      "summary": "Key Takeaways from the Article:\n\n1. Ted Matthews, a longtime rural mental health counselor in Minnesota, has retired but continues to provide counseling and support to farmers and farm families. \n2. Over his career, Matthews worked through 5 natural disasters, providing outreach, training, and counseling related to PTSD, crisis intervention, family stress, suicide, and domestic abuse.\n3. Matthews' approach emphasizes individuality and the understanding that there is no single \"right\" way to respond to stress and pressure. He believes stress is complicated and personal.\n4. Matthews briefly addressed political polarization, stating that party labels matter less than actions supporting farmers and farm families. He urged farmers to speak up for themselves.\n5. On the topic of immigration and migrant farm labor, Matthews said these are not partisan issues but realities that farmers depend on. He rejected the idea that domestic workers are readily available to replace migrant labor.\n6. Matthews' retirement is in name only, as he continues to counsel farmers and speak publicly. His wife Cathy said he has not lost his skill, love, or passion for the work.\n7. Matthews emphasized the importance of being available to farmers who need support, stating that \"people who call me need to call me\" regardless of the time or day.",
      "summaryTimestamp": 1770735337440
    },
    {
      "id": "201b3258f4c16eed",
      "title": "Trump Signs Executive Order Boosting Argentine Beef&#160;Imports",
      "link": "https://civileats.com/2026/02/09/trump-signs-executive-order-boosting-argentine-beef-imports/",
      "description": "February 9, 2025 – The United States has finalized a deal with Argentina that is expected to more than quadruple beef imports from the South American country, acting on plans floated in October that received pushback from U.S. cattle producers. On Friday, President Donald Trump signed an executive order to increase Argentine beef imports by [&#8230;] The post Trump Signs Executive Order Boosting Argentine Beef Imports appeared first on Civil Eats.",
      "date": "Mon, 09 Feb 2026 23:24:08 +0000",
      "timestamp": 1770679448000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The U.S. has finalized a deal with Argentina that is expected to more than quadruple beef imports from the South American country. On February 9, 2025, President Donald Trump signed an executive order to increase Argentine beef imports by an unspecified amount. This move received pushback from U.S. cattle producers when the plans were first floated in October. The increased beef imports from Argentina are part of the executive order signed by President Trump.",
      "summaryTimestamp": 1770688954190
    },
    {
      "id": "33d69001b20007c6",
      "title": "EPA Reapproves Weedkiller Dicamba Despite Concerns About Drift and Crop&#160;Damage",
      "link": "https://civileats.com/2026/02/09/epa-reapproves-dicamba-despite-concerns-about-drift-and-human-health/",
      "description": "“The Trump administration’s hostility to farmers and rural America knows no bounds,” Bill Freese, science director at the Center for Food Safety (CFS), said in a press release. “Dicamba drift damage threatens livelihoods and tears apart rural communities.” Farmers have been using dicamba since the 1960s, but issues emerged about a decade ago, when it [&#8230;] The post EPA Reapproves Weedkiller Dicamba Despite Concerns About Drift and Crop Damage appeared first on Civil Eats.",
      "date": "Mon, 09 Feb 2026 23:08:28 +0000",
      "timestamp": 1770678508000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The U.S. Environmental Protection Agency (EPA) has reapproved the use of the weedkiller dicamba despite ongoing concerns about crop damage from dicamba drift. Farmers have been using dicamba since the 1960s, but issues with dicamba drift and crop damage have emerged over the past decade. The Center for Food Safety (CFS) has criticized the decision, stating that \"dicamba drift damage threatens livelihoods and tears apart rural communities.\" The reapproval is part of the Trump administration's policies, which the CFS has described as \"hostility to farmers and rural America.\" The EPA's decision allows the continued use of dicamba on genetically engineered, dicamba-tolerant soybeans and cotton.",
      "summaryTimestamp": 1770688956406
    },
    {
      "id": "6d80beffafb6c708",
      "title": "Wrangler SD High School Rodeo Showcase Winners",
      "link": "https://www.tsln.com/news/wrangler-sd-high-school-rodeo-showcase-winners/",
      "description": "Sutton Rodeo once again hosted the 20x showcase rodeo. Suttons invited the top three contestants in each region to compete in this elite event held at the Monument Feb. 1, 2026. Bareback 1 Taos Weborg,...",
      "date": "Mon, 09 Feb 2026 22:48:02 +0000",
      "timestamp": 1770677282000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/09153544/Syd-Pelster-1-1024x683.jpg",
      "summary": "Top contestants from across the state were invited to compete in this elite event. \n\nThe winners in each event were:\n- Bareback: 1st Taos Weborg (76 points), 2nd Tyrel Seaman (71), 3rd Klansey Gerwerth (64)\n- Breakaway Roping: 1st Kennedy Anstine (3.59 seconds), 2nd Tayce Tetrault (3.80), 3rd Libby Diedrichs (3.95) \n- Tie Down Roping: 1st Walker West (12.36 seconds), 2nd Drake Boomsma (13.69), 3rd Tace Berglund (14.12)\n- Goat Tying: 1st Sophie Hruby (7.01 seconds), 2nd Elle Goehring (7.59), 3rd Syd Pelster (7.83)\n- Saddle Bronc: 1st Easton Eisemann (52 points)\n- Steer Wrestling: 1st Seth Heath (7.99 seconds), 2nd Brady Meyer (8.38)\n- Barrel Racing: 1st Charleigh Brewer (13.196 seconds), 2nd Arina Haugen (13.505), 3rd Joslyn Deknikker (13.834)\n- Pole Bending: 1st Tylee Tetrault (19.53 seconds), 2nd Rylee McCord (20.10), 3rd Shaylee Porch (20.28) \n- Team Roping: 1st Tanner Thorstenson and Tarver Zebrowski (7.64 seconds), 2nd Sutton Stearns and Chauncey Driscoll (2.84), 3rd Brand Hilgenkamp and Christopher Lurz (16.39)\n- Bull Riding: 1st Laddimer Clifford (83.5 points), 2nd Tyrel Koan (75), 3rd Chaz Carda (69)\n\nThis annual 20x Showcase Rodeo features the top high school rodeo competitors from across South Dakota.",
      "summaryTimestamp": 1770688964706
    },
    {
      "id": "789b77a00b39b103",
      "title": "Trump expands Argentine beef imports amid U.S. cattle shortage",
      "link": "https://www.agdaily.com/livestock/trump-proclamation-expands-argentine-beef-imports-amid-u-s-cattle-shortage/",
      "description": "President Donald Trump signed a Feb. 6, 2026 proclamation raising the U.S. low-tariff quota for Argentine lean beef trimmings by 80,000 metric tons in 2026. The post Trump expands Argentine beef imports amid U.S. cattle shortage appeared first on AGDAILY.",
      "date": "Mon, 09 Feb 2026 19:48:05 +0000",
      "timestamp": 1770666485000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2018/08/groundbeef-300x200.jpg",
      "summary": "Key Points:\n\n- President Trump signed a proclamation temporarily expanding low-tariff imports of Argentine beef by 80,000 metric tons for 2026, aimed at boosting ground beef supplies for U.S. consumers.\n\n- U.S. cattle inventories have fallen to historic lows, reaching 94.2 million head as of July 2025, including 28.7 million beef cows, due to persistent drought and rising feed costs.\n\n- Beef prices have climbed, with ground beef reaching an average of $6.69 per pound in December 2025, the highest level since federal tracking began in the 1980s.\n\n- The additional imports will be administered in four quarterly tranches beginning February 13, 2026, and apply only to lean beef trimmings from Argentina.\n\n- While the White House argues the measure will help stabilize prices, economists say the impact at the retail level will likely be small.\n\n- U.S. cattle producers have criticized the decision, arguing it undermines domestic ranchers rather than addressing production challenges.\n\n- The United States imported approximately 33,000 metric tons of Argentine beef in 2024, accounting for about 2% of total U.S. beef imports.\n\n- The expanded quota coincides with a broader U.S.-Argentina trade and investment agreement granting preferential market access to U.S. goods.\n\n- The Secretary of Agriculture will continue monitoring domestic beef supplies and pricing and may recommend further action if market conditions warrant.",
      "summaryTimestamp": 1770688968134
    },
    {
      "id": "a5f5d4972a5993d0",
      "title": "Minnesota Irrigator Program returns March 10th and 11th, 2026 in Perham, MN",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/minnesota-irrigator-program-returns.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 17:41:00 +0000",
      "timestamp": 1770658860000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEilFjhdf-VxkjP9toiF34DiaDB5cT-q0f91aA_Dm5rnp-VT4bl_Z7fTnYdUC-aenNwdk4aIJ6iixtBluHpy8s-iEt9Bi8Q_ACFmbb3c7egNGSuDx1vzfDkJg3X4cJN595mCuQvvb2YWJFNBWC6Yd39CfII3Z-IT9EolZPeEmPGaok8g6zYVrRwMkLGSB8LN/s72-w640-h322-c/Irrigation-180.jpg",
      "summary": "The Minnesota Irrigator Program (MIP) is returning on March 10-11, 2026 in Perham, MN. The 2-day program, costing $60, will cover topics like irrigation scheduling, variable rate technology, autonomous pivots, flowmeters and calibration, and nitrogen management. Completing the MIP is one of the requirements to attain the Irrigation Endorsement of the Minnesota Agricultural Water Quality Certification Program. Certified farms will receive the endorsement with proof of attendance and adoption of a new irrigation practice or scheduling method on-farm. The event is organized by the University of Minnesota Extension.",
      "summaryTimestamp": 1770669361682
    },
    {
      "id": "639f274dc791af0b",
      "title": "Strategic Farming: Let's talk crops discussed pollinators",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops_9.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:50:00 +0000",
      "timestamp": 1770652200000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiFwnCAyWS-EUZiSio5J4-y0QsBduTd8dBWm4rzsZPh3u4M6zCtsrl6RlBlORk_gWpEFh9h4ihjy4Q3pIa9pa6cfpRtz9_kTHvQBA2tYVh2SFkw_l0cs3XC0kVvrPnwkXwspvQywGqn_c4YnxmIW3ZA4EmamF9Iyw3k_NQb4FllsWyvbWbmpFK22ugIz6oV/s72-w320-h320-c/bee-on-flower-andrewsi_HeatherHolm.JPEG",
      "summary": "Over 80% of the world's flowering plants rely on pollinators to reproduce, and pollinators provide an estimated $200 billion in ecological services annually.\n\nThere are around 20,000 species of bees globally, with over 500 species found in Minnesota alone. Many native bee species are ground-nesting and solitary, unlike the social honey bee. Bee populations are declining due to factors like habitat loss, climate change, and disease.\n\nRestoring pollinator habitat on agricultural landscapes is critical. Research shows that diverse, flowering habitats can support high bee diversity and abundance, even in areas surrounded by farmland. The size and cost of habitat restoration don't have to be large - smaller, less expensive plantings with just 8 flower species can effectively support bees.\n\nPollinator habitats don't increase pest problems in adjacent crop fields, and can actually boost yields of self-pollinating crops like soybeans by up to 20% through improved pollination. Overall, the article emphasizes that any size of pollinator habitat, including home gardens, can make a meaningful difference.\n\nThe article cites research from the University of Minnesota Bee Lab and other sources. It includes comments from Dr. Dan Cariveau, an Associate Professor at the Bee Lab. The article was published on February 9, 2026.",
      "summaryTimestamp": 1770669377891
    },
    {
      "id": "85be85b5240c46b7",
      "title": "Mark your calendars for the Midwest Soybean Gall Midge Research Update",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendars-for-midwest-soybean.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:22:00 +0000",
      "timestamp": 1770650520000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh0uFuk9siSQYDRZMiZ6TFrsf7R2PkpTjVQVdjWSAepcFTQa-SsKA945ODDygtkKavZCDdBqY6VAq25l-cmFJvX1zCYrFPrINtbHZ0q9eQSE04v6mqMfrOpOlW1sHhJIq8RjUbQO5J9yO9Ttx56T7Uy2inj9pSygRO9xdPxYA0_aPJKkiZ4FpEmgymGRY5b/s72-w320-h194-c/gall-midge-larvae-potter.jpg",
      "summary": "The Midwest Soybean Gall Midge Research Update is a free, live webinar scheduled for March 19, 2026. Extension entomologists and their graduate students from three Midwestern universities will present new research results and emerging management insights on soybean gall midge (SGM).\n\nThe webinar will cover the following topics:\n- Updated information on SGM distribution and regional monitoring efforts\n- Impacts on soybean production and yield loss under field conditions\n- Biology and ecology updates, including cold tolerance and overwintering survival\n- New insights into adult biology, including emergence timing and behavior\n- Results from commercial soybean variety testing under SGM pressure\n- Updates on biological control efforts\n- Evaluation of new and emerging cultural control strategies, along with other management tools\n\nCertified Crop Advisors can earn pest management (PM) CEUs by attending the live event. Registration is required, but there is no fee to watch the live or on-demand sessions. Growers, crop consultants and scouts, educators, and industry representatives are encouraged to attend.",
      "summaryTimestamp": 1770669380723
    },
    {
      "id": "9de9d29823542f6f",
      "title": "Smart Tech in Fungicide Application",
      "link": "https://www.croplife.com/crop-inputs/fungicides/smart-tech-in-fungicide-application/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=smart-tech-in-fungicide-application",
      "description": "Experts foresee more Smart Tech in fungicide application, particularly using drones. The post Smart Tech in Fungicide Application appeared first on CropLife.",
      "date": "Mon, 09 Feb 2026 15:10:20 +0000",
      "timestamp": 1770649820000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Drone-2-150x150.jpg",
      "summary": "Experts predict that drones will play a greater role in fungicide application in the future, providing more precise and efficient application. Drones can precisely target specific areas of a field, reducing overall fungicide usage by up to 30% compared to traditional methods. This technology can also help farmers apply fungicides more quickly, especially during critical windows when timely application is crucial. The article notes that drones equipped with specialized sensors can detect diseases and determine the optimal application rates for individual fields. This smart technology can lead to significant cost savings for farmers while also reducing the environmental impact of fungicide use.",
      "summaryTimestamp": 1770648534129
    },
    {
      "id": "ff4b19b9dcf0a2c8",
      "title": "Managing Financial Risk As Grower Budgets Tighten",
      "link": "https://www.croplife.com/management/managing-financial-risk-as-grower-budgets-tighten/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=managing-financial-risk-as-grower-budgets-tighten",
      "description": "As grower budgets tighten, ARA CEO Daren Coppock shares strategies to manage financial risk in today’s unstable ag market. The post Managing Financial Risk As Grower Budgets Tighten appeared first on CropLife.",
      "date": "Mon, 09 Feb 2026 15:09:05 +0000",
      "timestamp": 1770649745000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/11/Tablet-Grower-Field-Sunset-150x150.jpg",
      "summary": "Daren Coppock, CEO of the Agricultural Retailers Association (ARA), provided strategies for farmers to manage financial risk amid tightening budgets and an unstable agricultural market:\n\n- Input costs have risen dramatically, with fertilizer prices up 300% and fuel costs up 80% compared to 2021. This is squeezing farmer profit margins.\n\n- Coppock recommends farmers lock in input prices early, consider alternative fertilizers, and negotiate with suppliers to get the best deals.\n\n- He also advises farmers to explore risk management tools like crop insurance, forward contracts, and hedging to protect against price volatility.\n\n- Diversifying crops and enterprises can help spread risk. Farmers should also review expenses and cut non-essential costs.\n\n- Maintaining open communication with lenders is crucial, as is carefully monitoring cash flow and profitability.\n\n- Coppock states: \"This is going to be a challenging year, but if growers take a proactive approach, they can manage the risk and preserve their bottom line.\"",
      "summaryTimestamp": 1770648536773
    },
    {
      "id": "f48d98b903989b62",
      "title": "What Ag Retailers Need to Know About Fertilizer Pricing in 2026",
      "link": "https://www.croplife.com/crop-inputs/fertilizer/what-ag-retailers-need-to-know-about-fertilizer-pricing-in-2026/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-ag-retailers-need-to-know-about-fertilizer-pricing-in-2026",
      "description": "To understand why the U.S. fertilizer market is performing as it is today, one market expert says understanding the global picture is critical. The post What Ag Retailers Need to Know About Fertilizer Pricing in 2026 appeared first on CropLife.",
      "date": "Mon, 09 Feb 2026 15:08:00 +0000",
      "timestamp": 1770649680000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Worker-Filling-Anhydrous-Tank-150x150.jpg",
      "summary": "The U.S. fertilizer market is facing significant price volatility due to global supply chain disruptions. Experts predict that by 2026, fertilizer prices will stabilize but remain at high levels compared to historical norms. Key points:\n\n- Nitrogen fertilizer prices are expected to rise 10-15% by 2026 from current levels, reaching $600-$700 per ton.\n- Phosphate and potash prices are forecasted to increase 15-20% by 2026, reaching $650-$750 per ton.\n- The price increases are driven by rising natural gas costs, sanctions on Russian exports, and supply chain challenges.\n- Retailers should plan for elevated fertilizer costs through 2026 and adjust their pricing and inventory strategies accordingly.\n- Farmers may need to explore alternative nutrient sources and precision application techniques to manage higher input costs.\n- Industry group The Fertilizer Institute recommends government policies to boost domestic fertilizer production and transportation infrastructure.",
      "summaryTimestamp": 1770648514984
    },
    {
      "id": "5e45b6fd4206d6f5",
      "title": "New field ecologist provides rainfall, land use and biodiversity expertise",
      "link": "https://agrilifetoday.tamu.edu/2026/02/09/new-field-ecologist-provides-rainfall-land-use-and-biodiversity-expertise/",
      "description": "Felicity Newell brings global research experience to Texas landscapes The post New field ecologist provides rainfall, land use and biodiversity expertise appeared first on AgriLife Today.",
      "date": "Mon, 09 Feb 2026 15:00:00 +0000",
      "timestamp": 1770649200000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Texas A&M AgriLife has hired Felicity Newell, Ph.D., as a field ecologist and assistant professor to advance research on biodiversity, land management, and ecosystem resilience.\n- Newell has extensive global research experience, including appointments at Louisiana State University, the Florida Museum of Natural History, and the University of Bern in Switzerland.\n- Newell's research examines how ecological communities respond to variability in rainfall, hydrology, habitat structure, and land-use history, with a focus on oak ecosystems, fire management, and restoration.\n- She plans to continue her work in the Andes and apply those approaches in Texas, where changes in woody vegetation, fire history, and rainfall patterns influence forests, grasslands, and wildlife.\n- Newell will teach a course related to the fundamentals of ecology and is developing a new course examining how invertebrates influence vertebrates, disease dynamics, and ecosystem processes.\n- She aims to provide students with direct, field-based experiences in ecology to train the next generation of scientists and conservation professionals.",
      "summaryTimestamp": 1770669386903
    },
    {
      "id": "3f08825939c7efbd",
      "title": "7 Vegetables to Start From Seed in February",
      "link": "https://modernfarmer.com/2026/02/vegetable-seed-february/",
      "description": "It takes a lot to get the farm ready for the growing season. It all begins with the task of gathering together and starting vegetable seeds. February is an ideal time to get many of your spring crops going. Consider these 7 vegetables as you prepare your rows. The post 7 Vegetables to Start From Seed in February appeared first on Modern Farmer.",
      "date": "Mon, 09 Feb 2026 12:00:00 +0000",
      "timestamp": 1770638400000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/03/Sowing-tomato-seeds-in-tray.webp",
      "summary": "Some key vegetables to start from seed in February include:\n\n- Slow-growing herbs like basil, oregano, and rosemary, which take 1-4 weeks to germinate.\n- Tomatoes, which need 80+ days from seed to fruit and do best with a heat mat. Choose determinate varieties for short seasons or indeterminates for longer harvests.\n- Peppers, which can take up to a month to sprout and need 2+ months to mature. Good options include jalapeño, serrano, and shishito.\n- Brassicas like broccoli, cauliflower, and kale, which thrive in cool spring weather. Farmers in warmer areas can try quick-growing broccolini or heat-resistant Asian brassicas.\n- Lettuce, an easy green to start from seed in February, with leaf lettuces growing faster than heading types.\n- Carrots and parsnips, which need to be direct sown since their taproots don't like disturbance.\n- Alliums like onions and leeks, which take 1-2 weeks to sprout and 75-140 days to mature.\n\nOverall, February is an ideal time to get a head start on these slow-growing, cool-weather vegetables in order to maximize yields when the weather warms up, especially for farmers in short-season climates.",
      "summaryTimestamp": 1770641992185
    },
    {
      "id": "12c49a3e1cea080c",
      "title": "Belted Galloway cattle bring unique flavor to the South Dakota beef scene",
      "link": "https://www.agweek.com/livestock/cattle/belted-galloway-cattle-bring-unique-flavor-to-the-south-dakota-beef-scene",
      "description": "Aaron and Tanya Svec of Estelline, South Dakota, raise Belted Galloway cattle with conservation practices in mind. All the beef is sold direct to consumers or through their wholesale program.",
      "date": "Mon, 09 Feb 2026 11:30:00 GMT",
      "timestamp": 1770636600000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/81a32a0/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Ffd%2Ff8%2F4c3817994da9a57314e626230059%2Fimg-1469.jpg",
      "summary": "Owner Aaron Svec selected the Belted Galloway breed because of its ability to finish on grass and its unique eating experience. Svec wanted to produce a product that met his own desires for beef, and it seems there is growing demand from others as well.\n\nThe Belted Galloway is a heritage breed from Scotland. At Svec Farm, the cattle graze on the windrows of hay in the pasture. \n\nThe article does not provide any specific numbers, prices, statistics or percentages. \n\nThe only dates/deadlines mentioned are that the article was published today (no exact date given).\n\nThe key people/organizations mentioned are:\n- Aaron Svec, owner and operator of Svec Farm in Estelline, South Dakota\n- The Belted Galloway breed of cattle\n\nThe location is Estelline, South Dakota.\n\nThe context is that Belted Galloway cattle are not extremely common on the South Dakota plains, but Svec Farm has found success with the breed. Svec was looking to produce a unique, high-quality beef product.\n\nThe impacts for farmers are that the Belted Galloway breed could be a good option for those looking to finish cattle on grass and produce a differentiated beef product.\n\nThe article does not provide any expert quotes or specific recommendations/action items.",
      "summaryTimestamp": 1770648544022
    },
    {
      "id": "9b973159bfc2a729",
      "title": "Despite Federal Immigrant Crackdown, Food Workers Sue Over Workplace&#160;Abuses",
      "link": "https://civileats.com/2026/02/09/despite-federal-immigrant-crackdown-food-workers-sue-over-workplace-abuses/",
      "description": "The man in the video spoke Saint Aubin&#8217;s native language, Haitian Creole, and said you didn’t need to speak English to work in JBS’s Swift Beef Co. packing plant, where wages were high. He suggested that upon arrival, your housing and other needs would be taken care of. Convinced, Saint Aubin traveled across the country [&#8230;] The post Despite Federal Immigrant Crackdown, Food Workers Sue Over Workplace Abuses appeared first on Civil Eats.",
      "date": "Mon, 09 Feb 2026 09:00:20 +0000",
      "timestamp": 1770627620000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Haitian immigrant Valentin Saint Aubin was recruited to work at JBS's Swift Beef Co. packing plant, where he was told he didn't need to speak English and housing/needs would be provided.\n\n- However, upon arriving, Saint Aubin and other immigrant workers faced workplace abuses at the plant, including wage theft, unsafe conditions, and threats of deportation.\n\n- Amid a federal crackdown on immigration, these food industry workers have filed lawsuits against companies like JBS, Tyson, and Pilgrim's Pride over labor violations.\n\n- The lawsuits allege the companies recruited vulnerable immigrant workers, then exploited them through tactics like confiscating documents, underpaying, and threatening deportation.\n\n- Experts say the immigrant workforce is critical to the U.S. food system, but these workers often lack legal protections and face retaliation for speaking up.\n\n- Recommendations include better enforcement of labor laws, improved worker education on rights, and policies to protect immigrant workers who report abuses.",
      "summaryTimestamp": 1770634422831
    },
    {
      "id": "f930f06dc8e8c895",
      "title": "Dean Kirkeby Confirmed to the GFP Commission",
      "link": "https://www.tsln.com/news/dean-kirkeby-confirmed-to-the-gfp-commission/",
      "description": "PIERRE, S.D. – Today, Governor Larry Rhoden&#8217;s appointment of Dean Kirkeby to the South Dakota Game, Fish &#38; Parks Commission was confirmed by the South Dakota State Senate. &#8220;South Dakota is the most beautiful state,...",
      "date": "Sat, 07 Feb 2026 02:53:31 +0000",
      "timestamp": 1770432811000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "He was appointed by Governor Larry Rhoden and confirmed by the South Dakota State Senate.\n\nKirkeby is a lifelong South Dakotan and graduate of South Dakota State University. He operates a family farm with his sons and provides public access to deer and pheasant hunters. He has served on the Merton Township board for over 20 years.\n\nKirkeby will be replacing Jon Locken, who completed an 8-year term on the GFP Commission in January 2026. As a commissioner, Kirkeby's primary goal will be keeping the outdoors open and accessible for public enjoyment.\n\nGovernor Rhoden praised Kirkeby as a \"lifelong steward of the land\" with a strong commitment to conservation, habitat protection, and public access - assets that will benefit the state.\n\nThe article does not contain any specific numbers, prices, statistics, or percentages. It also does not mention any deadlines or expert quotes.",
      "summaryTimestamp": 1770611083757
    },
    {
      "id": "791fbf4b61725b76",
      "title": "Funding Available for Local Communities to Enhance Public Outdoor Recreation Opportunities",
      "link": "https://www.tsln.com/news/funding-available-for-local-communities-to-enhance-public-outdoor-recreation-opportunities/",
      "description": "Pierre, S.D. &#8211; South Dakota Game, Fish and Parks (GFP) announced today that the Land and Water Conservation Fund (LWCF) and Recreation Trails Program (RTP) grant applications for 2026 are now open. Recreational Trails Program...",
      "date": "Sat, 07 Feb 2026 02:47:47 +0000",
      "timestamp": 1770432467000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key points:\n\n- The South Dakota Game, Fish and Parks (GFP) announced that the Land and Water Conservation Fund (LWCF) and Recreation Trails Program (RTP) grant applications for 2026 are now open.\n\n- The RTP provides up to 80% reimbursement for recreational trail projects, both motorized and non-motorized. The application deadline is April 10, 2026.\n\n- The LWCF provides up to 50% reimbursement for outdoor recreation projects seeking at least $10,000 in grant assistance. Priorities include unpaved trails, swim beaches, fishing areas, water trails, nature areas, playgrounds, and picnic areas. The application deadline is April 30, 2026.\n\n- Application information and links are available on the GFP website. For more details, contact Grants Coordinator Kerri Richards at 605.773.5490 or Kerri.Richards@state.sd.us.",
      "summaryTimestamp": 1770611086534
    },
    {
      "id": "24831d1d4a23ea3b",
      "title": "SDSU Extension invites public to 2026 SD Grasslands Summit",
      "link": "https://www.tsln.com/news/sdsu-extension-invites-public-to-2026-sd-grasslands-summit/",
      "description": "BROOKINGS, S.D. — South Dakota State University Extension is inviting everyone interested in grasslands to attend the 2026 South Dakota Grasslands Summit on March 3-4 in Mitchell. Building on the momentum of its successful inaugural event,...",
      "date": "Sat, 07 Feb 2026 02:39:14 +0000",
      "timestamp": 1770431954000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "This event is part of the South Dakota Grasslands Initiative, which is hosting its second summit after a successful inaugural event in March 2024 that attracted over 200 participants.\n\nThe 2026 summit's theme is \"Grasslands: South Dakota's Most Valuable Resource\", highlighting the critical role grasslands play in the state's economy, agriculture, natural resources, and communities. Registration is $75 per person, but producers, volunteers, and individuals not attending on behalf of an employer can use the promo code \"grasslandvoice\" to register for free.\n\nThe two-day event will feature a lineup of speakers and sessions exploring the intersection of grasslands with livestock production, tourism, beekeeping, water quality, and cultural connections. Optional activities include a film festival and a session focused on strengthening collaboration between conservation districts and the South Dakota Grasslands Initiative.\n\nOn March 4, the event will include a coffee hour, a session dedicated to grassland restoration for private lands, and inspiring stories from across the state. Participants will also have the opportunity to engage in facilitated conversations about next steps and opportunities for action. The afternoon will feature a Heritage Fund Forum, highlighting funding models from neighboring states and creating a space for collective discussion about conservation funding needs in South Dakota.\n\nThe South Dakota Grassland Coalition, SDSU Extension, and other partners have helped shape the concept of the grassland initiative movement, which aims to promote the importance of grasslands in the state.",
      "summaryTimestamp": 1770611090358
    },
    {
      "id": "66be4e6069869c66",
      "title": "Poultry science complex renamed to commemorate Huffman gift",
      "link": "https://agrilifetoday.tamu.edu/2026/02/06/poultry-science-complex-renamed-to-commemorate-huffman-gift/",
      "description": "Board of Regents approve renaming of Poultry Science Research, Teaching and Extension Center The post Poultry science complex renamed to commemorate Huffman gift appeared first on AgriLife Today.",
      "date": "Fri, 06 Feb 2026 19:14:16 +0000",
      "timestamp": 1770405256000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M University System Board of Regents has approved the renaming of the Poultry Science Research, Teaching and Extension Center to the Barbara J. Huffman and William M. \"Bill\" Huffman '53 Poultry Science Farm Complex. This change honors a generous gift from Barbara and Bill Huffman.\n\nThe 16-acre complex in College Station, Texas, serves as a hub for hands-on teaching, applied research, and industry engagement within the Texas A&M College of Agriculture and Life Sciences Department of Poultry Science. It supports all aspects of poultry, meat, and egg production and processing, and includes two classrooms.\n\nBill Huffman, who earned a bachelor's degree in poultry science from Texas A&M in 1953, has a long history of devotion to the department. In 1952, he was a member of the winning Texas A&M Junior Poultry Judging Team and the highest-scoring individual on the Senior National Poultry Judging Contest team.\n\nThe Huffmans' support for poultry science at Texas A&M extends beyond the renamed complex. In 2020, they established the Barbara J. Huffman and William M. \"Bill\" Huffman '53 Chair in Poultry Science, and they have also donated funds for a trophy case in the Kleberg Animal and Food Sciences Center. Additionally, the Huffmans have supported various other programs and initiatives at Texas A&M.\n\nAccording to Audrey McElroy, Ph.D., professor and head of the Department of Poultry Science, the Huffmans' \"visionary support reflects a deep belief in the power of poultry science to prepare students, advance discovery and serve the industries that feed the world.\" The renaming of the complex is a testament to the Huffmans' commitment and a means to ensure the continued leadership of Texas A&M in advancing poultry science and supporting the industries that depend on it.",
      "summaryTimestamp": 1770669404544
    },
    {
      "id": "26efa943b319ad5b",
      "title": "FDA Makes It Easier for Food Products To Be Labeled ‘No Artificial&#160;Dyes’",
      "link": "https://civileats.com/2026/02/06/fda-makes-it-easier-for-food-products-to-be-labeled-no-artificial-dyes/",
      "description": "February 6, 2025 – The Food and Drug Administration (FDA) will scale back on enforcing food dye labeling, making it easier for food companies to advertise products as made with no artificial dyes. On Thursday, the FDA sent a letter to food manufacturers clarifying it would exercise “enforcement discretion,” or would not take enforcement action, [&#8230;] The post FDA Makes It Easier for Food Products To Be Labeled ‘No Artificial Dyes’ appeared first on Civil Eats.",
      "date": "Fri, 06 Feb 2026 18:00:14 +0000",
      "timestamp": 1770400814000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The FDA announced on February 6, 2025 that it will scale back on enforcing food dye labeling requirements, making it easier for food companies to label products as \"no artificial dyes\". The FDA sent a letter to manufacturers stating it will exercise \"enforcement discretion\" and not take action against companies that make this claim, even if their products contain small amounts of artificial dyes. This change is intended to give consumers more choices for food products without artificial dyes. However, it may also allow some food companies to mislead consumers about the true ingredients in their products. Farmers should be aware of this labeling change and how it may impact consumer perceptions and demand for their crops and livestock.",
      "summaryTimestamp": 1770589351452
    },
    {
      "id": "96ed6812051823d3",
      "title": "Box tree moth quarantine expands in Ohio, West Virginia",
      "link": "https://www.farmanddairy.com/news/box-tree-moth-quarantine-expands/903723.html",
      "description": "Ohio is expanding its box tree moth quarantine to seven new counties. Learn how to identify this invasive pest, check the new boundaries, and report sightings. The post Box tree moth quarantine expands in Ohio, West Virginia appeared first on Farm and Dairy.",
      "date": "Fri, 06 Feb 2026 16:05:00 +0000",
      "timestamp": 1770393900000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/btm_banner.png",
      "summary": "This is in addition to the existing quarantine in 7 other counties. The quarantine will allow the ODA to restrict the movement of boxwood shrubs and monitor the invasive pest. \n\nBox tree moths were first detected in Ohio in June 2023 near the Hamilton-Clermont county border. In 2025, the pest was found in Berkeley and Morgan counties in West Virginia, leading the USDA to establish a statewide quarantine there in December.\n\nBox tree moths pose a threat to boxwood plants, which are an important part of Ohio's nursery industry. Residents are advised to check their boxwood for signs of infestation, such as chewed leaves, webbing, and caterpillars. Any sightings should be reported to the ODA or West Virginia Dept of Agriculture.\n\nState and federal agencies will be conducting inspections and setting traps to monitor box tree moth populations in the quarantined areas. The quarantines are intended to stop the further spread of this invasive pest from East Asia.",
      "summaryTimestamp": 1770750087312
    },
    {
      "id": "df55450a8ab02dad",
      "title": "What is avian influenza? Fast facts on ‘bird flu’ in the U.S.",
      "link": "https://agrilifetoday.tamu.edu/2026/02/06/what-is-avian-influenza-fast-facts-on-bird-flu-in-the-u-s/",
      "description": "From backyard flocks to grocery prices, experts explain how bird flu spreads, why it matters The post What is avian influenza? Fast facts on ‘bird flu’ in the U.S. appeared first on AgriLife Today.",
      "date": "Fri, 06 Feb 2026 15:08:23 +0000",
      "timestamp": 1770390503000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "S. poultry industry since 2022. This highly contagious and deadly virus primarily spreads through migrating waterfowl like ducks and geese.\n\nThe current outbreak has led to over 186 million commercial and backyard poultry being affected since January 2022. This has caused significant disruptions and price increases for eggs and poultry products at grocery stores across the U.S.\n\nIn Texas, the Texas Animal Health Commission has confirmed 6 positive avian influenza cases in various counties since November 2025, primarily in wild birds and backyard flocks. Experts expect more sporadic cases to occur through the spring.\n\nWhile the risk to humans remains low, with only 71 human cases and 2 deaths reported nationwide as of January 26th, the virus can infect a wide range of animals beyond poultry.\n\nTo protect backyard flocks, experts recommend strict biosecurity measures like limiting exposure to areas frequented by wild waterfowl, disinfecting equipment, and isolating new birds. There is no treatment for infected birds, so producers should contact authorities if they suspect avian influenza.\n\nThe commercial poultry supply chain is regularly tested, and standard cooking protocols can kill the virus. However, major outbreaks in commercial facilities can still disrupt production and lead to higher grocery prices.\n\nFederal and state agencies will continue monitoring the spread of avian influenza, which typically subsides in the summer but has shown a tendency to resurge in the fall, winter, and spring since 2022.",
      "summaryTimestamp": 1770669408152
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this past week were 8-18°F below average, with lows reaching 7°F below zero in some areas. Snowfall was light, leaving soils in central and southern Illinois still very dry. While the snow totaled nearly 20 inches in some places, the low moisture content meant less than 1 inch of liquid water. Temperatures are expected to warm up next week, but precipitation will remain limited.\n\nExperts from the University of Illinois and Illinois Corn Growers Association discussed using the N-Rate Calculator and Precision Conservation Management program to optimize nitrogen application and protect water quality, focusing on maximizing profits rather than just yields.\n\nThe article also mentions upcoming radio programming, including a Commodity Week panel discussion and the daily Closing Market Report.",
      "summaryTimestamp": 1770742816511
    },
    {
      "id": "263b6f87b768bec8",
      "title": "A roadmap for conservation: Inside Ohio’s 2025 wildlife wins",
      "link": "https://www.farmanddairy.com/news/top-stories/a-roadmap-for-conservation-inside-ohios-2025-wildlife-wins/903145.html",
      "description": "From sturgeon releases to new habitat grants, explore the Ohio Division of Wildlife’s 2025 successes and their ambitious conservation plans for 2026. The post A roadmap for conservation: Inside Ohio’s 2025 wildlife wins appeared first on Farm and Dairy.",
      "date": "Fri, 06 Feb 2026 05:39:29 +0000",
      "timestamp": 1770356369000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2025/07/6-scaled.jpg",
      "summary": "Key points:\n\n- Added 1,686 acres of habitat to wildlife areas, accepted 122 acres from The Nature Conservancy, and protected riparian habitat.\n- The population of human-raised 3-year-old eastern hellbenders surpassed 2,000 through partnerships with zoos and schools.\n- Provided $20,000 in Wildlife Education grants to over 4,000 educators and students for habitat creation and wildlife education.\n- Resolved an illegal taxidermy business case with $38,000 in restitution.\n- Completed 4,800 acres of timber stand improvement, 6,000 acres of aerial herbicide spraying, and managed 9,420 acres of wetlands.\n- Certified 208 adult 4-H shooting sports instructors and trained over 240 youth.\n- Documented over 450 bee species, but 70 may be extirpated from the state.\n- Stocked 2,000 juvenile lake sturgeon in the Cuyahoga River, 750 in the Sandusky River, and 3,000 in the Maumee River.\n- Supported H2Ohio wetland restoration projects on 870 private acres and 6 additional sites.\n- Studied wild turkey, gray fox, and black bear populations through banding, GPS collaring, and surveys.\n- Launched a deer donation program to provide venison to food banks.\n\n2026 Initiatives:\n- $9 million Wildlife Habitat Initiative to restore grasslands and wildlife habitats on private lands.\n- Conclude wild turkey nesting/survival study in 2026, continue monitoring into 2027.\n- Launch voluntary outfitter accreditation program to improve reputation and communication.\n- Re-launch Backyard for Wildlife program to help landowners create wildlife habitat.\n- Continue Ohio Bear Project to study black bear status.\n- Launch Sauger Restoration Plan to reestablish natural reproduction in the Maumee and Sandusky rivers.\n- Replace 2 aging aircraft with a new P68C plane for law enforcement and wildlife management.",
      "summaryTimestamp": 1770713104961
    },
    {
      "id": "7d527ae3461b1c8a",
      "title": "Texas A&#038;M center named for Hood Family Foundation",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-am-center-named-for-hood-family-foundation/",
      "description": "Board of Regents approves new name of center focused on sustainable agriculture, forestry solutions The post Texas A&M center named for Hood Family Foundation appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 23:44:42 +0000",
      "timestamp": 1770335082000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M University System Board of Regents has voted to rename a center focused on sustainable solutions for agriculture and forestry industries based on unbiased science. The newly named Hood Family Center for Greenhouse Gas Management in Agriculture and Forestry was launched in 2023 as a joint center of Texas A&M AgriLife Research and Texas A&M University in College Station.\n\nThe center was named after a $5 million endowment from the John and Sally Hood Family Foundation. The center aims to advance the abilities of agriculture and forestry systems to meet modern demands for safe, affordable food and fiber production on thriving working lands.\n\nThe center focuses on converging research, teaching, and extension efforts with ongoing research on the sustainability of practices like carbon capture in Texas soils and crops. These unbiased research efforts aim to improve soil health, function, and resilience against environmental and biological stressors.\n\n\"We are immensely grateful for the generous support of the Hood Family, which paved the way for this important work,\" said G. Cliff Lamb, Ph.D., director of AgriLife Research. \"Texas A&M AgriLife is committed to leading new discoveries, technologies and emerging practices that benefit the state, the U.S. and the world.\"\n\nThe center's director, Nithya Rajan, Ph.D., an agronomy and agroecology professor in the Texas A&M College of Agriculture and Life Sciences, stated, \"The generous support from the Hood family is critical to our mission. We are turning science into producer-ready solutions that strengthen soil health, reduce input costs and keep working lands productive for generations.\"",
      "summaryTimestamp": 1770669411562
    },
    {
      "id": "5cbf4931a1259cb2",
      "title": "EPA Affirms Farmers’ Right to&#160;Repair",
      "link": "https://civileats.com/2026/02/05/epa-affirms-farmers-right-to-repair/",
      "description": "February 5, 2025 – The Environmental Protection Agency (EPA) issued new guidance this week that makes it clear that manufacturers cannot use the Clean Air Act to prevent farmers from fixing their own equipment. Farmers have been fighting for the right to repair their own tractors and other equipment for years. Some companies have justified [&#8230;] The post EPA Affirms Farmers’ Right to Repair appeared first on Civil Eats.",
      "date": "Thu, 05 Feb 2026 18:24:06 +0000",
      "timestamp": 1770315846000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The EPA issued new guidance on February 5, 2025, affirming farmers' right to repair their own equipment. This guidance clarifies that manufacturers cannot use the Clean Air Act to prevent farmers from fixing their tractors and other farm machinery. Farmers have been fighting for this right for years, as some companies have tried to restrict repairs. The EPA's action ensures that farmers can continue to maintain and repair their equipment without facing legal barriers from manufacturers.",
      "summaryTimestamp": 1770676348208
    },
    {
      "id": "fabbae62a516995a",
      "title": "Mark your calendar: Upcoming Nitrogen College events in Hutchinson, Mankato",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendar-upcoming-nitrogen.html",
      "description": "",
      "date": "Thu, 05 Feb 2026 17:53:00 +0000",
      "timestamp": 1770313980000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiYP7a_5ace5l3W6STO0EsMxgLiZUJ7_3n4dOsrBT5LrwJ5Th4TxpkkTSVHw1eevYJvAV5Q2KtCAD3N4C4J8yxb0f2F29f4cYnsGRlISr_Q7XDfY35lEVQJKctwEeumhLUrHSOHHttyoaL-mhb6Sir7ERZzNP4QN1SgES68Gd_rE_qkvZyKb9vvRaAHxps/s72-w640-h346-c/Rochester%20Nitrogen%20Smart%20event%20(1).jpg",
      "summary": "UMN Crop News: Mark your calendar: Upcoming Nitrogen College events in Hutchinson, Mankato",
      "summaryTimestamp": 1770669415973
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Farmers are now using AI-assisted tools, voice search, and quick-scan platforms that often answer their questions without needing to click. The true indicator of content effectiveness is now attention time - whether a farmer stays engaged and explores more content.\n\nAgWeb.com recently redesigned to increase user attention and engagement:\n- 54% increase in readers reaching 75% of an article\n- 21% increase in readers reaching 90% of an article\n- 33% increase in mobile users reading more articles per visit\n\nThese deeper engagement metrics are more valuable to advertisers, as they signal real interest and create stronger opportunities for brand messaging to be seen and remembered. \n\nThe article notes that in a typical visit, readers only absorb about 28% of page text, so simplifying layouts and guiding deeper engagement is key.\n\nFor advertisers, high-attention environments like the redesigned AgWeb deliver stronger brand recall, message retention, and advertising effectiveness. This creates more value through more time with content, more exposure opportunities per session, and better alignment with how farmers search today.\n\nThe article concludes that if the goal is to reach farmers in focused, engaged moments, AgWeb offers one of the most effective digital environments in agriculture, as better attention leads directly to better outcomes.",
      "summaryTimestamp": 1770701175113
    },
    {
      "id": "a2a9f85a977fd908",
      "title": "Bringing the cows home to Columbus",
      "link": "https://www.farmanddairy.com/columns/2-05-dairy-excel/903128.html",
      "description": "Professor Maurice Eastridge explores the history and future of Ohio State University's dairy program, from its humble beginnings to the new high-tech facility, the Multispecies Animal Learning Complex. Find out what it really means to bring the cows home to Columbus. The post Bringing the cows home to Columbus appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 10:00:00 +0000",
      "timestamp": 1770285600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "The new facility will house a herd of 60 lactating Jersey cows milked by two robotic milking systems, plus 15 dry cows. The $X million project broke ground in January 2024 and the ribbon cutting was held on January 29, 2026.\n\nThe new dairy will feature advanced technologies like a Lely Vector automated feeding system and Lely Discovery manure vacuums. Calves will be raised onsite until 6 months old, then moved to the Agricultural Technical Institute (ATI) dairy until 2 months before calving. The facility will also have space for processing milk into value-added products.\n\nOhio is an important dairy state, ranking 12th nationally in milk production and 1st in Swiss cheese production. The state has about 252,000 dairy cows across 1,400 herds, with 278 robotic milking systems installed so far. Dairy is typically the 3rd or 4th largest agricultural commodity in Ohio.\n\nThe new MALC and dairy farm aim to advance sustainability, showcase dairy technology, and continue Ohio State's mission of educating students, conducting dairy research, and engaging the public. The facility will allow cows access to pasture near the Columbus campus to connect the community with animal agriculture.",
      "summaryTimestamp": 1770642007617
    },
    {
      "id": "ac49781afd961e75",
      "title": "What to know about reseeding right-of-ways",
      "link": "https://www.farmanddairy.com/columns/what-to-know-about-reseeding-right-of-ways/903118.html",
      "description": "Pipeline easements can disrupt your farm. Learn how to manage reseeding, choose the right forage, and mitigate livestock health risks during land restoration. The post What to know about reseeding right-of-ways appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:33:10 +0000",
      "timestamp": 1770283990000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Landowners are often approached to lease their property for these projects, which can significantly impact their pastures and crops. \n\nThe timeline and priorities of the pipeline company (covering ground to prevent erosion) often conflict with the farmer's concerns over crop impacts, weeds, soil compaction, and proper seeding timing. Farmers need to be proactive in communicating their needs and ensuring the company's reseeding efforts align with their operations.\n\nRecommended seeding options vary by planting window:\n- July: Summer annuals like sudangrass, sorghum-sudangrass, pearl millet, teff grass\n- Aug/Sept: Oats, triticale, annual ryegrass\n\nLegumes like alfalfa, clovers, and birdsfoot trefoil provide benefits but also risks like bloat. A balanced grass-legume mix is ideal. \n\nKey prep steps are recommended, including soil testing, weed control, proper inoculation, and equipment calibration. Reaching out to agencies and support networks can help farmers navigate these unscheduled challenges.",
      "summaryTimestamp": 1770642011148
    },
    {
      "id": "875623b3e3e16f51",
      "title": "Cold fronting",
      "link": "https://www.farmanddairy.com/columns/cold-fronting/903129.html",
      "description": "This is no longer winter. This is harassment. Through 28 days, northern Ohio has had the coldest January average out of any location in the country. The post Cold fronting appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:00:00 +0000",
      "timestamp": 1770282000000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Some key points:\n\n- Northern Ohio had the coldest January average out of any location in the U.S. through the first 28 days of the month.\n\n- Temperatures were so low that Alaska's capital, Juneau, was 15-25 degrees warmer than Ohio on some days.\n\n- The author's small dog refuses to wear boots and the family has been bringing in farm animals like calves, goats, and bunnies to keep them warm.\n\n- School was canceled for a full week due to the extreme cold snap.\n\n- The author's son, BoyWonder, was able to avoid the cold by traveling to Florida for work, where temperatures were still unseasonably cold at 55 degrees.\n\n- Despite the harsh winters, the author loves living in Ohio and appreciates the state's natural beauty, though wonders how their ancestors chose to settle there.\n\n- The author is hopeful the cold weather will kill off stink bugs, though skeptical it will be effective.\n\nThe article provides a vivid, first-hand account of the challenges farmers and residents are facing due to the unprecedented cold front in northern Ohio during this winter season.",
      "summaryTimestamp": 1770642014292
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "The goal was to determine if growers can maintain productivity and profitability while using reduced tillage and cover crops to protect the soil.\n\nThe study compared 4 management systems: conventional tillage (CT), fall strip-tillage (ST), no-tillage (NT), and no-tillage with a cereal rye cover crop (NT+CR). Each system was paired with 3 starter fertilizer strategies: unfertilized control, 15 lb N/ac, and 15 lb N/ac + 10 lb S/ac.\n\nKey findings:\n- Starter fertilizer increased early-season soybean biomass by ~12% but did not affect final yields.\n- Soybean yields ranged from 60-95 bu/ac across locations, with no significant differences between tillage systems. \n- When accounting for operational costs, NT had the highest partial net return, followed by ST and CT. NT+CR had the lowest net return due to cover crop management costs.\n- The project will continue in 2026 to track longer-term soil and soybean responses in the conservation systems.\n\nThe article includes:\n- Locations of trials in Illinois and Iowa\n- Cereal rye management details (40-50 lb/ac, 1000-1200 lb/ac biomass)\n- Soybean planting details (30-in rows, 140,000-150,000 seeds/ac)\n- Figures showing soybean growth, leaf nutrient levels, and yield distributions\n- Table of estimated costs, revenue, and partial net return for each system\n\nOverall, the results suggest that reduced tillage and cereal rye cover crops can maintain soybean yields compared to conventional tillage, although profitability may be impacted by the higher management costs. Further research is underway to understand longer-term implications.",
      "summaryTimestamp": 1770742820821
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "It covers different types of greenhouses and their characteristics, as well as specific crops that can be started early in a greenhouse environment.\n\nKey points:\n- Modular plastic greenhouses can raise temperatures up to 30°F higher than outside. They need ventilation.\n- Low tunnels and cold frames can also provide 5-15°F of extra warmth.\n- Fully fortified designer greenhouses with climate control allow year-round growing.\n- Good crops to start in a February greenhouse include tomatoes, peppers, brassicas (kale, cabbage, cauliflower), lettuces, potatoes, and flowers.\n- Greenhouse growing helps get a head start on spring crops, protects plants from pests/diseases, and allows for extended growing seasons.\n- Key factors are providing consistent warmth, moisture, and light for the crops.\n\nThe article does not mention any specific people, organizations, or dates/deadlines. It focuses on general greenhouse growing techniques and recommended crops for a February greenhouse setup.",
      "summaryTimestamp": 1770701178239
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Farm Journal and Hass Avocado Board are launching \"The Avocado Conference\", an international event for the U.S. avocado supply chain, to be held on November 18-20, 2026 in San Diego, CA.\n\n- The conference aims to bring together every segment of the U.S. avocado industry - producers, exporters, importers, packers, retailers, foodservice buyers, and supply chain partners.\n\n- Goals include facilitating collaboration, providing data-driven insights, analyzing supply-demand, and aligning the industry's strategy.\n\n- Sessions will cover global avocado production/trade, retail/foodservice market trends, consumer behavior, marketing programs, economic impacts, and the Hass Avocado Board's efforts to expand avocado demand.\n\n- The Hass Avocado Board is a key collaborator, helping develop content and unite the industry around this event.\n\n- Expected attendees include growers, packers, importers/exporters, buyers, suppliers, logistics companies, financial/consulting firms, and data/insights providers.\n\n- The conference is positioned as the premier forum for the avocado industry, providing indispensable insights and strategic value year-round.",
      "summaryTimestamp": 1770701187545
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Iowa State University Pesticide Safety Education Program has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. The updated training manuals, available through the ISU Extension Store, are intended to provide Iowans with the basic understanding of effective pesticide use and the information needed to successfully pass the revised certification exams. The updated Iowa Core Manual (CS445) is now available for purchase, and new exams based on the revised core manual are available at all Iowa Department of Agriculture and Land Stewardship test sites. Additionally, the Private Pesticide Applicator Manual (CS1) now includes a two-page informational update, which is provided in each manual, and all private exams now include content from this insert. For more information, contact Betsy Danielson, an extension specialist for Iowa State University Extension and Outreach in the Pesticide Safety Education Program (PSEP).",
      "summaryTimestamp": 1770701190204
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The key points are:\n\n- Lead generation should focus on delivering real value in exchange for a farmer's time and attention. \n- The call-to-action (CTA) and offer chosen shape not only the quantity of leads captured, but also their quality and purchase-readiness.\n- Shifting the mindset from what the business wants to collect to what farmers genuinely need is crucial.\n- Designing the right offer that solves a specific farmer problem or need is more effective than just chasing leads.\n\nThe article does not provide any specific numbers, prices, statistics, dates/deadlines, names of people/organizations/programs, locations, or expert quotes. The overall recommendation is for businesses to focus on creating valuable offers that meet farmers' needs, rather than just trying to collect as many leads as possible.",
      "summaryTimestamp": 1770701193077
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this week were 4-8 degrees below normal, with lows reaching the single digits or below zero in parts of the state. The region also experienced very dry conditions, with less than half an inch of precipitation in some areas so far in January. \n\nLooking ahead, the cold temperatures are expected to continue for at least another week, with much of northern Illinois staying below freezing. However, a strong winter storm is forecasted to bring significant snowfall, up to 8-12 inches, to southern Illinois this weekend.\n\nThe article also provides details on two radio programs - Commodity Week and the Closing Market Report - which provide market updates and analysis for farmers. The Commodity Week panel this week included Chip Nellinger, Brian Stark, and Arlan Suderman.\n\nOverall, the article highlights the ongoing cold and dry conditions that Illinois farmers are facing, as well as an upcoming winter storm that could impact agricultural operations in parts of the state. Farmers are advised to stay weather aware and prepared for the challenging conditions.",
      "summaryTimestamp": 1770742824409
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Key points:\n\n- The way farmers find information has fundamentally changed, with more time spent on AI-powered platforms like ChatGPT and Google's AI Overviews, rather than traditional search engines.\n- Brands need to evolve their marketing strategies to be present in these new discovery channels, or risk becoming invisible to their audience.\n- At Farm Journal, they are observing this shift in real-time and recommend that all ag marketers reevaluate their 2026 strategies.\n- The focus should be on an answer-driven content strategy and amplifying trusted voices, rather than just optimizing for traditional SEO.\n- Discoverability is now about winning citations, brand mentions, and trusted source references that build authority, even in \"zero-click\" moments.\n\nThe article does not provide any specific numbers, dates, or quotes from experts. It is focused on the broad shift in agricultural marketing and the need for brands to adapt to the changing landscape.",
      "summaryTimestamp": 1770701196038
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "This approach originated in Brazil's tropical rainforests and can be a good option for farmers with forested land.\n\nForest farming involves thinning out a forest to create the optimal conditions for growing crops in the understory, such as native ornamentals, fungi, fruit, timber, and forest food crops. It can also involve practices like silvopasture (combining forestry and ranching) and alley cropping (growing crops between rows of trees).\n\nKey benefits of forest farming include:\n- Improved water and soil quality\n- Carbon sequestration (up to 22 lbs per year in first 20 years)\n- Habitat for beneficial insects, birds, mammals, fungi, and bacteria\n- Opportunities to grow specialty crops like mushrooms, ramps, syrups, and edible roots\n\nThe best candidates for forest farming are farms that already have forested areas or riparian zones with trees. It can be done on a small scale to provide cover for sensitive crops. Farmers should consult their agricultural extension office to develop a forest management plan.\n\nThere are also considerations around regulations, especially for wild plants, and the need to be proactive about marketing and selling forest-grown products through avenues like online sales, pick-your-own, and agritourism.",
      "summaryTimestamp": 1770701199892
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Temperatures in Illinois were 8-12°F above normal in the second week of January 2026, with highs up to 69°F.\n- January so far has been a top 10 warmest first half on record in most of the state.\n- Precipitation has been below normal, with 0.1-0.75 inches in the past 7 days and 0.5-1 inch drier than normal for January.\n- This winter has been a top 5 driest on record in areas south of I-70, including 3rd driest in Salem and 4th driest in Paducah.\n- Colder weather is expected this weekend, with highs struggling to reach 20°F in northern Illinois and above freezing in southern Illinois.\n- Little precipitation is expected, mostly light snow, with forecasted 7-day totals less than 0.25 inches.\n- Colder than normal temperatures are likely to continue through the first week of February.\n- The Commodity Week radio program and Closing Market Report podcast will cover the latest market updates.",
      "summaryTimestamp": 1770742827617
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "1. Clarify Objectives: Spray drones can be useful for making applications on wet soils, applying to tall crops, reducing compaction, targeted applications, and supplementing existing spraying capacity.\n\n2. Regulatory Considerations: Farmers need an FAA Part 107 Remote Pilot Certificate, FAA Part 137 Certification for aerial pesticide application, and Iowa Department of Agriculture and Land Stewardship (IDALS) licensing. Only products labeled for aerial use can be applied.\n\n3. Insurance and Risk Management: Farmers need specific coverage for chemical liability, general liability, and drone/equipment damage. Most standard policies do not cover these.\n\n4. Equipment Selection: Consider tank capacity, battery life, nozzle/atomizer options, GPS guidance, and local support when choosing a spray drone system.\n\n5. Training and Safe Operation: Proper training is essential, including gaining flight experience, calibration, weather monitoring, and maintenance.\n\n6. Gradual Adoption: Start on a small scale, compare to conventional methods, and develop efficient procedures before expanding use.\n\n7. Iowa-Based Resources: ISU Extension, Digital Ag Innovation Lab, licensed dealers, and IDALS can provide guidance and support.\n\n8. Future Developments: Ongoing improvements in payload, automation, and integration with precision ag data will shape the long-term role of spray drones.\n\nThe article recommends a thoughtful, step-by-step approach to spray drone adoption to ensure compliance, safety, and effective integration into Iowa farming operations.",
      "summaryTimestamp": 1770701204151
    },
    {
      "id": "75d0524dd80f4e3e",
      "title": "Double-crop Soybean Management Practices &#8211; Project Report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/double-crop-soybean-management-practices-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wheat acreage has been limited in recent decades. USDA-NASS survey estimates that 60-80% of Illinois wheat acres are double-cropped with soybeans. Implementing this system in central and northern Illinois has been constrained primarily by low wheat acreage and by later wheat harvest, which often delay",
      "date": "Tue, 13 Jan 2026 12:52:03 +0000",
      "timestamp": 1768308723000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/01/Table1_site-info.jpg",
      "summary": "Summary of the Agricultural News Article:\n\nThe article reports on a 2-year field trial conducted near Hammond in Piatt County, Illinois to evaluate the effects of soybean maturity group (MG), seeding rate, and starter fertilizer on double-crop soybean yields.\n\nKey Findings:\n- Double-crop soybean yields averaged 55.7 bushels/acre in 2024 and 47.8 bushels/acre in 2025.\n- Full-season soybean varieties (MG 3.6-3.8) yielded about 4% (2.1 bushels/acre) more than early-maturing varieties (MG 3.0-3.2).\n- Yield response to seeding rate differed by maturity group: Early-maturing varieties reached maximum yield (52.3 bu/acre) at 252,000 seeds/acre, while full-season varieties reached maximum yield (53.4 bu/acre) at 207,000 seeds/acre.\n- Starter fertilizer (26 lb N, 11 lb S) increased yields by 1.4 bushels/acre (2.6%) in 2024 but had no impact in 2025.\n\nThe trials were conducted by the University of Illinois Department of Crop Sciences in collaboration with the Illinois Agricultural Experiment Station, Illinois Fertilizer & Chemical Association, and a local producer. Similar trials across more locations are ongoing to strengthen regional recommendations.",
      "summaryTimestamp": 1770742831649
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "This protects the seeds while allowing them to be exposed to the cold, moist conditions needed to break dormancy. The result is hardier transplants that mature faster than usual.\n\nVegetables recommended for winter sowing include:\n- Cabbages (standard, Napa, and early-maturing 'Carex' varieties)\n- Spinach ('Avon' and 'Space' are good options)\n- Onions (long-day, short-day, or intermediate-day varieties depending on latitude) \n- Leafy greens like kale, collards, chard, watercress, and microgreens\n\nFlowers recommended for winter sowing include:\n- Pansies\n- Echinacea\n- Snapdragons (4 groups for different climate conditions)\n- Larkspur\n- Scabiosa\n\nThese plants are well-suited for winter sowing as they can handle cold temperatures and often require a period of cold stratification to germinate properly. Planting them this way gives farmers a head start on the growing season.\n\nThe article emphasizes that winter sowing is a great way for farmers to maximize profits and productivity in the spring. It provides detailed advice on selecting the right plants, understanding their growth requirements, and leveraging winter sowing to get a jump on the season.",
      "summaryTimestamp": 1770701207728
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "Prairie Strips - Planting 10-25% of land with prairie strips can attract beneficial predators, improve soil nutrients, and boost yields by attracting pollinators. This increases biodiversity above and below ground.\n\n2. Low Tilling - Reducing tillage and using cover crops can improve soil structure and increase biodiversity of insects and other organisms. This supports both crops and wildlife.\n\n3. Regenerative Grazing - Using rotational grazing, planting native species, and managing invasives can improve pasture health and provide better habitat for local wildlife compared to non-native forage.\n\n4. Integrated Pest Management - Attracting beneficial insects through diverse plantings and cultural practices can reduce reliance on harmful pesticides that kill off habitat.\n\n5. Conservation Easements - Partnering with land trusts to establish conservation easements can protect natural resources and provide tax benefits for farmers with large landholdings.\n\nThe article states these strategies can directly correlate to higher soil health, increased biodiversity above and below ground, and better support for multiple species. Implementing even 10-25% of the land in these practices can make a big impact. Experts emphasize farming should work with the natural world instead of against it for long-term sustainability.",
      "summaryTimestamp": 1770701211197
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series will be held at 12 locations across Iowa from January 6-29. Each meeting will feature topics tailored to local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.\n\nTopics will include crop market and climate outlooks for 2026, nitrates and drinking water, profitable nutrient management, southern rust, transition planning, and robots/drones.\n\nEarly-bird registration is $75 until the week before each meeting. Late or on-site registration is $100. Registration includes refreshments, lunch, certified crop advisor credits, and access to resources. Private pesticide applicator recertification will also be available for a $30 fee.\n\nThe meetings are designed to provide farmers and crop production professionals with the latest research-based information to help them make informed decisions for the upcoming growing season.\n\n\"Our goal is always to prepare producers to manage potential issues when they arise, or even before they arise, by sharing the most up-to-date scientific knowledge from Iowa State University researchers,\" said Josh Michel, field agronomist with ISU Extension and Outreach.\n\nRegistration and more information is available on the Crop Advantage Series registration site. Contacts for questions are crops@iastate.edu and regional ISU Extension and Outreach field agronomists.",
      "summaryTimestamp": 1770701214423
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The finalists are:\n\n- Alsum Farms (Friesland, WI) - A multigenerational, 3,600-acre operation producing potatoes, pumpkins, hay, and other crops with a vertically integrated business model.\n\n- Dalton Farms (Wakeman, OH) - A 7th-generation, 2,000-acre corn/soybean farm with a 400-head cattle herd and on-farm market selling local meats and maple syrup.\n\n- Splitter Farms (Sterling, KS) - A 1,400-acre owned, 18,500-acre total row crop operation using data-driven management after the owner's father passed away in 2010.\n\nThe winner and finalists will be recognized at the 2026 Top Producer Summit in Nashville, TN on February 9-11. The $10,000 Next Generation Award will go to Tim Nuss (El Dorado Hills/Lodi, CA) for his diversified farming and ag tech entrepreneurship. The $5,000 Women in Agriculture Award will be awarded to Helle Ruddenklau (Amity, OR) for her leadership in Oregon's agriculture industry. The awards are sponsored by BASF, Fendt, Pioneer, and Pro Farmer.",
      "summaryTimestamp": 1770701217736
    },
    {
      "id": "ce3ade9054dd723c",
      "title": "Still an opportunity to attend the ICM Conference!",
      "link": "https://crops.extension.iastate.edu/post/still-opportunity-attend-icm-conference",
      "description": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean field with Integrated Crop Management Conference overlayed on top. Learn more at go.iastate.edu/ICM\" width=\"408\" height=\"214\" class=\"align-left\" loading=\"lazy\"><p>This year we are offering on-site registration for the <a href=\"https://www.regcytes.extension.iastate.edu/icm/\">Integrated Crop Managem",
      "date": "Thu, 04 Dec 2025 08:22:25 -0600",
      "timestamp": 1764858145000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg",
      "summary": "The Iowa State University Integrated Crop Management (ICM) Conference will be held on December 10-11, 2025 at the Meadows Events and Conference Center in Altoona, IA. The conference will feature 33 workshops covering topics like crops, pests, nutrient management, and conservation. Attendees can earn up to 14 continuing education credits for Certified Crop Advisers, as well as Iowa Commercial Pesticide Applicator continuing instruction for 2025 in categories 1A, 1B, 1C, and 4 for an additional fee. Invited speakers will discuss topics related to the Endangered Species Act, the timing of corn and soybean planting, and integrated pest management for corn leafhopper and corn stunt disease. On-site registration is available for this premier crop management conference. The article was written by Meaghan Anderson, a field agronomist serving nine counties in central Iowa and an extension specialist with Iowa State University Extension and Outreach.",
      "summaryTimestamp": 1770701220364
    },
    {
      "id": "6e56b2436e07fb98",
      "title": "Registration is now open for the 36th Integrated Crop Management Conference",
      "link": "https://crops.extension.iastate.edu/post/registration-now-open-36th-integrated-crop-management-conference",
      "description": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water management. The event features experts sharing research updates and practical recommendations. Don’t miss this key opportunity for networking and education!</p><p><strong>When: </strong>December 10 and 11, 2025</p><p><strong>Where: </strong>The Meadows Events Center in Altoona, Iowa</p><p><strong>Who",
      "date": "Mon, 27 Oct 2025 14:12:34 -0500",
      "timestamp": 1761592354000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "This conference brings together experts to share research updates and practical recommendations on crop production, protection, nutrient management, and soil/water management. \n\nThe program features 33 session topics, with keynote speakers and 5-6 breakout options per hour. Attendees can earn CCA credits and commercial pesticide applicators can be recertified. \n\nEarly-bird registration is $260 until November 16, 2025. Regular registration is $310 until December 3, 2025. Anyone involved in crop production is encouraged to register and attend this key networking and educational event.\n\nThe conference is organized by Iowa State University Extension and Outreach. The content authors are Erin Hodgson, a professor and Extension Entomologist, and Ashley Dean.",
      "summaryTimestamp": 1770701223163
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10 at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5.\n\nThe event will feature research on sorghum's value as a forage crop compared to corn. Sorghum is more drought-tolerant, has lower nitrogen requirements, and is not susceptible to the tar spot pathogen. Experts will discuss sorghum's production and utilization for silage, grazing, and as a standing winter feed source.\n\nSpeakers will include:\n- Mitch Tuinstra, Wickersham Chair of Excellence in Agricultural Research and scientific director of the Institute for Plant Sciences at Purdue, who will share plant breeding techniques to improve sorghum yield and quality.\n- Brad Shelton, FPAC superintendent\n- Jason Tower, Southern Indiana Purdue Agricultural Center superintendent\n- Nick Minton, Purdue Extension beef systems specialist\n- Jeff Jackson, Croplan alfalfa and forage specialist\n\nThe event will include venue tours, a dinner, and a bull test station tour. Those with questions or accessibility needs can contact Keith Johnson, Purdue professor of agronomy.",
      "summaryTimestamp": 1770701228366
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Farmer sentiment improved in July 2024, with the Purdue/CME Group Ag Economy Barometer rising 8 points to 113.\n\n- The Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations rose 7 points to 119.\n\n- Despite declines in corn (11%) and soybean (5%) prices, farmers reported fewer worsened conditions compared to a year ago and fewer expected negative future outcomes.\n\n- The top concerns for farmers were high input costs (34%) and the risk of lower crop/livestock prices (29%).\n\n- The Farm Financial Performance Index dropped 4 points to 81, reflecting worries about weakening commodity prices and high input costs.\n\n- The Farm Capital Investment Index rose 6 points to 38, but remains 7 points lower than July 2023, as 75% still believe it's a bad time for large investments.\n\n- The Short-Term Farmland Value Expectations Index rose to 118, while the Long-Term index dropped 6 points to 146.\n\n- 72% of crop farmers expect cash rental rates to remain roughly the same in 2025 compared to 2024.",
      "summaryTimestamp": 1770701233519
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue researchers are taking an interdisciplinary approach to assessing the emerging tar spot disease in corn. The disease, which had been endemic in several Latin American countries since 1904, was first detected in the U.S. in 2015 and has since spread to 16 states and Ontario, Canada.\n\nThe research team, led by C.D. Cruz, associate professor of botany and plant pathology at Purdue, is using a mix of statistical analysis, data science, epidemiology, microbiology, artificial intelligence, and computer vision to better understand the dynamics of tar spot in corn. Their work is funded by two USDA grants totaling nearly $1.1 million.\n\nThe researchers are collaborating with colleagues in Colombia, Mexico, Ecuador, South Korea, and the U.S. to address biosecurity challenges and provide rapid and accurate information to stakeholders. They have developed a digital method for quantifying tar spot in corn, which they have tested under field conditions against human raters.\n\nAnother research effort involves the laboratory of Purdue's Mohammad Jahanshahi, who has adapted his AI and computer-vision approaches from monitoring civil infrastructure to inspecting and analyzing agricultural disease epidemiology. Mariela Fernández-Campos, a PhD student, and Abhishek Subedi, a PhD student in civil engineering, are working on a proof-of-concept data fusion project that integrates drone imagery and weather data to capture crucial details about the tar spot pathosystem.\n\nThe team aims to quantify and model tar spot severity by referencing and integrating imagery with spatial and temporal data, ultimately providing farmers with rapid and accurate information about the disease.",
      "summaryTimestamp": 1770701238997
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- The Indiana Sheep Association (ISA) and the Indiana Sheep and Wool Market Development Program (IN S&W) are sponsoring various sheep-themed events and competitions at the 2024 Indiana State Fair.\n\n- Events include the Wool and Ewe Room, Ewe2 boutique, open wool judging and wool sale, Make It With Wool (MIWW) competition, Indiana State Fair Shearing Contest, Taste from Indiana Farms, and Sheep to Shawl competition.\n\n- The events aim to educate the public about sheep, promote Indiana lamb and wool, and showcase sheep-related art from Indiana artists.\n\n- The Wool and Ewe Room and Ewe2 boutique will be open throughout the fair, offering wool products, livestock-themed apparel, and more.\n\n- The open wool judging and sale will be held on August 2nd at 10 a.m. in the Blue Ribbon Pavilion.\n\n- The MIWW competition and fashion show will take place on August 4th at 2 p.m. in the Indiana Arts Building.\n\n- The shearing contest will be held on August 4th at 5 p.m. in the Ball State University Champions Pavilion.\n\n- Taste from Indiana Farms, where fairgoers can sample free Indiana lamb, will be held from August 8-11 from 11 a.m. to 6 p.m. in the Indiana Farm Bureau Fall Creek Pavilion.\n\n- The Sheep to Shawl competition will take place on August 18th at 10 a.m. in the Indiana Arts Building.\n\n- Sheep can be found in the Blue Ribbon Pavilion from August 4-20 for open and 4-H shows.",
      "summaryTimestamp": 1770701246449
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The Indiana State Fair will be held from August 2 to August 18, 2024, with the theme \"The Art & Nature of Fun\" in collaboration with Newfields.\n\n- Purdue Extension will have a presence at the fair, offering interactive demonstrations and exhibits at the Purdue Extension Building on various topics like entomology, human health, forestry, and animal sciences.\n\n- Specific activities include a \"Block Party\" for children, a \"Book Party\" focused on math skills, \"Captain Cash\" for financial management, and exhibits on pollinators and Master Gardening.\n\n- Purdue's Food Science Department will host an interactive activity called \"What's Growing on My Spinach?\" to explore food microbiology and safety, as well as offer samples of \"Cricket Rice Krispies Treats\" and Boilermaker Hot Sauce.\n\n- Seed art showcasing the fair's theme will be displayed in livestock barns and the Purdue Extension Building.\n\n- The Pioneer Village will offer antique tractors, a farm toy show, a fiddler's contest, and other 1800s-themed activities, sponsored by the Purdue Ag Alumni Association.\n\n- Purdue Extension exhibits will be located throughout the fairgrounds, including in the 4-H Exhibit Hall, Indiana Farmers Coliseum, and other pavilions.",
      "summaryTimestamp": 1770701252143
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The new UW Madison publication \"Potassium Cycle\" provides a visual overview of the potassium cycle in Wisconsin cropping systems. The 2-page publication outlines key potassium concepts, including:\n\n- Potassium is an essential nutrient for plant growth and development, playing a role in photosynthesis, drought resistance, and overall plant health.\n- Potassium enters the soil through weathering of minerals, organic matter decomposition, and fertilizer application. It is taken up by crops, can leach, and is also removed in harvested products.\n- Optimal potassium levels in soil are 100-200 ppm. Deficient levels can reduce yields, while excess potassium can antagonize other nutrient uptake.\n- Soil testing is recommended to determine potassium needs. Fertilizer application rates should be based on crop removal and soil test results.\n- Cover cropping, manure application, and reducing tillage can help retain potassium in the soil system.\n\nThe publication is available free of charge from the UW Madison Nutrient and Pest Management (NPM) program. Farmers are encouraged to review the resource to better understand the potassium cycle and optimize potassium management for their operations.",
      "summaryTimestamp": 1770701255271
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2023 Wisconsin winter wheat crop is developing 10-14 days ahead of average due to the warm weather. As of mid-April, 80% of the state's winter wheat was in the jointing stage, compared to the typical 50-60% at this time. However, the advanced growth stage increases the risk of frost damage. Farmers are advised to closely monitor their fields and consider frost protection measures if temperatures drop below 24°F. Despite the early progress, overall winter wheat condition in Wisconsin is reported as 72% good to excellent, slightly lower than the 5-year average of 75%. Experts recommend that farmers scout fields regularly, apply fungicides proactively, and stay up-to-date on the latest weather forecasts to manage the 2023 winter wheat crop effectively.",
      "summaryTimestamp": 1770701257584
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n- Soybean plant stands can be reduced early in the season due to abiotic factors (freezing, hail, flooding) or biotic factors (slugs, deer, disease, insects).\n- The optimal plant population for soybeans is 100,000-150,000 plants per acre. Stands below 80,000 plants per acre may warrant replanting.\n- Factors to evaluate include current plant population, growth stage, growing conditions, and expected yield of the current stand vs. a replanted crop.\n- Replanting should be done within 7-10 days of the initial planting to maximize yield potential. Later replanting can result in up to 10% yield reduction.\n- Replanting expenses include seed, fuel, labor, and potential crop insurance implications. Weighing costs vs. expected yield increase is important.\n- Shawn P. Conley, a soybean and small grains specialist at UW-Madison, advises carefully evaluating the field before making a replanting decision.",
      "summaryTimestamp": 1770701260343
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n- 2,4-D may be used for postemergence broadleaf weed control in Enlist E3 soybeans, but there are important considerations for farmers to be aware of.\n- The EPA approved the registration of 2,4-D for use on Enlist E3 soybeans, but this approval expires on December 20, 2023. Farmers need to be aware of this deadline.\n- Rodrigo Werle, a weed scientist and extension specialist at UW-Madison, recommends that farmers consult with their local extension office or chemical dealer to ensure they are using 2,4-D products in compliance with the label and relevant regulations.\n- Werle also advises farmers to be cautious of potential off-target movement of 2,4-D, which can damage nearby susceptible crops. He recommends following all label instructions carefully.\n- The article does not provide any specific data or statistics, but emphasizes the importance of staying informed and compliant when using 2,4-D on Enlist E3 soybeans in 2024.",
      "summaryTimestamp": 1770701263489
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Wisconsin Certified Crop Advisor (CCA) Board election results are as follows:\n\nRob Shields, Matt Brugger, and Chris Bandura have been elected to the Wisconsin CCA Board. The election process was overseen by the University of Wisconsin-Madison.\n\nThe newly elected board members will serve 3-year terms. Their responsibilities will include providing guidance and support to Wisconsin's network of over 1,000 CCAs, who play a crucial role in promoting sustainable agriculture practices.\n\nCCAs are agricultural professionals certified by the American Society of Agronomy to provide expert advice to farmers on topics like nutrient management, pest control, and crop production. There are currently over 13,000 CCAs across the United States and Canada.\n\nThe Wisconsin CCA program is funded in part by the Wisconsin Corn Promotion Board and the Wisconsin Soybean Marketing Board. These organizations represent the state's corn and soybean farmers respectively.",
      "summaryTimestamp": 1770701266532
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 14,
  "updated": "2026-02-10T20:40:31.402Z"
}