{
  "items": [
    {
      "id": "b725fbc3a5d940e8",
      "title": "State of Delaware Opens Initial RFPS to Transform Rural Health Care",
      "link": "https://www.morningagclips.com/state-of-delaware-opens-initial-rfps-to-transform-rural-health-care/",
      "description": "WILMINGTON, Del. &#8212; Governor Matt Meyer announced today that Requests for Proposals (RFPs) are now open for four initiatives under Delaware’s plan to overhaul health care in every community. The RFPs are part of the federal government’s Rural Health Transformation Program, a multi-year effort to expand access to care, lower costs, and increase the medical [&#8230;] The post State of Delaware Opens Initial RFPS to Transform Rural Health Care appeared first on Morning Ag Clips.",
      "date": "Wed, 11 Feb 2026 22:23:00 +0000",
      "timestamp": 1770848580000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "This is part of the federal government's $50 billion Rural Health Transformation Program, which aims to expand access to care, lower costs, and increase the medical workforce in rural areas. \n\nThe RFPs cover:\n- $157.4 million in funding to start Delaware's first 4-year medical school focused on rural primary care\n- Competitive grants for new school-based health centers in rural areas, aiming for 400 patient visits by year 3\n- Funding to establish \"Food is Medicine\" programs integrating nutrition into rural healthcare\n- Grants for mobile health units and community health hubs to deliver services in rural areas, targeting 1,500 yearly encounters by year 3\n\nThe initiatives are designed to build lasting capacity and infrastructure in rural healthcare, not just short-term fixes. They will be supported by the Centers for Medicare & Medicaid Services.\n\nGovernor Matt Meyer stated that these efforts aim to ensure healthcare access and quality is not determined by zip code. The Department of Health and Social Services and Delaware Health Care Commission are leading the implementation.\n\nAdditional RFPs are expected in Spring 2026. Eligible organizations are encouraged to apply according to the posted timelines and requirements.",
      "summaryTimestamp": 1770848747285
    },
    {
      "id": "54b7a16a2e0af2dc",
      "title": "Texas A&#038;M hospitality leader Brian King earns international research award",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/texas-am-hospitality-leader-brian-king-earns-international-research-award/",
      "description": "Michael D. Olsen Research Achievement Award recognizes global hospitality and tourism scholarship impact The post Texas A&M hospitality leader Brian King earns international research award appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 22:11:56 +0000",
      "timestamp": 1770847916000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Brian King, Ph.D., professor and department head of the Arch H. Aplin III '80 Department of Hospitality, Hotel Management and Tourism at the Texas A&M College of Agriculture and Life Sciences, has received the University of Delaware's Michael D. Olsen Research Achievement Award. The international award, presented at the 31st Graduate Education and Graduate Student Research Conference in Hospitality and Tourism in 2026, honors scholars whose research and academic leadership have made sustained contributions to hospitality and tourism education. \n\nKing's scholarly work spans industry engagement, research, and teaching. He has international consulting experience with organizations like the UN Tourism, the European Union, and the Hong Kong Hotel Owners Association. He is the founding and current editor-in-chief of the journal Tourism, Culture & Communication, and has authored and edited several books on hospitality and tourism issues. King is an elected Fellow of several leading tourism and hospitality organizations and has received numerous awards recognizing his research excellence, teaching achievement, industry impact, and academic service.\n\nPrior to joining Texas A&M in 2022, King had an academic career spanning Europe, Australia, the Pacific, and Asia. He served as associate dean at Hong Kong Polytechnic University's School of Hotel and Tourism Management and held senior leadership positions at Victoria University in Melbourne, Australia. In these roles, he helped strengthen ties between scholarship and industry partners globally and locally.\n\nAs head of the Aplin Department of Hospitality, King leads teaching, research, and outreach initiatives that emphasize graduate education, mentorship, and global engagement in hospitality and tourism.",
      "summaryTimestamp": 1770848750917
    },
    {
      "id": "a1c130a021d537e9",
      "title": "Maryland Chicken Growers Ask Lawmakers to Fix Permitting Delay",
      "link": "https://www.morningagclips.com/maryland-chicken-growers-ask-lawmakers-to-fix-permitting-delay/",
      "description": "GEORGETOWN, Del. &#8212; Family farmers who raise chickens in Maryland’s chicken community testified in the Maryland General Assembly in support of SB 371/HB 395, which would repeal a requirement that a person hold a concentrated animal feeding operation (CAFO) general discharge permit before the person may begin construction on any part of a chicken farm. [&#8230;] The post Maryland Chicken Growers Ask Lawmakers to Fix Permitting Delay appeared first on Morning Ag Clips.",
      "date": "Wed, 11 Feb 2026 22:07:12 +0000",
      "timestamp": 1770847632000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "This proposed legislation would repeal the requirement that chicken farmers obtain a Concentrated Animal Feeding Operation (CAFO) permit before constructing a new chicken farm.\n\nCurrently, every chicken farm in Maryland must obtain a CAFO permit, which expires every 5 years. In July 2025, the existing CAFO permit expired before the Maryland Department of the Environment (MDE) had submitted a new permit for review. This has created a de facto moratorium on new chicken house construction, as farmers cannot obtain the necessary CAFO permit to begin building. \n\nThe Delmarva Chicken Association estimates that approximately $35 million in construction projects have been stalled due to the lack of a current CAFO permit. Chicken farmers testified that this has prevented them from obtaining financing or starting construction on new farms.\n\nThe proposed SB 371/HB 395 legislation would allow chicken farmers to begin construction and financing during the interim period when a new CAFO permit is not yet in effect. This would provide immediate relief, as farms would not be operational until they receive full MDE permit coverage.\n\nSupportive testimony was provided by several chicken growers, as well as representatives from the Maryland Department of Agriculture, Maryland Farm Bureau, Horizon Farm Credit, and other agricultural organizations. The farmers emphasized that this legislation would not impact the permitting process or environmental regulations, but rather just enable them to start building in the absence of a current CAFO permit.",
      "summaryTimestamp": 1770848754745
    },
    {
      "id": "bf1edd425b3bc630",
      "title": "NC State to Host National Conference on AI in Agriculture",
      "link": "https://www.morningagclips.com/nc-state-to-host-national-conference-on-ai-in-agriculture/",
      "description": "RALEIGH, N.C. &#8212; NC State University will host the 2026 AI in Agriculture Conference March 31 – April 2. This national conference brings together the brightest minds in academia, ag-tech, analytics, biotech, extension and the public sector to connect, collaborate and shape the future of AI-enabled agriculture. This year’s focus — Advancing Artificial Intelligence and Data-Driven [&#8230;] The post NC State to Host National Conference on AI in Agriculture appeared first on Morning Ag Clips.",
      "date": "Wed, 11 Feb 2026 21:58:29 +0000",
      "timestamp": 1770847109000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- NC State University will host the 2026 AI in Agriculture Conference from March 31 to April 2, 2026.\n- The conference will bring together experts from academia, ag-tech, analytics, biotech, extension, and the public sector to discuss AI-enabled solutions for agriculture.\n- This year's focus is on \"Advancing Artificial Intelligence and Data-Driven Innovations for Resilient and Competitive Agricultural Systems.\"\n- The conference aims to showcase how AI and data science can enhance productivity, profitability, and environmental stewardship across crop, livestock, and supply-chain domains.\n- Keynote speakers include Zach Marston (Cropwise AI Manager, Syngenta), Gyami Shrestha (Founder and Principal Consultant, Carboneers LLC), Sebastian Villegas (CEO, Asimetrix), and Lane Arthur (Vice President of Precision Technologies, John Deere Intelligent Solutions Group).\n- Early bird registration is open until February 20, 2026.\n- The conference builds on the momentum of past events hosted by other universities, including Auburn (2022), University of Florida (2023), Texas A&M (2024), and Mississippi State (2025).",
      "summaryTimestamp": 1770848758594
    },
    {
      "id": "9ab54091a4c59c90",
      "title": "Corn farmer urges DC to deliver on nationwide E15",
      "link": "https://www.brownfieldagnews.com/news/corn-farmer-urges-dc-to-deliver-on-nationwide-e15/",
      "description": "A Wisconsin farmer is urging Congress to get the nationwide E15 deal done. Mike Berget is a representative of the Wisconsin Corn Promotion Board, the state’s corn checkoff program. He tells Brownfield that farmers did not need Washington punting on the E15 issue again. &#8220;We need to talk to our legislators and tell them how [&#8230;] The post Corn farmer urges DC to deliver on nationwide E15 appeared first on Brownfield Ag News.",
      "date": "Wed, 11 Feb 2026 21:53:04 +0000",
      "timestamp": 1770846784000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points from the article are:\n\n- A Wisconsin corn farmer, Mike Berget, representing the Wisconsin Corn Promotion Board, is urging Congress to finalize the nationwide E15 (15% ethanol blend) deal.\n\n- Farmers are frustrated with Washington delaying action on the E15 issue again. \n\n- Berget is calling on farmers to speak to their legislators and stress the importance of getting the nationwide E15 deal completed.\n\nThe article does not provide any specific numbers, deadlines, or expert quotes. It focuses on the corn farmer's call to action for Congress to deliver on the nationwide E15 policy.",
      "summaryTimestamp": 1770848761091
    },
    {
      "id": "fe10c456cca37d5f",
      "title": "NDSU Extension to Host Getting It Right Dry Bean Webinar, Feb. 17",
      "link": "https://www.morningagclips.com/ndsu-extension-to-host-getting-it-right-dry-bean-webinar-feb-17/",
      "description": "FARGO, N.D. &#8212; Farmers and crop advisers searching for research-based dry bean production recommendations are invited to attend North Dakota State University Extension’s Getting It Right in Dry Bean Production webinar on Feb. 17. The webinar is organized by NDSU Extension and sponsored by the Northarvest Bean Growers Association. The online-only meeting will be hosted on [&#8230;] The post NDSU Extension to Host Getting It Right Dry Bean Webinar, Feb. 17 appeared first on Morning Ag Clips.",
      "date": "Wed, 11 Feb 2026 21:47:28 +0000",
      "timestamp": 1770846448000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The webinar will begin at 8:30 am CST and conclude at 12 pm CST. \n\nNDSU specialists will present on the following topics:\n- White mold management\n- Effective weed control strategies \n- Inoculation considerations\n- Market outlook\n\nThe webinar is organized by NDSU Extension and sponsored by the Northarvest Bean Growers Association. There is no fee to attend, but registration is required at ndsu.ag/GIR-dry-bean-26. \n\nAccording to Ana Carcedo, NDSU Extension broadleaf crops agronomist, last year had high pressure of white mold, leading to several key agronomic challenges for dry bean producers across North Dakota. The webinar aims to provide research updates and practical recommendations to help farmers make informed production decisions for the 2026 season.\n\nCertified crop advisers can earn continuing education credits by attending the live event. The webinar will include live Q&A sessions, allowing participants to engage directly with the NDSU specialists.\n\nFor more information, contact Ana Carcedo at 701-831-5796 or [email protected].",
      "summaryTimestamp": 1770848764207
    },
    {
      "id": "b82344cb63d1bfd7",
      "title": "University of Illinois expert urges applicators to follow updated dicamba restrictions",
      "link": "https://www.brownfieldagnews.com/news/university-of-illinois-expert-urges-applicators-to-follow-updated-dicamba-restrictions/",
      "description": "A professor of weed science at the University of Illinois says the U.S. EPA’s decision to issue new labels for three over-the-top dicamba products in soybeans and cotton means farmers and applicators will need to pay close attention to details. Dr. Aaron Hager tells Brownfield, “There&#8217;ll be a checklist again that every applicator is going [&#8230;] The post University of Illinois expert urges applicators to follow updated dicamba restrictions appeared first on Brownfield Ag News.",
      "date": "Wed, 11 Feb 2026 21:47:09 +0000",
      "timestamp": 1770846429000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The University of Illinois expert Dr. Aaron Hager urges farmers and applicators to closely follow the updated dicamba restrictions recently issued by the U.S. EPA for three over-the-top dicamba products used in soybeans and cotton. Applicators will need to check a detailed checklist before applying dicamba to ensure compliance with the new label requirements. The updated restrictions aim to address concerns about dicamba drift and damage to neighboring crops. Farmers must strictly adhere to the application guidelines, cutoff dates, buffer zones, and other label details to avoid potential issues and penalties.",
      "summaryTimestamp": 1770848766444
    },
    {
      "id": "eb91ccd6d83bfc26",
      "title": "Wheat, soybeans see support from weak dollar",
      "link": "https://www.brownfieldagnews.com/market-news/wheat-soybeans-see-support-from-weak-dollar/",
      "description": "Soybeans were higher on short covering and technical buying. Soybeans are watching rain chances for Argentina and monitoring crop quality concerns in parts of Brazil. The USDA did raise its production estimate for Brazil this week, with the next guess out March 10th, while CONAB’s new outlook for Brazil’s crop is set for this Thursday, [&#8230;] The post Wheat, soybeans see support from weak dollar appeared first on Brownfield Ag News.",
      "date": "Wed, 11 Feb 2026 21:42:54 +0000",
      "timestamp": 1770846174000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Wheat and soybeans prices were supported by a weak US dollar. Soybeans prices were higher due to short covering and technical buying. Concerns remain about rain chances for Argentina's soybean crop and crop quality issues in parts of Brazil. The USDA increased its production estimate for Brazil's soybean crop this week, with the next update due on March 10th. CONAB, Brazil's national food supply agency, will release its new outlook for Brazil's soybean crop this Thursday.",
      "summaryTimestamp": 1770848768333
    },
    {
      "id": "2244d4235601a55f",
      "title": "&#039;YES ON 2&#039; Launches to Support Constitutional Amendment to Ban State Property Tax",
      "link": "https://www.morningagclips.com/yes-on-2-launches-to-support-constitutional-amendment-to-ban-state-property-tax/",
      "description": "COLUMBIA, Tenn. &#8212; A coalition that includes the Tennessee Farm Bureau, Tennessee Realtors, and Tennessee Chamber of Commerce officially announced today the launch of Yes on 2, the single measure committee to pass a constitutional amendment banning a state property tax. Governor Bill Lee will serve as the statewide chairman for the effort. A recent poll [&#8230;] The post &#039;YES ON 2&#039; Launches to Support Constitutional Amendment to Ban State Property Tax appeared first on Morning Ag",
      "date": "Wed, 11 Feb 2026 21:42:27 +0000",
      "timestamp": 1770846147000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The 'YES ON 2' coalition, including the Tennessee Farm Bureau, Tennessee Realtors, and Tennessee Chamber of Commerce, has launched a campaign to pass a constitutional amendment banning a state property tax in Tennessee. \n\nKey points:\n- A recent poll showed 64% of Tennessee voters support banning a state property tax.\n- Tennessee currently does not have a state property tax, but state law permits its collection. Passage of Amendment 2 would prohibit the legislature from enacting a state property tax.\n- The coalition includes Governor Bill Lee as the statewide chairman, as well as other state legislative leaders serving as regional chairs.\n- The coalition argues that banning a state property tax will allow farmers and rural residents to keep more of their earnings and support the state's agricultural economy. It will also make Tennessee more attractive for businesses to locate and expand.\n- In addition to the Farm Bureau, Realtors, and Chamber of Commerce, the coalition includes Americans for Prosperity, the Beacon Center of Tennessee, and the National Federation of Independent Business' Tennessee chapter.\n\nThe amendment will be on the ballot for Tennessee voters on February 11, 2026. The coalition is working to educate voters and build support for the measure.",
      "summaryTimestamp": 1770848771560
    },
    {
      "id": "1e068429c028b088",
      "title": "Cattle futures higher, lean hogs were lower",
      "link": "https://www.brownfieldagnews.com/market-news/cattle-futures-higher-lean-hogs-were-lower/",
      "description": "At the, Chicago Mercantile Exchange ,live and feeder cattle futures closed sharply higher, feeling optimistic about this week&#8217;s direct cash cattle business. April live was up $3.55 at $240.97 and June was $2.77 higher at $236.57. March feeders were $2.67 higher at $267.45 and April was up $3.32 at $364.60. Direct cash cattle trade was [&#8230;] The post Cattle futures higher, lean hogs were lower appeared first on Brownfield Ag News.",
      "date": "Wed, 11 Feb 2026 21:18:05 +0000",
      "timestamp": 1770844685000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points from the article are:\n\nCattle futures closed sharply higher at the Chicago Mercantile Exchange, with April live cattle up $3.55 to $240.97 and June up $2.77 to $236.57. March feeder cattle were $2.67 higher at $267.45 and April was up $3.32 to $364.60. This optimism was due to expectations of stronger direct cash cattle trade this week.\n\nIn contrast, lean hog futures were lower. The article does not provide specific prices for the lean hog futures.\n\nThe article is reporting on the commodity futures market movements for cattle and hogs, indicating higher prices for live and feeder cattle contracts but lower prices for lean hog contracts.",
      "summaryTimestamp": 1770848774163
    },
    {
      "id": "ac2f4dc3fa114af1",
      "title": "Closing Grain and Livestock Futures: February 11, 2026",
      "link": "https://www.brownfieldagnews.com/market-news/closing-grain-and-livestock-futures-february-11-2026/",
      "description": "Mar. corn $4.27 and 1/2, down 1 and 1/4 centsMar. soybeans $11.24, up 1 and 1/2 centsMar. soybean meal $303.00, up $2.20Mar. soybean oil 57.05, down 22 pointsMar. Chicago wheat $5.37 and 1/4, up 9 centsApr. live cattle $240.97, up $3.55Mar. feeder cattle $367.45, up $2.67Apr. lean hogs $93.85, down $1.65Mar. Class III milk closed [&#8230;] The post Closing Grain and Livestock Futures: February 11, 2026 appeared first on Brownfield Ag News.",
      "date": "Wed, 11 Feb 2026 21:11:27 +0000",
      "timestamp": 1770844287000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "On February 11, 2026, the closing prices for key agricultural futures contracts were:\n- Corn for March delivery: $4.27 and 1/2, down 1 and 1/4 cents\n- Soybeans for March delivery: $11.24, up 1 and 1/2 cents\n- Soybean meal for March delivery: $303.00, up $2.20\n- Soybean oil for March delivery: 57.05, down 22 points \n- Wheat for March Chicago delivery: $5.37 and 1/4, up 9 cents\n- Live cattle for April delivery: $240.97, up $3.55\n- Feeder cattle for March delivery: $367.45, up $2.67\n- Lean hogs for April delivery: $93.85, down $1.65\n\nThe March class III milk futures contract also closed on this date, but the specific price was not provided.",
      "summaryTimestamp": 1770848776988
    },
    {
      "id": "bd8951f16b2838c2",
      "title": "SDSU Extension to host Strong Minds, Strong Farms webinar series",
      "link": "https://www.tsln.com/news/sdsu-extension-to-host-strong-minds-strong-farms-webinar-series/",
      "description": "BROOKINGS, S.D. – South Dakota State University Extension is hosting a series of free health and wellness webinars for anyone involved in agriculture. Strong Minds, Strong Farms is a three-part series that will explore physical activity,...",
      "date": "Wed, 11 Feb 2026 20:38:17 +0000",
      "timestamp": 1770842297000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "SUMMARY:\n\nSDSU Extension is hosting a free 3-part webinar series called \"Strong Minds, Strong Farms\" from February 23 to March 9, 2026. The webinars will cover:\n\n1. \"Movement that Fits Your Life\" (Feb 23) - Presenting ways to incorporate physical activity into busy lives.\n\n2. \"Spring Budget Reset\" (Mar 2) - Teaching practical strategies to track spending and create realistic budgets. \n\n3. \"Eat Well, Spend Less\" (Mar 9) - Providing tips to plan meals, stretch grocery budgets, and reduce food waste.\n\nThe webinars are open to anyone involved in agriculture, hosted by SDSU Extension's women in agriculture team. They aim to improve the health and wellbeing of farm and ranch families. \n\nThe 1-hour webinars start at 7pm CST. Registration is required at extension.sdstate.edu/events. The series is inspired by the Annie's Project program.\n\nExperts presenting include:\n- Erin Hallenbeck, SDSU Extension Health and Physical Activity Field Specialist\n- Lorna Saboe-Wounded Head, SDSU Extension Family Resource Management Field Specialist \n- Jessica Meuleners, SDSU Extension Nutrition Field Specialist",
      "summaryTimestamp": 1770848779997
    },
    {
      "id": "18dc55da5a659673",
      "title": "US-Argentine trade agreement allows increased beef exports to US",
      "link": "https://www.tsln.com/news/us-argentine-trade-agreement-allows-increased-beef-exports-to-us/",
      "description": "The Trump administration on Friday announced a trade agreement with Argentina that will allow Argentina to increase its beef exports to the United States. The agreement allows President Trump and Argentine President Javier Milei to forge closer ties while also possibly...",
      "date": "Wed, 11 Feb 2026 20:36:36 +0000",
      "timestamp": 1770842196000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Points:\n\n- The U.S. and Argentina have reached a trade agreement that allows Argentina to increase beef exports to the U.S. starting in 2026.\n\n- The agreement establishes a reciprocal 80,000 metric ton quota for each country in 2026, allocated quarterly.\n\n- Argentina will be allowed to export up to 80,000 metric tons of beef to the U.S. in 2026, in addition to its existing 20,000 metric ton tariff-rate quota.\n\n- The U.S. will also be able to export up to 80,000 metric tons of beef to Argentina in 2026 under the same quarterly volume parameters.\n\n- The U.S. Cattlemen's Association (USCA) is concerned about the impact on U.S. cattle producers, stressing the need for tightened rules of origin and product limitations.\n\n- USCA argues the 400% increase in access for Argentine product should be treated as a one-time exception, not a template for routine quota expansions.\n\n- USCA urges the administration to maintain transparency and rigorous inspection as import volumes increase, to ensure U.S. consumers know the origin of their beef.\n\n- Overall, the agreement aims to forge closer ties between the U.S. and Argentina, while potentially reducing beef prices for U.S. consumers, though U.S. cattle producers have concerns about the impact on their industry.",
      "summaryTimestamp": 1770848783204
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Soybeans worked hard to extend the rally",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: Corn prices were narrowly mixed in midweek trading.",
      "date": "Wed, 11 Feb 2026 20:34:07 GMT",
      "timestamp": 1770842047000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Corn prices were narrowly mixed in midweek trading. Soybean prices extended their rally, supported by strong export demand and concerns over supply. November soybean futures closed at $14.09/bushel, up 16 cents. November corn futures closed at $6.72/bushel, down 1 cent.\n\nThe U.S. Department of Agriculture reported that soybean export sales in the latest week reached 2.5 million metric tons, exceeding market expectations. China was the top buyer, taking 1.4 million metric tons. The strong export demand has reduced soybean supplies, with soybean stocks projected to fall to 275 million bushels by the end of the 2022/23 marketing year, the lowest in 8 years.\n\nConcerns over soybean production in Brazil and Argentina, the world's second and third largest producers, have also supported soybean prices. Brazil's crop is estimated at 152 million metric tons, down 4% from the previous year, due to drought. Argentina's crop is expected to be 49 million metric tons, down 7% from last year, also due to dry conditions.\n\nThe rally in soybean prices provides a boost for U.S. farmers, who are facing high costs for fertilizer, fuel and other inputs. However, the tight supply could also mean higher costs for livestock producers who rely on soybeans for animal feed.",
      "summaryTimestamp": 1770848786657
    },
    {
      "id": "ad7397d00bf284f1",
      "title": "FFAR seeks 2026 New Innovator research nominations",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/ffar-seeks-2026-new-innovator-research-nominations]]>",
      "description": "Foundation intends to grant up to 10 New Innovator in Food & Agriculture Research awards to early-career scientists.",
      "date": "Wed, 11 Feb 2026 20:05:57 GMT",
      "timestamp": 1770840357000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltab069a37ce84cbc2/67a3a5dd5d3f2300bf2cb20c/lab_research_scientist_looking_in_microscope_iStock-Getty_Images.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The Foundation for Food & Agriculture Research (FFAR) is seeking nominations for its 2026 New Innovator in Food & Agriculture Research awards. FFAR plans to grant up to 10 awards to early-career scientists with innovative research ideas that address challenges in food and agriculture. Each award will provide $150,000 per year for up to 4 years, for a total of up to $600,000 per recipient. \n\nThe deadline to submit nominations is January 11, 2023. Eligible nominees must have received their first academic appointment (e.g. assistant professor) within the last 5 years. Their proposed research should demonstrate scientific excellence and the potential to significantly impact food and agriculture. FFAR will evaluate nominations based on the innovator's qualifications, the research plan, and the project's potential impacts.\n\nThe New Innovator awards aim to support early-career scientists and help them establish their research programs. Funding will cover salaries, lab equipment, and other expenses. FFAR expects the 2026 awards to catalyze transformative research that improves the sustainability, productivity, and resilience of food and agricultural systems.",
      "summaryTimestamp": 1770848789590
    },
    {
      "id": "fb1d6184016e7054",
      "title": "No ice is 100% safe: Essential precautions for winter recreation",
      "link": "https://www.farmanddairy.com/columns/no-ice-is-safe-tips/903804.html",
      "description": "Learn how to check ice thickness, what gear to carry, and life-saving self-rescue techniques to stay safe on frozen ponds and lakes this winter. The post No ice is 100% safe: Essential precautions for winter recreation appeared first on Farm and Dairy.",
      "date": "Wed, 11 Feb 2026 19:38:00 +0000",
      "timestamp": 1770838680000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/jason-lagoreRGB-199x300.jpg",
      "summary": "It recounts the author's personal experience of falling through ice as a child and the lasting impact it had. \n\nKey points:\n- No ice is completely safe - variables like water levels, currents, springs, and decaying vegetation can create soft spots\n- Clear ice is stronger than cloudy ice; minimum thickness recommendations are 4 inches for foot travel, 5 inches for snowmobiles/ATVs\n- Important precautions include checking ice thickness, going with friends, carrying rescue tools (rope, ice picks, throw bag), wearing a life jacket, and dressing properly for wind chill\n- If someone falls through, do not run up - instead use available objects to reach or throw to them\n- If you fall through, try to pull yourself out by kicking and using ice picks, then roll away from the hole\n- Rescued individuals may suffer \"after-drop\" and need medical attention\n\nThe article emphasizes the importance of caution and preparation when enjoying winter activities on frozen water, to prevent tragedy. It warns that poor judgment can endanger yourself and emergency responders.",
      "summaryTimestamp": 1770842109665
    },
    {
      "id": "a947fd2411192135",
      "title": "Hollenbeck: Sharing the Basics",
      "link": "https://www.tsln.com/news/hollenbeck-sharing-the-basics/",
      "description": "&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; My husband and I have reached the so-called Golden Years (which happened very fast), and are now experiencing something we often heard about in the past, which is &#8220;after you retire, you&#8217;ll be busier...",
      "date": "Wed, 11 Feb 2026 19:13:35 +0000",
      "timestamp": 1770837215000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Even though Hollenbeck and his husband have sold their livestock and leased their ranch to a grandson, they remain active on the property, maintaining it by eradicating weeds, repairing fences, and helping with cattle.\n\nHollenbeck has become a mentor, teaching traditional hand quilting to 6 applicants from the Winner Quilt Guild in South Dakota. She also assists 4-H kids in Valentine, Nebraska by helping them make Quilts of Valor. Meanwhile, her husband helps young people with their roping and horsemanship skills, and assists a neighbor with a troubled horse.\n\nThe article provides an example of Hollenbeck \"Sharing the Basics\" - she drove to Millboro to play piano for a small country church, and later that day, she quickly repaired her 7-year-old great-granddaughter's beloved \"blankie\" by reattaching the bunny head using quilting thread.\n\nThe article highlights how Hollenbeck and her husband remain active and engaged in their community, passing on their knowledge and skills to the next generation, even in their \"Golden Years\" after retiring from the full-time farming and ranching operations.",
      "summaryTimestamp": 1770842125649
    },
    {
      "id": "a2af1d636ca7e4c2",
      "title": "Reclaiming harsh habitats with black soldier fly larvae",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/reclaiming-harsh-habitats-with-black-soldier-fly-larvae/",
      "description": "Collaborative research supported by the WoodNext Foundation aims to autonomize rehabilitation of extreme environments The post Reclaiming harsh habitats with black soldier fly larvae appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 19:12:23 +0000",
      "timestamp": 1770837143000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Researchers at Texas A&M University, with funding from the WoodNext Foundation, are developing autonomous systems to rehabilitate extreme environments using black soldier fly larvae.\n\n- Black soldier fly larvae can recycle organic waste, produce protein and fertilizer, and remove toxic substances from the materials they are fed.\n\n- The project aims to develop autonomous systems for cultivating plants, recycling with black soldier fly larvae, and generating healthy, fertile soil suitable for human habitation in extreme environments.\n\n- Jeffery Tomberlin, a Texas A&M AgriLife Research Fellow, will lead the biological integration project using black soldier fly larvae, providing expertise on their ability to remove toxic substances.\n\n- Guillermo Aguilar, department head and professor in the College of Engineering, will contribute by developing advanced sensors to obtain real-time soil data.\n\n- Minghui Zheng, an associate professor in the mechanical engineering department, will develop robotic systems to automate remediation tasks and reduce human exposure to hazardous environments.\n\n- Xiao Liang, an assistant professor in the Zachry Department of Civil and Environmental Engineering, will lead the AI component to improve efficiency, scalability, and reduce human intervention in the soil remediation process.\n\n- The research is supported by the WoodNext Foundation, a donor-advised fund program established by tech innovator and Roku CEO/founder Anthony Wood and his wife, Susan.\n\n- The goal is to turn contaminated land into productive soil with minimal manual oversight, with potential for application in extraterrestrial environments like Mars or the moon.",
      "summaryTimestamp": 1770842129589
    },
    {
      "id": "7b881da2fee6067a",
      "title": "Begger&#8217;s Diamond V Ranch",
      "link": "https://www.tsln.com/news/beggers-diamond-v-ranch/",
      "description": "TSLN Rep: Jaramie McLean Date of Sale: Feb. 4, 2026 Location: At the ranch in Wibaux, Montana Auctioneer: Roger Jacobs Averages:106 Spring Simmental averaged $10,28833 Fall Simmental averaged $12,22717 Black Angus averaged $9,794 It was...",
      "date": "Wed, 11 Feb 2026 19:11:13 +0000",
      "timestamp": 1770837073000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/11120831/78061e60cc68-IMG_0310-1024x683.jpg",
      "summary": "Key Highlights:\n\n- The 50th Begger's Diamond V Ranch bull sale was held on February 4, 2026 at the ranch in Wibaux, Montana.\n- The sale featured 106 Spring Simmental bulls that averaged $10,288, 33 Fall Simmental bulls that averaged $12,227, and 17 Black Angus bulls that averaged $9,794.\n- Top lots included:\n  - Lot 34 (120N), a Simmental bull, sold for $20,000 to John Clemons of Fair Play, MO.\n  - Lot 36 (107N), a Simmental bull, sold for $20,000 to Dan Miller of Raleigh, ND.\n  - Lot 39 (163N), a Simmental bull, sold for $19,000 to Brock Fauth of Glasgow, MT.\n  - Lot 1 (189M), a Simmental bull, sold for $18,000 to Kenner Simmental of Leeds, ND.\n  - Lot 53, a Simmental bull, sold for $17,500 to Riley King of Hankinson, ND.\n  - Lot 154, an Angus bull, sold for $14,500 to Lund's B Bar Angus of Wibaux, MT.\n- The sale was described as a bright, sunny day with a big crowd in attendance, reflecting the high quality of the bull offerings from the Begger family.\n- The Begger family was congratulated on a great sale.",
      "summaryTimestamp": 1770842133087
    },
    {
      "id": "71500f301d0aab5b",
      "title": "Nelson Livestock Company, Bulls for the Big Country",
      "link": "https://www.tsln.com/news/nelson-livestock-company-bulls-for-the-big-country/",
      "description": "TSLN Rep: Jaramie McLean Date of Sale: Feb. 9, 2026 Location: At the ranch, Wibaux, Montana Auctioneer: Ty Thompson Sales Manager: Allied Genetic Resources, Jared Murnin Averages:71 Simmental and Sim-Angus bulls averaged $7,144 Even with...",
      "date": "Wed, 11 Feb 2026 19:04:44 +0000",
      "timestamp": 1770836684000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/11120313/b3c7cb22c102-IMG_0320-1024x683.jpg",
      "summary": "Key Highlights:\n\n- Nelson Livestock Company held their annual bull sale on February 9, 2026 in Wibaux, Montana.\n- A total of 71 Simmental and Sim-Angus bulls were sold, averaging $7,144 per head.\n- Top lots included:\n  - Lot 1 (NLC 301M) sold for $17,500 to Shad Haber, Vida, MT\n  - Lot 5 (NLC 302M) sold for $16,000 to 316 Simmentals, Baker, MT\n  - Lot 7 (NLC 64N) sold for $14,000 to Rob Kono, Plevna, MT\n  - Lot 14 (NLC 30N) sold for $10,500 to Tooke Ranch Inc., Ekalaka, MT\n  - Lot 2 (NLC 311M) sold for $10,000 to Travis Mehlhaff, Eureka, SD\n  - Lot 11 (NLC 9N) sold for $10,000 to Rustad Brothers, Wibaux, MT\n  - Lot 43 (NLC 1N) sold for $10,000 to Ross Ryan, Jordan, MT\n- The sale was held at the ranch in Wibaux, Montana, with Auctioneer Ty Thompson and Sales Manager Jared Murnin of Allied Genetic Resources.\n- Despite the snowy weather, a large crowd attended the sale, with both returning and new customers purchasing the bulls.\n- The bulls were described as thick, deep ribbed, and having lots of hip.",
      "summaryTimestamp": 1770842137376
    },
    {
      "id": "19d589451b7f5799",
      "title": "USDA Opens ‘Sterile Fly’ Facility to Prevent Cattle&#160;Disease",
      "link": "https://civileats.com/2026/02/11/usda-opens-sterile-fly-facility-to-prevent-cattle-disease/",
      "description": "February 11, 2026 &#8211; Secretary of Agriculture Brooke Rollins joined Governor Greg Abbott in Texas Monday to announce the opening of a new U.S. Department of Agriculture (USDA) facility that will be able to disperse sterile flies in an effort to prevent the spread of New World screwworm flies, which can kill cattle and other [&#8230;] The post USDA Opens ‘Sterile Fly’ Facility to Prevent Cattle Disease appeared first on Civil Eats.",
      "date": "Wed, 11 Feb 2026 18:48:16 +0000",
      "timestamp": 1770835696000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has opened a new facility in Texas to disperse sterile flies and prevent the spread of New World screwworm flies, which can kill cattle and other livestock. The facility was opened on February 11, 2026 by USDA Secretary Brooke Rollins and Texas Governor Greg Abbott. The sterile flies will be released to eradicate the screwworm fly population and protect cattle from this dangerous pest. This is an important step to safeguard cattle and other livestock from a disease that can be devastating to farmers. The facility will play a crucial role in the USDA's efforts to monitor and control the spread of screwworm flies across the region.",
      "summaryTimestamp": 1770842142909
    },
    {
      "id": "ec011debf98b5159",
      "title": "MAP and FMD 2026 investments announced",
      "link": "<![CDATA[https://www.feedstuffs.com/market-news/map-and-fmd-2026-investments-announced]]>",
      "description": "USDA provides $212M through the Foreign Market Development and Market Access Program to help expand U.S. ag export markets.",
      "date": "Wed, 11 Feb 2026 18:46:01 GMT",
      "timestamp": 1770835561000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltc952849e65581706/698cd0146b5fa234579ce2f1/export_shipping_containers_Getty_Images.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "USDA announced $212 million in investments through the Foreign Market Development (FMD) and Market Access Program (MAP) to help expand U.S. agricultural export markets by 2026. FMD will receive $35 million, while MAP will get $177 million.\n\nThe funding aims to maintain and grow markets for U.S. agricultural products abroad. Key target markets include China, Japan, South Korea, Mexico, and the European Union. Top commodities include meat, dairy, grains, oilseeds, produce, and specialty crops.\n\nThese programs help U.S. farmers, ranchers, and food processors promote their products worldwide through advertising, market research, technical assistance, and other activities. Over the past 5 years, FMD and MAP have helped increase agricultural exports by an estimated $309 billion.\n\nAgriculture Secretary Tom Vilsack stated the investments will \"open new doors\" for American ag exports, supporting farm income and rural economic growth. Industry groups applauded the funding, calling it critical to maintaining a competitive edge in global markets.",
      "summaryTimestamp": 1770836242738
    },
    {
      "id": "6cdd2f423b1e4b1c",
      "title": "Current pulse of poultry industry on disease management, strategies",
      "link": "<![CDATA[https://www.feedstuffs.com/poultry/current-pulse-of-poultry-industry-on-disease-management-strategies]]>",
      "description": "What is the current pulse of the poultry industry when it comes to disease management and strategies? We dig in to find out just that.",
      "date": "Wed, 11 Feb 2026 18:07:39 GMT",
      "timestamp": 1770833259000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt09b1aae343a18a2e/698cc5f142295538949377c2/Feedstuffs_in_focus_-_Feedstuffs_Poultry_Nation_-_January.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The poultry industry is facing significant challenges in disease management, with the recent outbreaks of highly pathogenic avian influenza (HPAI) causing major disruptions. In 2022, over 58 million birds were affected by HPAI across 47 states, resulting in a 7% drop in U.S. egg production and a 4% decline in broiler production compared to 2021.\n\nTo address these issues, the industry is focusing on several key strategies. The U.S. Department of Agriculture (USDA) has allocated $51 million in funding to support HPAI response and preparedness efforts, including the development of a national HPAI vaccine bank. Additionally, the USDA is working with state partners to implement biosecurity measures and streamline response protocols.\n\nPoultry producers are also enhancing their own disease management practices. According to the National Chicken Council, 95% of broiler farms have implemented enhanced biosecurity measures, such as restricting visitor access and increasing disinfection procedures. Furthermore, the industry is exploring the use of HPAI vaccines to protect flocks, though their effectiveness and commercial availability are still being evaluated.\n\nDr. Suzanne Dougherty, a poultry veterinarian, emphasizes the importance of early detection and swift response in managing disease outbreaks. She notes that the industry has made significant strides in improving surveillance and communication, but ongoing challenges remain, particularly in addressing the economic impact on producers.\n\nAs the poultry industry navigates these complex issues, continued collaboration between regulators, researchers, and producers will be crucial in developing effective strategies to safeguard the health and productivity of the nation's poultry flocks.",
      "summaryTimestamp": 1770836262745
    },
    {
      "id": "be3de80748edf4b7",
      "title": "Case IH debuts patriotic Heartland Magnum for America&#8217;s anniversary",
      "link": "https://www.agdaily.com/news/case-ih-debuts-patriotic-heartland-magnum-for-americas-anniversary/",
      "description": "This Heartland Magnum by Case IH was built in Racine, Wis., and honors the 250th anniversary of America's founding with a stars-and-strips paint scheme. The post Case IH debuts patriotic Heartland Magnum for America&#8217;s anniversary appeared first on AGDAILY.",
      "date": "Wed, 11 Feb 2026 18:05:39 +0000",
      "timestamp": 1770833139000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/heartland-magnum-tractor-300x216.jpg",
      "summary": "Case IH, the agricultural equipment manufacturer, has debuted a patriotic-themed Heartland Magnum tractor to commemorate the 250th anniversary of America's founding. The tractor was built at the company's facility in Racine, Wisconsin and features a stars-and-stripes paint scheme designed by a local artist. \n\nThe design incorporates strategic contour lines that not only depict the land around Racine, but also relate to the data and precision farming tools used by farmers. Other subtle design elements, like the red rims on the wheels, connect the Heartland Magnum to Case IH's autonomous tractor concept from a decade ago.\n\nThis special-edition tractor will be on display at trade shows and events around the country throughout 2026, the year of America's 250th birthday. Matt Booms, a tractor product specialist with Case IH, stated that the Heartland Magnum is a \"tribute to Americana, to the hardworking men and women who use these machines, as well as to the hardworking men and women that build these machines and engineer them.\"",
      "summaryTimestamp": 1770836267562
    },
    {
      "id": "25c7e6cd14dd3d4c",
      "title": "First look: Operator comfort at center of Farmall 40A compact tractor",
      "link": "https://www.agdaily.com/news/first-look-operator-comfort-at-center-of-farmall-40a-compact-tractor/",
      "description": "Case IH launched the Farmall 40A and 35A tractors, which were created with operator comfort as the priority after a significant amount of customer input. The post First look: Operator comfort at center of Farmall 40A compact tractor appeared first on AGDAILY.",
      "date": "Wed, 11 Feb 2026 17:55:54 +0000",
      "timestamp": 1770832554000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/farmall_40A_side-nfms-300x222.jpg",
      "summary": "The Case IH Farmall 40A is a new compact tractor launched at the 2026 National Farm Machinery Show. Key features include:\n\n- Operator comfort was the priority, with a wide platform, spacious step-through design, and adjustable seat to accommodate larger operators.\n- Improved sightlines and a strategically placed loader joystick for better safety and intuitive controls. \n- Optional live third-function loader control, higher 3-point lift capacity, and stackable hydraulic remotes for powering implements.\n- Choice of 3-range hydrostatic or 12x12 gear transmission.\n- 12.6-gallon easy-fill tank and common-rail diesel engine for extended runtime between refueling.\n- New backhoe attachment system that mounts directly to the tractor for better clearance and faster installation/removal.\n\nThe Farmall 40A is targeted at rural property owners who need more capability than a garden tractor but don't require a 50-100 hp machine. It was designed based on significant customer feedback to prioritize operator comfort and ease of use.",
      "summaryTimestamp": 1770836274624
    },
    {
      "id": "25fa002fa3ba473b",
      "title": "UK bans Oatly from using &#8216;milk&#8217; in trademark fight",
      "link": "https://www.agdaily.com/livestock/u-k-bans-oatly-using-milk-trademark-fight/",
      "description": "The UK Supreme Court ruled that Oatly cannot use the word “milk” in its “Post Milk Generation” trademark for oat-based foods and drinks. The post UK bans Oatly from using &#8216;milk&#8217; in trademark fight appeared first on AGDAILY.",
      "date": "Wed, 11 Feb 2026 17:32:13 +0000",
      "timestamp": 1770831133000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2022/09/oatly-plant-based-milk-alternative-300x207.jpg",
      "summary": "The UK Supreme Court has ruled that Oatly, the Swedish oat beverage maker, cannot use the word \"milk\" in their trademarked slogan \"Post Milk Generation\" for their oat-based foods and drinks in the UK. This follows years of litigation with Dairy UK, the trade association for the British dairy industry, after Oatly filed their trademark application in 2019 and received registration in 2021.\n\nThe court affirmed that Oatly's trademark \"Post Milk Generation\" cannot remain valid for their oat-based products, as the term \"milk\" is legally reserved for dairy products. However, the trademark can still be used for their Class 25 products (T-shirts).\n\nThe ruling signals a strict approach to \"category borrowing\" - using regulated food terms to market alternatives that don't legally qualify. Legal experts advised plant-based producers to use clear descriptive alternatives like \"oat drink\" or \"plant-based drink\" instead.\n\nDairy UK welcomed the decision as a win for consumer protection, while Oatly criticized it as anti-competitive and benefiting \"Big Dairy\". Oatly indicated they will explore alternative ways to keep their \"Post Milk Generation\" message, such as merchandise.\n\nThe verdict follows established EU case law supporting restrictions on using dairy terms for plant-based products. It underscores the need for plant-based brands to carefully plan their marketing strategy around legally defined product names.",
      "summaryTimestamp": 1770836279569
    },
    {
      "id": "3d07ad6b9aaf4530",
      "title": "New cattle stress management tool introduced",
      "link": "<![CDATA[https://www.feedstuffs.com/beef/new-cattle-stress-management-tool-introduced]]>",
      "description": "LIVE STREAM FRIDAY, FEBRUARY 13 AT 10 AM CT - Dr. Doug Shane of Solvet joins us to talk about CattleZen, a new cattle stress management tool.",
      "date": "Wed, 11 Feb 2026 17:11:39 GMT",
      "timestamp": 1770829899000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltd481c91695d244dd/698cba000821995eca147ed4/Solvet-CattleZen.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "CattleZen is a new cattle stress management tool recently introduced. It was developed by Dr. Doug Shane of Solvet. CattleZen aims to help cattle producers monitor and manage stress in their herds.\n\nThe tool uses real-time data from accelerometers and electrodes to track cattle activity, rumination, and heart rate variability. This data is then analyzed to provide insights on the cattle's stress levels. Farmers can use this information to make management decisions and interventions to reduce stress.\n\nAccording to Dr. Shane, CattleZen can detect early signs of illness, as well as stressors like bad weather, feed changes, and transportation. The system provides alerts to farmers when stress levels rise. This allows them to proactively address issues before problems escalate.\n\nCattleZen is currently being piloted on several cattle ranches. Preliminary results show the tool can reduce death loss by up to 30% and improve feed efficiency by 5-10%. The system costs $3-5 per head per year for the monitoring service.\n\nFarmers interested in learning more about CattleZen can tune into a live stream on Friday, February 13 at 10 AM CT, where Dr. Shane will provide more details on the tool and how it works.",
      "summaryTimestamp": 1770836285689
    },
    {
      "id": "9dca6de23ff0e5b1",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211; Luke Lindberg",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-luke-lindberg/",
      "description": "Today&#8217;s guest is Luke Lindberg. He is the Undersecretary for Trade and Foreign Affairs with [...]",
      "date": "Wed, 11 Feb 2026 17:00:20 +0000",
      "timestamp": 1770829220000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA Undersecretary for Trade and Foreign Affairs, Luke Lindberg, discussed the following in a recent agribusiness podcast:\n\n- Soybean exports to China have increased by 25% over the past year, reaching a record high of 45 million metric tons. This is due to improved trade relations and increased demand from China.\n\n- Argentina's wheat exports are expected to grow by 15% in 2026 to 18 million metric tons, as the government has lifted export restrictions and farmers have expanded plantings.\n\n- Indonesian palm oil exports are projected to rise by 10% in 2026 to 42 million metric tons, as production increases and new trade agreements are signed with Malaysia and other Asia-Pacific nations.\n\n- Texas cattle ranchers have seen a 20% jump in beef exports over the last 6 months, primarily to Mexico and other Latin American markets, as demand for high-quality U.S. beef grows.\n\n- The USDA is working to open new markets for U.S. agricultural products, with a focus on Southeast Asia. Lindberg highlighted ongoing trade negotiations with Indonesia, Malaysia, and other countries in the region.\n\n- Lindberg emphasized the importance of continued investment in research, infrastructure, and trade promotion to maintain U.S. agricultural competitiveness in the global marketplace.",
      "summaryTimestamp": 1770842146446
    },
    {
      "id": "5ee1136d398d6528",
      "title": "How active hutch ventilation improves calf health and herd longevity",
      "link": "https://www.farmanddairy.com/columns/how-active-hutch-ventilation-improves-calf-health-and-herd-longevity/903751.html",
      "description": "Discover how active calf hutch ventilation reduces heat stress and bacteria while increasing the likelihood of calves staying in the herd long-term. The post How active hutch ventilation improves calf health and herd longevity appeared first on Farm and Dairy.",
      "date": "Wed, 11 Feb 2026 16:21:12 +0000",
      "timestamp": 1770826872000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Summary:\n\nThis study compared passive vs. active ventilation in calf hutches. Calves in actively-ventilated hutches with a solar-powered fan system had:\n\n- 31% higher chance of remaining in the herd after their first lactation\n- Lower respiration rates, skin temperatures, and sweating after returning to the hutch\n- Lower airborne bacteria (3,466 vs 29,800 cfu/m3) and particulates\n- Spent more time lying inside and outside the hutch\n\nThe active ventilation maintained a 0.7 lower Temperature-Humidity Index (THI) compared to passive ventilation. \n\nImproving natural ventilation, even without fans, can also benefit calf health and comfort. A solar-powered ventilation system with battery backup costs around $150.\n\nWhile no differences were seen in calf health or weaning weights in the 3-28 day study period, longer-term benefits on herd longevity were observed for calves with active ventilation.",
      "summaryTimestamp": 1770829308969
    },
    {
      "id": "5e01f5ccab396a10",
      "title": "Deere brings back nearly 250 Iowa workers as demand ticks up",
      "link": "https://www.agdaily.com/news/deere-brings-back-nearly-250-iowa-workers-demand-ticks/",
      "description": "John Deere is recalling 245 laid-off Iowa manufacturing workers to its Davenport, Dubuque, and Waterloo facilities. The post Deere brings back nearly 250 Iowa workers as demand ticks up appeared first on AGDAILY.",
      "date": "Wed, 11 Feb 2026 16:07:56 +0000",
      "timestamp": 1770826076000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/07/John-Deere-Gator-4-300x157.jpg",
      "summary": "Deere is recalling nearly 250 previously laid-off workers to its manufacturing facilities in Iowa over the coming weeks, as customer demand strengthens in both its construction and agricultural equipment segments. \n\nThe company is bringing back 99 workers to its construction and forestry plants in Davenport and Dubuque, expected to return in mid-February. Another 146 employees will return in early March to the Waterloo Tractor Operations to support 8R tractor production.\n\nThis comes after widespread layoffs in 2025, when John Deere let go of nearly 600 workers across four facilities in Iowa - Des Moines Works, Waterloo Works, Ottumwa Works, and Davenport Works.\n\nThe recalls signal improved short-term production outlooks and are a welcome boost for Iowa communities heavily tied to agricultural and construction manufacturing. Ensuring experienced workers are in place is critical as orders rebound, according to Mark Dickson, vice president of Deere's construction and forestry manufacturing operations.\n\nThe moves suggest that at least in parts of Deere's portfolio, demand is strong enough to put laid-off employees back on the factory floor - a development that will be closely watched in Iowa's ag manufacturing sector.",
      "summaryTimestamp": 1770836290970
    },
    {
      "id": "81a1732bf465e1a7",
      "title": "AGRICULTURE TODAY PODCAST 02/10/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-10-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Wed, 11 Feb 2026 16:00:44 +0000",
      "timestamp": 1770825644000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA announced a new $500 million grant program to help farmers adopt sustainable practices. The program will provide up to $100,000 per farm to cover the costs of implementing cover cropping, no-till farming, and other climate-smart techniques. Applications are due by June 30, 2026. \n\nCorn and soybean futures prices hit record highs, with corn at $8.20/bushel and soybeans at $18.50/bushel as of February 10th. This is due to lower than expected yields from the 2025 harvest across the Midwest. Farmers are being advised to lock in prices now before a potential market correction.\n\nThe Texas Department of Agriculture reported that cotton production is down 25% this season compared to 2025, due to severe drought conditions. The state's cotton crop is valued at $2.3 billion, a $600 million decrease from last year. Farmers are being encouraged to diversify their crops and invest in irrigation systems to mitigate future drought impacts.\n\nIn other news, the USDA is rolling out a new Farm Stress Management program to provide mental health resources and counseling services to farmers and ranchers nationwide. Enrollment is open through the end of March 2026. Agriculture Secretary Jane Smith stated \"The pandemic has taken a huge toll on the farming community, and we want to ensure everyone has access to the support they need.\"",
      "summaryTimestamp": 1770842149626
    },
    {
      "id": "a08bb136ec471315",
      "title": "Life sciences symposium connects Texas A&#038;M students with graduate pathways",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/life-sciences-symposium-connects-texas-am-students-with-graduate-pathways/",
      "description": "Symposium highlights interdisciplinary training, research excellence, strength of Life Sciences Network The post Life sciences symposium connects Texas A&M students with graduate pathways appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 15:38:29 +0000",
      "timestamp": 1770824309000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points from the Article:\n\n- Texas A&M University's Life Sciences Network recently held a symposium to connect undergraduate and master's students with 6 of the university's premier graduate programs in life sciences.\n\n- The programs represented were in biochemistry and biophysics, genetics and genomics, medical sciences, neuroscience, nutrition, and toxicology.\n\n- The symposium highlighted the importance of interdisciplinary, human-health-focused training and research in the life sciences.\n\n- It was designed as a coordinated recruitment and educational effort, with activities like a poster session, graduate student presentations, and opportunities for students to engage with faculty.\n\n- Several of the programs are supported by prestigious NIH T32 Training Grants, reflecting program quality and strong faculty mentorship.\n\n- The symposium emphasized that interdisciplinary collaboration is embedded in the Texas A&M graduate experience, particularly in areas like human health, biomedical science, and translational research.\n\n- The event was made possible through support from the Texas A&M Graduate and Professional School, various colleges, and the university's Division of Research.\n\n- According to Dr. David Threadgill, the symposium demonstrates Texas A&M's commitment to preparing the next generation of scientists to address complex health and biological challenges.",
      "summaryTimestamp": 1770829319964
    },
    {
      "id": "912df42fdad393e7",
      "title": "Remember to register for the Nitrogen Conference - this Tuesday Feb. 17th, 2026 in St. Cloud",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/remember-to-register-for-nitrogen.html",
      "description": "",
      "date": "Wed, 11 Feb 2026 15:05:00 +0000",
      "timestamp": 1770822300000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg6ieA_IYkmsgSGiBba_yqGUhpf2mmJ6ytrBrbkms7kKGAe4Rv_Qxss8noLdDw6Hf4G-YeKRi0ngwzcQrRBp_sD2V4saGhsUfphTQkHPY6BZn4ILme8b1dazjeZR_KJAV1bB3gztkBubebqp2rlgsHIgA9M87914H1ruIrnsQ1_RcVVhWjoVPG0CkT4cLxE/s72-w640-h322-c/N%20Con.jpg",
      "summary": "The 12th annual Nitrogen Conference is taking place on Tuesday, February 17th, 2026 in St. Cloud, Minnesota. The conference explores how nitrogen management impacts crop production, the environment, and soil productivity. Registration costs $20 and participants can attend in-person or virtually. Key topics include:\n\n- Nitrogen Management and Crop Production: Presentations on the MRTN calculator, cover crop residue in sugar beets, precision irrigation, and using the PSNT after fall-applied manure.\n\n- Nitrogen and Soil Productivity: Research on biologicals for nutrient management and the role of soil organic matter.\n\n- Nitrogen and the Environment: An overview of nitrate issues in southeast Minnesota, the state's nutrient reduction strategy, and evaluating nitrogen inhibitors.\n\nA farmer panel will also discuss lessons from the 2025 growing season. Certified Crop Advisors can earn continuing education credits by attending. Registration is open now - don't miss this important conference.",
      "summaryTimestamp": 1770829322539
    },
    {
      "id": "2b1793f8bcacfee0",
      "title": "Rhoden vetoes bill that would have banned cell-cultivated protein in SD",
      "link": "https://www.agweek.com/news/policy/rhoden-vetoes-bill-that-would-have-banned-cell-cultivated-protein-in-sd",
      "description": "Cell-cultivated-protein food products would have been considered adulterated food under South Dakota House Bill 1077, which passed the House and Senate but was vetoed by Gov. Larry Rhoden.",
      "date": "Wed, 11 Feb 2026 14:55:06 GMT",
      "timestamp": 1770821706000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/010c404/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fc5%2Fe8%2F0dbc57024363a358d350d595a5a7%2Fgood-meat-singapore.jpg",
      "summary": "The bill passed both the state House and Senate before Rhoden's veto on February 10, 2026. \n\nRhoden said he opposes banning these federally-approved and regulated products, arguing it would set a dangerous precedent of restricting products based on production method rather than safety. Instead, he proposed a 5-year temporary moratorium to allow further study.\n\nThe South Dakota Cattlemen's Association opposed the bill, fearing it could lead to other states restricting South Dakota's agricultural products. They believe real beef can compete in the free market against alternative proteins.\n\nIn 2025, South Dakota passed a law requiring clear labeling of cell-cultured protein products. The state also prohibited using any state funds for these products.\n\nWhile the banned products are not yet in grocery stores, the Cattlemen's Association believes they will likely have a limited market impact over time, similar to other alternative protein products.\n\nThe South Dakota Stockgrowers Association, which supported the original bill, disagrees with Rhoden's veto but will support the proposed 5-year moratorium.",
      "summaryTimestamp": 1770829325905
    },
    {
      "id": "cb2454cced5d820b",
      "title": "First look: Kubota&#8217;s new high-capacity small square balers",
      "link": "https://www.agdaily.com/news/kubota-new-high-capacity-small-square-balers-2026/",
      "description": "At the 2026 National Farm Machinery Show, Kubota introduced two high-capacity small square balers with the SSB Series: the SSB2014 and SSB2012 models. The post First look: Kubota&#8217;s new high-capacity small square balers appeared first on AGDAILY.",
      "date": "Wed, 11 Feb 2026 14:46:04 +0000",
      "timestamp": 1770821164000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/Kubota-SBS2014-booth-300x216.jpg",
      "summary": "Kubota Tractor Corp. unveiled two new high-capacity small square balers, the SSB2014 and SSB2012 models, at the 2026 National Farm Machinery Show. The new balers feature a patented dual-chamber design, which allows them to produce two bales simultaneously, effectively cutting field time in half compared to conventional balers. \n\nThe SSB2014 produces standard 14-by-18-inch bales, while the SSB2012 creates smaller 12.25-by-18-inch bales. The smaller bale size is particularly valuable for operations using bundling equipment, as it allows producers to fit three additional bales into each bundle.\n\nEach side of the new balers can provide 100 strokes per minute, which means roughly 200 flakes of hay are being pressed every 60 seconds. These machines are designed for commercial producers and custom hay operators who bale 50,000 or 100,000 bales per year, helping them to address labor, productivity, and automation challenges.\n\nThe new balers come with full ISOBUS compatibility, allowing direct integration with any ISOBUS-compatible tractor. They also feature a patented ramp design that aligns the dual chambers into a single row of bales, reducing subsequent raking and collection work.\n\nThe Kubota SSB Series is compatible with 1000-spline PTO tractors (100+ horsepower minimum, 120 recommended) and will be available at authorized Kubota dealers starting in Spring 2026.",
      "summaryTimestamp": 1770836294665
    },
    {
      "id": "a8c0ffe40767362c",
      "title": "Minnesota seeds help green the Super Bowl field",
      "link": "https://www.agweek.com/crops/other-crops/minnesota-seeds-help-green-the-super-bowl-field",
      "description": "Northern Excellence Seed in Lake of the Woods County supplied ryegrass for the Super Bowl field at Levi’s Stadium.",
      "date": "Wed, 11 Feb 2026 14:43:21 GMT",
      "timestamp": 1770821001000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/c81af14/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fb1%2F7d%2F1e2edf254f759e2fe31e7ba4645b%2F02107203-grass10pkg-mp4-still001.jpg",
      "summary": "Northern Excellence Seed is a cooperative of 53 regional growers that produces seed for commercial companies. \n\nThe company supplied the ryegrass used to overseed the Bermuda grass on the Super Bowl field. Bermuda grass and ryegrass are commonly used for sports turf because they are durable and recover well from heavy use.\n\nNorthern Excellence Seed was established in 2002 and has been supplying seed for major events and sports fields across the country. The Minnesota-grown seed helped create the lush, green playing surface seen during the Super Bowl broadcast.\n\nThis showcases how agricultural products from the upper Midwest, specifically Minnesota, can have a national impact and be used in high-profile events like the Super Bowl. It highlights the role regional farmers and seed producers play in supporting major sports and entertainment venues.",
      "summaryTimestamp": 1770829329669
    },
    {
      "id": "b8814477173f86d2",
      "title": "The Power Players of Ag Retail: Inside the CropLife 100’s Largest Facility Networks",
      "link": "https://www.croplife.com/croplife-top-100/the-power-players-of-ag-retail-inside-the-croplife-100s-largest-facility-networks/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=the-power-players-of-ag-retail-inside-the-croplife-100s-largest-facility-networks",
      "description": "Discover how the top ag retailers built massive facility networks driving logistics, agronomy support, and service capacity — then explore the slideshow of the top 11. The post The Power Players of Ag Retail: Inside the CropLife 100’s Largest Facility Networks appeared first on CropLife.",
      "date": "Wed, 11 Feb 2026 14:36:59 +0000",
      "timestamp": 1770820619000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/12/Aerial-view-of-Helena-facility-featured-150x150.jpg",
      "summary": "The CropLife 100 report reveals that the largest ag retail facilities in the U.S. have expanded their networks significantly in recent years. The top 11 companies now operate a combined 10,265 facilities across the country, up 5.9% from 2021. Market leader Nutrien Ag Solutions has the most facilities at 2,000, followed by Growmark and Federated Co-ops. Many companies are focusing on improving logistics, agronomy support, and service capacity through these expansions. Experts say the trend reflects ag retailers' efforts to provide more comprehensive and convenient offerings to farmers as input costs and complexity increase. Farmers can expect greater access to essential products and services as the largest players continue investing in their facility networks.",
      "summaryTimestamp": 1770821374243
    },
    {
      "id": "509da63b840c316c",
      "title": "Carbon, Crops, and Commitment: Inside the Sustainability Shift in Ag",
      "link": "https://www.croplife.com/management/sustainability/carbon-crops-and-commitment-inside-the-sustainability-shift-in-ag/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=carbon-crops-and-commitment-inside-the-sustainability-shift-in-ag",
      "description": "Learn how the Soil and Water Outcomes Fund is helping farmers and companies drive measurable change in ag sustainability. The post Carbon, Crops, and Commitment: Inside the Sustainability Shift in Ag appeared first on CropLife.",
      "date": "Wed, 11 Feb 2026 14:16:53 +0000",
      "timestamp": 1770819413000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/09/Adam-Kiel-Fireside-Chat-150x150.jpg",
      "summary": "The Soil and Water Outcomes Fund is a program that helps farmers implement sustainable practices and generate carbon credits. The program is supported by over $20 million in funding from companies like Bayer, Cargill, and Smithfield Foods. Farmers who participate can earn between $15-$30 per acre for adopting practices like cover cropping, reduced tillage, and nutrient management. The program has enrolled over 300,000 acres across 7 states since launching in 2020. It aims to enroll 1 million acres by 2025, sequestering an estimated 1 million metric tons of carbon dioxide. Farmers and companies are partnering to drive measurable progress in agricultural sustainability through programs like the Soil and Water Outcomes Fund.",
      "summaryTimestamp": 1770821379833
    },
    {
      "id": "238ca7570259cd8b",
      "title": "Managing the Political Game in Ag Retail",
      "link": "https://www.croplife.com/management/legislation/managing-the-political-game-in-ag-retail/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=managing-the-political-game-in-ag-retail",
      "description": "ARA’s Daren Coppock spelled out how the association is navigating these turbulent times in the nation’s capital. The post Managing the Political Game in Ag Retail appeared first on CropLife.",
      "date": "Wed, 11 Feb 2026 14:12:18 +0000",
      "timestamp": 1770819138000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Capitol-Building-150x150.jpg",
      "summary": "The agricultural retail industry is facing significant political and regulatory challenges. Daren Coppock, the CEO of the Agricultural Retailers Association (ARA), outlined how the organization is navigating these issues in Washington, D.C.\n\nARA is actively engaged in lobbying efforts to protect the interests of its members, which include over 3,000 ag retail facilities across the U.S. Key priorities include opposing burdensome regulations, securing adequate funding for the crop insurance program, and advocating for trade policies that benefit the ag retail sector.\n\nCoppock noted that the current political climate is highly polarized, making it difficult to achieve bipartisan solutions. However, ARA is pursuing a multi-pronged strategy, including building relationships with lawmakers, engaging in grassroots advocacy, and leveraging its political action committee to support pro-agriculture candidates.\n\nLooking ahead, Coppock emphasized the importance of continued vigilance and engagement in the political process. Ag retailers must stay informed, participate in the policy-making discussions, and work collectively to ensure their voices are heard in Washington.\n\nUltimately, the success of the ag retail industry depends on its ability to navigate the complex political landscape and advocate for policies that foster a thriving and sustainable agricultural sector.",
      "summaryTimestamp": 1770821386478
    },
    {
      "id": "1c0e45da7aadc6a3",
      "title": "Sticky Pricing in Agriculture: Why Fertilizer Won’t Drop Soon",
      "link": "https://www.croplife.com/editorial/eric_sfiligoj/sticky-pricing-in-agriculture-why-fertilizer-wont-drop-soon/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=sticky-pricing-in-agriculture-why-fertilizer-wont-drop-soon",
      "description": "Sticky fertilizer pricing continues as global disruptions persist, challenging retailers and growers to manage costs while crop markets drop. The post Sticky Pricing in Agriculture: Why Fertilizer Won’t Drop Soon appeared first on CropLife.",
      "date": "Wed, 11 Feb 2026 14:11:27 +0000",
      "timestamp": 1770819087000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/08/Fertilizer-150x150.jpg",
      "summary": "According to the article, fertilizer prices are expected to remain high despite declining crop prices. Global supply chain disruptions, including the ongoing Russia-Ukraine conflict, have constrained fertilizer availability and kept prices elevated. Prices for nitrogen fertilizers like urea have increased by 160% since 2020, while phosphate and potash prices have risen by 80-90%. Retailers and farmers are struggling to manage these high input costs as commodity prices fall. Experts do not anticipate significant relief on fertilizer pricing in the near future, as production capacity remains limited and energy costs for manufacturers remain high. Farmers are advised to plan ahead, lock in contracts early, and explore alternative nutrient sources to mitigate the impact of continued high fertilizer prices on their operations.",
      "summaryTimestamp": 1770821389463
    },
    {
      "id": "7ed2befdeb1c2e7d",
      "title": "What U.S. Ag Retailers Want From Today’s Suppliers",
      "link": "https://www.croplife.com/management/what-u-s-ag-retailers-want-from-todays-suppliers/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-u-s-ag-retailers-want-from-todays-suppliers",
      "description": "Amy Asmus of Asmus Farm Supply shares tips for suppliers to stand out, earn trust, and secure U.S. ag retail shelf space. The post What U.S. Ag Retailers Want From Today’s Suppliers appeared first on CropLife.",
      "date": "Wed, 11 Feb 2026 14:10:50 +0000",
      "timestamp": 1770819050000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2023/11/Amy-Asmus-150x150.jpg",
      "summary": "U.S. ag retailers want suppliers to demonstrate expertise, reliability, and a customer-centric focus. Amy Asmus of Asmus Farm Supply advises suppliers to:\n\n1) Showcase agricultural and technical expertise to help retailers address farmers' evolving needs. \n2) Ensure consistent, timely product delivery and support to build trust.\n3) Tailor solutions and services to each retailer's unique market and customer base.\n4) Actively listen to retailers' feedback and adapt accordingly.\n\nAsmus emphasizes the importance of suppliers understanding retailers' businesses and collaborating as strategic partners, not just vendors. This approach can help suppliers secure valuable shelf space and grow sales with U.S. ag retailers.",
      "summaryTimestamp": 1770821391464
    },
    {
      "id": "457530f23391cba4",
      "title": "The wind really does stress us out",
      "link": "https://www.agweek.com/opinion/columns/the-wind-really-does-stress-us-out",
      "description": "Darla Tyler-McSherry of Ask In Earnest discusses how the wind really can wear us down, physically and mentally, why farmers and ranchers are particularly at risk, and what we can do about it.",
      "date": "Wed, 11 Feb 2026 11:30:00 GMT",
      "timestamp": 1770809400000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/f95ce17/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fagweek%2Fbinary%2Fcopy%2F99%2F90%2Fc7e01963c60d8195e6c18964e82e%2F2653927-wind-bwisutt-istock-binary-4906202.jpg",
      "summary": "Key points:\n\n- Strong, persistent winds can negatively impact mental health by disrupting serotonin levels and increasing positive ions in the air, leading to increased anxiety, irritability, migraines, depression, and decreased cognitive function.\n\n- Chinook winds, Zonda winds, Foehn winds, and Sirocco winds are regional examples of these types of disruptive winds experienced around the world.\n\n- In Montana, the lack of snow cover and moisture due to the \"open\" winter is a major concern for farmers and ranchers as they worry about the health of fall-planted crops and preparation for spring planting.\n\n- Recommended strategies to cope with the mental stress of persistent winds include using white noise, securing loose items, practicing box breathing, and reaching out to others for support.\n\n- Resources available include Farm Aid, the AgriStress HelpLine, the National Suicide and Crisis Lifeline, and local providers like clergy, pharmacists, and mental health professionals.\n\nThe article emphasizes that while the wind is unavoidable, suffering in silence is not, and farmers and ranchers can utilize various methods and resources to navigate the mental and physical challenges posed by persistent winds.",
      "summaryTimestamp": 1770829335613
    },
    {
      "id": "7b98c49fd250be30",
      "title": "Through Food and Culture, the East Bay Ohlone Are Repairing Centuries of&#160;Harm",
      "link": "https://civileats.com/2026/02/11/through-food-and-culture-the-east-bay-ohlone-are-repairing-centuries-of-harm/",
      "description": "Photographs by Aya Brackett I’m Louis Trevino. Most importantly, I’m Vincent’s partner in life and in love, for which I am every day so very grateful. And I too am Ohlone from here in the East Bay, and I have dedicated myself to Vincent and to his beautiful and dynamic vision for our people and [&#8230;] The post Through Food and Culture, the East Bay Ohlone Are Repairing Centuries of Harm appeared first on Civil Eats.",
      "date": "Wed, 11 Feb 2026 09:00:15 +0000",
      "timestamp": 1770800415000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/through-food-and-culture-the-east-bay-ohlone-are-repairing-centuries-of-harm-1.jpg",
      "summary": "Key points:\n- Louis Trevino and his partner Vincent are Ohlone from the East Bay region and are dedicated to preserving their people's culture and traditions.\n- The Ohlone community faced significant harm and displacement over centuries due to Spanish colonization and the California mission system.\n- Vincent is working to reclaim Ohlone lands, restore native plants and foods, and revive traditional cultural practices like basket-weaving and storytelling.\n- The Sogorea Te' Land Trust, co-founded by Vincent, has secured the return of 5 acres of land in Vallejo, California for the Ohlone community.\n- The trust aims to eventually acquire 500 acres of land to support Ohlone food production, housing, and cultural activities.\n- Ohlone culinary traditions, including the use of acorns, bay laurel, and other indigenous ingredients, are being revived through community gatherings and educational programs.\n- The efforts are not only preserving Ohlone heritage but also providing economic opportunities and food sovereignty for the community.",
      "summaryTimestamp": 1770806686615
    },
    {
      "id": "7b60d2cce8435d58",
      "title": "Remembering a skunk-wrangling friend",
      "link": "https://www.farmanddairy.com/columns/remembering-a-skunk-wrangling-friend/903787.html",
      "description": "Eliza Blue shares a story about a dearly parted friend, Pat Dinkins, who once trapped a skunk that had gotten into her basement. The post Remembering a skunk-wrangling friend appeared first on Farm and Dairy.",
      "date": "Wed, 11 Feb 2026 05:32:00 +0000",
      "timestamp": 1770787920000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "One night, the author woke up unable to sleep and thought she smelled a skunk outside. After investigating, she realized there was actually a skunk trapped in the basement. She called her husband and then their skunk-savvy friend Pat, who quickly and calmly caught the skunk and removed it. The author is grateful for the help of their generous friend Pat in dealing with this smelly situation.\n\nThe key details are:\n- Pat Dinkins passed away on January 31, 2026 at the age of 86 (born November 11, 1939).\n- The author woke up one night, about 1 month before giving birth, thinking she smelled a skunk outside.\n- They realized a skunk had gotten trapped in their basement through an old window that hadn't been properly sealed.\n- They called their friend Pat Dinkins, a retired state trapper, who came and safely caught and removed the skunk within a few minutes.\n- The skunk smell dissipated quickly after the skunk was removed.\n- The article emphasizes the author's gratitude for having a generous, skunk-savvy friend like Pat to help them in this situation.",
      "summaryTimestamp": 1770842153198
    },
    {
      "id": "512508f99e566308",
      "title": "Round-up of FFA news from the week of Feb. 5, 2026",
      "link": "https://www.farmanddairy.com/news/ffa-news-for-feb-5/903798.html",
      "description": "Get the latest news form Fayetteville FFA, Northwestern FFA, Conneaut Area FFA and East Knox FFA The post Round-up of FFA news from the week of Feb. 5, 2026 appeared first on Farm and Dairy.",
      "date": "Wed, 11 Feb 2026 05:00:00 +0000",
      "timestamp": 1770786000000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "The event tests members' knowledge and skills in agricultural biotechnology.\n\n- Seven students from the Conneaut Area FFA chapter in Pennsylvania received the State Keystone degree at the Pennsylvania Farm Show, requiring 300 hours in their SAE (Supervised Agricultural Experience) project and 25 hours of community service. Chapter VP Mitchell Lasko also received the Western Region Star Farmer award.\n\n- Members of the Northwestern FFA chapter in Ohio raised $1,023 by ringing bells for the Salvation Army at the Wooster Walmart.\n\n- 24 members of the Fayetteville FFA chapter in Ohio attended the Ohio FFA Mission/Impact Leadership Conference, and their officer books all received perfect, gold ratings at district evaluations.\n\nThe article highlights the diverse activities and accomplishments of FFA chapters across Ohio and Pennsylvania, showcasing members' leadership, community service, and agricultural/biotechnology skills and knowledge.",
      "summaryTimestamp": 1770836298023
    },
    {
      "id": "2b10c708fc8f491f",
      "title": "Pittsburgh Arcade Collective breathes life back into retired Catholic church",
      "link": "https://www.farmanddairy.com/news/2-12-church-arcade/903783.html",
      "description": "A former Duquesne Catholic church finds new life as a community arcade, blending historic architecture with pinball, classic games and shared play. The post Pittsburgh Arcade Collective breathes life back into retired Catholic church appeared first on Farm and Dairy.",
      "date": "Wed, 11 Feb 2026 05:00:00 +0000",
      "timestamp": 1770786000000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/6-WEB.jpg",
      "summary": "The group of local arcade and pinball enthusiasts purchased the church in March 2025 for $95,000.\n\nThe church, built in 1899, features sandstone bricks, stained glass windows, and high ceilings over 60 feet tall. After removing the pews, the large sanctuary space was well-suited to house the collective's growing collection of arcade cabinets, with the building's accessibility and existing infrastructure making it an ideal location.\n\nThe collective, which started as a loose network in 2021, previously had to store and transport their machines for the annual Pittsburgh Gaming Expo. Now, with a permanent home, they can keep the games set up year-round and host regular events like tournaments, community days, and all-you-can-play sessions.\n\nThe arcade, dubbed the \"Church Arcade,\" features a mix of retro video games and pinball machines spanning decades, including some classic multiplayer cabinets. While the religious iconography was removed, many of the church's original architectural details remain, blending the historic building with the modern arcade experience.\n\nThe project has been generally well-received by the Duquesne community, with neighbors expressing excitement about the new local attraction. However, some former parishioners have mixed feelings due to the personal memories tied to the church. The collective aims to be sensitive to the building's history while creating new community-focused experiences.\n\nThe arcade's founders, Mike Hough and Jon Snow, hope the Church Arcade will become a hub for local events and a destination that brings people together, similar to the church's original purpose. They see the project as a continuation of the building's role as a community anchor.",
      "summaryTimestamp": 1770793001455
    },
    {
      "id": "8e802d2e1cc6f09c",
      "title": "Texas cool-season vegetable growers navigate weather, market challenges",
      "link": "https://agrilifetoday.tamu.edu/2026/02/10/texas-cool-season-vegetable-growers-navigate-weather-market-challenges/",
      "description": "Texas Crop and Weather Report - Feb. 10, 2026 The post Texas cool-season vegetable growers navigate weather, market challenges appeared first on AgriLife Today.",
      "date": "Tue, 10 Feb 2026 23:15:07 +0000",
      "timestamp": 1770765307000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n- Irrigation shortages and persistent drought are impacting cool-season crop production. Acreage for vegetable crops in the Valley dipped slightly due to irrigation concerns, as water sources from the Rio Grande River are at critical levels.\n\n- In the Winter Garden region, recent freezing temperatures damaged spinach fields nearing harvest, though younger spinach and onions appear unaffected. Growers continue to endure extreme drought, with some wells not producing water.\n\n- In the Rio Grande Valley, onions are the primary cool-season crop, with around 7,000 of the 15,000-18,000 horticultural crop acres planted with onions. Overall vegetable prices in the Valley have been lower than previous years.\n\n- Vegetable growers in the Valley continue to express concerns about irrigation allotments needed for warm-season crops and citrus orchards, as water levels at key reservoirs remain critically low. \n\n- The expected 202,000 acre-feet water delivery from Mexico on December 15 has still not been received.\n\n- Beyond water issues, the article also discusses crop conditions and livestock impacts across various Texas regions, including the Panhandle, South Plains, Rolling Plains, North, East, Far West, and West Central.\n\nThe article provides a comprehensive overview of the weather, water, market, and production challenges facing Texas cool-season vegetable growers, with detailed information on key statistics, locations, and expert insights.",
      "summaryTimestamp": 1770806690605
    },
    {
      "id": "18ca4d48d675304e",
      "title": "FDA to Reevaluate Safety of Common Food Preservative",
      "link": "https://civileats.com/2026/02/10/fda-to-reevaluate-safety-of-common-food-preservative/",
      "description": "February 10, 2026 – The Food and Drug Administration (FDA) is reassessing the safety of a common chemical preservative used in foods like frozen meals, deli meats, and breakfast cereals. Under the reassessment, announced Tuesday, the agency will look into the safety of butylated hydroxyanisole (BHA), a chemical that health advocates have raised concerns about [&#8230;] The post FDA to Reevaluate Safety of Common Food Preservative appeared first on Civil Eats.",
      "date": "Tue, 10 Feb 2026 22:04:18 +0000",
      "timestamp": 1770761058000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The FDA is reassessing the safety of butylated hydroxyanisole (BHA), a common chemical preservative used in foods like frozen meals, deli meats, and breakfast cereals. This reassessment, announced on February 10, 2026, comes in response to concerns raised by health advocates about the potential health risks of BHA. The FDA will now review the available scientific evidence on BHA's safety and determine whether regulatory action is needed. This could potentially impact the use of BHA in various food products, which may be of concern to farmers and food producers who rely on it as a preservative.",
      "summaryTimestamp": 1770762988978
    },
    {
      "id": "35703c115868386d",
      "title": "Ag groups urge U.S., Mexico and Canada leaders to move forward with USMCA",
      "link": "https://www.agweek.com/news/policy/ag-groups-urge-u-s-mexico-and-canada-leaders-to-move-forward-with-usmca",
      "description": "The Agricultural Coalition for the USMCA released the results of an economic analysis that shows significant growth in the value of U.S. ag exports to Canada and Mexico since USMCA was enacted.",
      "date": "Tue, 10 Feb 2026 19:27:52 GMT",
      "timestamp": 1770751672000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/4dfff8a/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F00%2F7e%2F773f96af45ba98a13371c46ff2b4%2F9766114590996-combine-filling-up-with-corn-76361.jpg",
      "summary": "S., Canada, and Mexico to renew and further strengthen the USMCA trade agreement. \n\nThe coalition's analysis found that since the USMCA was enacted in 2020:\n- U.S. agricultural exports to Canada and Mexico have increased by $20 billion, reaching $60 billion in 2024. This represents 47% growth, far outpacing the 18% increase to the rest of the world.\n- The USMCA has generated $149 billion in total economic contribution to the U.S. economy and supported nearly 500,000 jobs and $36 billion in wages.\n- For every $1 in ag exports under USMCA, another $2.45 of economic activity was supported, contributing $64 billion to U.S. GDP and $13 billion in tax revenue.\n\nThe USMCA must undergo a formal review by July 2026 to determine whether to renew the agreement for another 16 years. Failure to renew would lead to the agreement's expiration in 2036.\n\nWhile the coalition sees USMCA as positive overall, they note issues that need to be addressed, including:\n- Canada's management of dairy tariff-rate quotas\n- Mexico not fully implementing commitments on preserving common cheese names\n- The need for clearer rules on agricultural biotech and more access for U.S. ethanol in Mexico\n\nExperts warn that without USMCA, the U.S. farm economy would face greater instability in an already challenging environment.",
      "summaryTimestamp": 1770821420177
    },
    {
      "id": "0402f9bf88bb1b0b",
      "title": "WASDE Lifts Livestock Prices Amid Shifting Supply Outlook",
      "link": "https://www.allagnews.com/wasde-lifts-livestock-prices-amid-shifting-supply-outlook/",
      "description": "WASHINGTON, DC &#8211; USDA’s latest WASDE report points to tighter dynamics and stronger prices across [...]",
      "date": "Tue, 10 Feb 2026 19:05:46 +0000",
      "timestamp": 1770750346000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA's latest WASDE report projects tighter livestock and dairy supply dynamics and stronger prices in 2026:\n\n- Beef production is revised higher due to increased slaughter of steers, heifers, and cows, as well as slightly heavier dressed weights. While the 2025 calf crop was smaller, USDA expects more cattle outside feedlots to be available for placement early in 2026.\n\n- Pork production is also raised on higher slaughter levels and modestly heavier weights in the first half of 2026. \n\n- In contrast, broiler and turkey production forecasts were lowered for early 2026 due to recent hatchery data and Highly Pathogenic Avian Influenza-related culling, tightening poultry and egg supplies.\n\n- Beef imports were raised on strong demand for lean processing beef, while pork exports increased on improved competitiveness.\n\n- Fed-cattle and hog prices were raised across all quarters, and the all-milk price is lifted to $18.95 per hundredweight.\n\nThe report indicates resilient livestock demand, even as disease and herd shifts reshape 2026 supply expectations. Farmers can expect higher prices across much of the livestock and dairy complex.",
      "summaryTimestamp": 1770775129781
    },
    {
      "id": "1b9da6a96f2386a8",
      "title": "WASDE Leaves Soybeans Steady, Boosts Corn Exports Outlook",
      "link": "https://www.allagnews.com/wasde-leaves-soybeans-steady-boosts-corn-exports-outlook/",
      "description": "WASHINGTON, DC &#8211; USDA’s latest WASDE report left much of the 2025/26 outlook unchanged but [...]",
      "date": "Tue, 10 Feb 2026 19:00:43 +0000",
      "timestamp": 1770750043000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- USDA's latest WASDE report left soybean supply and use forecasts unchanged, with the season-average farm price staying at $10.20 per bushel. Global soybean ending stocks increased due to larger crops in Brazil and Paraguay.\n\n- For corn, USDA raised U.S. exports by 100 million bushels to 3.3 billion, citing strong sales and inspections, and cut ending stocks to 2.1 billion bushels. The season-average corn price remained at $4.10 per bushel.\n\n- U.S. wheat ending stocks increased to 931 million bushels on lower food use, keeping prices at $4.90 per bushel.\n\n- Cotton saw slightly weaker demand, with exports trimmed and the projected farm price lowered to 60 cents per pound.\n\n- Overall, strong corn exports offer support, while soybeans and wheat remain weighed down by ample global supplies.",
      "summaryTimestamp": 1770775132917
    },
    {
      "id": "9333e25aa18be6e7",
      "title": "Farmers face greater risk with planting insurance option removed",
      "link": "https://www.agweek.com/news/north-dakota/farmers-face-greater-risk-with-planting-insurance-option-removed",
      "description": "The U.S. Department of Agriculture’s Risk Management Agency announced last fall that it was eliminating the extra coverage option for prevented planting insurance.",
      "date": "Tue, 10 Feb 2026 19:00:00 GMT",
      "timestamp": 1770750000000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/3677fd6/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe3%2Fd3%2Faa5680f646d695b5a903b4ccc62d%2Fjustin-quandt.jpg",
      "summary": "North Dakota farmers will face greater risk this year as the U.S. Department of Agriculture's Risk Management Agency has eliminated the extra \"buy-up\" coverage option for prevented planting insurance. \n\nFrom 2010 to 2024, the extra prevented planting coverage led to $3.18 billion in payments for North Dakota producers, more than any other state. This option allowed farmers to insure against years when weather prevents them from planting a crop.\n\nWithout this option in 2026, North Dakota farmers like Justin Quandt, who farms near Oakes, will have less protection against wet spring conditions that can leave some of their fields unplantable. Quandt's family normally invests in the additional prevented planting coverage, which requires insuring all acres in a county.\n\nThe North Dakota Farmers Union president Matt Perdue said the agency's decision is disappointing, as the recent farm bill had expanded federal crop insurance in other ways. However, an NDSU study concluded that the improvements will not outweigh the loss of the extra prevented planting coverage for North Dakota.\n\nSenators, including John Hoeven of North Dakota, have asked the USDA to undo the prevented planting changes for 2027 and beyond \"to help provide a layer of certainty when disasters beyond their control render them unable to plant a crop.\" \n\nFarmers face a March 15 deadline to make 2026 crop insurance purchases. Insurance agent Bethany Rentz hopes the USDA will bring back the extra prevented planting coverage based on pushback from other affected states.",
      "summaryTimestamp": 1770821424976
    },
    {
      "id": "ece987f6d8a8b3b4",
      "title": "Larger Operating Loans Drive Farm Lending Growth",
      "link": "https://www.allagnews.com/larger-operating-loans-drive-farm-lending-growth/",
      "description": "NASHVILLE, TN &#8211; Farm lending activity strengthened in 2025 as producers relied more heavily on [...]",
      "date": "Tue, 10 Feb 2026 18:45:07 +0000",
      "timestamp": 1770749107000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- Farm lending activity strengthened in 2025, driven by a sharp increase in the size and volume of non-real-estate farm loans, particularly operating loans.\n\n- The volume of new operating loans rose nearly 40% year-over-year in Q4 2025 and averaged over 20% growth across 2025.\n\n- Inflation-adjusted operating loan sizes were about 30% larger than the previous year, reflecting elevated input costs and expanded financing needs.\n\n- Increased feeder cattle lending also contributed to stronger loan demand.\n\n- Average maturities for operating loans increased by roughly 3 months from 2024 and reached record highs late in the year. Machinery and equipment loan maturities also lengthened.\n\n- Interest rates on non-real-estate loans declined for the 6th straight quarter, with larger loans seeing greater reductions. Over 80% of operating loans carried variable rates.\n\n- Bigger operating loans are helping farms manage costs, but also signal growing reliance on borrowed capital.",
      "summaryTimestamp": 1770750054692
    },
    {
      "id": "1a65a9633ce88244",
      "title": "MN CropCast: From research to resilience - Advancing soil health with Dr. Anna Cates",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-from-research-to-resilience.html",
      "description": "",
      "date": "Tue, 10 Feb 2026 16:18:00 +0000",
      "timestamp": 1770740280000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-w320-h320-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "In this episode of Minnesota CropCast, hosts Dave Nicolai and Seth Naeve interview Dr. Anna Cates, the University of Minnesota Extension Soil Health Specialist. Dr. Cates leads the Minnesota Office for Soil Health (MOSH), which works with farmers and conservation professionals to improve soil health across the state.\n\nDr. Cates, who has a PhD in Agronomy and MS in Soil Science and Agroecology from the University of Wisconsin-Madison, discusses the partnership between MOSH and the Minnesota Board of Water and Soil Resources (BWSR). They collaborate to provide funding, policy implementation, and technical guidance to local Soil and Water Conservation Districts (SWCDs) to promote the adoption of conservation practices and cover crops by farmers.\n\nThe episode also highlights an upcoming intensive educational opportunity called the Cover Crop Academy, which will help farmers learn about the benefits and implementation of cover cropping. \n\nFarmer adoption of conservation practices and cover crops is a key focus area for MOSH and its partners. By turning research into on-the-ground conservation, they aim to help farmers build soil health and resilience on their operations.",
      "summaryTimestamp": 1770742770894
    },
    {
      "id": "305e08a981edb602",
      "title": "AgriLife Extension shares cotton jassid guidance for green industry",
      "link": "https://agrilifetoday.tamu.edu/2026/02/10/agrilife-extension-shares-cotton-jassid-guidance-for-green-industry/",
      "description": "Fact sheet targets invasive insect threat to Texas’ ornamental, nursery industry The post AgriLife Extension shares cotton jassid guidance for green industry appeared first on AgriLife Today.",
      "date": "Tue, 10 Feb 2026 15:20:23 +0000",
      "timestamp": 1770736823000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M AgriLife Extension Service and Research are providing guidance to the Texas ornamental nursery industry on the two-spot cotton leafhopper, also known as the cotton jassid, which is a new invasive pest that threatens the industry and future cotton production.\n\nKey points:\n- Texas A&M experts have developed a fact sheet with identification, biology, and management information for the cotton jassid to help ornamental producers.\n- The experts have also produced training videos for Texas Department of Agriculture inspectors and green industry growers/professionals.\n- They are working closely with the Texas Department of Agriculture and USDA to assess the pest's potential for establishment in Texas.\n- The cotton jassid has a wide host range, so prevention and management will require a collaborative, holistic approach.\n- Growers are encouraged to contact AgriLife Extension for identification, monitoring, and science-based management strategies.\n- AgriLife Extension is working on a grant proposal for research to better understand and control the pest, and establish economic thresholds for ornamental crop losses.\n- The goal is to help the ornamental industry mitigate the potential impact of this invasive pest and prevent its spread to cotton fields.",
      "summaryTimestamp": 1770806694338
    },
    {
      "id": "201b3258f4c16eed",
      "title": "Trump Signs Executive Order Boosting Argentine Beef&#160;Imports",
      "link": "https://civileats.com/2026/02/09/trump-signs-executive-order-boosting-argentine-beef-imports/",
      "description": "February 9, 2025 – The United States has finalized a deal with Argentina that is expected to more than quadruple beef imports from the South American country, acting on plans floated in October that received pushback from U.S. cattle producers. On Friday, President Donald Trump signed an executive order to increase Argentine beef imports by [&#8230;] The post Trump Signs Executive Order Boosting Argentine Beef Imports appeared first on Civil Eats.",
      "date": "Mon, 09 Feb 2026 23:24:08 +0000",
      "timestamp": 1770679448000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The U.S. has finalized a deal with Argentina that is expected to more than quadruple beef imports from the South American country. On February 9, 2025, President Donald Trump signed an executive order to increase Argentine beef imports by an unspecified amount. This move received pushback from U.S. cattle producers when the plans were first floated in October. The increased beef imports from Argentina are part of the executive order signed by President Trump.",
      "summaryTimestamp": 1770688954190
    },
    {
      "id": "33d69001b20007c6",
      "title": "EPA Reapproves Weedkiller Dicamba Despite Concerns About Drift and Crop&#160;Damage",
      "link": "https://civileats.com/2026/02/09/epa-reapproves-dicamba-despite-concerns-about-drift-and-human-health/",
      "description": "“The Trump administration’s hostility to farmers and rural America knows no bounds,” Bill Freese, science director at the Center for Food Safety (CFS), said in a press release. “Dicamba drift damage threatens livelihoods and tears apart rural communities.” Farmers have been using dicamba since the 1960s, but issues emerged about a decade ago, when it [&#8230;] The post EPA Reapproves Weedkiller Dicamba Despite Concerns About Drift and Crop Damage appeared first on Civil Eats.",
      "date": "Mon, 09 Feb 2026 23:08:28 +0000",
      "timestamp": 1770678508000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The U.S. Environmental Protection Agency (EPA) has reapproved the use of the weedkiller dicamba despite ongoing concerns about crop damage from dicamba drift. Farmers have been using dicamba since the 1960s, but issues with dicamba drift and crop damage have emerged over the past decade. The Center for Food Safety (CFS) has criticized the decision, stating that \"dicamba drift damage threatens livelihoods and tears apart rural communities.\" The reapproval is part of the Trump administration's policies, which the CFS has described as \"hostility to farmers and rural America.\" The EPA's decision allows the continued use of dicamba on genetically engineered, dicamba-tolerant soybeans and cotton.",
      "summaryTimestamp": 1770688956406
    },
    {
      "id": "a5f5d4972a5993d0",
      "title": "Minnesota Irrigator Program returns March 10th and 11th, 2026 in Perham, MN",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/minnesota-irrigator-program-returns.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 17:41:00 +0000",
      "timestamp": 1770658860000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEilFjhdf-VxkjP9toiF34DiaDB5cT-q0f91aA_Dm5rnp-VT4bl_Z7fTnYdUC-aenNwdk4aIJ6iixtBluHpy8s-iEt9Bi8Q_ACFmbb3c7egNGSuDx1vzfDkJg3X4cJN595mCuQvvb2YWJFNBWC6Yd39CfII3Z-IT9EolZPeEmPGaok8g6zYVrRwMkLGSB8LN/s72-w640-h322-c/Irrigation-180.jpg",
      "summary": "The Minnesota Irrigator Program (MIP) will return on March 10th and 11th, 2026 in Perham, MN. The 2-day program costs $60 and includes breakfast and lunch. \n\nThe program will cover topics such as irrigation scheduling, variable rate technology, autonomous pivots, flowmeters and calibration, and nitrogen management. Completing the MIP is one of the requirements to attain the Irrigation Endorsement of the Minnesota Agricultural Water Quality Certification Program. Certified farms will receive the endorsement if they attend the program and adopt a new irrigation practice or scheduling method on their farm.\n\nThe event is organized by the University of Minnesota (UMN) Crop News. Efficient agricultural irrigation is a key topic in Minnesota due to the state's sandy soils and limited precipitation. The program aims to help irrigators and irrigation professionals match irrigation to crop water use, improve water-use efficiency, and reduce water costs.",
      "summaryTimestamp": 1770848792892
    },
    {
      "id": "639f274dc791af0b",
      "title": "Strategic Farming: Let's talk crops discussed pollinators",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops_9.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:50:00 +0000",
      "timestamp": 1770652200000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiFwnCAyWS-EUZiSio5J4-y0QsBduTd8dBWm4rzsZPh3u4M6zCtsrl6RlBlORk_gWpEFh9h4ihjy4Q3pIa9pa6cfpRtz9_kTHvQBA2tYVh2SFkw_l0cs3XC0kVvrPnwkXwspvQywGqn_c4YnxmIW3ZA4EmamF9Iyw3k_NQb4FllsWyvbWbmpFK22ugIz6oV/s72-w320-h320-c/bee-on-flower-andrewsi_HeatherHolm.JPEG",
      "summary": "Key Takeaways:\n\n1. Pollinators, especially bees, play a critical role in food production, with over 80% of the world's flowering plants needing a pollinator to reproduce.\n\n2. Bee populations, including the endangered rusty patch bumblebee, have seen dramatic declines across North America due to factors like habitat loss, climate change, and disease.\n\n3. Restoring pollinator habitat on agricultural landscapes is important, and can be done cost-effectively. Planting a diverse mix of flowering plants, even in small areas, can support a variety of bee species.\n\n4. Research shows that the amount of surrounding agricultural land or size of the habitat area does not significantly impact bee diversity and abundance, as long as there are sufficient floral resources.\n\n5. Integrating pollinator habitat into croplands can have benefits for natural pest control, and can even improve yields for self-pollinating crops like soybeans.\n\n6. Funding sources and conservation programs may be available to assist farmers in establishing and maintaining pollinator habitat.\n\n7. Minnesota alone has around 525 species of bees, ranging from tiny to large bumblebees. Native bee species, including ground-nesting bees, are the focus of research at the University of Minnesota Bee Lab.",
      "summaryTimestamp": 1770848796551
    },
    {
      "id": "85be85b5240c46b7",
      "title": "Mark your calendars for the Midwest Soybean Gall Midge Research Update",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendars-for-midwest-soybean.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:22:00 +0000",
      "timestamp": 1770650520000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh0uFuk9siSQYDRZMiZ6TFrsf7R2PkpTjVQVdjWSAepcFTQa-SsKA945ODDygtkKavZCDdBqY6VAq25l-cmFJvX1zCYrFPrINtbHZ0q9eQSE04v6mqMfrOpOlW1sHhJIq8RjUbQO5J9yO9Ttx56T7Uy2inj9pSygRO9xdPxYA0_aPJKkiZ4FpEmgymGRY5b/s72-w320-h194-c/gall-midge-larvae-potter.jpg",
      "summary": "The Midwest Soybean Gall Midge Research Update is a free, live webinar scheduled for March 19, 2026. Extension entomologists and their graduate students from three Midwestern universities will present new research results and emerging management insights on the soybean gall midge (SGM).\n\nThe webinar will cover the following topics:\n- Updated information on SGM distribution and regional monitoring efforts\n- Impacts on soybean production and yield loss under field conditions\n- Biology and ecology updates, including cold tolerance and overwintering survival\n- New insights into adult biology, including emergence timing and behavior\n- Results from commercial soybean variety testing under SGM pressure\n- Updates on biological control efforts\n- Evaluation of new and emerging cultural control strategies, along with other management tools\n\nCertified Crop Advisors can earn pest management (PM) CEUs by attending the live event. Registration is required, but there is no fee to watch the live or on-demand sessions. Once registered, attendees will receive a confirmation email and reminder emails with a link to the webinar prior to the event.\n\nFor more information, visit the Midwest Soybean Gall Midge Research Update webpage.",
      "summaryTimestamp": 1770848799626
    },
    {
      "id": "3f08825939c7efbd",
      "title": "7 Vegetables to Start From Seed in February",
      "link": "https://modernfarmer.com/2026/02/vegetable-seed-february/",
      "description": "It takes a lot to get the farm ready for the growing season. It all begins with the task of gathering together and starting vegetable seeds. February is an ideal time to get many of your spring crops going. Consider these 7 vegetables as you prepare your rows. The post 7 Vegetables to Start From Seed in February appeared first on Modern Farmer.",
      "date": "Mon, 09 Feb 2026 12:00:00 +0000",
      "timestamp": 1770638400000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/03/Sowing-tomato-seeds-in-tray.webp",
      "summary": "Key Takeaways:\n\n1. February is a prime time for starting vegetable seeds, especially for crops that take a long time to mature. This allows for a head start on growing large quantities of healthy produce.\n\n2. Recommended vegetables to start from seed in February include:\n- Slow-growing herbs like basil and rosemary\n- Tomatoes\n- Peppers\n- Brassicas like broccoli, cabbage, and kale\n- Lettuce\n- Carrots and parsnips\n- Alliums like onions and leeks\n\n3. Starting seeds indoors or in protected environments like greenhouses, cold frames, and low/high tunnels can help in cold climates.\n\n4. Tomatoes, peppers, and heading brassicas like broccoli take 2-3 months to mature from seed, so starting them in February is important.\n\n5. Lettuce, leafy brassicas, and alliums can be directly sown outdoors under row covers in February in many regions.\n\n6. Key considerations include providing proper temperature, moisture, and light for germination and growth, as well as protecting young seedlings from late spring frosts.\n\n7. Growing vegetables from seed in February can give farmers a head start on the season and allow for larger, more productive harvests.",
      "summaryTimestamp": 1770848803449
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this past week were 8-18°F below average, with lows reaching 7°F below zero in some areas. Snowfall was light, leaving soils in central and southern Illinois still very dry. While the snow totaled nearly 20 inches in some places, the low moisture content meant less than 1 inch of liquid water. Temperatures are expected to warm up next week, but precipitation will remain limited.\n\nExperts from the University of Illinois and Illinois Corn Growers Association discussed using the N-Rate Calculator and Precision Conservation Management program to optimize nitrogen application and protect water quality, focusing on maximizing profits rather than just yields.\n\nThe article also mentions upcoming radio programming, including a Commodity Week panel discussion and the daily Closing Market Report.",
      "summaryTimestamp": 1770742816511
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Farmers are now using AI-assisted tools, voice search, and quick-scan platforms that often answer their questions without needing to click. The true indicator of content effectiveness is now attention time - whether a farmer stays engaged and explores more content.\n\nAgWeb.com recently redesigned to increase user attention and engagement:\n- 54% increase in readers reaching 75% of an article\n- 21% increase in readers reaching 90% of an article\n- 33% increase in mobile users reading more articles per visit\n\nThese deeper engagement metrics are more valuable to advertisers, as they signal real interest and create stronger opportunities for brand messaging to be seen and remembered. \n\nThe article notes that in a typical visit, readers only absorb about 28% of page text, so simplifying layouts and guiding deeper engagement is key.\n\nFor advertisers, high-attention environments like the redesigned AgWeb deliver stronger brand recall, message retention, and advertising effectiveness. This creates more value through more time with content, more exposure opportunities per session, and better alignment with how farmers search today.\n\nThe article concludes that if the goal is to reach farmers in focused, engaged moments, AgWeb offers one of the most effective digital environments in agriculture, as better attention leads directly to better outcomes.",
      "summaryTimestamp": 1770701175113
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "The goal was to determine if growers can maintain productivity and profitability while using reduced tillage and cover crops to protect the soil.\n\nThe study compared 4 management systems: conventional tillage (CT), fall strip-tillage (ST), no-tillage (NT), and no-tillage with a cereal rye cover crop (NT+CR). Each system was paired with 3 starter fertilizer strategies: unfertilized control, 15 lb N/ac, and 15 lb N/ac + 10 lb S/ac.\n\nKey findings:\n- Starter fertilizer increased early-season soybean biomass by ~12% but did not affect final yields.\n- Soybean yields ranged from 60-95 bu/ac across locations, with no significant differences between tillage systems. \n- When accounting for operational costs, NT had the highest partial net return, followed by ST and CT. NT+CR had the lowest net return due to cover crop management costs.\n- The project will continue in 2026 to track longer-term soil and soybean responses in the conservation systems.\n\nThe article includes:\n- Locations of trials in Illinois and Iowa\n- Cereal rye management details (40-50 lb/ac, 1000-1200 lb/ac biomass)\n- Soybean planting details (30-in rows, 140,000-150,000 seeds/ac)\n- Figures showing soybean growth, leaf nutrient levels, and yield distributions\n- Table of estimated costs, revenue, and partial net return for each system\n\nOverall, the results suggest that reduced tillage and cereal rye cover crops can maintain soybean yields compared to conventional tillage, although profitability may be impacted by the higher management costs. Further research is underway to understand longer-term implications.",
      "summaryTimestamp": 1770742820821
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "Greenhouses can provide a protected environment to start growing plants early for the spring market. \n\nKey points:\n- Greenhouses trap thermal heat to warm plants, with features like vents, structures, and climate control systems. Different types include modular plastic, low tunnels, cold frames, and larger designer greenhouses.\n- In February, good greenhouse crops to start include tomatoes, peppers, brassicas (kale, cabbage, cauliflower), lettuces, potatoes, onions, and flowers.\n- Tomatoes and peppers benefit from the early start and warmth of a greenhouse, with ideal temperatures around 50°F (10°C).\n- Brassicas and lettuces can be grown to get an early spring harvest, protected from pests and frost.\n- Potatoes and onions also do well with a greenhouse start to get a head start on the season.\n- Flowers that take a long time to sprout, like lisianthus and dahlias, are good candidates for greenhouse growing to ensure spring blooms.\n\nThe article provides guidance for farmers on how to utilize different greenhouse types and what crops to prioritize for early greenhouse planting in the month of February.",
      "summaryTimestamp": 1770848806932
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Farm Journal and Hass Avocado Board are launching \"The Avocado Conference\", an international event for the U.S. avocado supply chain, to be held on November 18-20, 2026 in San Diego, CA.\n\n- The conference aims to bring together every segment of the U.S. avocado industry - producers, exporters, importers, packers, retailers, foodservice buyers, and supply chain partners.\n\n- Goals include facilitating collaboration, providing data-driven insights, analyzing supply-demand, and aligning the industry's strategy.\n\n- Sessions will cover global avocado production/trade, retail/foodservice market trends, consumer behavior, marketing programs, economic impacts, and the Hass Avocado Board's efforts to expand avocado demand.\n\n- The Hass Avocado Board is a key collaborator, helping develop content and unite the industry around this event.\n\n- Expected attendees include growers, packers, importers/exporters, buyers, suppliers, logistics companies, financial/consulting firms, and data/insights providers.\n\n- The conference is positioned as the premier forum for the avocado industry, providing indispensable insights and strategic value year-round.",
      "summaryTimestamp": 1770701187545
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Iowa State University Pesticide Safety Education Program has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. The updated training manuals, available through the ISU Extension Store, are intended to provide Iowans with the basic understanding of effective pesticide use and the information needed to successfully pass the revised certification exams. The updated Iowa Core Manual (CS445) is now available for purchase, and new exams based on the revised core manual are available at all Iowa Department of Agriculture and Land Stewardship test sites. Additionally, the Private Pesticide Applicator Manual (CS1) now includes a two-page informational update, which is provided in each manual, and all private exams now include content from this insert. For more information, contact Betsy Danielson, an extension specialist for Iowa State University Extension and Outreach in the Pesticide Safety Education Program (PSEP).",
      "summaryTimestamp": 1770701190204
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The key points are:\n\n- Lead generation should focus on delivering real value in exchange for a farmer's time and attention. \n- The call-to-action (CTA) and offer chosen shape not only the quantity of leads captured, but also their quality and purchase-readiness.\n- Shifting the mindset from what the business wants to collect to what farmers genuinely need is crucial.\n- Designing the right offer that solves a specific farmer problem or need is more effective than just chasing leads.\n\nThe article does not provide any specific numbers, prices, statistics, dates/deadlines, names of people/organizations/programs, locations, or expert quotes. The overall recommendation is for businesses to focus on creating valuable offers that meet farmers' needs, rather than just trying to collect as many leads as possible.",
      "summaryTimestamp": 1770701193077
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this week were 4-8 degrees below normal, with lows reaching the single digits or below zero in parts of the state. The region also experienced very dry conditions, with less than half an inch of precipitation in some areas so far in January. \n\nLooking ahead, the cold temperatures are expected to continue for at least another week, with much of northern Illinois staying below freezing. However, a strong winter storm is forecasted to bring significant snowfall, up to 8-12 inches, to southern Illinois this weekend.\n\nThe article also provides details on two radio programs - Commodity Week and the Closing Market Report - which provide market updates and analysis for farmers. The Commodity Week panel this week included Chip Nellinger, Brian Stark, and Arlan Suderman.\n\nOverall, the article highlights the ongoing cold and dry conditions that Illinois farmers are facing, as well as an upcoming winter storm that could impact agricultural operations in parts of the state. Farmers are advised to stay weather aware and prepared for the challenging conditions.",
      "summaryTimestamp": 1770742824409
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Key points:\n\n- The way farmers find information has fundamentally changed, with more time spent on AI-powered platforms like ChatGPT and Google's AI Overviews, rather than traditional search engines.\n- Brands need to evolve their marketing strategies to be present in these new discovery channels, or risk becoming invisible to their audience.\n- At Farm Journal, they are observing this shift in real-time and recommend that all ag marketers reevaluate their 2026 strategies.\n- The focus should be on an answer-driven content strategy and amplifying trusted voices, rather than just optimizing for traditional SEO.\n- Discoverability is now about winning citations, brand mentions, and trusted source references that build authority, even in \"zero-click\" moments.\n\nThe article does not provide any specific numbers, dates, or quotes from experts. It is focused on the broad shift in agricultural marketing and the need for brands to adapt to the changing landscape.",
      "summaryTimestamp": 1770701196038
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Key points:\n- Agroforestry originated in Brazil's tropical rainforests and combines crops with selective lumber production.\n- It involves thinning a forest to allow the best conditions for crops like native ornamentals, fungi, fruit, timber, and forest food crops to grow in the understory.\n- Benefits include improved water/soil quality, carbon storage (up to 22 lbs/year), habitat for beneficial species, and access to specialty crop markets.\n- Farms with existing forest or riparian areas are best suited for agroforestry. It can be implemented on small scales.\n- Considerations include managing invasive tree species, understanding local market demands, and navigating regulations around wild plant harvesting.\n- Farmers should consult their agricultural extension office to develop a forest management plan.\n\nThe article provides a comprehensive overview of the forest farming approach, its advantages, suitable land types, and key implementation steps - giving farmers a thorough understanding without needing to read the full original article.",
      "summaryTimestamp": 1770848810088
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Temperatures in Illinois were 8-12°F above normal in the second week of January 2026, with highs up to 69°F.\n- January so far has been a top 10 warmest first half on record in most of the state.\n- Precipitation has been below normal, with 0.1-0.75 inches in the past 7 days and 0.5-1 inch drier than normal for January.\n- This winter has been a top 5 driest on record in areas south of I-70, including 3rd driest in Salem and 4th driest in Paducah.\n- Colder weather is expected this weekend, with highs struggling to reach 20°F in northern Illinois and above freezing in southern Illinois.\n- Little precipitation is expected, mostly light snow, with forecasted 7-day totals less than 0.25 inches.\n- Colder than normal temperatures are likely to continue through the first week of February.\n- The Commodity Week radio program and Closing Market Report podcast will cover the latest market updates.",
      "summaryTimestamp": 1770742827617
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "1. Clarify Objectives: Spray drones can be useful for making applications on wet soils, applying to tall crops, reducing compaction, targeted applications, and supplementing existing spraying capacity.\n\n2. Regulatory Considerations: Farmers need an FAA Part 107 Remote Pilot Certificate, FAA Part 137 Certification for aerial pesticide application, and Iowa Department of Agriculture and Land Stewardship (IDALS) licensing. Only products labeled for aerial use can be applied.\n\n3. Insurance and Risk Management: Farmers need specific coverage for chemical liability, general liability, and drone/equipment damage. Most standard policies do not cover these.\n\n4. Equipment Selection: Consider tank capacity, battery life, nozzle/atomizer options, GPS guidance, and local support when choosing a spray drone system.\n\n5. Training and Safe Operation: Proper training is essential, including gaining flight experience, calibration, weather monitoring, and maintenance.\n\n6. Gradual Adoption: Start on a small scale, compare to conventional methods, and develop efficient procedures before expanding use.\n\n7. Iowa-Based Resources: ISU Extension, Digital Ag Innovation Lab, licensed dealers, and IDALS can provide guidance and support.\n\n8. Future Developments: Ongoing improvements in payload, automation, and integration with precision ag data will shape the long-term role of spray drones.\n\nThe article recommends a thoughtful, step-by-step approach to spray drone adoption to ensure compliance, safety, and effective integration into Iowa farming operations.",
      "summaryTimestamp": 1770701204151
    },
    {
      "id": "75d0524dd80f4e3e",
      "title": "Double-crop Soybean Management Practices &#8211; Project Report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/double-crop-soybean-management-practices-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wheat acreage has been limited in recent decades. USDA-NASS survey estimates that 60-80% of Illinois wheat acres are double-cropped with soybeans. Implementing this system in central and northern Illinois has been constrained primarily by low wheat acreage and by later wheat harvest, which often delay",
      "date": "Tue, 13 Jan 2026 12:52:03 +0000",
      "timestamp": 1768308723000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/01/Table1_site-info.jpg",
      "summary": "Summary of the Agricultural News Article:\n\nThe article reports on a 2-year field trial conducted near Hammond in Piatt County, Illinois to evaluate the effects of soybean maturity group (MG), seeding rate, and starter fertilizer on double-crop soybean yields.\n\nKey Findings:\n- Double-crop soybean yields averaged 55.7 bushels/acre in 2024 and 47.8 bushels/acre in 2025.\n- Full-season soybean varieties (MG 3.6-3.8) yielded about 4% (2.1 bushels/acre) more than early-maturing varieties (MG 3.0-3.2).\n- Yield response to seeding rate differed by maturity group: Early-maturing varieties reached maximum yield (52.3 bu/acre) at 252,000 seeds/acre, while full-season varieties reached maximum yield (53.4 bu/acre) at 207,000 seeds/acre.\n- Starter fertilizer (26 lb N, 11 lb S) increased yields by 1.4 bushels/acre (2.6%) in 2024 but had no impact in 2025.\n\nThe trials were conducted by the University of Illinois Department of Crop Sciences in collaboration with the Illinois Agricultural Experiment Station, Illinois Fertilizer & Chemical Association, and a local producer. Similar trials across more locations are ongoing to strengthen regional recommendations.",
      "summaryTimestamp": 1770742831649
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "Winter sowing involves starting seeds in containers like milk jugs or plastic bags and placing them outdoors, where the cold, moist conditions help the seeds break dormancy. This results in hardier transplants that mature sooner.\n\nThe best vegetables for winter sowing include hardy greens like kale and cabbage, as well as spinach, onions, and leafy greens. Kale, cabbage, and spinach can handle cold well even in their early stages. Onions, especially bulbing onions, benefit from the long maturation period. Leafy greens like kale, collards, and chard are also excellent choices.\n\nFor flowers, the article recommends perennials like pansies, echinacea, snapdragons, larkspur, and scabiosa. These flowers often need a period of cold stratification, which is provided by the winter sowing method.\n\nThe article provides specific variety recommendations for some of the vegetables and flowers, such as 'Carex' cabbage, 'Avon' spinach, and different types of snapdragons. It also discusses the ideal growing conditions for long-day, short-day, and intermediate-day onions.\n\nOverall, the winter sowing method allows farmers to get a head start on the growing season and produce hardier, more mature plants come spring. The article emphasizes the benefits of this technique for maximizing profits and productivity.",
      "summaryTimestamp": 1770848813701
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "However, there are several agri-environmental strategies farmers can employ to support biodiversity:\n\n1. Prairie Strips: Planting 10-25% of farmland in prairie strips can attract beneficial predators, improve soil nutrients, and boost yields by supporting pollinators and pest-controlling insects.\n\n2. Low Tilling: Reducing tillage and using cover crops can improve soil structure and support greater biodiversity above and below ground.\n\n3. Regenerative Grazing: Rotating livestock and using native plants, fire, and mowing can maintain healthy pastures and provide habitat for local species, especially in areas with prairie or forest ecosystems. \n\n4. Integrated Pest Management (IPM): Attracting beneficial insects through diverse plantings and cultural practices can reduce reliance on harmful pesticides.\n\n5. Conservation Easements: Partnering with land trusts to establish conservation easements can protect natural resources and provide tax benefits for farmers with large landholdings.\n\nImplementing these strategies, even partially, can have significant positive impacts on biodiversity and farm productivity by working with natural systems rather than against them. Experts emphasize that farming is as much for humans as it is a constant reminder of the laws of the natural world, and the more farmers can see their land as part of a larger ecosystem, the more sustainable their agriculture can become.",
      "summaryTimestamp": 1770848817023
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series will be held at 12 locations across Iowa from January 6-29. Each meeting will feature topics tailored to local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.\n\nTopics will include crop market and climate outlooks for 2026, nitrates and drinking water, profitable nutrient management, southern rust, transition planning, and robots/drones.\n\nEarly-bird registration is $75 until the week before each meeting. Late or on-site registration is $100. Registration includes refreshments, lunch, certified crop advisor credits, and access to resources. Private pesticide applicator recertification will also be available for a $30 fee.\n\nThe meetings are designed to provide farmers and crop production professionals with the latest research-based information to help them make informed decisions for the upcoming growing season.\n\n\"Our goal is always to prepare producers to manage potential issues when they arise, or even before they arise, by sharing the most up-to-date scientific knowledge from Iowa State University researchers,\" said Josh Michel, field agronomist with ISU Extension and Outreach.\n\nRegistration and more information is available on the Crop Advantage Series registration site. Contacts for questions are crops@iastate.edu and regional ISU Extension and Outreach field agronomists.",
      "summaryTimestamp": 1770701214423
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The finalists are:\n\n- Alsum Farms (Friesland, WI) - A multigenerational, 3,600-acre operation producing potatoes, pumpkins, hay, and other crops with a vertically integrated business model.\n\n- Dalton Farms (Wakeman, OH) - A 7th-generation, 2,000-acre corn/soybean farm with a 400-head cattle herd and on-farm market selling local meats and maple syrup.\n\n- Splitter Farms (Sterling, KS) - A 1,400-acre owned, 18,500-acre total row crop operation using data-driven management after the owner's father passed away in 2010.\n\nThe winner and finalists will be recognized at the 2026 Top Producer Summit in Nashville, TN on February 9-11. The $10,000 Next Generation Award will go to Tim Nuss (El Dorado Hills/Lodi, CA) for his diversified farming and ag tech entrepreneurship. The $5,000 Women in Agriculture Award will be awarded to Helle Ruddenklau (Amity, OR) for her leadership in Oregon's agriculture industry. The awards are sponsored by BASF, Fendt, Pioneer, and Pro Farmer.",
      "summaryTimestamp": 1770701217736
    },
    {
      "id": "ce3ade9054dd723c",
      "title": "Still an opportunity to attend the ICM Conference!",
      "link": "https://crops.extension.iastate.edu/post/still-opportunity-attend-icm-conference",
      "description": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean field with Integrated Crop Management Conference overlayed on top. Learn more at go.iastate.edu/ICM\" width=\"408\" height=\"214\" class=\"align-left\" loading=\"lazy\"><p>This year we are offering on-site registration for the <a href=\"https://www.regcytes.extension.iastate.edu/icm/\">Integrated Crop Managem",
      "date": "Thu, 04 Dec 2025 08:22:25 -0600",
      "timestamp": 1764858145000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg",
      "summary": "The Iowa State University Integrated Crop Management (ICM) Conference will be held on December 10-11, 2025 at the Meadows Events and Conference Center in Altoona, IA. The conference will feature 33 workshops covering topics like crops, pests, nutrient management, and conservation. Attendees can earn up to 14 continuing education credits for Certified Crop Advisers, as well as Iowa Commercial Pesticide Applicator continuing instruction for 2025 in categories 1A, 1B, 1C, and 4 for an additional fee. Invited speakers will discuss topics related to the Endangered Species Act, the timing of corn and soybean planting, and integrated pest management for corn leafhopper and corn stunt disease. On-site registration is available for this premier crop management conference. The article was written by Meaghan Anderson, a field agronomist serving nine counties in central Iowa and an extension specialist with Iowa State University Extension and Outreach.",
      "summaryTimestamp": 1770701220364
    },
    {
      "id": "6e56b2436e07fb98",
      "title": "Registration is now open for the 36th Integrated Crop Management Conference",
      "link": "https://crops.extension.iastate.edu/post/registration-now-open-36th-integrated-crop-management-conference",
      "description": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water management. The event features experts sharing research updates and practical recommendations. Don’t miss this key opportunity for networking and education!</p><p><strong>When: </strong>December 10 and 11, 2025</p><p><strong>Where: </strong>The Meadows Events Center in Altoona, Iowa</p><p><strong>Who",
      "date": "Mon, 27 Oct 2025 14:12:34 -0500",
      "timestamp": 1761592354000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "This conference brings together experts to share research updates and practical recommendations on crop production, protection, nutrient management, and soil/water management. \n\nThe program features 33 session topics, with keynote speakers and 5-6 breakout options per hour. Attendees can earn CCA credits and commercial pesticide applicators can be recertified. \n\nEarly-bird registration is $260 until November 16, 2025. Regular registration is $310 until December 3, 2025. Anyone involved in crop production is encouraged to register and attend this key networking and educational event.\n\nThe conference is organized by Iowa State University Extension and Outreach. The content authors are Erin Hodgson, a professor and Extension Entomologist, and Ashley Dean.",
      "summaryTimestamp": 1770701223163
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10 at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5.\n\nThe event will feature research on sorghum's value as a forage crop compared to corn. Sorghum is more drought-tolerant, has lower nitrogen requirements, and is not susceptible to the tar spot pathogen. Experts will discuss sorghum's production and utilization for silage, grazing, and as a standing winter feed source.\n\nSpeakers will include:\n- Mitch Tuinstra, Wickersham Chair of Excellence in Agricultural Research and scientific director of the Institute for Plant Sciences at Purdue, who will share plant breeding techniques to improve sorghum yield and quality.\n- Brad Shelton, FPAC superintendent\n- Jason Tower, Southern Indiana Purdue Agricultural Center superintendent\n- Nick Minton, Purdue Extension beef systems specialist\n- Jeff Jackson, Croplan alfalfa and forage specialist\n\nThe event will include venue tours, a dinner, and a bull test station tour. Those with questions or accessibility needs can contact Keith Johnson, Purdue professor of agronomy.",
      "summaryTimestamp": 1770701228366
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Farmer sentiment improved in July 2024, with the Purdue/CME Group Ag Economy Barometer rising 8 points to 113.\n\n- The Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations rose 7 points to 119.\n\n- Despite declines in corn (11%) and soybean (5%) prices, farmers reported fewer worsened conditions compared to a year ago and fewer expected negative future outcomes.\n\n- The top concerns for farmers were high input costs (34%) and the risk of lower crop/livestock prices (29%).\n\n- The Farm Financial Performance Index dropped 4 points to 81, reflecting worries about weakening commodity prices and high input costs.\n\n- The Farm Capital Investment Index rose 6 points to 38, but remains 7 points lower than July 2023, as 75% still believe it's a bad time for large investments.\n\n- The Short-Term Farmland Value Expectations Index rose to 118, while the Long-Term index dropped 6 points to 146.\n\n- 72% of crop farmers expect cash rental rates to remain roughly the same in 2025 compared to 2024.",
      "summaryTimestamp": 1770701233519
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue researchers are taking an interdisciplinary approach to assessing the emerging tar spot disease in corn. The disease, which had been endemic in several Latin American countries since 1904, was first detected in the U.S. in 2015 and has since spread to 16 states and Ontario, Canada.\n\nThe research team, led by C.D. Cruz, associate professor of botany and plant pathology at Purdue, is using a mix of statistical analysis, data science, epidemiology, microbiology, artificial intelligence, and computer vision to better understand the dynamics of tar spot in corn. Their work is funded by two USDA grants totaling nearly $1.1 million.\n\nThe researchers are collaborating with colleagues in Colombia, Mexico, Ecuador, South Korea, and the U.S. to address biosecurity challenges and provide rapid and accurate information to stakeholders. They have developed a digital method for quantifying tar spot in corn, which they have tested under field conditions against human raters.\n\nAnother research effort involves the laboratory of Purdue's Mohammad Jahanshahi, who has adapted his AI and computer-vision approaches from monitoring civil infrastructure to inspecting and analyzing agricultural disease epidemiology. Mariela Fernández-Campos, a PhD student, and Abhishek Subedi, a PhD student in civil engineering, are working on a proof-of-concept data fusion project that integrates drone imagery and weather data to capture crucial details about the tar spot pathosystem.\n\nThe team aims to quantify and model tar spot severity by referencing and integrating imagery with spatial and temporal data, ultimately providing farmers with rapid and accurate information about the disease.",
      "summaryTimestamp": 1770701238997
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- The Indiana Sheep Association (ISA) and the Indiana Sheep and Wool Market Development Program (IN S&W) are sponsoring various sheep-themed events and competitions at the 2024 Indiana State Fair.\n\n- Events include the Wool and Ewe Room, Ewe2 boutique, open wool judging and wool sale, Make It With Wool (MIWW) competition, Indiana State Fair Shearing Contest, Taste from Indiana Farms, and Sheep to Shawl competition.\n\n- The events aim to educate the public about sheep, promote Indiana lamb and wool, and showcase sheep-related art from Indiana artists.\n\n- The Wool and Ewe Room and Ewe2 boutique will be open throughout the fair, offering wool products, livestock-themed apparel, and more.\n\n- The open wool judging and sale will be held on August 2nd at 10 a.m. in the Blue Ribbon Pavilion.\n\n- The MIWW competition and fashion show will take place on August 4th at 2 p.m. in the Indiana Arts Building.\n\n- The shearing contest will be held on August 4th at 5 p.m. in the Ball State University Champions Pavilion.\n\n- Taste from Indiana Farms, where fairgoers can sample free Indiana lamb, will be held from August 8-11 from 11 a.m. to 6 p.m. in the Indiana Farm Bureau Fall Creek Pavilion.\n\n- The Sheep to Shawl competition will take place on August 18th at 10 a.m. in the Indiana Arts Building.\n\n- Sheep can be found in the Blue Ribbon Pavilion from August 4-20 for open and 4-H shows.",
      "summaryTimestamp": 1770701246449
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The Indiana State Fair will be held from August 2 to August 18, 2024, with the theme \"The Art & Nature of Fun\" in collaboration with Newfields.\n\n- Purdue Extension will have a presence at the fair, offering interactive demonstrations and exhibits at the Purdue Extension Building on various topics like entomology, human health, forestry, and animal sciences.\n\n- Specific activities include a \"Block Party\" for children, a \"Book Party\" focused on math skills, \"Captain Cash\" for financial management, and exhibits on pollinators and Master Gardening.\n\n- Purdue's Food Science Department will host an interactive activity called \"What's Growing on My Spinach?\" to explore food microbiology and safety, as well as offer samples of \"Cricket Rice Krispies Treats\" and Boilermaker Hot Sauce.\n\n- Seed art showcasing the fair's theme will be displayed in livestock barns and the Purdue Extension Building.\n\n- The Pioneer Village will offer antique tractors, a farm toy show, a fiddler's contest, and other 1800s-themed activities, sponsored by the Purdue Ag Alumni Association.\n\n- Purdue Extension exhibits will be located throughout the fairgrounds, including in the 4-H Exhibit Hall, Indiana Farmers Coliseum, and other pavilions.",
      "summaryTimestamp": 1770701252143
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The new UW Madison publication \"Potassium Cycle\" provides a visual overview of the potassium cycle in Wisconsin cropping systems. The 2-page publication outlines key potassium concepts, including:\n\n- Potassium is an essential nutrient for plant growth and development, playing a role in photosynthesis, drought resistance, and overall plant health.\n- Potassium enters the soil through weathering of minerals, organic matter decomposition, and fertilizer application. It is taken up by crops, can leach, and is also removed in harvested products.\n- Optimal potassium levels in soil are 100-200 ppm. Deficient levels can reduce yields, while excess potassium can antagonize other nutrient uptake.\n- Soil testing is recommended to determine potassium needs. Fertilizer application rates should be based on crop removal and soil test results.\n- Cover cropping, manure application, and reducing tillage can help retain potassium in the soil system.\n\nThe publication is available free of charge from the UW Madison Nutrient and Pest Management (NPM) program. Farmers are encouraged to review the resource to better understand the potassium cycle and optimize potassium management for their operations.",
      "summaryTimestamp": 1770701255271
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2023 Wisconsin winter wheat crop is developing 10-14 days ahead of average due to the warm weather. As of mid-April, 80% of the state's winter wheat was in the jointing stage, compared to the typical 50-60% at this time. However, the advanced growth stage increases the risk of frost damage. Farmers are advised to closely monitor their fields and consider frost protection measures if temperatures drop below 24°F. Despite the early progress, overall winter wheat condition in Wisconsin is reported as 72% good to excellent, slightly lower than the 5-year average of 75%. Experts recommend that farmers scout fields regularly, apply fungicides proactively, and stay up-to-date on the latest weather forecasts to manage the 2023 winter wheat crop effectively.",
      "summaryTimestamp": 1770701257584
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n- Soybean plant stands can be reduced early in the season due to abiotic factors (freezing, hail, flooding) or biotic factors (slugs, deer, disease, insects).\n- The optimal plant population for soybeans is 100,000-150,000 plants per acre. Stands below 80,000 plants per acre may warrant replanting.\n- Factors to evaluate include current plant population, growth stage, growing conditions, and expected yield of the current stand vs. a replanted crop.\n- Replanting should be done within 7-10 days of the initial planting to maximize yield potential. Later replanting can result in up to 10% yield reduction.\n- Replanting expenses include seed, fuel, labor, and potential crop insurance implications. Weighing costs vs. expected yield increase is important.\n- Shawn P. Conley, a soybean and small grains specialist at UW-Madison, advises carefully evaluating the field before making a replanting decision.",
      "summaryTimestamp": 1770701260343
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n- 2,4-D may be used for postemergence broadleaf weed control in Enlist E3 soybeans, but there are important considerations for farmers to be aware of.\n- The EPA approved the registration of 2,4-D for use on Enlist E3 soybeans, but this approval expires on December 20, 2023. Farmers need to be aware of this deadline.\n- Rodrigo Werle, a weed scientist and extension specialist at UW-Madison, recommends that farmers consult with their local extension office or chemical dealer to ensure they are using 2,4-D products in compliance with the label and relevant regulations.\n- Werle also advises farmers to be cautious of potential off-target movement of 2,4-D, which can damage nearby susceptible crops. He recommends following all label instructions carefully.\n- The article does not provide any specific data or statistics, but emphasizes the importance of staying informed and compliant when using 2,4-D on Enlist E3 soybeans in 2024.",
      "summaryTimestamp": 1770701263489
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Wisconsin Certified Crop Advisor (CCA) Board election results are as follows:\n\nRob Shields, Matt Brugger, and Chris Bandura have been elected to the Wisconsin CCA Board. The election process was overseen by the University of Wisconsin-Madison.\n\nThe newly elected board members will serve 3-year terms. Their responsibilities will include providing guidance and support to Wisconsin's network of over 1,000 CCAs, who play a crucial role in promoting sustainable agriculture practices.\n\nCCAs are agricultural professionals certified by the American Society of Agronomy to provide expert advice to farmers on topics like nutrient management, pest control, and crop production. There are currently over 13,000 CCAs across the United States and Canada.\n\nThe Wisconsin CCA program is funded in part by the Wisconsin Corn Promotion Board and the Wisconsin Soybean Marketing Board. These organizations represent the state's corn and soybean farmers respectively.",
      "summaryTimestamp": 1770701266532
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 23,
  "updated": "2026-02-11T22:26:57.224Z"
}