{
  "items": [
    {
      "id": "4dceda7ffa883cda",
      "title": "Rollins, Abbott open sterile fly facility in Texas",
      "link": "https://www.tsln.com/news/rollins-abbott-open-sterile-fly-facility-in-texas/",
      "description": "Agriculture Secretary Brooke Rollins and Texas Gov. Greg Abbott on Monday celebrated the completion of a U.S.-based sterile fly dispersal facility in Edinburg, Texas. The facility expands USDA&#8217;s ability to disperse sterile flies along the...",
      "date": "Sat, 14 Feb 2026 05:34:48 +0000",
      "timestamp": 1771047288000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key points:\n\n- Rollins (U.S. Agriculture Secretary) and Abbott (Texas Governor) celebrated the completion of a U.S.-based sterile fly dispersal facility in Edinburg, Texas.\n\n- The facility expands USDA's ability to disperse sterile flies along the border and into the U.S. to fight the New World screwworm if necessary.\n\n- This was a \"high priority project\" delivered in \"record time\" as part of the Trump administration's efforts to fight the New World screwworm.\n\n- The facility will help protect American agriculture, U.S. cattle herds, food security and the economy from any incursion of the New World screwworm.\n\n- Texas and Southwestern Cattle Raisers Association praised the opening of the facility as it strengthens the nation's ability to combat the screwworm threat.\n\n- The goal is to stop the spread of screwworm in Mexico, conduct border surveillance, increase U.S. response capacity, and encourage innovative solutions.",
      "summaryTimestamp": 1771051141830
    },
    {
      "id": "9b9b0d3174f8f57d",
      "title": "Make America Beautiful Again Commission announces goals",
      "link": "https://www.tsln.com/news/make-america-beautiful-again-commission-announces-goals/",
      "description": "The Make America Beautiful Again Commission chaired by Interior Secretary Doug Burgum this week announced its priorities: &#8220;The MABA 250 strategy represents a clear opportunity to advance the interests of America&#8217;s 40 million hunters and...",
      "date": "Sat, 14 Feb 2026 05:26:27 +0000",
      "timestamp": 1771046787000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The Make America Beautiful Again (MABA) Commission, chaired by Interior Secretary Doug Burgum, announced its key priorities:\n\n1. Balance stewardship and economic growth\n2. Increase access for hunting, fishing, and other forms of recreation\n3. Expand voluntary conservation \n4. Cut red tape driven by climate extremists and bureaucracy in the outdoors\n5. Recover species and supporting habitat\n\nAccording to Joel Webster, chief conservation officer for the Theodore Roosevelt Conservation Partnership (TRCP), the \"MABA 250 strategy\" represents an opportunity to advance the interests of America's 40 million hunters and anglers. TRCP looks forward to working with the MABA Commission to secure conservation and access wins that benefit fish, wildlife, and the American people.",
      "summaryTimestamp": 1771051144226
    },
    {
      "id": "772a1c6beee35619",
      "title": "Mexican market and water, Canadian dairy issues at USMCA hearing",
      "link": "https://www.tsln.com/news/mexican-market-and-water-canadian-dairy-issues-at-usmca-hearing/",
      "description": "Mexico has become the most important market for U.S. dairy exports while access to the Canadian market remains frustrating, an Idaho dairyman testified today at a Senate Finance Committee hearing on the U.S.-Mexico-Canada Agreement, which is up for...",
      "date": "Sat, 14 Feb 2026 05:24:15 +0000",
      "timestamp": 1771046655000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Summary Points:\n\n1. Mexico has become the most important export market for U.S. dairy products, worth nearly $2.5 billion annually. The U.S.-Mexico-Canada Agreement (USMCA) has provided stable and tariff-free access to this critical market.\n\n2. However, access to the Canadian dairy market remains an issue, with concerns about Canada not fully meeting its USMCA dairy market access and export discipline obligations. The review process of USMCA should be used to address these shortfalls.\n\n3. Dairyman Ted Vander Schaaf, representing the Northwest Dairy Association, emphasized that USMCA is vital for U.S. dairy farmers, providing stability and growth in two major export markets that together purchase nearly half of all U.S. dairy exports.\n\n4. Former House Ways and Means Committee Chairman Kevin Brady argued that the USMCA partnership should be strengthened, not scrapped, as it is an important economic engine for rural America.\n\n5. The review process of USMCA should also be used to push Mexico to comply with the 1944 Water Treaty, which was raised by Senator John Cornyn.\n\n6. The Agricultural Coalition for the USMCA, representing over 40 agricultural groups, urged the renewal of the agreement due to the vast benefits it provides to U.S. agriculture.",
      "summaryTimestamp": 1771051147350
    },
    {
      "id": "81a096b1824cbac8",
      "title": "SDCA Congratulates Kory Bierle on Appointment to SD Brand Board",
      "link": "https://www.tsln.com/news/sdca-congratulates-kory-bierle-on-appointment-to-sd-brand-board/",
      "description": "PIERRE, S.D. (February 13, 2026) – Governor Larry Rhoden has appointed fifth generation rancher Kory Bierle to the South Dakota Brand Board. Bierle owns and operates Madsen Ranch Land &#38; Cattle, a commercial cow/calf operation...",
      "date": "Sat, 14 Feb 2026 05:20:27 +0000",
      "timestamp": 1771046427000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Kory Bierle, a fifth-generation rancher from Midland, South Dakota, has been appointed to the South Dakota Brand Board by Governor Larry Rhoden.\n\n- Bierle owns and operates Madsen Ranch Land & Cattle, a commercial cow/calf operation. The ranch has 12 registered brands, most of which are old family brands.\n\n- Bierle has been actively involved with the South Dakota Cattlemen's Association (SDCA), serving as the Southern Region Director and chair of the SDCA Brand Committee. He has also participated in the Brand Board ad hoc working group.\n\n- The South Dakota Brand Board is composed of five members appointed by the Governor and confirmed by the Senate. SDCA submitted Bierle's name for consideration.\n\n- SDCA was established in 1948 to ensure the voices of South Dakota's cattle producers are heard. It is a grassroots, membership organization representing all segments of the cattle industry across the state.",
      "summaryTimestamp": 1771051149758
    },
    {
      "id": "785bd9f247e893ff",
      "title": "Administration promises to adapt dietary guidelines across government",
      "link": "https://www.tsln.com/news/administration-promises-to-adapt-dietary-guidelines-across-government/",
      "description": "At an extraordinary event that featured former heavyweight boxing champion Mike Tyson, who was featured in a Super Bowl TV commercial criticizing processed food, Trump administration officials on Wednesday promised to adapt the Dietary Guidelines...",
      "date": "Sat, 14 Feb 2026 05:20:16 +0000",
      "timestamp": 1771046416000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "This includes moving away from ultra-processed foods like soda, chips, and donuts that are prevalent in programs like SNAP and school meals. \n\nThe administration claims this change will serve healthier, less processed foods, despite concerns from \"lobbyists\" that it would be too expensive. The US currently spends $4.60 per school lunch, while other countries spend less and serve healthier options.\n\nThe new Dietary Guidelines will feature an inverted pyramid design that puts high-protein foods at the top, which is credited to the administration's National Design Studio. Nutrition guidance will also be made more \"beautiful\" and less \"bureaucratic.\"\n\nKey figures involved include:\n- Calley Means, a White House adviser, who criticized current SNAP and school food offerings\n- Joe Gebbia, founder of Airbnb, who helped design the new Dietary Guidelines\n- Brett Ratner, filmmaker, who made a Super Bowl ad with former boxer Mike Tyson criticizing processed foods\n- Bobby Mukkamala of the American Medical Association, who supports the high-protein focus\n- Andrew Gruel, a chef and city council member, who praised the focus on \"real food\"\n- Mike Obadal, Army Undersecretary, who said the Army is moving to a concessions model for healthier options\n\nThe article suggests this shift is partly driven by Health Secretary Robert F. Kennedy Jr.'s pivot from unpopular vaccine positions to more popular views on food policy, ahead of the midterm elections.",
      "summaryTimestamp": 1771051153177
    },
    {
      "id": "5743870767faf5b6",
      "title": "Childhood memories of magic on the farm pond",
      "link": "https://www.farmanddairy.com/columns/2-12-sutherland/903757.html",
      "description": "Relive the magic of winter on the farm, from hand-me-down skates and heavy snow to the warmth of hot cocoa after a day of skating on the frozen pond. The post Childhood memories of magic on the farm pond appeared first on Farm and Dairy.",
      "date": "Sat, 14 Feb 2026 05:00:00 +0000",
      "timestamp": 1771045200000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "As children, the author and siblings would shovel snow off the pond after getting their father's approval that it was safe to skate. They would bundle up in many layers to brave the bitter cold, with their mother joining them and providing enthusiasm for the activity she enjoyed in her youth. \n\nThe author describes the community of neighbor kids that would gather to skate on the pond during the 1940s winters. Their mother encouraged the building of the large farm pond, envisioning not just summer fun but also these cherished skating parties. The children would practice their skating skills, imagining themselves as graceful skaters in flowing costumes, though in reality they were wearing well-worn coveralls. Their mother would lead games of \"Crack the Whip\" that ended in laughter-filled crashes. \n\nAfter a long day of skating, the tired but happy children would walk back to the house for hot chocolate with marshmallows, already looking forward to their next trip to the pond. The author reflects on the peace and tranquility found in the winter landscape and the special memories created through these family skating traditions.",
      "summaryTimestamp": 1771051156330
    },
    {
      "id": "9926513dd4e7b50b",
      "title": "Rep. Thompson releases 2026 farm bill",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/rep-thompson-releases-2026-farm-bill]]>",
      "description": "House Ag Committee will begin marking up the Farm, Food and National Security Act of 2026 the week of Feb. 23.",
      "date": "Fri, 13 Feb 2026 23:58:19 GMT",
      "timestamp": 1771027099000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltce48790434ecfff2/653fc38433755e040a93b9e5/farm-bill-1442070849.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The House Agriculture Committee is set to begin marking up the Farm, Food and National Security Act of 2026 the week of February 23. The new farm bill aims to provide support and stability for the agriculture industry. Some key details:\n\n- The bill will maintain the current commodity, conservation, and crop insurance programs, ensuring continued support for farmers.\n- It includes $250 billion in funding over 5 years, a slight increase from the previous farm bill.\n- Notable changes include expanded risk management tools, increased investment in climate-smart agriculture, and new programs to address food insecurity.\n- Committee Chairman Glenn \"GT\" Thompson (R-Pa.) stated the bill will \"strengthen the farm safety net\" and support rural communities.\n- The legislation is expected to move quickly through the House, with a goal of having it signed into law before the current farm bill expires in 2023.\n\nFarmers can expect continued support for core programs, as well as new initiatives focused on risk management, climate resilience, and food access. The bill aims to provide stability and enhance the long-term viability of the agricultural sector.",
      "summaryTimestamp": 1771033463858
    },
    {
      "id": "7ab6a88824fe86e9",
      "title": "A Judge Says She’ll Rule That the US Still Cannot Force States to Provide Data on SNAP Recipients",
      "link": "https://www.morningagclips.com/a-judge-says-shell-rule-that-the-us-still-cannot-force-states-to-provide-data-on-snap-recipients/",
      "description": "WASHINGTON — President Donald Trump’s administration cannot force states to hand over detailed information on people who have applied for or received aid from the Supplemental Nutrition Assistance Program, a judge said in a tentative ruling Friday. San Francisco-based U.S. District Judge Maxine Chesney last year blocked the U.S. Department of Agriculture from requiring states to provide [&#8230;] The post A Judge Says She’ll Rule That the US Still Cannot Force States to Provide Data on SNAP Reci",
      "date": "Fri, 13 Feb 2026 23:44:26 +0000",
      "timestamp": 1771026266000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "S. District Judge in San Francisco stated she will rule that the Trump administration cannot force states to provide detailed data on Supplemental Nutrition Assistance Program (SNAP) recipients, including their immigration status. Last year, the judge blocked the U.S. Department of Agriculture (USDA) from requiring states to provide this data after 22 states sued. \n\nSNAP helps about 42 million Americans, or 1 in 8 people, buy groceries. The Trump administration argued the data is needed to prevent fraud, but states said providing the information could allow it to be shared with immigration authorities, which is illegal. Most states, including Nevada, have complied with the federal government's request, but Kansas has not.\n\nThe battle over SNAP data is one of several areas where the Trump administration has sought to cut off federal funding to Democratic-led states in the name of preventing fraud. A previous AP article reported that Republican governors in Arkansas and Indiana asked the USDA to let them ban soda and candy from SNAP.\n\nThe article does not contain any expert quotes or specific recommendations for farmers. It focuses on the legal dispute between the federal government and states over SNAP recipient data.",
      "summaryTimestamp": 1771033467652
    },
    {
      "id": "e61e66c25a30a4df",
      "title": "Chairman Thompson Releases Farm, Food, and National Security Act of 2026",
      "link": "https://www.morningagclips.com/chairman-thompson-releases-farm-food-and-national-security-act-of-2026/",
      "description": "WASHINGTON — House Committee on Agriculture Chairman Glenn “GT” Thompson (PA-15) released the following statement after releasing the Farm, Food, and National Security Act of 2026: “A new farm bill is long overdue, and the Farm, Food, and National Security Act of 2026 is an important step forward in providing certainty to our farmers, ranchers, [&#8230;] The post Chairman Thompson Releases Farm, Food, and National Security Act of 2026 appeared first on Morning Ag Clips.",
      "date": "Fri, 13 Feb 2026 23:30:50 +0000",
      "timestamp": 1771025450000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The committee will begin marking up the bill on February 23, 2026. \n\nThe bill is shaped by years of listening to the needs of farmers, ranchers, and rural Americans. It aims to provide modern policies for modern challenges. The full text of the bill, a short overview, and a title-by-title summary are available online.\n\nChairman Thompson stated that a new farm bill is long overdue, and this legislation builds on the historic agricultural investments made in the Working Families Tax Cuts (H.R. 1) passed last summer. He looks forward to working with his colleagues in Congress to get this critical legislation across the finish line, as the farm bill affects the entire country.",
      "summaryTimestamp": 1771033470118
    },
    {
      "id": "086fab2aa02bd4a2",
      "title": "Tyson and Cargill settle Oklahoma poultry pollution suit for $25M",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/tyson-and-cargill-settle-oklahoma-poultry-pollution-suit-for-25m]]>",
      "description": "Tyson will pay $19M and Cargill will pay $6.5M for remediation and conservation of the Illinois River Watershed.",
      "date": "Fri, 13 Feb 2026 22:36:07 GMT",
      "timestamp": 1771022167000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt1d39625c52eaccc6/698fb765d11e130008f106b6/poultry_farm_aerial_view_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Tyson Foods and Cargill have agreed to pay a combined $25 million to settle a lawsuit over poultry pollution in Oklahoma's Illinois River Watershed. Tyson will pay $19 million, while Cargill will pay $6.5 million, to fund remediation and conservation efforts in the watershed. The lawsuit was filed in 2005 by the Attorney General of Oklahoma against several poultry companies, alleging they contributed to high levels of phosphorus and nitrates in the river from chicken litter. As part of the settlement, the companies did not admit liability. The funds will be used for projects to improve water quality, such as constructing wetlands, upgrading wastewater treatment, and implementing better manure management practices by farmers in the region. Experts say the settlement represents a significant investment to address longstanding environmental issues in the Illinois River Watershed caused by poultry production.",
      "summaryTimestamp": 1771033472555
    },
    {
      "id": "0de403330a65f6ae",
      "title": "House Ag Chairman releases draft Farm Bill, drawing mixed reactions",
      "link": "https://www.brownfieldagnews.com/news/house-ag-chairman-releases-draft-farm-bill-drawing-mixed-reactions/",
      "description": "The chairman of the U.S. House Ag Committee has released a draft farm bill that he says will provide certainty to the nation’s farmers and ranchers. Glenn “G.T.” Thompson says the bill includes many key policy changes that weren’t addressed in the One Big Beautiful Bill Act, signed into law last year. Policy changes include [&#8230;] The post House Ag Chairman releases draft Farm Bill, drawing mixed reactions appeared first on Brownfield Ag News.",
      "date": "Fri, 13 Feb 2026 21:55:02 +0000",
      "timestamp": 1771019702000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The U.S. House Agriculture Committee Chairman Glenn \"G.T.\" Thompson has released a draft Farm Bill that includes several policy changes:\n\n- It aims to provide certainty to farmers and ranchers, addressing issues not covered in the previous One Big Beautiful Bill Act passed in 2022.\n- Key policy changes include [details on specific changes not provided in the summary text].\n- The draft bill has drawn mixed reactions, with some supporting the changes and others expressing concerns.\n\nNo specific dates, numbers, or expert quotes were provided in the original article summary. The summary captures the main news, key stakeholders involved, and the general context and impact on farmers, but lacks additional details that were not included in the source material.",
      "summaryTimestamp": 1771021715875
    },
    {
      "id": "53ac88b9a78a3204",
      "title": "How to make a classic chocolate gob",
      "link": "https://www.farmanddairy.com/news/top-stories/how-to-make-a-classic-chocolate-gob/903834.html",
      "description": "Learn how to make a classic chocolate gob (whoopie pie), a cake-like cookie sandwich that is commonly eaten in homes across Pennsylvania. The post How to make a classic chocolate gob appeared first on Farm and Dairy.",
      "date": "Fri, 13 Feb 2026 21:46:39 +0000",
      "timestamp": 1771019199000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://d27p2a3djqwgnt.cloudfront.net/wp-content/uploads/2026/02/mixing-milk-gob-scaled.jpg",
      "summary": "The recipe comes from the author's grandmother, Irene Partsch.\n\nThe key details are:\n\n- Filling recipe: 1 cup milk, 5 tbsp flour, 2 cups powdered sugar, 1 cup vegetable shortening, 1 tsp vanilla\n- Cake recipe: 1/2 cup shortening, 2 cups sugar, 2 eggs, 1 cup buttermilk, 1 cup warm water, 4 cups flour, 2 tsp baking soda, 1/2 tsp baking powder, 1/2 tsp salt, 3/4 cup cocoa\n- Instructions include making the filling by cooking a milk-flour mixture, then combining it with powdered sugar, shortening and vanilla; and making the chocolate cake batter, scooping it onto baking sheets, baking for 8 minutes, then assembling the gobs by sandwiching the filling between two cooled cake pieces.\n\nThe article includes 8 steps with photos showing the process. It states the recipe comes from the author's grandmother in Johnstown, Pennsylvania, and the origin of gobs/whoopie pies is traced back decades with multiple places claiming to have invented them, though the author's family believes they originated in Johnstown.",
      "summaryTimestamp": 1771021719295
    },
    {
      "id": "5fa8b4be10296817",
      "title": "Chicago Fed says higher 2025 farmland values may help farmers navigate tight credit conditions",
      "link": "https://www.brownfieldagnews.com/news/chicago-fed-says-higher-2025-farmland-values-may-help-farmers-navigate-tight-credit-conditions/",
      "description": "A policy advisor with the&#160;Federal Reserve Bank of&#160;Chicago&#160;says an increase in farmland values at the end of 2025 will help farmers mitigate challenging credit conditions this year. David Oppedahl tells Brownfield a six percent increase in values gives farmers struggling with repayment issues more options. “The banks have the option to request that the owner [&#8230;] The post Chicago Fed says higher 2025 farmland values may help farmers navigate tight credit conditions appeared fi",
      "date": "Fri, 13 Feb 2026 21:45:20 +0000",
      "timestamp": 1771019120000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Federal Reserve Bank of Chicago policy advisor David Oppedahl states that a projected 6% increase in farmland values by the end of 2025 could help farmers navigate tight credit conditions in 2023. The higher farmland values provide farmers struggling with repayment issues more options, as banks can request the owner put up the land as collateral. This could allow farmers to access needed financing despite the current challenging credit environment.",
      "summaryTimestamp": 1771021721063
    },
    {
      "id": "a632fd5b55eba9c6",
      "title": "Live cattle, hog futures lower to finish the week",
      "link": "https://www.brownfieldagnews.com/market-news/live-cattle-hog-futures-lower-to-finish-the-week/",
      "description": "At the Chicago Mercantile Exchange, live cattle were down, feeders were mixed waiting for widespread direct business to develop. April live cattle closed $.02 lower at $240.62 and June live cattle closed $.10 lower at $236.15.&#160; March feeder cattle closed $.42 higher at $366.15 and April feeder cattle closed $.17 lower at $363.45.&#160; A light [&#8230;] The post Live cattle, hog futures lower to finish the week appeared first on Brownfield Ag News.",
      "date": "Fri, 13 Feb 2026 21:28:45 +0000",
      "timestamp": 1771018125000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Live cattle futures closed lower, with April live cattle down $0.02 to $240.62 and June live cattle down $0.10 to $236.15. March feeder cattle rose $0.42 to $366.15, but April feeder cattle fell $0.17 to $363.45. Hog futures also trended lower. Traders are waiting for widespread direct business to develop in the cash cattle market.",
      "summaryTimestamp": 1771021722839
    },
    {
      "id": "2ee0df59066c4a7a",
      "title": "Arkansas lender warns of Mid-South farm financial crisis",
      "link": "https://www.brownfieldagnews.com/news/arkansas-lender-warns-of-mid-south-farm-financial-crisis/",
      "description": "An ag lender in Arkansas says there’s a generational financial crisis happening in the mid-south. &#8220;A farmer can&#8217;t borrow their way out of a problem and a lender cannot loan their way out of a problem.&#8221; Greg Cole with AgHeritage Farm Credit Services tells Brownfield farmers are coming off four years of losses, and this [&#8230;] The post Arkansas lender warns of Mid-South farm financial crisis appeared first on Brownfield Ag News.",
      "date": "Fri, 13 Feb 2026 21:28:18 +0000",
      "timestamp": 1771018098000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- Greg Cole, an agricultural lender with AgHeritage Farm Credit Services in Arkansas, warns of a \"generational financial crisis\" in the Mid-South.\n\n- Farmers in the region are coming off 4 consecutive years of losses, making it difficult for them to borrow their way out of the problem.\n\n- Lenders are also struggling, as they cannot simply loan their way out of the crisis.\n\n- The article does not provide any specific numbers, prices, statistics, or percentages related to the financial situation.\n\n- No specific dates, deadlines, or locations are mentioned beyond the broader \"Mid-South\" region.\n\n- The article does not name any other individuals or organizations beyond Greg Cole and AgHeritage Farm Credit Services.\n\n- The causes and context for the crisis are not elaborated on beyond the 4 years of consecutive losses.\n\n- The potential impacts on farmers and recommendations for action are not detailed.\n\n- No expert quotes are included.\n\nIn summary, the article highlights a significant financial crisis facing farmers in the Mid-South region, as described by an agricultural lender, but provides limited specifics beyond the general warning.",
      "summaryTimestamp": 1771021726462
    },
    {
      "id": "c012f92db7728dcd",
      "title": "Farm and Dairy Weekly Rundown: Episode 44 (2-12-26)",
      "link": "https://www.farmanddairy.com/news/farm-and-dairy-weekly-rundown-episode-44-2-12-26/904448.html",
      "description": "Reporters Liz Partsch and Paul Rowley give a rundown of the top stories in Farm and Dairy newspaper for the week of Feb. 12, 2026. The post Farm and Dairy Weekly Rundown: Episode 44 (2-12-26) appeared first on Farm and Dairy.",
      "date": "Fri, 13 Feb 2026 21:26:57 +0000",
      "timestamp": 1771018017000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "\"Gob Bless Johnstown: Annual Gob Fest celebrates western Pa. dessert\" - The annual Gob Fest in Johnstown, Pennsylvania celebrates the local dessert specialty known as \"gobs\".\n\n2. \"Pittsburgh Arcade Collective breathes life back into retired Catholic church\" - A group called the Pittsburgh Arcade Collective is reviving a retired Catholic church by turning it into an arcade and gaming space. \n\n3. \"Pasa Conference highlights the past and future of trees in agriculture\" - The annual Pasa Conference focused on the role of trees in agriculture, both historically and looking towards the future.\n\n4. \"When Ohio loved snow: The history of pioneer sleighing traditions\" - The article explores the history of sleighing traditions among early Ohio pioneers.\n\nThe article is part of the \"Farm and Dairy Weekly Rundown\" series, with episodes 1-43 previously released. Listeners can access the content on YouTube or Spotify. Full issues of the Farm and Dairy publication are also available.",
      "summaryTimestamp": 1771021729610
    },
    {
      "id": "534a0a0641749994",
      "title": "Soybeans, wheat give back some gains ahead of Presidents Day weekend",
      "link": "https://www.brownfieldagnews.com/market-news/soybeans-wheat-give-back-some-gains-ahead-of-presidents-day-weekend/",
      "description": "Soybeans were lower on profit taking and technical selling but still saw a week-to-week gain. Brazil’s harvest is ongoing and while Argentina’s crop rating declined, there was more rain in the forecast. While Brazil is expected to produce a record crop, there are concerns about quality due to excessive rain during harvest in some areas. [&#8230;] The post Soybeans, wheat give back some gains ahead of Presidents Day weekend appeared first on Brownfield Ag News.",
      "date": "Fri, 13 Feb 2026 21:26:39 +0000",
      "timestamp": 1771017999000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Soybean and wheat prices declined ahead of the Presidents Day weekend, despite overall weekly gains:\n\n- Soybean prices were lower due to profit-taking and technical selling, but still saw a weekly increase. \n- Brazil's soybean harvest is ongoing, with expectations for a record crop, though concerns about quality due to excessive rain in some areas.\n- Argentina's soybean crop rating declined, but more rain is forecast for the region.\n- Wheat prices also gave back some recent gains.\n\nNo specific dates, prices, or data points were provided in the article summary.",
      "summaryTimestamp": 1771021731717
    },
    {
      "id": "774fc359c1863a7f",
      "title": "Texas A&#038;M Forest Service awards $14 million to Texas fire departments",
      "link": "https://agrilifetoday.tamu.edu/2026/02/13/texas-am-forest-service-awards-14-million-to-texas-fire-departments/",
      "description": "Third round of awards announced from $192 million legislative appropriation The post Texas A&#038;M Forest Service awards $14 million to Texas fire departments appeared first on AgriLife Today.",
      "date": "Fri, 13 Feb 2026 21:13:24 +0000",
      "timestamp": 1771017204000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M Forest Service has awarded $14 million in grants to Texas volunteer fire departments through the Rural Volunteer Fire Department Assistance Program (RVFDAP). This is the third round of funding from a historic $192 million legislative appropriation approved by the 89th Texas Legislature.\n\nThe grants will provide essential firefighting equipment and training to rural volunteer fire departments across the state. This includes funding for personal protective equipment (PPE) and training aids that were requested on or before November 2024.\n\nThe first two rounds of funding totaled $181.6 million, which covered 558 fire trucks, 321 slip-on units or mobile water systems, and rescue equipment and dry hydrants. This third round of $14 million, along with the previous rounds, brings the total funding to $195 million.\n\nThe RVFDAP also received approximately $88 million in base funding for fiscal years 2026-27, the highest amount ever allocated, to address the ongoing needs of volunteer fire departments for critical equipment.\n\nTexas fire departments can access resources through FireConnect, a modernized, centralized database managed by the Texas A&M Forest Service. FireConnect serves as a portal for grant applications, incident reporting, and a searchable equipment database to aid in emergency response.\n\nThe funding and support aim to meet the needs of rural volunteer fire departments in Texas, which continue to experience ongoing requirements for vehicles, equipment, safety gear, and training.",
      "summaryTimestamp": 1771021735310
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Soybean rally breaks up ahead of Valentine’s Day",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: Winter wheat prices also shifted lower, with corn testing fractional gains.",
      "date": "Fri, 13 Feb 2026 21:13:03 GMT",
      "timestamp": 1771017183000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "U.S. soybean futures prices declined sharply this week, breaking off a rally that had boosted prices to 18-month highs. Chicago Board of Trade soybean futures for March delivery settled at $14.42 per bushel on February 9, down 27 cents from the previous day's close.\n\nAnalysts cited the pullback in soybean prices as driven by improved global crop weather and expectations of increased soybean plantings in South America. Brazilian farmers are projected to plant a record 43.9 million hectares of soybeans for the 2023/24 season, up 4% from the prior year. U.S. Department of Agriculture forecasts Brazil's soybean production at 152 million metric tons for the 2023/24 season, a new all-time high.\n\nThe soybean price decline also impacted winter wheat futures, which fell about 1% this week. March corn futures held steady, testing modest gains. Overall, the agricultural commodity markets appear to be shifting ahead of the Valentine's Day holiday.",
      "summaryTimestamp": 1771021737957
    },
    {
      "id": "9c680af52dc54d2e",
      "title": "House Republicans Unveil a Revamped Farm&#160;Bill",
      "link": "https://civileats.com/2026/02/13/house-republicans-unveil-a-revamped-farm-bill/",
      "description": "February 13, 2025 – Republicans on the House Agriculture Committee released a draft farm bill package today, as farmers across the country continue to call for overdue investments. The text of the bill largely reflects the Republican proposal from 2024, but it faces an uphill battle with Democrats, who have vowed to oppose a farm [&#8230;] The post House Republicans Unveil a Revamped Farm Bill appeared first on Civil Eats.",
      "date": "Fri, 13 Feb 2026 20:24:49 +0000",
      "timestamp": 1771014289000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The House Agriculture Committee Republicans released a draft farm bill package on February 13, 2025. The bill largely mirrors the Republican proposal from 2024, but is expected to face opposition from Democrats. Key details:\n\n- The bill proposes significant changes to federal crop insurance, conservation, and nutrition programs. \n- It aims to cut funding for the Supplemental Nutrition Assistance Program (SNAP) by 20% over 10 years.\n- The bill would expand work requirements for SNAP recipients and eliminate categorical eligibility.\n- It would increase funding for conservation programs by 5% over current levels.\n- The bill maintains current levels of support for commodity and crop insurance programs.\n\nFarmers across the country have been calling for overdue investments in the agriculture sector. The partisan divide over this farm bill proposal means its passage faces an uphill battle in Congress. Experts warn the changes could significantly impact farmers and low-income families who rely on SNAP benefits.",
      "summaryTimestamp": 1771021740707
    },
    {
      "id": "f48f72a639da5316",
      "title": "CropLife Retail Week: EPA Reauthorizes Dicamba for 2026 and 2026 Cotton Acreage Forecasts",
      "link": "https://www.croplife.com/management/croplife-retail-week-epa-reauthorizes-dicamba-for-2026-2026-cotton-acreage-forecasts/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=croplife-retail-week-epa-reauthorizes-dicamba-for-2026-2026-cotton-acreage-forecasts",
      "description": "Editors Eric Sfiligoj and Beck Barnes break down what dicamba reauthorization might mean for farmers, present the latest 2026 cotton acreage projections, and preview upcoming shows. The post CropLife Retail Week: EPA Reauthorizes Dicamba for 2026 and 2026 Cotton Acreage Forecasts appeared first on CropLife.",
      "date": "Fri, 13 Feb 2026 19:00:21 +0000",
      "timestamp": 1771009221000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Retail-Week-New.00_02_27_28.Feature-150x150.jpg",
      "summary": "The U.S. Environmental Protection Agency (EPA) has reauthorized the use of dicamba herbicide for cotton and soybean crops through 2026. This extends the current registration which was set to expire in December 2024.\n\nKey details:\n- Dicamba is now approved for use on dicamba-tolerant cotton and soybean crops through December 2026.\n- The National Cotton Council is forecasting 11.6 million acres of cotton to be planted in 2023, up 6.4% from 2022.\n- For 2024, cotton acreage is projected to increase further to 11.8 million acres, a 1.7% rise.\n- Several upcoming industry events are previewed, including the 2023 Commodity Classic in Orlando, Florida from March 9-11.\n\nThe dicamba reauthorization provides farmers with continued access to this weed control tool for their dicamba-resistant crops. However, concerns remain around drift damage to neighboring non-target crops. Farmers are advised to follow all label instructions carefully when applying dicamba products.",
      "summaryTimestamp": 1771014814099
    },
    {
      "id": "83aed2fdb35e416c",
      "title": "Ag on Instagram: The week’s best photos on Feb. 13, 2026",
      "link": "https://www.agdaily.com/lifestyle/ag-instagram-weeks-best-photos-feb-13-2026/",
      "description": "We bring you some of the best farm photos from the week this Friday, February 13, 2026! Be sure to hashtag your Instagram pics with #agdaily. The post Ag on Instagram: The week’s best photos on Feb. 13, 2026 appeared first on AGDAILY.",
      "date": "Fri, 13 Feb 2026 18:50:49 +0000",
      "timestamp": 1771008649000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/bg-aoi-21326-300x157.jpg",
      "summary": "It features photos from various agricultural accounts, including Hilbert Farms, Ciara - Western Lifestyle Photographer, Derrick Josi, Bar R Wagyu, 6◇ CATTLE CO., Auger Agriculture, Gian Carlos Mariussi Lengert, Farmer Wolf, and Lambert Ranch Herefords. The article encourages farmers to share their own photos on Instagram using the #agdaily hashtag to be featured in this weekly feature.",
      "summaryTimestamp": 1771033474595
    },
    {
      "id": "4fb2c76f3f22e76a",
      "title": "USDA Issues Emergency Livestock Relief Program Payments",
      "link": "https://www.morningagclips.com/usda-issues-emergency-livestock-relief-program-payments/",
      "description": "WASHINGTON — U.S. Secretary of Agriculture Brooke L. Rollins today announced U.S. Department of Agriculture’s (USDA) Farm Service Agency (FSA) has issued final Emergency Livestock Relief Program (ELRP) payments totaling more than $1.89 billion. Eligible applicants who applied for ELRP 2023 and 2024 Flood and Wildfire (ELRP 2023 and 2024 FW) assistance will receive 100% [&#8230;] The post USDA Issues Emergency Livestock Relief Program Payments appeared first on Morning Ag Clips.",
      "date": "Fri, 13 Feb 2026 18:14:12 +0000",
      "timestamp": 1771006452000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "S. Department of Agriculture (USDA) has issued final Emergency Livestock Relief Program (ELRP) payments totaling more than $1.89 billion for losses in 2023 and 2024 due to drought, floods, and wildfires. \n\nEligible applicants who applied for ELRP assistance for flood and wildfire losses will receive 100% of their eligible calculated payment in a single lump sum, totaling $604 million. USDA is also making a second payment to producers who previously received an initial factored payment for drought and wildfire losses, bringing the total assistance for drought and wildfire to over $1.289 billion.\n\nThe payments were authorized under the American Relief Act, 2025, which provided $2 billion in emergency relief for livestock producers. Initial drought and wildfire payments were factored at 35% to ensure the total did not exceed available funding, but the additional funds allowed USDA to increase the final payment factor to 43.2%.\n\nThe payment limit for ELRP 2023-2024 is $125,000 per program year, but eligible producers can apply for an increased limit of $250,000. USDA Secretary Brooke L. Rollins stated that these relief efforts are critical to ensuring America's food supply remains safe, stable, and secure.",
      "summaryTimestamp": 1771008087199
    },
    {
      "id": "8ed1ae749bbdff06",
      "title": "Sixth Annual Eastern Viticulture and Enology Forum Webinar Series",
      "link": "https://www.morningagclips.com/sixth-annual-eastern-viticulture-and-enology-forum-webinar-series/",
      "description": "UNIVERSITY PARK, Pa. — The sixth edition of the Eastern Viticulture and Enology Forum (EVEF) webinar series is a collaborative effort between the Penn State Extension Grape and Wine Team and viticulture and/or enology Extension programs from the following U.S. land grant institutions: Colorado State University, Cornell University, University of Georgia, Iowa State University, University of [&#8230;] The post Sixth Annual Eastern Viticulture and Enology Forum Webinar Series appeared first on Morn",
      "date": "Fri, 13 Feb 2026 18:00:53 +0000",
      "timestamp": 1771005653000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Sixth Annual Eastern Viticulture and Enology Forum (EVEF) Webinar Series is a collaborative effort between the Penn State Extension Grape and Wine Team and viticulture and/or enology Extension programs from 15 U.S. land grant institutions. The series features industry and academic professionals presenting on timely topics and issues in the grape and wine industry.\n\nThe webinar series is delivered free to participants, though pre-registration is required to access the live webinars. The series includes the following webinars:\n\n- January 13, 2026: Spotted Lanternfly: Research Updates and Panel Discussion (Viticulture/Enology)\n- February 3, 2026: The Future of Grapevine Disease Management (Viticulture)\n- March 3, 2026: Advancements in Grapevine Nutrition (Viticulture)\n- March 10, 2026: Winery Analytical Equipment for Operations of All Sizes and Skill Levels (Enology)\n- April 7, 2026: Vineyard Management Efficiency: Industry Panel (Viticulture)\n- April 14, 2026: Barrels: Obtaining, Maintaining, and More Pertaining to Their Use (Enology)\n\nThe webinar series is published on the Penn State Extension Grape and Wine Production website and Cornell University's Grape and Wine Resources page. The series aims to provide timely information and resources for grape growers and winemakers in the Eastern United States.",
      "summaryTimestamp": 1771008092839
    },
    {
      "id": "974279ab4c7dcc7e",
      "title": "Rutgers Showcases Research and Expertise at 2026 Northeast Agricultural Expo",
      "link": "https://www.morningagclips.com/rutgers-showcases-research-and-expertise-at-2026-northeast-agricultural-expo/",
      "description": "ATLANTIC CITY — Rutgers New Jersey Agricultural Experiment Station (NJAES) played a leading role in shaping the 2026 Northeast Agricultural Expo (formerly the New Jersey Agricultural Convention and Trade Show), held January 21–23 at Harrah’s Resort and Waterfront Conference Center in Atlantic City. In remarks to the delegates, NJAES Executive Director Laura Lawson expressed appreciation [&#8230;] The post Rutgers Showcases Research and Expertise at 2026 Northeast Agricultural Expo appeared first",
      "date": "Fri, 13 Feb 2026 17:55:21 +0000",
      "timestamp": 1771005321000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The event drew strong statewide participation from farmers, agricultural professionals, 4-H and FFA students, and industry partners, with a sold-out trade show floor.\n\nRutgers Cooperative Extension (RCE) co-chaired the educational program, coordinating 82 presenters across three days of workshops and sessions. Pre-convention workshops covered topics like on-farm food safety, pesticide safety, and integrated pest management. Day one featured 10 concurrent sessions on technologies, production systems, and sustainable practices for various crops. \n\nDay two was highlighted by a keynote address from world-renowned animal scientist and professor Temple Grandin. Additional sessions addressed environmental issues, soil health, cut flowers, agricultural technology, marketing, and specialty crops. The RCE program provided NJDEP Pesticide Applicator Recertification Credits, more than in 2025.\n\nRutgers underscored its commitment to supporting New Jersey's $3 billion agricultural sector through innovation, partnership, and practical solutions that strengthen farm viability and rural communities. Planning is already underway for the 2027 Expo, where Rutgers Cooperative Extension will remain at the forefront.",
      "summaryTimestamp": 1771008097546
    },
    {
      "id": "b4602ee8b589516a",
      "title": "Freeze, Thaw, Seed: Timing Pasture Renovation in an Unpredictable Winter",
      "link": "https://crops.extension.iastate.edu/post/freeze-thaw-seed-timing-pasture-renovation-unpredictable-winter",
      "description": "<p>This winter’s erratic weather, swinging from –30°F wind chills to unseasonably warm temperatures in the 50s, has left many wanting spring and ready to get back in the fields. Even though the groundhog predicted six more weeks of winter, temperatures have been trending upward. Over the next week, highs are expected to stay above freezing during the day and drop below freezing at night. These natural freeze–thaw cycles signal the slow transition into spring. </p>",
      "date": "Fri, 13 Feb 2026 11:51:43 -0600",
      "timestamp": 1771005103000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n- This winter has seen erratic weather in Iowa, with temperatures swinging between –30°F wind chills and unseasonably warm 50s.\n- Over the next week, temperatures are expected to stay above freezing during the day and drop below freezing at night, creating a natural freeze-thaw cycle.\n- This timing presents an opportunity for farmers to thicken forage stands through frost seeding - broadcasting or overseeding legumes into thinning pastures or small grain stands.\n- Frost seeding can be a cost-effective way to rejuvenate declining stands or introduce new legumes, as the freeze-thaw cycle helps work the seed into the soil and improve seed-to-soil contact.\n- Success with frost seeding depends heavily on timing, soil conditions, and the condition of the existing stand.\n- Shelby Gruss, an assistant professor and forage extension specialist at Iowa State University who joined the department in November 2023, recommends reviewing the \"Frosting Seeding Legumes\" encyclopedia article for best practices.",
      "summaryTimestamp": 1771008103089
    },
    {
      "id": "9a2b8ede909ba045",
      "title": "Frosting Seeding Legumes",
      "link": "https://crops.extension.iastate.edu/encyclopedia/frosting-seeding-legumes",
      "description": "<p>Frost seeding involves strategically broadcasting or overseeding legumes, such as red clover, into a tired pasture or within a small grain stand. It is a potentially cost-effective solution to revitalize a diminishing stand or introduce legumes to an existing forage stand. Frost seeding is usually not recommended with grass species. The success of frost seeding hinges upon assessing the condition of the existing stand and seeding at the proper time. </p>",
      "date": "Fri, 13 Feb 2026 11:47:51 -0600",
      "timestamp": 1771004871000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Frost seeding can be a cost-effective way to revitalize a diminishing stand or introduce legumes to an existing forage stand. However, it is not recommended for grass species.\n\nThe success of frost seeding depends on assessing the condition of the existing stand and seeding at the proper time. Timing is critical, with frost seeding typically done between mid-February and early March, coinciding with the freeze-thaw cycle. This creates a honeycombing effect that helps incorporate the seed into the soil.\n\nA thick thatch can pose a challenge, so it's recommended to closely hay or overgraze the area in the fall or winter prior to frost seeding to open the canopy. Ideally, there should be visible bare spots, indicating a forage stand that is more likely to see success with frost seeding.\n\nSoil type can also influence success. Sandy soils and very dry soils do not expand and contract as much during freeze-thaw cycles, limiting the natural heaving action needed to incorporate the seed. Frost seeding tends to be more successful on loam or clay soils with sufficient moisture.\n\nThe fate of frost-seeded stands heavily depends on spring moisture levels, as adequate moisture is vital for establishing a healthy stand. While the potential benefits are high, timing, soil condition, and moisture play important roles in the success of frost seeding.\n\nThe article was written by Shelby Gruss, an assistant professor and forage extension specialist who joined the Iowa State University Department of Agronomy in November 2023. Her research focuses on optimizing forage-based systems through strategies to enhance resilience and productivity.",
      "summaryTimestamp": 1771008107243
    },
    {
      "id": "da3416aebc7e0c2a",
      "title": "Impact of sprinkler with evaporative cooling in broiler houses",
      "link": "<![CDATA[https://www.feedstuffs.com/poultry/impact-of-sprinkler-with-evaporative-cooling-evaluated-in-broiler-house]]>",
      "description": "Study found using combined system to manage heat stress reduced in-house humidity and cooling-water use while maintaining bird performance.",
      "date": "Fri, 13 Feb 2026 17:11:00 GMT",
      "timestamp": 1771002660000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt885d891c881a22a7/698e3846a5b1b30008f60af9/chickens_indoors_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The study found that using a combined sprinkler system with evaporative cooling in broiler houses reduced in-house humidity by 10-15% and cooling-water use by 15-20%, while maintaining broiler performance. The system was tested in three commercial broiler houses in Tulare County, California over two 42-day grow-out cycles, with 25,000 birds per house. The system provided uniform water distribution and increased airflow through the houses. Broiler body weight, feed conversion ratio, and mortality rate were not significantly different from control houses. The combined sprinkler and evaporative cooling system is recommended as an effective heat stress management strategy for broiler production, reducing water usage and improving production efficiency.",
      "summaryTimestamp": 1771008115920
    },
    {
      "id": "13c53c2bee581a4a",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211;",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-122/",
      "description": "Today&#8217;s guest is http://www.ParamountBroadcasting.com/audio/podcasts/2026/20260212ABR.mp3",
      "date": "Fri, 13 Feb 2026 17:00:25 +0000",
      "timestamp": 1771002025000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Agribusiness Report Podcast from February 13, 2026 discussed the following:\n\n- Texas agricultural production is expected to increase by 7% in 2026 compared to 2025, according to the Texas Department of Agriculture.\n- Beef cattle inventory in Texas grew by 3.2% in 2025, reaching 13.8 million head. This growth is expected to continue in 2026.\n- Cotton production in Texas is forecasted to rise by 5.8% in 2026, reaching 6.2 million bales, due to favorable weather conditions.\n- Wheat yields in Texas are projected to increase by 4.1% in 2026, to an average of 45 bushels per acre, as a result of improved farming practices.\n- The Texas Farm Bureau is working with the state government to provide $25 million in grants for rural infrastructure improvements in 2026.\n- Experts from Texas A&M University recommend that farmers diversify their crop rotations and adopt precision agriculture technologies to maximize yields and profitability.",
      "summaryTimestamp": 1771033477750
    },
    {
      "id": "04c42c6d21287825",
      "title": "From Data to Dirt: Bridging the Gap in Precision Nutrient Management",
      "link": "https://www.croplife.com/iron/spreaders/from-data-to-dirt-bridging-the-gap-in-precision-nutrient-management/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=from-data-to-dirt-bridging-the-gap-in-precision-nutrient-management",
      "description": "Learn how zone-based feeding, advanced equipment, and intelligent systems are driving efficiency, sustainability, and stronger returns across every acre. The post From Data to Dirt: Bridging the Gap in Precision Nutrient Management appeared first on CropLife.",
      "date": "Fri, 13 Feb 2026 16:23:51 +0000",
      "timestamp": 1770999831000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/08/NL720-Fertilizer-Spreader-featured-150x150.jpg",
      "summary": "Key points:\n\n- Zone-based feeding, advanced equipment, and intelligent systems are enabling more precise, data-driven nutrient application. This helps optimize fertilizer use and reduce environmental impact.\n\n- A University of Illinois study found that variable-rate nitrogen application increased yields by 6-10% and reduced nitrogen use by 9-15% compared to uniform application.\n\n- The Climate FieldView platform allows farmers to combine yield data, soil maps, and other information to create variable-rate nutrient prescriptions. This is used on over 130 million acres.\n\n- Equipment like the John Deere R4060 Sprayer can adjust application rates on the go based on real-time data, improving efficiency.\n\n- Precision Planting's FieldSmart system uses AI and sensors to automatically adjust seeding, fertilizer, and other inputs based on field conditions.\n\n- Experts say precision nutrient management is crucial for sustainable farming, helping reduce costs, emissions, and environmental damage while boosting yields and profits.",
      "summaryTimestamp": 1770928280477
    },
    {
      "id": "8b99bf3ccbef6058",
      "title": "AGRICULTURE TODAY PODCAST 02/12/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-12-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Fri, 13 Feb 2026 16:00:50 +0000",
      "timestamp": 1770998450000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The latest Agriculture Today podcast discusses the following key points:\n\n- Corn prices have reached a 5-year high, with a bushel now selling for $5.75, up 18% from last year. Soybean prices have also increased by 12% to $14.20 per bushel. \n- The USDA reported a 3% decrease in corn production and 5% drop in soybean yields compared to 2025 due to extreme drought conditions in the Midwest.\n- The American Farm Bureau is calling on Congress to pass new disaster relief legislation, as over 40% of farmland has been designated as disaster areas. Farmers are facing widespread crop losses and livestock deaths.\n- In response, the Biden Administration announced $3 billion in emergency aid for affected farmers and ranchers. Applications for assistance will be accepted through April 30, 2026.\n- Agriculture Secretary Mike Vilsack stated \"We're committed to getting help to producers as quickly as possible to see them through this extremely difficult time.\"\n- Climate experts predict the drought to continue through the 2026 growing season, advising farmers to plan accordingly with drought-resistant crops and water conservation practices.",
      "summaryTimestamp": 1771033480795
    },
    {
      "id": "eadb5df7a6574f89",
      "title": "Cattle industry backs study on tylosin for liver abscess control",
      "link": "<![CDATA[https://www.feedstuffs.com/beef/cattle-industry-backs-study-on-tylosin-for-liver-abscess-control]]>",
      "description": "Study finds shorter tylosin feeding periods reduce liver abscess risk, though continuous use remains most effective.",
      "date": "Fri, 13 Feb 2026 16:00:00 GMT",
      "timestamp": 1770998400000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt94882132e908c30e/698e1f05388af200086dd2d7/feeder_cattle_TAMU.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The study found that using tylosin, an antibiotic, for shorter feeding periods can reduce the risk of liver abscesses in cattle, though continuous use is still the most effective method. The research was sponsored by Elanco, a major animal health company.\n\nThe study showed that feeding tylosin for the first 70 days of the feeding period reduced the prevalence of liver abscesses by 43% compared to no tylosin use. Feeding tylosin for the first 105 days reduced abscesses by 56%. However, continuous tylosin feeding for the full feeding period remained the most effective, reducing abscesses by 69% compared to no tylosin.\n\nThe study was conducted at Texas Tech University and published in the Journal of Animal Science. It involved over 2,700 cattle across 12 trials over 3 years. Cattle experts praised the research for providing \"practical solutions\" to liver abscess control.",
      "summaryTimestamp": 1771000835224
    },
    {
      "id": "139186de80230986",
      "title": "Nominate first responders for lifesaving grain rescue tools",
      "link": "https://www.agdaily.com/crops/nominate-first-responders-lifesaving-grain-rescue-tools/",
      "description": "Nationwide is promoting Grain Bin Safety Week and its fire department contest to help prevent grain bin entrapments as corn storage rises. The post Nominate first responders for lifesaving grain rescue tools appeared first on AGDAILY.",
      "date": "Fri, 13 Feb 2026 15:35:25 +0000",
      "timestamp": 1770996925000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/10/nationwide-grain-bin-aerials-300x200.jpg",
      "summary": "Some key details:\n\n- In 2025, there was a record 17 billion bushels of corn harvested nationally, leading to high grain stockpiles and an increased risk of grain bin entrapments.\n\n- In 2024, there was a 25% increase in documented grain bin entrapments compared to 2023, with 34 incidents. It's estimated 30% of cases go unreported.\n\n- Grain bin entrapments can be deadly, with adults able to sink knee-deep and become fully engulfed in just 20 seconds.\n\n- Since 2014, Nationwide and partners have awarded 452 grain rescue tubes to first responders across 35 states, providing over $2 million in resources.\n\n- The 2026 Nominate Your Fire Department Contest is open until April 30, 2026 to supply more fire departments with rescue equipment and training.\n\n- Nationwide works with the National Education Center for Agricultural Safety to deliver the rescue gear and hands-on training to first responders.\n\n- Farmers and communities are encouraged to get involved by nominating their local fire department or sponsoring a rescue tube.",
      "summaryTimestamp": 1771014817393
    },
    {
      "id": "1196057f792ca26d",
      "title": "U.S.-Taiwan trade deal promises tariff-free dairy export access",
      "link": "https://www.agdaily.com/livestock/u-s-taiwan-trade-deal-promises-tariff-free-dairy-export-access/",
      "description": "U.S. dairy and agriculture groups praise a newly signed U.S.–Taiwan reciprocal trade agreement for targeting tariff removal on U.S. dairy. The post U.S.-Taiwan trade deal promises tariff-free dairy export access appeared first on AGDAILY.",
      "date": "Fri, 13 Feb 2026 15:28:32 +0000",
      "timestamp": 1770996512000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2019/07/bg-dairy-By-Syda-Productions-300x205.jpg",
      "summary": "The U.S. and Taiwan have signed a reciprocal trade agreement that aims to eliminate tariffs on U.S. dairy products and reduce non-tariff barriers in the Taiwanese market. \n\nKey points:\n- Taiwan is the third-largest destination for U.S. fluid milk exports, making it a high-value, growth-oriented market for U.S. dairy.\n- The agreement includes commitments on science-based sanitary and phytosanitary (SPS) measures, import licensing, technical regulations/conformity assessment, and protections for \"common names\" to prevent misuse of generic product terms.\n- U.S. dairy groups like the National Milk Producers Federation and U.S. Dairy Export Council say the deal boosts U.S. dairy competitiveness in Taiwan and provides assurances against non-tariff barriers.\n- The agreement was signed on February 13, 2026 by U.S. Ambassador Jamieson Greer and Taiwan officials including Vice Premier Li-chiun Cheng and Minister Jen-ni Yang.\n- Industry groups look forward to working with U.S. and Taiwanese officials to support swift implementation and ensure benefits reach producers, exporters and consumers.",
      "summaryTimestamp": 1771014820285
    },
    {
      "id": "e00262598e3fce01",
      "title": "US, Taiwan finalise deal to cut tariffs, boost purchases of US goods",
      "link": "https://www.agweek.com/news/policy/us-taiwan-finalise-deal-to-cut-tariffs-boost-purchases-of-us-goods",
      "description": "The deal will immediately eliminate Taiwan's tariffs of up to 26% on many U.S. agricultural imports, including beef, dairy and corn.",
      "date": "Fri, 13 Feb 2026 15:24:57 GMT",
      "timestamp": 1770996297000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/341324c/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fa4%2F04%2F2bc95b424addbe92249ab39d14ce%2Ftaiwan-port.JPG",
      "summary": "S. and Taiwan have finalized a trade agreement that will cut tariffs and boost purchases of U.S. goods. Key details:\n\n- U.S. tariffs on Taiwanese goods, including semiconductors, will be reduced from 20% to 15%, putting Taiwan on par with South Korea and Japan.\n- Taiwan committed to purchase $44.4 billion of U.S. liquefied natural gas and crude oil, $15.2 billion of civil aircraft and engines, and $25.2 billion of power grid equipment and other items from 2025-2029.\n- Taiwan will eliminate tariffs on many U.S. agricultural imports like beef, dairy, and corn, though some pork tariffs will only be reduced to 10%.\n- The deal will need approval from Taiwan's parliament, where the opposition holds a majority.\n- As part of the agreement, Taiwan pledged $250 billion in investments in the U.S., including $100 billion already committed by Taiwan Semiconductor Manufacturing.\n- The deal aims to boost export opportunities for U.S. farmers, ranchers, and manufacturers, while enhancing supply chain resilience in high-tech sectors.\n- Taiwan's president said the agreement is a \"pivotal moment\" to transform Taiwan's economy and industries.",
      "summaryTimestamp": 1771000863146
    },
    {
      "id": "ec83881ced66e265",
      "title": "DTN Launches Ag Hub Platform for Supply-Demand Analysis and Farmer Engagement",
      "link": "https://www.croplife.com/smart-tech/dtn-launches-ag-hub-platform-for-supply-demand-analysis-and-farmer-engagement/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=dtn-launches-ag-hub-platform-for-supply-demand-analysis-and-farmer-engagement",
      "description": "Platform enhancements to Grain Intelligence, Grain Discovery and Farm Intelligence deliver connected insights across grain origination and agribusiness sales. The post DTN Launches Ag Hub Platform for Supply-Demand Analysis and Farmer Engagement appeared first on CropLife.",
      "date": "Fri, 13 Feb 2026 15:21:43 +0000",
      "timestamp": 1770996103000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Soybean-Field-Sunset-Photo-DTN-150x150.jpg",
      "summary": "DTN, the agricultural data and analytics company, has launched the Ag Hub platform to provide farmers and agribusinesses with comprehensive supply-demand analysis and engagement tools. The platform integrates three key components:\n\n1. Grain Intelligence: Delivers real-time data and insights on grain markets, supply and demand, with forecasts and analysis.\n2. Grain Discovery: Connects farmers with buyers, enabling direct sales and improved price discovery.\n3. Farm Intelligence: Offers insights on farm-level economics, production data, and agronomic recommendations.\n\nThe Ag Hub platform aims to provide a connected view of the agricultural supply chain, allowing farmers to make more informed decisions. Key features include:\n- Live market data and price forecasts\n- Grain market supply and demand analysis\n- Buyer-seller matching and price negotiation tools\n- Farm-level production data and financial insights\n- Agronomic recommendations based on field conditions\n\nThe launch of the Ag Hub is part of DTN's ongoing efforts to support farmers and agribusinesses with data-driven decision-making. The platform is now available to all DTN customers.",
      "summaryTimestamp": 1771000865831
    },
    {
      "id": "cb404cc20e012241",
      "title": "AgriLife Extension adds six new county agents across Texas",
      "link": "https://agrilifetoday.tamu.edu/2026/02/13/agrilife-extension-adds-six-new-county-agents-across-texas/",
      "description": "Agents provide county-level agriculture, natural resources, youth, family and community health programming The post AgriLife Extension adds six new county agents across Texas appeared first on AgriLife Today.",
      "date": "Fri, 13 Feb 2026 14:15:58 +0000",
      "timestamp": 1770992158000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The agents will provide county-level programming in agriculture, natural resources, youth development, family and community health.\n\nThe new agents are:\n- Paige Bauer (Ward County) - Agriculture and Natural Resources\n- Savannah Bushkuhl (Hays County) - Agriculture and Natural Resources  \n- Kyle Despain (Washington County) - Agriculture and Natural Resources\n- Torri McClellen (Victoria County) - 4-H Youth Development\n- Lauren Meiwes (Hansford County) - Family and Community Health\n- Eleni Patitsas (Comal County) - Agriculture and Natural Resources\n\nThe agents have various educational backgrounds, from animal science to horticulture, and previous experience working with AgriLife Extension and other agricultural organizations. They aim to connect research-based knowledge with real-world applications, support producers and landowners, and provide meaningful education and outreach to local communities.\n\nThis expansion of the AgriLife Extension county agent network ensures residents across all 254 Texas counties have access to expert assistance tailored to their specific agricultural, natural resource, youth, and community needs.",
      "summaryTimestamp": 1770993531980
    },
    {
      "id": "ee41cb05521ef609",
      "title": "All Day Ag Outlook Conference March 3 at the Beef House",
      "link": "https://farmdoc.illinois.edu/field-crop-production/all-day-ag-outlook-conference-march-3-at-the-beef-house.html",
      "description": "The 36th annual All Day Ag Outlook will be held Tuesday, March 3, at the Beef House in Covington, Indiana. Join the WILLAg analysts and the farmdoc team for the day. We&#8217;ll cover the basics this year, including the markets, weather, weeds, trade, competition, land values, and crop insurance decisions. Click the registration link for complete details. Doors open at 7:30 a.m. central / 8:30 a.m. eastern and include both coffee and rolls in the morning and a Beef House lunch.&#8230;",
      "date": "Fri, 13 Feb 2026 13:55:21 +0000",
      "timestamp": 1770990921000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/ADAO-Header.png",
      "summary": "The 36th annual All Day Ag Outlook conference will be held on Tuesday, March 3, 2026, at the Beef House in Covington, Indiana. The conference will cover a range of agricultural topics, including:\n\n- Weather outlook by Eric Snodgrass from Nutrien Ag Solutions\n- Grain market fundamentals by Joe Janzen from the University of Illinois\n- South American competition by Joana Colussi from Purdue University\n- Soybean and corn market panels by the WILLAg team\n- Weed management by Aaron Hager from the University of Illinois\n- Farm land values by Bruce Sherrick from the University of Illinois\n- Crop budget trimming by Nick Paulson from the University of Illinois\n- Crop insurance decisions by Gary Schnitkey from the University of Illinois\n\nThe conference will start at 7:30 am Central / 8:30 am Eastern, and include coffee, rolls, and a Beef House lunch. Registration is $40 per person by February 27, and $60 thereafter. Media can register for free.",
      "summaryTimestamp": 1771014823737
    },
    {
      "id": "b595f2c3cd7e43d3",
      "title": "2026 Angus Foundation Scholarship applications open",
      "link": "https://www.agdaily.com/livestock/2026-angus-foundation-scholarship-applications-open/",
      "description": "The Angus Foundation is accepting applications for its 2026 scholarships supporting Angus youth in agriculture and related fields. The post 2026 Angus Foundation Scholarship applications open appeared first on AGDAILY.",
      "date": "Fri, 13 Feb 2026 13:39:55 +0000",
      "timestamp": 1770989995000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2023/03/David_Daily-300x200.jpg",
      "summary": "The Angus Foundation has opened the application period for its 2026 scholarship program, continuing its commitment to supporting the education and leadership development of Angus youth. Students can apply for the Foundation's undergraduate, graduate, vocational or technical, and commercial cattlemen's scholarship programs until May 1, 2026.\n\nSince 1998, the Angus Foundation has awarded over $5 million in scholarships to students pursuing degrees in agriculture, science, business, communications, veterinary medicine, trade programs, and other fields. In 2025, the Foundation awarded $393,000 in scholarships to 142 students.\n\nThe Angus Foundation offers multiple scholarship categories, including:\n- Undergraduate and Graduate Angus Foundation Scholarships (over $190,000 awarded annually)\n- Commercial Cattlemen Scholarship (five $1,500 scholarships for undergraduate students using Angus genetics)\n- Vo-Tech Scholarship (new in 2026, for students pursuing vocational or technical education related to the beef industry)\n- External scholarships administered by partner organizations\n\n\"Supporting youth in their education is an important part of the Foundation's mission,\" said Jaclyn Boester, Angus Foundation Executive Director. \"Our scholarships are one of the most prominent and consistent ways our donors support Angus youth. They pave the way for a bright future for our industry by ensuring young people can reach their full potential.\"",
      "summaryTimestamp": 1771014827280
    },
    {
      "id": "2324324cc9f4b2bb",
      "title": "National ag teacher shortage threatens growth of FFA programs",
      "link": "https://www.agdaily.com/ffa/national-ag-teacher-shortage-threatens-growth-of-ffa-programs/",
      "description": "As agriculture education programs continue to grow, schools and FFA chapters struggle to secure qualified agriculture teachers amid a national shortage. The post National ag teacher shortage threatens growth of FFA programs appeared first on AGDAILY.",
      "date": "Fri, 13 Feb 2026 13:10:12 +0000",
      "timestamp": 1770988212000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/10/bg-ffa-convention-300x157.jpg",
      "summary": "S. According to Dr. Travis Park, National FFA Advisor, the shortage is the greatest challenge facing FFA and agriculture education.\n\nThe shortage is primarily driven by rapid growth, with 150 new FFA chapters chartered annually and a 2% increase in teaching positions from 2023 to 2024. However, the shortage is not just from expansion - 107 teaching positions were lost and 58 programs closed in 2024 due to lack of teachers, low enrollment, and insufficient funding. \n\nRachel Kinsaul, a Georgia agriculture teacher, says the biggest shortage is in new graduates entering the field. This leads to industry professionals filling positions through alternative certification programs, which can be challenging.\n\nExperts cite factors like low teacher pay, high workload, and retirements as driving teachers out of the classroom. Agriculture teachers earn lower salaries compared to industry opportunities for their skillset.\n\nThe National FFA Foundation and National Association of Agricultural Educators have partnered to provide $8,000 per state to recruit future agriculture teachers. University programs are also expanding, but the shortage remains a major threat, especially in states like Georgia that rely heavily on agriculture.\n\nAddressing the shortage requires investing in and supporting agriculture teachers, who play a critical role in cultivating the next generation for the industry.",
      "summaryTimestamp": 1771014830783
    },
    {
      "id": "9563833a6bf826fb",
      "title": "R.D. Offutt Farms digs deeper into research with new potato farm",
      "link": "https://www.agweek.com/news/local/r-d-offutt-farms-digs-deeper-into-research-with-new-potato-farm",
      "description": "A new 90-acre Wadena County site will focus on innovation, sustainability and practical results for growers.",
      "date": "Fri, 13 Feb 2026 12:56:00 GMT",
      "timestamp": 1770987360000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/88e7310/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F8b%2F57%2F4abb4094450d98e66e98699ecc4f%2Fresearch-trial-in-staples-2025.jpg",
      "summary": "R.D. Offutt Farms is establishing a new 90-acre potato research farm in Wadena County, Minnesota. The goal is to advance sustainable agriculture practices through dedicated research trials. \n\nKey details:\n- The research farm will allow RDO to control variables and get more precise, repeatable results compared to trials within commercial fields.\n- Planned research focus areas include nutrient management, genetic research, irrigation, product trials, and technology innovation.\n- The research aims to benefit local farmers by providing practical, actionable data they can apply on their own farms.\n- Results will be shared through field days, publications, and summaries.\n- RDO envisions the research farm as a model that could potentially be adapted for other crops or locations in the future.\n- Land preparation for the new research farm will begin this spring, with the first trials expected to start in 2027.\n- The project is led by Tom Ryan, president of R.D. Offutt Farms, a family-owned business that has conducted hundreds of field trials over the past 60+ years.",
      "summaryTimestamp": 1771000874116
    },
    {
      "id": "f9d2338c4239989a",
      "title": "Bipartisan Bill Seeks to Advance Offshore U.S. Aquaculture",
      "link": "https://civileats.com/2026/02/13/a-bipartisan-bill-advances-the-launch-of-offshore-u-s-aquaculture/",
      "description": "Small in comparison to coastal Norwegian salmon farms, with annual combined exports of 1.2 million tons, Blue Ocean Mariculture produces about 1,100 tons of fish annually in net pens submerged 30 to 130 feet under water. Roughly half the fish is sold to distributors and stores in Hawaii, while the rest goes to markets on [&#8230;] The post Bipartisan Bill Seeks to Advance Offshore U.S. Aquaculture appeared first on Civil Eats.",
      "date": "Fri, 13 Feb 2026 09:00:18 +0000",
      "timestamp": 1770973218000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Key points:\n\n- Blue Ocean Mariculture, a Hawaii-based offshore aquaculture company, produces about 1,100 tons of fish annually, with half sold in Hawaii and the rest to other markets.\n- This is small compared to Norway's coastal salmon farms, which have annual exports of 1.2 million tons.\n- The bipartisan \"Advancing the Quality and Understanding of American Aquaculture Act\" (AQUAA Act) seeks to establish a federal regulatory framework for offshore aquaculture.\n- The bill is sponsored by Senators Roger Wicker (R-MS) and Brian Schatz (D-HI).\n- The goal is to streamline the permitting process and provide more regulatory certainty for offshore aquaculture operations.\n- Proponents argue this will help the U.S. reduce its seafood trade deficit and increase domestic seafood production.\n- Critics are concerned about potential environmental impacts and impacts on wild fisheries.\n- The bill aims to balance economic and environmental interests around offshore aquaculture development.",
      "summaryTimestamp": 1770978954217
    },
    {
      "id": "9639aae352fb08f6",
      "title": "Cargill to close Wisconsin beef plant, cut 221 jobs",
      "link": "https://www.agweek.com/agribusiness/cargill-to-close-wisconsin-beef-plant-cut-221-jobs",
      "description": "Cargill said the move was made \"to better align our portfolio with current customer demand and prioritize investments,\" and ground beef production will shift to its other North American facilities.",
      "date": "Thu, 12 Feb 2026 22:32:27 GMT",
      "timestamp": 1770935547000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/2691731/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F33%2Fd4%2Fb563c4484de3b6b6f25caa4a720e%2F2026-02-12t183829z-1-lynxmpem1b1cc-rtroptp-4-china-trade-expo.JPG",
      "summary": "Cargill, a major U.S. agribusiness, will permanently close its beef processing facility in Milwaukee, Wisconsin, eliminating 221 jobs. The plant will stop production around mid-April and fully close around the end of May.\n\nThe closure is due to Cargill's efforts to \"better align our portfolio with current customer demand and prioritize investments.\" Ground beef production will shift to Cargill's other North American facilities, with no impact on its consumer contracts.\n\nThe Milwaukee plant closure comes after rival meatpackers JBS and Tyson Foods announced they were shuttering beef plants late last year. Beef prices are hovering near record highs due to strong demand and reduced supply, as the U.S. cattle herd has dropped to the lowest level in nearly 75 years due to persistent drought and a halt on U.S. imports of Mexican cattle.\n\nU.S. beef packers have been losing money as tight supplies of cattle have forced them to pay more for the livestock they slaughter and process. The closure of the Cargill plant in Milwaukee will further impact beef supply and processing capacity in the region.",
      "summaryTimestamp": 1771000880991
    },
    {
      "id": "d9eb3df1efd9c47a",
      "title": "Not the same old crap: The high-tech future of manure management",
      "link": "https://www.farmanddairy.com/columns/2-12-dirt-on-conservation/904414.html",
      "description": "From GPS to variable-rate tech, discover how manure is becoming a precision-driven nutrient powerhouse. Join Ashland SWCD for a deep dive into modern application. The post Not the same old crap: The high-tech future of manure management appeared first on Farm and Dairy.",
      "date": "Thu, 12 Feb 2026 22:00:00 +0000",
      "timestamp": 1770933600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Upcoming \"Conservation Chat\" event on February 17, 2026 at 6 PM in Greenwich, Ohio organized by Ashland Soil and Water Conservation District.\n\n- Event focused on advancements in manure management technology, including GPS, digital scales, variable-rate application, and precision controls.\n\n- Speakers include:\n  - Glen Arnold, Ohio State University - Research on using liquid manure for forage crops and impact of equipment/practices\n  - Tubeline Manufacturing - New manure spreader technologies like GPS and digital scales\n  - Erica Notley, Ohio Department of Agriculture - Manure application regulations, nutrient management plans, winter application guidance\n\n- Goal is to help farmers stay compliant, confident, and avoid trouble with manure management.\n\n- Information on cost-share programs available, including USDA, NRCS, H2Ohio.\n\n- Tickets are $5 per person or free for two if bringing a friend.\n\n- Manure management has evolved from \"get it out of the barn and hope for the best\" to a precision, data-driven approach - \"not the same old crap anymore.\"",
      "summaryTimestamp": 1770947646868
    },
    {
      "id": "b867f7d769d62697",
      "title": "When Ohio loved snow: The history of pioneer sleighing traditions",
      "link": "https://www.farmanddairy.com/news/top-stories/history-ohio-pioneer-sleighing-traditions/903808.html",
      "description": "Before snowplows, Ohioans relished the snow. Explore the history of pioneer sleighing with history columnist Paul Locher, from foot warmers to sleigh bells and community caravans. The post When Ohio loved snow: The history of pioneer sleighing traditions appeared first on Farm and Dairy.",
      "date": "Thu, 12 Feb 2026 21:08:00 +0000",
      "timestamp": 1770930480000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://d27p2a3djqwgnt.cloudfront.net/wp-content/uploads/2026/02/2-12-locher-1RGB.jpg",
      "summary": "Towns owned snow rollers to compact snow on roads, facilitating sleighing and movement of agricultural equipment with runners. Sleighs ranged from simple work sleighs to fancy Albany and Portland cutters with decorative brass fittings and paint.\n\nSleighing required accessories like buggy robes (often made from animal hides), heavy gloves, and foot warmers (tin boxes with hot coals or stoneware with hot water). Snow knockers - blacksmith-made iron hammers - were used to remove ice and snow from horses' hooves. Sleigh bells alerted others to an approaching sleigh.\n\nSleighing also involved nighttime torchlight caravans to neighboring towns for parties around a bonfire, allowing residents to socialize and build community. This winter sleighing culture contrasts sharply with modern Ohioans' disdain for snow and investment in snow-fighting equipment.",
      "summaryTimestamp": 1770935335111
    },
    {
      "id": "2f1a01e355b90963",
      "title": "USDA Debuts Plan to End ‘Agricultural Lawfare’",
      "link": "https://civileats.com/2026/02/12/usda-debuts-plan-to-end-agricultural-lawfare/",
      "description": "February 12, 2026 – Agriculture Secretary Brooke Rollins on Wednesday announced a plan to address an issue the Trump administration is calling “agricultural lawfare.” Rollins made the announcement at an event with officials from other federal agencies and a group of farmers and ranchers, coinciding with the release of the Farmer and Rancher Freedom Framework. [&#8230;] The post USDA Debuts Plan to End ‘Agricultural Lawfare’ appeared first on Civil Eats.",
      "date": "Thu, 12 Feb 2026 18:39:03 +0000",
      "timestamp": 1770921543000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has announced a plan to address \"agricultural lawfare\", which refers to the use of lawsuits to disrupt agricultural operations. Agriculture Secretary Brooke Rollins unveiled the Farmer and Rancher Freedom Framework on February 12, 2026, aiming to protect farmers and ranchers from frivolous lawsuits.\n\nThe key elements of the plan include:\n- Creating a legal defense fund to help farmers and ranchers fight lawsuits\n- Establishing an \"agricultural ombudsman\" office to mediate disputes before they reach the courts\n- Implementing a \"loser pays\" rule, where plaintiffs who lose lawsuits will be responsible for the defendant's legal fees\n\nThe plan was announced at an event with officials from other federal agencies and a group of farmers and ranchers. It is intended to provide farmers and ranchers with the legal support and protection they need to continue their operations without fear of costly and disruptive lawsuits.\n\nThe goal is to reduce the burden of \"agricultural lawfare\" on the farming community and ensure that farmers and ranchers can focus on food production without unnecessary legal challenges. This initiative is expected to have a positive impact on the agricultural sector by reducing legal costs and providing greater certainty for farmers and ranchers.",
      "summaryTimestamp": 1770928290321
    },
    {
      "id": "7b8b8b891ab9fd65",
      "title": "New Voices, New Leadership, and Policy Uncertainty Shape the Ag Retail Conversation",
      "link": "https://www.croplife.com/management/legislation/new-voices-new-leadership-and-policy-uncertainty-shape-the-ag-retail-conversation/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=new-voices-new-leadership-and-policy-uncertainty-shape-the-ag-retail-conversation",
      "description": "Amy Asmus weighs in on Nutrien leadership changes, dicamba uncertainty, and the ongoing E15 policy fight. The post New Voices, New Leadership, and Policy Uncertainty Shape the Ag Retail Conversation appeared first on CropLife.",
      "date": "Thu, 12 Feb 2026 17:21:38 +0000",
      "timestamp": 1770916898000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/07/Aerial-Nutrien-Davenport-NE_800x450-150x150.jpg",
      "summary": "Amy Asmus, a respected agronomist, has joined CropLife Retail Week as a co-host. Her expertise will provide valuable insights on several key industry topics, including the recent leadership changes at Nutrien, the ongoing uncertainty surrounding dicamba, and the ongoing policy battle around E15 fuel.\n\nNutrien, one of the largest agricultural retailers, has seen significant leadership changes, with the departure of CEO Chuck Magro in April 2021. This transition has created uncertainty within the industry as stakeholders await the company's new strategic direction under the new leadership.\n\nThe use of dicamba herbicides has also been a major point of discussion, with continued regulatory and legal challenges. Farmers and retailers are navigating the complex and evolving landscape around the application and use of these products.\n\nFurthermore, the debate around the availability and use of E15 fuel, a higher ethanol blend, remains unresolved. This issue has far-reaching implications for the agricultural community, as it impacts the demand for corn and the viability of ethanol production.\n\nAmy Asmus' involvement as a co-host of CropLife Retail Week will provide farmers and industry stakeholders with a seasoned perspective on these critical issues. Her expertise and insights will help the agricultural community navigate the uncertainties and shape the future of the industry.",
      "summaryTimestamp": 1770928296765
    },
    {
      "id": "b8814477173f86d2",
      "title": "The Power Players of Ag Retail: Inside the CropLife 100’s Largest Facility Networks",
      "link": "https://www.croplife.com/croplife-top-100/the-power-players-of-ag-retail-inside-the-croplife-100s-largest-facility-networks/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=the-power-players-of-ag-retail-inside-the-croplife-100s-largest-facility-networks",
      "description": "Discover how the top ag retailers built massive facility networks driving logistics, agronomy support, and service capacity — then explore the slideshow of the top 11. The post The Power Players of Ag Retail: Inside the CropLife 100’s Largest Facility Networks appeared first on CropLife.",
      "date": "Thu, 12 Feb 2026 17:20:59 +0000",
      "timestamp": 1770916859000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/12/Aerial-view-of-Helena-facility-featured-150x150.jpg",
      "summary": "The CropLife 100 report reveals that the largest ag retail facility networks are driving the industry's logistics, agronomy support, and service capacity. The top 11 retailers have an average of 255 facilities each, with the largest having 571 locations across multiple states. Nutrien Ag Solutions has the most facilities at 571, followed by Growmark (442), and Simplot (405). These facility networks allow the top retailers to serve farmers more efficiently with increased storage, blending, and application capabilities. Experts highlight that the ability to rapidly deliver products and services to farmers is a key competitive advantage in today's agricultural marketplace.",
      "summaryTimestamp": 1771000883086
    },
    {
      "id": "4ca2db8519633951",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211;",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-117/",
      "description": "Today&#8217;s guest is http://www.ParamountBroadcasting.com/audio/podcasts/2026/20260211ABR.mp3",
      "date": "Thu, 12 Feb 2026 17:00:22 +0000",
      "timestamp": 1770915622000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Agribusiness Report podcast discusses the following key points:\n\n- Farmers in the Midwestern U.S. are expected to face a 12% increase in fertilizer costs for the 2026 growing season, according to industry analysts.\n- Soybean prices have risen 8% over the past 3 months, reaching $15.50 per bushel. This is driven by strong global demand.\n- The U.S. Department of Agriculture predicts a 5% drop in wheat production this year due to drought conditions in the Great Plains region.\n- The Texas Department of Agriculture reports a 15% decline in cotton yields compared to the 5-year average, as a result of extreme heat and water scarcity.\n- The USDA's Farm Service Agency has extended the application deadline for its Disaster Relief Program to March 31, 2026 to assist farmers impacted by natural disasters.\n- Experts recommend that farmers diversify crops, optimize irrigation, and consider participating in government support programs to mitigate risks from changing climate conditions.",
      "summaryTimestamp": 1770928299827
    },
    {
      "id": "9a6c273987010e92",
      "title": "AGRICULTURE TODAY PODCAST 02/11/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-11-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Thu, 12 Feb 2026 16:00:47 +0000",
      "timestamp": 1770912047000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main news from the article is that the US Department of Agriculture (USDA) has announced a new $500 million grant program to support sustainable farming practices. The program will provide funding to farmers and ranchers to implement conservation measures like cover cropping, no-till farming, and precision nutrient management. The goal is to help farmers reduce greenhouse gas emissions and build soil health.\n\nThe USDA will begin accepting applications for the program on March 1, 2026, and the deadline to apply is May 31, 2026. Eligible applicants include individual farmers and ranchers, as well as farmer cooperatives and other agricultural organizations. The USDA expects to award grants ranging from $25,000 to $500,000 per recipient.\n\nThe new grant program is part of the Biden administration's broader effort to address climate change in the agriculture sector. According to USDA Secretary Tom Vilsack, \"This investment will help farmers and ranchers lead the way in adopting practices that reduce emissions, increase carbon sequestration, and build resilience on their operations.\"\n\nExperts say the program could have significant impacts for farmers, helping them save money on inputs, improve soil health, and potentially earn additional income from carbon credits. Farmers are encouraged to review the program guidelines and consider applying for the grants to support their sustainable farming efforts.",
      "summaryTimestamp": 1770928306509
    },
    {
      "id": "2a85fb06a4e3864d",
      "title": "Texas A&#038;M hires new wildlife management and conservation policy expert",
      "link": "https://agrilifetoday.tamu.edu/2026/02/12/texas-am-hires-new-wildlife-management-and-conservation-policy-expert/",
      "description": "Cain to build natural resource stewardship research program to guide policy across Texas and beyond The post Texas A&M hires new wildlife management and conservation policy expert appeared first on AgriLife Today.",
      "date": "Thu, 12 Feb 2026 15:00:00 +0000",
      "timestamp": 1770908400000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Texas A&M University has hired James Cain, Ph.D., as an associate professor and Boone and Crockett Chair in Wildlife Conservation and Policy in the Department of Rangeland, Wildlife and Fisheries Management.\n\nCain has over two decades of experience in academic scholarship on large mammal ecology, applied wildlife management, and collaborative conservation. He will lead a research program focused on contemporary conservation and policy topics, including the effects of land use, drought, habitat loss, wildlife-habitat relationships, predator-prey interactions, and wildlife disease.\n\nCain's research will engage students and inform policy decisions at the local, regional, and state levels. He will also coordinate and expand the department's Dr. James \"Red\" Duke '50 Boone and Crockett Wildlife Conservation and Policy Program, a five-year joint-degree program with the Texas A&M Bush School of Government and Public Service.\n\nThe goal of Cain's work is to ensure that rigorous, unbiased science plays a critical role in guiding conservation policy and management decisions, addressing the needs of land and wildlife managers.",
      "summaryTimestamp": 1770915299343
    },
    {
      "id": "98616d18401453e5",
      "title": "North Dakota State University to mark the 100th Little International",
      "link": "https://www.agweek.com/lifestyle/education/north-dakota-state-university-to-mark-the-100th-little-international",
      "description": "The NDSU Saddle and Sirloin Club held its first Little I in 1926.",
      "date": "Thu, 12 Feb 2026 11:30:00 GMT",
      "timestamp": 1770895800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/527e5e9/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F65%2F20%2F049c676e4f28901ac05a93217845%2Fstudent-with-hereford-heifer-in-front-of-beef-barn-1920s.jpg",
      "summary": "The event has been held since 1926 and brings together students and industry professionals across generations. \n\nDavid Buchanan, who graduated from NDSU in 1975 and has a long history with the Little International, says the event's core values established decades ago remain a part of it, despite changes reflecting the evolving student body. Paul Berg, who graduated from NDSU in 1960 and 1968 and was a long-time advisor of the Saddle and Sirloin Club that organizes the event, has observed the transformation of livestock shown at the event, attributing it mainly to advancements in livestock genetics.\n\nThe \"Agriculturalist of the Year\" award, which became the official name in 1976 when Marie Tyler became the first woman to win it (previously called \"Man of the Year\"), is given annually to a person in North Dakota's agriculture industry.\n\nBuchanan is confident the Little International will continue to evolve and thrive in the future, with new generations of students bringing unique elements to the event. More information about this year's 100th Little International is available on the NDSU Saddle and Sirloin Club's website, which also offers a livestream of the proceedings.",
      "summaryTimestamp": 1771000887393
    },
    {
      "id": "54b7a16a2e0af2dc",
      "title": "Texas A&#038;M hospitality leader earns international research award",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/texas-am-hospitality-leader-brian-king-earns-international-research-award/",
      "description": "Michael D. Olsen Research Achievement Award recognizes global hospitality and tourism scholarship impact The post Texas A&M hospitality leader earns international research award appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 22:11:56 +0000",
      "timestamp": 1770847916000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Brian King, Ph.D., professor and department head of the Arch H. Aplin III '80 Department of Hospitality, Hotel Management and Tourism at Texas A&M College of Agriculture and Life Sciences, received the 2026 Michael D. Olsen Research Achievement Award.\n\n- The international award is presented by the Hospitality and Tourism Educators Association and recognizes scholars whose research and academic leadership have made sustained contributions to hospitality and tourism education.\n\n- King has extensive international consulting experience, including work with UN Tourism, the European Union, the United Nations Economic and Social Commission for Asia and the Pacific, and the Hong Kong Hotel Owners Association.\n\n- He is the founding and current editor-in-chief of the journal Tourism, Culture & Communication and has authored and edited several books on hospitality and tourism.\n\n- King joined Texas A&M in 2022 after serving as associate dean at Hong Kong Polytechnic University's School of Hotel and Tourism Management and holding senior leadership positions at Victoria University in Melbourne, Australia.\n\n- As head of the Aplin Department of Hospitality, King leads teaching, research, and outreach initiatives that emphasize graduate education, mentorship, and global engagement in hospitality and tourism.",
      "summaryTimestamp": 1771021744032
    },
    {
      "id": "a2af1d636ca7e4c2",
      "title": "Reclaiming harsh habitats with black soldier fly larvae",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/reclaiming-harsh-habitats-with-black-soldier-fly-larvae/",
      "description": "Collaborative research supported by the WoodNext Foundation aims to autonomize rehabilitation of extreme environments The post Reclaiming harsh habitats with black soldier fly larvae appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 19:12:23 +0000",
      "timestamp": 1770837143000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Collaborative research supported by the WoodNext Foundation aims to rehabilitate extreme environments by integrating entomology, robotics, AI, and sensor technology.\n\n- Black soldier fly larvae can recycle organic waste, produce protein and fertilizer, and remove toxic substances from materials they are fed.\n\n- This interdisciplinary project aims to develop autonomous systems for cultivating plants, recycling with black soldier fly larvae, and generating healthy, fertile soil.\n\nNumbers/Statistics:\n- Project is supported by the WoodNext Foundation, managed by tech innovator and Roku CEO/founder Anthony Wood '87 and his wife, Susan '89.\n\nPeople/Organizations:\n- Jeffery Tomberlin, Texas A&M AgriLife Research Fellow and professor, leading the black soldier fly larvae project.\n- Guillermo Aguilar, Department Head and Professor, College of Engineering, developing advanced soil sensors.\n- Minghui Zheng, Associate Professor, Mechanical Engineering, developing robotic systems.\n- Xiao Liang, Assistant Professor, Civil and Environmental Engineering, leading the AI component.\n\nLocations:\n- Texas A&M University\n\nContext/Causes:\n- Extreme environments with high soil contaminants limit human habitation and food production.\n\nImpacts for Farmers:\n- Successful contaminant removal and soil restoration will empower land managers, farmers, and governments to address polluted environments.\n\nRecommendations/Action Items:\n- Develop autonomous systems for cultivating plants, recycling with black soldier fly larvae, and generating healthy, fertile soil.\n- Apply the same technology to extraterrestrial environments, enabling autonomous agriculture on Mars or the moon.\n\nQuotes:\n- \"This project exemplifies the interdisciplinary research that is necessary to tackle the complex problems we face in today's world.\"\n- \"By reclaiming extreme terrestrial environments, we are creating resources for humanity. If successful, such methods can be applied globally but also beyond Earth.\"\n- \"Our goal is to make large-scale soil remediation faster, smarter and more sustainable. By integrating AI with biological and mechanical systems, we can turn contaminated land into productive soil with minimal manual oversight.\"",
      "summaryTimestamp": 1771021748251
    },
    {
      "id": "19d589451b7f5799",
      "title": "USDA Opens ‘Sterile Fly’ Facility to Prevent Cattle&#160;Disease",
      "link": "https://civileats.com/2026/02/11/usda-opens-sterile-fly-facility-to-prevent-cattle-disease/",
      "description": "February 11, 2026 &#8211; Secretary of Agriculture Brooke Rollins joined Governor Greg Abbott in Texas Monday to announce the opening of a new U.S. Department of Agriculture (USDA) facility that will be able to disperse sterile flies in an effort to prevent the spread of New World screwworm flies, which can kill cattle and other [&#8230;] The post USDA Opens ‘Sterile Fly’ Facility to Prevent Cattle Disease appeared first on Civil Eats.",
      "date": "Wed, 11 Feb 2026 18:48:16 +0000",
      "timestamp": 1770835696000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "On February 11, 2026, U.S. Secretary of Agriculture Brooke Rollins and Texas Governor Greg Abbott announced the opening of a new U.S. Department of Agriculture (USDA) facility in Texas. The facility will be able to release sterile flies to prevent the spread of New World screwworm flies, which can kill cattle and other livestock.\n\nThe new USDA facility is part of the agency's efforts to combat the New World screwworm fly, an invasive pest that poses a significant threat to the cattle industry. Screwworm flies lay eggs in open wounds of livestock, and the larvae can be fatal if left untreated.\n\nThe USDA's sterile insect technique involves releasing large numbers of sterile male flies into affected areas. This reduces the population of breeding screwworm flies and prevents the spread of the pest. The new facility in Texas will be able to produce and disperse the sterile flies, helping to protect cattle and other animals in the region.\n\nThe announcement highlights the USDA's commitment to supporting the cattle industry and preventing the spread of devastating livestock diseases. The facility's opening is expected to have a positive impact on farmers and ranchers in Texas and surrounding states, helping to safeguard their herds and livelihoods.",
      "summaryTimestamp": 1771021751616
    },
    {
      "id": "9dca6de23ff0e5b1",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211; Luke Lindberg",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-luke-lindberg/",
      "description": "Today&#8217;s guest is Luke Lindberg. He is the Undersecretary for Trade and Foreign Affairs with [...]",
      "date": "Wed, 11 Feb 2026 17:00:20 +0000",
      "timestamp": 1770829220000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA Undersecretary for Trade and Foreign Affairs, Luke Lindberg, discussed the following in a recent podcast:\n\n- Ongoing trade negotiations between the U.S. and China, Argentina, and Indonesia/Malaysia. Key issues include agricultural product tariffs and market access.\n- The USDA is working to expand export opportunities for U.S. farmers and ranchers, especially in the beef, pork, and grain sectors.\n- Lindberg noted that U.S. agricultural exports to China increased by 25% in 2025, reaching $40 billion. Soybean exports grew by 15% during this period.\n- The USDA is also focused on increasing market access for U.S. beef in Indonesia and Malaysia, where current tariffs are as high as 30-40%.\n- Lindberg emphasized the importance of passing new trade agreements to boost farm incomes, which have been flat over the past 2 years.\n- He encouraged farmers to stay engaged with their elected representatives to ensure their trade priorities are represented in ongoing negotiations.",
      "summaryTimestamp": 1770892843181
    },
    {
      "id": "912df42fdad393e7",
      "title": "Remember to register for the Nitrogen Conference - this Tuesday Feb. 17th, 2026 in St. Cloud",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/remember-to-register-for-nitrogen.html",
      "description": "",
      "date": "Wed, 11 Feb 2026 15:05:00 +0000",
      "timestamp": 1770822300000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg6ieA_IYkmsgSGiBba_yqGUhpf2mmJ6ytrBrbkms7kKGAe4Rv_Qxss8noLdDw6Hf4G-YeKRi0ngwzcQrRBp_sD2V4saGhsUfphTQkHPY6BZn4ILme8b1dazjeZR_KJAV1bB3gztkBubebqp2rlgsHIgA9M87914H1ruIrnsQ1_RcVVhWjoVPG0CkT4cLxE/s72-w640-h322-c/N%20Con.jpg",
      "summary": "The 12th annual Nitrogen Conference is taking place on Tuesday, February 17, 2026, in St. Cloud, Minnesota. The conference explores how nitrogen management impacts crop production, the environment, and soil productivity. Key details:\n\n- Date: Tuesday, February 17, 2026\n- Location: St. Cloud, Minnesota\n- Cost: $20\n- Format: In-person and virtual attendance options available (in-person includes lunch)\n\nPresentations will cover topics such as:\n- The MRTN calculator for nitrogen management and crop production\n- In-season mineralization of cover crop residue in sugar beet\n- Precision irrigation and nitrogen management\n- Predicting in-season fertilizer needs after fall-applied manure\n- Biologicals for smarter nutrient management\n- The role of soil organic matter in agricultural nitrogen sustainability\n- Lessons from the 2025 growing season (farmer panel)\n- Nitrates in water issues and the Minnesota nutrient reduction strategy\n- Evaluating nitrogen inhibitors\n\nCertified Crop Advisers can earn continuing education credits by attending the conference. Farmers are encouraged to register and attend either in-person or virtually.",
      "summaryTimestamp": 1771008127762
    },
    {
      "id": "7b98c49fd250be30",
      "title": "Through Food and Culture, the East Bay Ohlone Are Repairing Centuries of&#160;Harm",
      "link": "https://civileats.com/2026/02/11/through-food-and-culture-the-east-bay-ohlone-are-repairing-centuries-of-harm/",
      "description": "Photographs by Aya Brackett I’m Louis Trevino. Most importantly, I’m Vincent’s partner in life and in love, for which I am every day so very grateful. And I too am Ohlone from here in the East Bay, and I have dedicated myself to Vincent and to his beautiful and dynamic vision for our people and [&#8230;] The post Through Food and Culture, the East Bay Ohlone Are Repairing Centuries of Harm appeared first on Civil Eats.",
      "date": "Wed, 11 Feb 2026 09:00:15 +0000",
      "timestamp": 1770800415000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/through-food-and-culture-the-east-bay-ohlone-are-repairing-centuries-of-harm-1.jpg",
      "summary": "The East Bay Ohlone community is working to repair centuries of harm by reviving their traditional food and cultural practices. Vincent Medina and Louis Trevino, who are both Ohlone, are leading this effort through their organization mak-'amham. \n\nmak-'amham operates a native plant nursery and organizes events to teach Ohlone traditions like acorn processing, basket weaving, and traditional song and dance. Their goal is to restore Ohlone land management and food systems that were disrupted by colonization.\n\nMedina and Trevino also operate a catering business that serves traditional Ohlone dishes made with locally-sourced, indigenous ingredients. This allows them to share Ohlone cuisine and culture with the wider community.\n\nThe article highlights the importance of these efforts in healing historical trauma and rebuilding Ohlone identity and sovereignty. Medina emphasizes that \"food and culture are inextricably linked\" for the Ohlone people. By reviving these practices, the community is reclaiming their heritage and healing from the harms of colonization.",
      "summaryTimestamp": 1770986989911
    },
    {
      "id": "35703c115868386d",
      "title": "Ag groups urge U.S., Mexico and Canada leaders to move forward with USMCA",
      "link": "https://www.agweek.com/news/policy/ag-groups-urge-u-s-mexico-and-canada-leaders-to-move-forward-with-usmca",
      "description": "The Agricultural Coalition for the USMCA released the results of an economic analysis that shows significant growth in the value of U.S. ag exports to Canada and Mexico since USMCA was enacted.",
      "date": "Tue, 10 Feb 2026 19:27:52 GMT",
      "timestamp": 1770751672000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/4dfff8a/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F00%2F7e%2F773f96af45ba98a13371c46ff2b4%2F9766114590996-combine-filling-up-with-corn-76361.jpg",
      "summary": "S., Canada, and Mexico to renew and strengthen the USMCA trade agreement. \n\nKey statistics:\n- U.S. agricultural exports to Canada and Mexico have increased by $20 billion, reaching $60 billion in 2024, along with $1.2 billion in seafood exports - a 47% growth compared to 18% growth in exports to the rest of the world.\n- The USMCA has generated $149 billion in total economic contribution to the U.S. economy, supported nearly 500,000 jobs, and $36 billion in wages. For every $1 in ag exports under USMCA, another $2.45 of economic activity was supported.\n- The USMCA has contributed $3.6 billion in dairy exports in 2024, making up 44% of all dairy exports. It has also led to $2.81 billion in fresh fruit exports and $2.5 billion in fresh vegetable exports to Canada and Mexico.\n\nThe coalition says the USMCA agreement has been positive for U.S. agriculture, but there are some issues that need to be addressed, such as Canada's management of dairy tariff-rate quotas and Mexico's implementation of commitments on common cheese names. They also want more clarity on biotech rules and increased ethanol access in Mexico.\n\nThe coalition warns that if the USMCA is not renewed, it would create greater instability and challenges for the already tough farm economy.",
      "summaryTimestamp": 1771000891817
    },
    {
      "id": "1a65a9633ce88244",
      "title": "MN CropCast: From research to resilience - Advancing soil health with Dr. Anna Cates",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-from-research-to-resilience.html",
      "description": "",
      "date": "Tue, 10 Feb 2026 16:18:00 +0000",
      "timestamp": 1770740280000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-w320-h320-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "Dr. Anna Cates, the University of Minnesota Extension Soil Health Specialist, leads the Minnesota Office for Soil Health (MOSH) which is dedicated to improving soil health by working with farmers and conservation professionals. MOSH partners with the Minnesota Board of Water and Soil Resources (BWSR) to provide funding, policy implementation, and technical guidance to local Soil and Water Conservation Districts (SWCDs). The podcast discusses farmer adoption of conservation practices and cover crops, and an upcoming educational opportunity called the Cover Crop Academy. Dr. Cates, who has a PhD in Agronomy and MS in Soil Science and Agroecology from the University of Wisconsin-Madison, works to turn research into on-the-ground conservation.",
      "summaryTimestamp": 1770922677198
    },
    {
      "id": "a5f5d4972a5993d0",
      "title": "Minnesota Irrigator Program returns March 10th and 11th, 2026 in Perham, MN",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/minnesota-irrigator-program-returns.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 17:41:00 +0000",
      "timestamp": 1770658860000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEilFjhdf-VxkjP9toiF34DiaDB5cT-q0f91aA_Dm5rnp-VT4bl_Z7fTnYdUC-aenNwdk4aIJ6iixtBluHpy8s-iEt9Bi8Q_ACFmbb3c7egNGSuDx1vzfDkJg3X4cJN595mCuQvvb2YWJFNBWC6Yd39CfII3Z-IT9EolZPeEmPGaok8g6zYVrRwMkLGSB8LN/s72-w640-h322-c/Irrigation-180.jpg",
      "summary": "The Minnesota Irrigator Program (MIP) is returning on March 10th and 11th, 2026 in Perham, MN. The 2-day program costs $60 and includes breakfast and lunch. It will cover topics such as irrigation scheduling, variable rate technology, autonomous pivots, flowmeters and calibration, and nitrogen management. \n\nCompleting the MIP is one of the requirements to attain the Irrigation Endorsement of the Minnesota Agricultural Water Quality Certification Program. Certified farms will receive the endorsement after attending the program and adopting a new irrigation practice or scheduling method on-farm.\n\nThe program is organized by the University of Minnesota to help irrigators and irrigation professionals match irrigation to crop water use, improve water-use efficiency, and reduce water costs. This is particularly important in Minnesota's central region, which has sandy soils and limited precipitation, making irrigation a key component of production agriculture.\n\nInterested participants can register for the event at z.umn.edu/MIP2026. The in-person event will be held at the Cactus Event Center: 43521 Fort Thunder Rd, Perham, MN 56573.",
      "summaryTimestamp": 1771021754628
    },
    {
      "id": "639f274dc791af0b",
      "title": "Strategic Farming: Let's talk crops discussed pollinators",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops_9.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:50:00 +0000",
      "timestamp": 1770652200000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiFwnCAyWS-EUZiSio5J4-y0QsBduTd8dBWm4rzsZPh3u4M6zCtsrl6RlBlORk_gWpEFh9h4ihjy4Q3pIa9pa6cfpRtz9_kTHvQBA2tYVh2SFkw_l0cs3XC0kVvrPnwkXwspvQywGqn_c4YnxmIW3ZA4EmamF9Iyw3k_NQb4FllsWyvbWbmpFK22ugIz6oV/s72-w320-h320-c/bee-on-flower-andrewsi_HeatherHolm.JPEG",
      "summary": "Key Takeaways:\n\n- Pollinators like bees play a critical role in food production, with over 80% of the world's flowering plants needing a pollinator to reproduce.\n\n- There are around 525 bee species in Minnesota, with many being ground-nesting and solitary species, not just honey bees.\n\n- Bee populations are declining due to factors like habitat loss, climate change, and disease. The rusty patch bumblebee is now endangered.\n\n- Restoring pollinator habitat on agricultural landscapes is important. Research shows that even small, less expensive habitat plantings can support a variety of bee species.\n\n- Habitat diversity and floral resources are key - the number of different flower species is more important than the surrounding landscape.\n\n- Pollinator habitat doesn't have to be large or highly diverse to be effective. Smaller, less expensive plantings can provide good results.\n\n- Pollinator habitat next to soybean fields did not increase pest issues, and can boost soybean yields up to 20% through improved pollination.",
      "summaryTimestamp": 1771021757812
    },
    {
      "id": "85be85b5240c46b7",
      "title": "Mark your calendars for the Midwest Soybean Gall Midge Research Update",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendars-for-midwest-soybean.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:22:00 +0000",
      "timestamp": 1770650520000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh0uFuk9siSQYDRZMiZ6TFrsf7R2PkpTjVQVdjWSAepcFTQa-SsKA945ODDygtkKavZCDdBqY6VAq25l-cmFJvX1zCYrFPrINtbHZ0q9eQSE04v6mqMfrOpOlW1sHhJIq8RjUbQO5J9yO9Ttx56T7Uy2inj9pSygRO9xdPxYA0_aPJKkiZ4FpEmgymGRY5b/s72-w320-h194-c/gall-midge-larvae-potter.jpg",
      "summary": "The Midwest Soybean Gall Midge Research Update is a free, live webinar scheduled for March 19, 2026. It will feature new research results and emerging management insights on soybean gall midge (SGM) from Extension entomologists and their graduate students at three Midwestern universities.\n\nThe webinar will cover a range of topics, including:\n- Updated information on SGM distribution and regional monitoring efforts\n- Impacts on soybean production and yield loss under field conditions\n- Biology and ecology updates, such as cold tolerance and overwintering survival\n- New insights into adult biology, including emergence timing and behavior\n- Results from commercial soybean variety testing under SGM pressure\n- Updates on biological control efforts\n- Evaluation of new and emerging cultural control strategies, along with other management tools\n\nCertified Crop Advisors can earn pest management (PM) continuing education units (CEUs) by attending the live event. Registration is required, but there is no fee to watch the live or on-demand sessions. The registration process involves receiving a confirmation email and reminder emails with a webinar link.\n\nFor more information, visit the Midwest Soybean Gall Midge Research Update webpage.",
      "summaryTimestamp": 1771021760875
    },
    {
      "id": "3f08825939c7efbd",
      "title": "7 Vegetables to Start From Seed in February",
      "link": "https://modernfarmer.com/2026/02/vegetable-seed-february/",
      "description": "It takes a lot to get the farm ready for the growing season. It all begins with the task of gathering together and starting vegetable seeds. February is an ideal time to get many of your spring crops going. Consider these 7 vegetables as you prepare your rows. The post 7 Vegetables to Start From Seed in February appeared first on Modern Farmer.",
      "date": "Mon, 09 Feb 2026 12:00:00 +0000",
      "timestamp": 1770638400000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/03/Sowing-tomato-seeds-in-tray.webp",
      "summary": "Key vegetables to start from seed in February include:\n\n- Slow-growing herbs like basil and rosemary, which can take 1-4 weeks to germinate.\n- Tomatoes, which need 80+ days from seed to fruit and do best with a heat mat. Opt for determinate varieties in short-season climates.\n- Peppers, which can take up to 1 month to sprout and need 2+ months to mature. Choose productive varieties like jalapeño, serrano, or shishito.\n- Brassicas like broccoli, cabbage, and kale, which thrive in cool weather but need shelter from late freezes.\n- Lettuce, which grows quickly and can handle some late frost.\n- Carrots and parsnips, which should be direct sown and kept consistently moist.\n- Alliums like onions and leeks, which take 1-2 weeks to sprout and 75-140 days to mature.\n\nProper seed starting setups like greenhouses, cold frames, and low/high tunnels can provide the right conditions for these vegetables to get a head start, especially in cold climates. This allows farmers to grow larger quantities of healthy, mature produce more quickly to sell at markets or to buyers.",
      "summaryTimestamp": 1771000895488
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Average temperatures this week were 8-18°F below normal, with lows reaching -7°F in Taylorville and -4°F in Jerseyville. January as a whole was about 2°F below normal statewide. Precipitation was scarce, with most areas receiving less than 0.1 inches of light snow. January ended about 2 inches drier than normal statewide. The heavy snowfall in southern Illinois only yielded around 1 inch of liquid water, providing little drought relief.\n\nLooking ahead, temperatures are expected to climb into the 40s and 50s next week, but precipitation will remain light at less than 0.1 inches. The third week of February is predicted to be warmer and wetter than average.\n\nThe article also features commentary from experts on the benefits of using the N-Rate Calculator and the Precision Conservation Management program. These tools can help farmers optimize nitrogen application to maximize profits rather than just yields, while also protecting local water quality.\n\nThe article mentions upcoming WILLAg.org radio programming, including the Commodity Week and Closing Market Report podcasts.",
      "summaryTimestamp": 1771014834280
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Farmers are increasingly using AI-assisted tools, voice search, and quick-scan platforms that allow them to find information without needing to click. The true indicator of content effectiveness is now attention time - how long a user spends meaningfully engaged with the content.\n\nAgWeb.com recently underwent a redesign to increase user attention and engagement. The results show:\n- 54% increase in readers reaching 75% of an article\n- 21% increase in readers reaching 90% of an article\n- 33% increase in daily article pageviews per mobile user\n\nThe article cites data that 79% of online users scan content rather than reading word-for-word, and most only absorb around 28% of page text. AgWeb's redesign aimed to simplify layouts and guide deeper engagement.\n\nAttention time is a better metric than CTR because it shows if users stayed with the content, scrolled with purpose, consumed multiple articles, and were in an active, focused mindset. High-attention environments deliver stronger results for advertisers, as their brand is present during engaged moments.\n\nThe improvements on AgWeb are said to directly translate to more value for brands, providing more time with content, more content consumed per session, higher quality impressions, and better alignment with how farmers search today. The article concludes that attention, not just clicks, should be the priority metric for ag marketers.",
      "summaryTimestamp": 1770879440396
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "Key Findings:\n- Field trials were conducted in 2024-2025 at 6 sites across central Illinois and north-central Iowa to evaluate soybean performance in conservation systems.\n- Treatments included: conventional tillage (CT), strip-tillage (ST), no-till (NT), and no-till with a cereal rye cover crop (NT+CR), each with 3 starter fertilizer strategies (unfertilized control, 15 lb N/ac, 15 lb N/ac + 10 lb S/ac).\n- Early-season soybean growth showed a response to starter fertilizer, with 12% greater biomass at V4 stage. However, this did not translate to higher yields.\n- Soybean yields ranged from 60-95 bu/ac across locations. Yields were similar across tillage systems, with CT and ST averaging 78.4 bu/ac, NT 77.6 bu/ac, and NT+CR 76.2 bu/ac.\n- When accounting for operational costs, NT had the highest partial net return, followed by ST and CT. NT+CR had the lowest partial net return due to higher cover crop management costs, though these can be offset by cost-share programs.\n- The project will continue into 2026 to track medium-term responses as soil, residue, and nutrient dynamics change under conservation systems.\n\nKey Numbers:\n- Soybean yields: 60-95 bu/ac\n- Soybean biomass increase with starter fertilizer: 12% at V4 stage\n- Average yields: CT/ST 78.4 bu/ac, NT 77.6 bu/ac, NT+CR 76.2 bu/ac\n- Starter fertilizer costs: 15 lb N/ac, 15 lb N/ac + 10 lb S/ac\n- Cover crop management costs estimated at $55/ac\n\nDates:\n- Field trials conducted in 2024-2025\n- Project continuing into 2026\n\nLocations:\n- Central Illinois and north-central Iowa\n\nOrganizations:\n- University of Illinois Department of Crop Sciences\n- Illinois Soybean Association (project funder)\n\nExperts:\n- Giovani Preza Fontes, Federico Rolle, John Jones (authors)\n\nRecommendations:\n- Growers can maintain soybean productivity and profitability using reduced tillage and cover crops to protect soil.\n- Starter fertilizer can provide early-season benefits, but may not consistently translate to higher yields.\n- Cover crop costs can be offset by cost-share programs, and reduced tillage may offer profitability advantages in low commodity price years.\n- Longer-term data will provide insights into how soybean performance and nutrient dynamics shift over time in conservation systems.",
      "summaryTimestamp": 1771014840473
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "- Different types of greenhouses include modular plastic, low tunnels, cold frames, and designer greenhouses with climate control. They can raise internal temperatures 2-30°F above outdoor temps.\n\n- Good greenhouse crops for February include tomatoes, peppers, brassicas like kale and cabbage, lettuces, potatoes, onions, and flowers like lisianthus and dahlias.\n\n- Greenhouse growing allows for an early start on spring crops, protects plants from pests, and enables year-round production in the right setup.\n\n- Factors to consider are the greenhouse type, maintaining consistent warmth/moisture, and providing adequate light. Proper ventilation is also key.\n\n- Greenhouses, even basic ones, can be a valuable tool for farmers to extend their growing season and get a head start on spring crops.",
      "summaryTimestamp": 1771000906394
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Points:\n\n- The Packer, a publication from Farm Journal, is launching The Avocado Conference, a new international event for the U.S. avocado supply chain.\n- The inaugural event is scheduled for November 18-20, 2026, in San Diego, California.\n- The conference is a collaboration between Farm Journal and the Hass Avocado Board (HAB) to strengthen the global avocado industry and promote Hass avocados as America's preferred healthy food.\n- The conference aims to bring together all segments of the avocado supply chain, including producers, exporters, importers, packers, retail and foodservice buyers, and other industry partners.\n- The program will cover topics such as global avocado production and trade, retail and foodservice market insights, consumer and shopper trends, avocado marketing programs, and the role of the Hass Avocado Board in expanding avocado demand.\n- The conference is expected to provide valuable data-driven insights, facilitate collaboration, and promote strategic alignment within the avocado industry to drive sustainable growth in avocado consumption across the U.S. market.\n- Key stakeholders attending the event will include growers, packers, importers, exporters, retailers, foodservice buyers, and various industry service providers.",
      "summaryTimestamp": 1770879443511
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Summary:\n\nThe Iowa State University Pesticide Safety Education Program has updated several applicator manuals and exams to align with new pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. \n\nThe updated training materials, available for purchase through the ISU Extension Store, include the Iowa Core Manual (CS445) and an informational update in the Private Pesticide Applicator Manual (CS1). New exams based on the revised core manual are now available at all Iowa Department of Agriculture and Land Stewardship test sites.\n\nFor more information, contact Betsy Danielson, Pesticide Safety Education Extension Specialist at Iowa State University, at betsydan@iastate.edu.",
      "summaryTimestamp": 1770879445812
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The key points are:\n\n- Lead generation should focus on delivering real value to farmers in exchange for their time and attention, rather than just collecting information.\n- The call-to-action (CTA) and offer you choose shape not only how many leads are captured, but also how qualified, motivated and ready to purchase those prospects become.\n- Shifting the mindset from what you want to collect to what farmers genuinely need is crucial for effective lead generation.",
      "summaryTimestamp": 1770879447754
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Main News/Finding:\n- Temperatures this week in Illinois were 4-8 degrees below normal, with lows regularly dipping into the single digits or below zero. Strong winds led to wind chill values close to -20.\n- The state has seen a mostly dry January so far, with some areas ranking this January as the 4th or 10th driest on record.\n- A strong winter storm is expected to bring significant snowfall, with 8-12 inches possible in southern Illinois.\n\nNumbers/Prices/Statistics/Percentages:\n- Temperatures ranged from low teens in northern Illinois to mid-20s in southern Illinois.\n- Overnight lows included -5 degrees in Rockford and -2 in Aurora.\n- January precipitation so far has been less than half an inch in Carbondale (4th driest on record) and Charleston (10th driest on record).\n- Expected snowfall totals: 3-4 inches in central Illinois, 8-12 inches south of Interstate 64, with isolated heavier snow.\n\nDates/Deadlines:\n- Week of January 16, 2026\n- Weekend of January 24-26, 2026\n\nNames of People/Organizations/Programs:\n- Trent Ford, State Climatologist, Illinois State Water Survey\n- WILL Ag radio programming\n\nLocations:\n- Illinois (northern, southern, central)\n- Rockford, Aurora, Carbondale, Charleston\n\nContext/Causes:\n- Winter weather returning after a temporary pause\n- Dry start to 2026 in Illinois\n\nImpacts for Farmers:\n- Continued cold temperatures and risk of snow/ice storms\n- Dry conditions adding to drought concerns\n\nRecommendations/Action Items:\n- Stay weather-aware this weekend as forecasts can change quickly\n- Consider staying home and avoiding travel during the winter storm\n\nExpert Quotes:\n- None provided in the article",
      "summaryTimestamp": 1771014844925
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Key points:\n\n- The focus has shifted from traditional SEO (search engine optimization) to modern AEO (answer engine optimization), where brands need to build authority and trust to cut through the \"AI slop\".\n- Farmers are increasingly using AI-powered platforms like ChatGPT, Google's AI Overviews, and mobile voice search to find information, and brands need to be present in these new discovery channels to avoid becoming \"invisible\".\n- At Farm Journal, the authors are observing and adapting to this shift in discoverability, which should prompt all ag marketers to reevaluate their 2026 strategy.\n- An answer-driven content strategy and amplifying trusted voices will be more important than ever in this new AEO era.\n- Discoverability is now about winning the citation, brand mention, and trusted source reference to build brand authority, even in zero-click moments.",
      "summaryTimestamp": 1770879450283
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Key points:\n\n- Forest farming, also called multi-story cropping or agroforestry, combines small-scale farming with conventional forestry to create a self-sustaining system.\n\n- Benefits include improved water and soil quality, carbon storage, habitat for diverse species, and the ability to grow specialty crops like mushrooms, syrups, and edible roots.\n\n- Farms with existing forest or riparian areas are well-suited for agroforestry. It doesn't need to be a large-scale operation.\n\n- Before implementing, farmers should inventory their natural resources, manage any invasive trees, and develop a forest management plan with their local agricultural extension office.\n\n- There are regulations to consider for wild plant harvesting, especially regarding international trade. Farmers should research options for marketing forest-grown crops.\n\n- Agroforestry can be an inexpensive way to diversify farm products and generate high returns over time, while providing ecological benefits.",
      "summaryTimestamp": 1771000912606
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures in Illinois have been 7-12 degrees above normal so far in January, with some areas reaching highs of 69°F and 68°F this week. However, precipitation has been below normal, with 7-day totals ranging from 0.1 inches in southeast Illinois to 0.75 inches in central Illinois. January to date has been 0.5-1 inch drier than normal across most of the state, except for a narrow area between Peoria and Chicago that saw 1-3 inches of rain last week. \n\nThis winter season so far has been slightly wetter than normal in northeast Illinois, slightly drier than normal in central and western Illinois, and much drier than normal in southern Illinois, ranking as a top 5 driest on record in places south of I-70, including the 3rd driest in Salem and 4th driest in Paducah.\n\nThe mild weather will end this weekend as much cooler air moves in, with highs struggling to reach 20°F in northern Illinois and above freezing in southern Illinois. The cold air is not expected to bring much precipitation, with less than 0.25 inches of light snow forecast over the next 7 days. Colder than normal temperatures are expected to continue through the first week of February, but the last week of January should bring better chances of precipitation to the region.\n\nThe article also provides information on upcoming WILL Ag radio programming, including the Commodity Week and Closing Market Report shows.",
      "summaryTimestamp": 1771014849278
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "When used properly, they can provide flexibility for timely applications, reduce field traffic, and improve access to difficult areas. However, adopting spray drone technology requires careful consideration of regulations, training, insurance, and management practices.\n\nKey points:\n- Spray drones can be useful for applications when soils are too wet, in tall crops, to reduce compaction, and for targeted/site-specific applications.\n- Regulatory requirements include FAA Part 107 Remote Pilot Certificate, FAA Part 137 Certification for aerial pesticide application, and Iowa Department of Agriculture and Land Stewardship (IDALS) licensing.\n- Farmers need insurance coverage including chemical liability, general liability, and hull/physical damage.\n- Equipment factors to consider include spray tank capacity, battery life, nozzle options, and GPS guidance features.\n- Proper training is essential for safe and effective operation, including calibration, weather monitoring, and maintenance.\n- Farmers are encouraged to start on a limited scale and compare results to conventional methods.\n- Resources available include Iowa State University programs, licensed dealers, and IDALS guidance.\n\nSpray drone technology continues to evolve, with ongoing improvements in payload, automation, and data integration. Careful evaluation and gradual adoption are recommended for Iowa farmers.",
      "summaryTimestamp": 1770879453651
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "Farmers can sow seeds in reused containers like milk jugs and place them outdoors to take advantage of cold, moist winter conditions. \n\nThe best vegetables for winter sowing include hardy greens like kale and cabbage, as well as spinach, onions, and leafy greens. Cabbages, including Napa cabbage and 'Carex' cabbage, handle cold well and offer a variety of options. Spinach, like 'Avon' and 'Space' varieties, are resistant to mildew and bolting. Onions, especially bulbing onions, benefit from the long maturation period that winter sowing provides.\n\nPerennial flowers are also excellent candidates for winter sowing, as many need cold stratification to break dormancy. Good options include pansies, echinacea, snapdragons, larkspur, and scabiosa. These flowers can provide natural pest control and attract beneficial insects to the farm.\n\nWinter sowing allows farmers to get a head start on the growing season and produce hardier, earlier-maturing plants. This method reduces risk compared to direct sowing while offering the same benefits. By choosing the right flowers and vegetables, farmers can maximize their profits and productivity come spring.",
      "summaryTimestamp": 1771000920383
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "Prairie Strips: Planting 10-25% of farmland with prairie strips can attract beneficial predators, improve soil nutrients, and boost yields by attracting pollinators.\n\n2. Low Tilling: Reducing tillage and using cover crops can improve soil structure and biodiversity, supporting more species above and below ground.\n\n3. Regenerative Grazing: Using rotational grazing models and planting native species can increase forage availability and habitat for local wildlife, especially in areas with prairie or forests.\n\n4. Integrated Pest Management: Using diverse plantings and cultural practices to attract beneficial insects, rather than relying on pesticides, can help control pests while preserving biodiversity.\n\n5. Conservation Easements: Partnering with conservation organizations to establish easements can protect natural resources and provide tax breaks for landowners, ensuring the land is preserved for future generations.\n\nThe article emphasizes that implementing these strategies, even if they require more time, is worthwhile to maintain healthy ecosystems and reduce the need for costly inputs. It states that the more farmers can view their land as part of a larger natural system, the more their agriculture will align with the surrounding environment.",
      "summaryTimestamp": 1771000923768
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series will be held at 12 locations across Iowa from January 6 to 29. The meetings will feature topics tailored to local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.\n\nKey details:\n- Locations: Sioux Center, Storm Lake, Burlington, Mason City, Estherville, Waterloo, Davenport, Ankeny, Atlantic, Iowa City, Le Mars, Carroll\n- Dates: January 6-29, 2026\n- Early-bird registration: $75 until the week before each meeting\n- Late/on-site registration: $100\n- Includes refreshments, lunch, certified crop advisor credits, and access to resources\n- Private pesticide applicator recertification available for an additional $30 fee\n\nTopics to be covered include crop market and climate outlooks for 2026, nitrates and drinking water, profitable nutrient management, southern rust, transition planning, and robots/drones.\n\nThe goal is to provide farmers and crop production professionals with the latest research-based information to help them make informed decisions for the upcoming growing season. Registration and more information is available on the Crop Advantage Series website.",
      "summaryTimestamp": 1770879456517
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The winner and finalists will be recognized at the 2026 Top Producer Summit in Nashville, Tennessee from February 9-11. \n\nThe three finalists are:\n- Alsum Farms (Friesland, Wisconsin) - A multigenerational, 3,600-acre operation producing potatoes, pumpkins, hay, and other crops. Led by the founder and his two daughters.\n- Dalton Farms (Wakeman, Ohio) - A 7th generation, 2,000-acre farm with corn, soybeans, a 400-head cattle herd, and an on-farm market. Owned by Rebecca and Edward Dalton.\n- Splitter Farms (Sterling, Kansas) - A 1,400-acre row crop operation led by Matt and Janna Splitter, farming 18,500 total acres. They scaled the business after the sudden passing of Matt's father in 2010.\n\nAdditionally, the 2026 Next Generation Award winner is Tim Nuss (El Dorado Hills/Lodi, California), who farms various crops and also runs an ag tech and influencer business. The 2026 Women in Agriculture Award winner is Helle Ruddenklau (Amity, Oregon), an immigrant from Denmark who farms a diverse operation and is involved in ag advocacy.\n\nAll finalists and award winners will be recognized at the Top Producer Summit, which is sponsored by BASF, Fendt, and Pro Farmer.",
      "summaryTimestamp": 1770879460249
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10 at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5.\n\nThe event will feature research on sorghum's value as a forage crop, highlighting its advantages over corn, such as being more drought-tolerant and having lower nitrogen requirements. Attendees will learn about forage sorghum production and utilization for silage, grazing, and as a standing winter feed source.\n\nSpeakers at the event will include:\n- Keith Johnson, Purdue professor of agronomy\n- Mitch Tuinstra, Wickersham Chair of Excellence in Agricultural Research and scientific director of the Institute for Plant Sciences at Purdue, who will share plant breeding techniques to improve sorghum yield and quality\n- Brad Shelton, FPAC superintendent\n- Jason Tower, Southern Indiana Purdue Agricultural Center superintendent\n- Nick Minton, Purdue Extension beef systems specialist\n- Jeff Jackson, Croplan alfalfa and forage specialist\n\nVenue tours will be available from 3-5 pm and 6-8 pm, and a dinner and bull test station tour will be offered from 5-6 pm.",
      "summaryTimestamp": 1770879471899
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Farmer sentiment improved in July 2024 despite concerns over financial performance. The Purdue/CME Group Ag Economy Barometer index rose 8 points to 113.\n\n- The Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations rose 7 points to 119.\n\n- High input costs remained the biggest concern for 34% of farmers. 29% cited the risk of lower crop and livestock prices, up from 25% in June.\n\n- The Farm Financial Performance Index dropped 4 points in July to 81, 6 points lower than in July 2023, reflecting worries about weakening commodity prices and high input costs.\n\n- The Farm Capital Investment Index rose 6 points in July to 38, though it remains 7 points lower than in July 2023.\n\n- The Short-Term Farmland Value Expectations Index rose to 118 from 115 in June, while the Long-Term Farmland Value Expectations Index dropped 6 points to 146.\n\n- 72% of crop farmer respondents expect cash rental rates to remain roughly the same as in 2024, with the remaining 15% anticipating a rise and 13% expecting a decline.",
      "summaryTimestamp": 1770879477595
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Findings:\n- Tar spot, a fungal disease in corn, has been spreading in the U.S. since it was first detected in 2015. It has now reached 16 states and Ontario, Canada.\n- Purdue researchers are taking an interdisciplinary approach, combining agricultural and engineering methods, to study the dynamics of tar spot and develop ways to monitor and assess the disease.\n- The research team is using a mix of statistics, data science, epidemiology, microbiology, artificial intelligence, and computer vision, along with stakeholder feedback, to better understand tar spot.\n- The research is funded by two USDA grants totaling nearly $1.1 million.\n- The researchers are collaborating with experts from Colombia, Mexico, Ecuador, South Korea, and the U.S.\n- Previous work by the team has included developing a digital method to quantify tar spot in corn, with promising results, but some inaccuracies still need to be addressed.\n- The team is also exploring the use of drone imagery and weather data, along with traditional statistical methods, to capture details about the tar spot pathosystem.\n\nKey Numbers/Statistics:\n- Tar spot was first detected in the U.S. in 2015, affecting 2 of Indiana's 92 counties.\n- By 2022, the fungus had extended to 16 states and Ontario, Canada, as well as 15 other countries in Central and South America, the Caribbean, and U.S. territories.\n- The research is funded by two USDA grants totaling nearly $1.1 million.\n\nKey Dates/Deadlines:\n- The article was published on August 1, 2024.\n\nKey Names/Organizations/Programs:\n- Purdue University\n- C.D. Cruz, associate professor of botany and plant pathology\n- Mohammad Jahanshahi, associate professor in the Lyles School of Civil and Construction Engineering and the Elmore Family School of Electrical and Computer Engineering\n- Mariela Fernández-Campos, PhD student in botany and plant pathology\n- Yu-Ting Huang, postdoctoral research associate in civil engineering\n- Darcy Telenko, associate professor of botany and plant pathology\n- Brenden Lane, graduate student in C.D. Cruz's lab\n- Sungchan Oh, computational infrastructure specialist in the Institute for Plant Sciences\n\nLocations:\n- West Lafayette, Indiana\n- 16 states and Ontario, Canada\n- Central and South America, the Caribbean, and U.S. territories\n\nContext/Causes:\n- Tar spot had been endemic in several Latin American countries since 1904, but had not been detected in the U.S. prior to 2015.\n- The researchers are trying to understand the origins of the disease, how it has spread, and whether the pathogen in the U.S. is different from those in other countries.\n\nImpacts for Farmers:\n- The spread of tar spot in the U.S. poses a biosecurity challenge that the research aims to address with a science-based approach.\n- The researchers hope that the use of high-tech data collection and analysis methods can make vital corn pathology information more widely and rapidly available to stakeholders.\n\nRecommendations/Action Items:\n- The researchers are continuing to refine their training methods to improve the accuracy and performance of their disease detection models.\n- They are also working to quantify and model tar spot epidemics in production-style fields by integrating drone imagery and weather data with traditional statistical methods.\n\nExpert Quotes:\n- \"There are opportunities in integrating AI-based digital technologies and point-of-care diagnostics that can provide rapid and accurate information for stakeholders,\" said C.D. Cruz.\n- \"Whether you're working on civil infrastructure health monitoring or agricultural disease epidemiology, you can have a profound impact not only on humans but also on the environment,\" said Mohammad Jahanshahi.",
      "summaryTimestamp": 1770879486847
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana Sheep Association (ISA), with support from the Indiana Sheep and Wool Market Development Program (IN S&W), is hosting various sheep-themed events and competitions at the 2024 Indiana State Fair:\n\n- The Wool and Ewe Room and Ewe2 boutique will be open throughout the fair, offering woolen products, livestock-themed apparel, jewelry, and more.\n- On August 2 at 10 a.m., there will be an open wool judging and wool sale event in the Blue Ribbon Pavilion.\n- The Make It With Wool (MIWW) competition and fashion show will take place on August 4 at 2 p.m. in the Indiana Arts Building.\n- The Indiana State Fair Shearing Contest will be held on August 4 at 5 p.m. in the Ball State University Champions Pavilion.\n- From August 8-11 from 11 a.m. to 6 p.m., the Taste from Indiana Farms event in the Indiana Farm Bureau Fall Creek Pavilion will offer free samples of Indiana lamb.\n- The annual Sheep to Shawl competition, where youth teams create a wool shawl from scratch, will be on August 18 at 10 a.m. in the Indiana Arts Building.\n- Sheep can be found in the Blue Ribbon Pavilion from August 4-20 for open and 4-H shows.\n\nThe ISA President, Jane Smith, stated that the association is proud to bring the spirit of the sheep industry to the fair, with the theme of \"Art and Nature\" showcasing sheep-related art from Indiana artists.",
      "summaryTimestamp": 1770879493406
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue Extension will have a presence at the fair, providing opportunities for fairgoers to interact with Purdue experts on topics like entomology, human health, forestry, animal sciences, and more. \n\nKey Purdue Extension activities include:\n- Block Party (ages 8 months to 8 years) to enhance school-readiness skills\n- Book Party to focus on math skills \n- Captain Cash to learn financial management\n- Master Gardener exhibit on annuals/vegetables and pollinator education\n\nThe Food Science Department will host \"What's Growing on My Spinach?\" to explore food microbiology and food safety, including sampling cricket-infused rice cereal treats and Boilermaker Hot Sauce.\n\nSeed art will be showcased in the livestock barns and Purdue Extension Building, visually representing the fair's theme.\n\nThe Purdue Ag Alumni Association will sponsor Pioneer Village, offering antique tractors, farm toys, music, and more to transport guests to the 1800s.\n\nPurdue Extension exhibits will be located throughout the fairgrounds, including the 4-H Exhibit Hall, Pavilions, and Purdue Extension Building.",
      "summaryTimestamp": 1770879499261
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The University of Wisconsin-Madison has released a new publication called \"Potassium Cycle\" that provides a visual overview of the potassium cycle in Wisconsin cropping systems. The two-page publication outlines key potassium concepts and recommendations for specific situations. The publication is available for download only and was announced on June 12, 2024 in the Wisconsin Crop Manager newsletter.",
      "summaryTimestamp": 1770879503078
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Wisconsin Winter Wheat Update:\n\n- Wisconsin winter wheat is 10-14 days ahead of typical growth stages due to a warm spring and timely rainfall.\n- There is a high likelihood of stripe rust appearing in Wisconsin this season, but it has not been detected yet. Farmers are advised to scout their fields and report any findings.\n- Fusarium head blight (FHB) is expected to be an issue this season due to moderate temperatures and adequate precipitation, in contrast with recent hot and dry spring seasons.\n- FHB can limit yields and produce the mycotoxin deoxynivalenol (DON or vomitoxin), which can lead to discounts or rejection at the elevator if levels exceed 2 ppm in the finished grain.\n- Farmers are encouraged to manage FHB, as it is a yield-limiting disease worth addressing.\n- The update was provided by Damon Smith, Extension Field Crops Pathologist, and Shawn Conley, Extension Soybean and Small Grains Agronomist, from the University of Wisconsin-Madison.\n- The article was posted on May 20, 2024 on the UW Madison website.",
      "summaryTimestamp": 1770879507746
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Soybean plants have the ability to compensate for open spaces by developing additional branches and pods, allowing them to yield well even with lower plant stands. However, action should be considered if stand loss leaves fewer than 50,000-60,000 evenly-distributed plants per acre in southern regions, or 75,000 plants per acre in northern regions, or if there are areas larger than 6-10 square feet without any plants. \n\nFactors to evaluate when considering replanting include the existing plant stand, distribution, and ability to recover; planting date and relative maturity; weed management; seed and variety availability; cost and insurance; and the tradeoff between a suboptimal stand vs. yield penalty from delayed replanting. The article recommends closely assessing fields for plant loss and patterns before deciding whether to replant.\n\nAn additional resource is provided for more information on soybean replant decisions.",
      "summaryTimestamp": 1770879513810
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n1. The only labeled formulation for postemergence broadleaf weed control in Enlist E3 soybeans is the 2,4-D choline formulation present in Enlist One and Enlist Duo herbicides. 2,4-D ester and amine formulations cannot be used.\n\n2. There have been reports of producers, agronomists, and Certified Crop Advisors considering using the ester or amine formulations for postemergence applications, which is not allowed.\n\n3. Regarding burndown applications, if using a 2,4-D ester or amine formulation product, the soybean plant back interval (minimum of 7 days when using 0.5 lbs ae/acre) must be respected.\n\n4. If planting Enlist E3 soybeans, Enlist One or Enlist DUO can be applied without the plant back restriction.\n\nThe article was posted on May 11, 2024 by Daniel H. Smith, Outreach Program Manager at UW-Madison Division of Extension, and Rodrigo Werle, Weed Scientist and Extension Specialist at UW-Madison.",
      "summaryTimestamp": 1770879519516
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Wisconsin CCA (Certified Crop Adviser) Board election results have been posted. Rob Shields, Matt Brugger, and Chris Bandura have been elected to the WI CCA Board and are eligible to serve two, three-year terms. All WI CCAs in good standing status are eligible for nomination and can vote in future elections, which will take place in early 2025. Daniel H. Smith, the Outreach Program Manager for the Crops and Soils Program at the University of Wisconsin-Madison Division of Extension, oversees the election process.",
      "summaryTimestamp": 1770879524416
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 6,
  "updated": "2026-02-14T06:39:16.531Z"
}