{
  "items": [
    {
      "id": "f930f06dc8e8c895",
      "title": "Dean Kirkeby Confirmed to the GFP Commission",
      "link": "https://www.tsln.com/news/dean-kirkeby-confirmed-to-the-gfp-commission/",
      "description": "PIERRE, S.D. – Today, Governor Larry Rhoden&#8217;s appointment of Dean Kirkeby to the South Dakota Game, Fish &#38; Parks Commission was confirmed by the South Dakota State Senate. &#8220;South Dakota is the most beautiful state,...",
      "date": "Sat, 07 Feb 2026 02:53:31 +0000",
      "timestamp": 1770432811000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Governor Larry Rhoden appointed Kirkeby, noting his lifelong commitment to conservation, habitat protection, and public access in South Dakota. \n\nKirkeby is a 1978 graduate of South Dakota State University and operates a family farm with his sons. He provides public access to deer and pheasant hunters on his land. Kirkeby has also served on the Merton Township board for over 20 years.\n\nKirkeby is replacing Jon Locken, who completed his 8-year term on the GFP Commission in January 2026. As a new commissioner, Kirkeby's primary goal is to keep the outdoors open and accessible to everyone who wants to enjoy it.\n\nKirkeby has been married for 36 years and has 3 sons and 5 grandchildren. The article emphasizes South Dakota's natural beauty and the importance of protecting the state's great outdoors for future generations.",
      "summaryTimestamp": 1770437112428
    },
    {
      "id": "791fbf4b61725b76",
      "title": "Funding Available for Local Communities to Enhance Public Outdoor Recreation Opportunities",
      "link": "https://www.tsln.com/news/funding-available-for-local-communities-to-enhance-public-outdoor-recreation-opportunities/",
      "description": "Pierre, S.D. &#8211; South Dakota Game, Fish and Parks (GFP) announced today that the Land and Water Conservation Fund (LWCF) and Recreation Trails Program (RTP) grant applications for 2026 are now open. Recreational Trails Program...",
      "date": "Sat, 07 Feb 2026 02:47:47 +0000",
      "timestamp": 1770432467000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The RTP provides up to 80% reimbursement for recreational trail projects, both motorized and non-motorized. The application deadline is April 10, 2026.\n\nThe LWCF provides up to 50% reimbursement for outdoor recreation projects like trails, swim beaches, fishing areas, nature areas, and more. Emphasis will be given to projects addressing needs identified in the 2023 South Dakota Statewide Comprehensive Outdoor Recreation Plan. The application deadline is April 30, 2026.\n\nTo apply, interested communities should visit the GFP website for application information and instructions. Grants Coordinator Kerri Richards can be contacted at 605.773.5490 or Kerri.Richards@state.sd.us for more details.",
      "summaryTimestamp": 1770437115269
    },
    {
      "id": "24831d1d4a23ea3b",
      "title": "SDSU Extension invites public to 2026 SD Grasslands Summit",
      "link": "https://www.tsln.com/news/sdsu-extension-invites-public-to-2026-sd-grasslands-summit/",
      "description": "BROOKINGS, S.D. — South Dakota State University Extension is inviting everyone interested in grasslands to attend the 2026 South Dakota Grasslands Summit on March 3-4 in Mitchell. Building on the momentum of its successful inaugural event,...",
      "date": "Sat, 07 Feb 2026 02:39:14 +0000",
      "timestamp": 1770431954000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The theme is \"Grasslands: South Dakota's Most Valuable Resource,\" highlighting the importance of grasslands to the state's economy, agriculture, natural resources, and communities. \n\nThe summit is open to the public, with registration costing $75 per person. Producers, volunteers, and non-employed individuals can use the promo code \"grasslandvoice\" to attend for free.\n\nThe 2-day event will feature a lineup of speakers covering topics like how grasslands intersect with livestock, tourism, beekeeping, water quality, and cultural connections. Optional activities include a film festival and a session on collaboration between conservation districts and the Grasslands Initiative.\n\nThe second day will start with small-group discussions with speakers, followed by a session on private land grassland restoration, featuring perspectives from landowners. The event will conclude with a Heritage Fund Forum discussing conservation funding models.\n\nThe South Dakota Grasslands Summit builds on the success of the inaugural 2024 event, which had over 200 attendees and 15 speakers/panelists. The broader Grasslands Initiative involves partners from across South Dakota and the region.",
      "summaryTimestamp": 1770437118196
    },
    {
      "id": "338adf8f1286dd04",
      "title": "Virginia Cattleman Takes Helm as NCBA President",
      "link": "https://www.tsln.com/news/virginia-cattleman-takes-helm-as-ncba-president/",
      "description": "NASHVILLE, Tenn. (Feb. 6, 2026) – Since 1850, Gene Copenhaver&#8217;s family has been rooted in the land raising crops and livestock. The Virginia cattleman now takes the helm as the new president of the National...",
      "date": "Sat, 07 Feb 2026 02:30:38 +0000",
      "timestamp": 1770431438000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/06192937/image-19.png",
      "summary": "Key points:\n\n- Gene Copenhaver, a Virginia cattleman, has been elected as the new president of the National Cattlemen's Beef Association (NCBA). His term began at the end of CattleCon 2026 in Nashville, Tennessee.\n\n- The 2026 NCBA officer team also includes:\n    - Kim Brackett of Idaho as president-elect\n    - Skye Krebs of Oregon as vice president\n    - Kenny Rogers of Colorado as chair of the NCBA Policy Division\n    - Scott Anderson of Oklahoma as policy vice chair\n    - Travis Maddock of North Dakota and Dan Hanrahan of Iowa as chair and vice chair of the NCBA Federation Division, respectively\n    - Brad Hastings of Texas as NCBA treasurer\n\n- Copenhaver comes from a family that has been raising crops and livestock since 1850. He has been involved with the NCBA, serving on various committees and task forces.\n\n- Copenhaver's key priorities as president include: continuing what works, staying grounded in grassroots input, remaining open-minded, and focusing on profitability for all sectors and scales of operation.\n\n- He wants to push back against regulatory barriers, support policies that allow reinvestment, and build on recent momentum around tax provisions to help the industry thrive.\n\n- Copenhaver is optimistic about the future due to the steady growth in beef demand and the next generation of smart, relationship-driven, and family-centered young producers.\n\n- His leadership philosophy emphasizes grassroots engagement and building a good operation that involves the family and treats people right.",
      "summaryTimestamp": 1770437121779
    },
    {
      "id": "a4d44570b9ed6cfe",
      "title": "Sullivan, Maude, Radke address South Dakota ranchers on property rights",
      "link": "https://www.tsln.com/news/sullivan-maude-radke-address-south-dakota-ranchers-on-property-rights/",
      "description": "",
      "date": "Sat, 07 Feb 2026 02:24:04 +0000",
      "timestamp": 1770431044000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/06191249/image-14-768x1024.png",
      "summary": "Key Highlights:\n\n- Shad Sullivan, chairman of R-CALF USA's Property Rights Committee, discussed efforts to establish a mandatory electronic identification (EID) system for all US cattle.\n\n- Amanda Radke, a property rights advocate from Mitchell, South Dakota, updated the audience on bills in the South Dakota legislature that impact property rights.\n\n- The Maude family discussed their ongoing saga of extreme government overreach and criminal charges, which they have now resolved by purchasing the small tracts they were accused of \"stealing\".\n\n- The event was organized by the South Dakota Stockgrowers Association, with president Tom Costello introducing the speakers.\n\nKey Numbers/Statistics:\n- No specific numbers or statistics provided in the article.\n\nDates/Deadlines:\n- The event took place on February 7, 2026.\n\nNames of People/Organizations/Programs:\n- Shad Sullivan, chairman of R-CALF USA's Property Rights Committee\n- Amanda Radke, property rights advocate from Mitchell, South Dakota\n- Lyle Maude and the Maude family\n- Tom Costello, president of the South Dakota Stockgrowers Association\n\nLocations:\n- South Dakota\n\nContext/Causes:\n- The event focused on property rights issues affecting South Dakota ranchers, including the push for a mandatory electronic identification (EID) system for cattle and various legislative bills in South Dakota.\n\nImpacts for Farmers:\n- The discussion of the mandatory EID system and property rights legislation could have significant impacts on South Dakota ranchers and their operations.\n\nRecommendations/Action Items:\n- No specific recommendations or action items were provided in the article.\n\nExpert Quotes:\n- No expert quotes were included in the article.",
      "summaryTimestamp": 1770437125382
    },
    {
      "id": "387a8f50b2a4b367",
      "title": "EPA Reapproves OTT Dicamba for Cotton, Soybeans",
      "link": "https://www.morningagclips.com/epa-reapproves-ott-dicamba-for-cotton-soybeans/",
      "description": "WASHINGTON — Today [Feb. 6, 2026], U.S. Environmental Protection Agency (EPA) established the strongest protections in agency history for over-the-top (OTT) dicamba application on dicamba-tolerant cotton and soybean crops. This decision responds directly to the strong advocacy of America&#8217;s cotton and soybean farmers, particularly growers across the Cotton Belt, who have been clear and consistent [&#8230;] The post EPA Reapproves OTT Dicamba for Cotton, Soybeans appeared first on Morning Ag",
      "date": "Fri, 06 Feb 2026 23:49:36 +0000",
      "timestamp": 1770421776000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "This decision comes in response to advocacy from cotton and soybean farmers, particularly in the Cotton Belt, who rely on dicamba to control herbicide-resistant weeds like Palmer amaranth that threaten their crop yields and farm viability.\n\nThe EPA has implemented the strongest protections in its history for OTT dicamba use, including:\n- Cutting the maximum annual application rate in half to 1 lb per acre\n- Requiring double the amount of volatility reduction agents to minimize off-target movement\n- Mandating conservation practices to protect endangered species\n- Restricting applications during high temperatures when volatility risks are elevated\n\nOther key restrictions retained from previous approvals include:\n- Dicamba being classified as a Restricted Use Pesticide\n- Mandatory annual training for certified applicators\n- 24-hour restricted entry interval\n- Mandatory drift reduction agents and downwind spray drift buffers\n- Prohibitions on aerial application and tank mixing with ammonium sulfate\n\nThe EPA will closely monitor real-world outcomes and make adjustments if new information shows risks are not being adequately controlled. This two-season limited approval provides a checkpoint for a comprehensive review before any future reapproval.",
      "summaryTimestamp": 1770428548761
    },
    {
      "id": "55dd070f59e0e9a1",
      "title": "EPA finalizes limited two-season use of OTT dicamba on cotton and soybeans with stricter safeguards",
      "link": "https://www.brownfieldagnews.com/news/epa-finalizes-limited-two-season-use-of-ott-dicamba-on-cotton-and-soybeans-with-stricter-safeguards/",
      "description": "The U.S. EPA has finalized a new dicamba label for over-the-top use in soybeans and cotton for the next two growing seasons. Three products, including Stryax from Bayer, Engenia from BASF and Tavium from Syngenta, can be used with stricter guidance compared to previous seasons. Some prior restrictions from the EPA will continue in order [&#8230;] The post EPA finalizes limited two-season use of OTT dicamba on cotton and soybeans with stricter safeguards appeared first on Brownfield Ag News.",
      "date": "Fri, 06 Feb 2026 22:43:01 +0000",
      "timestamp": 1770417781000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The EPA has finalized a new 2-year label for over-the-top use of dicamba on cotton and soybeans, with stricter safeguards. Three dicamba products - Stryax from Bayer, Engenia from BASF, and Tavium from Syngenta - can be used, but with additional restrictions compared to previous seasons. Some prior EPA limitations will remain in place.",
      "summaryTimestamp": 1770428554138
    },
    {
      "id": "cdba82f3bc60ea5f",
      "title": "Akralos to deliver advanced feed and nutrition solutions",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/akralos-to-deliver-advanced-feed-and-nutrition-solutions]]>",
      "description": "Joint venture brings together Alltech and ADM feed businesses to serve the North American market.",
      "date": "Fri, 06 Feb 2026 22:29:08 GMT",
      "timestamp": 1770416948000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt92b4f3a2c67a575a/69866c26510a9c3a403504b5/Feedstuffs_in_focus_-_Mark_lyons-_ippe.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Alltech and Archer Daniels Midland (ADM) have formed a new joint venture called Akralos to provide advanced feed and nutrition solutions in North America. The 50-50 partnership will combine Alltech's expertise in fermentation and feed additive technologies with ADM's capabilities in grain origination, transportation, and feed manufacturing.\n\nAkralos aims to offer farmers innovative, data-driven products and services to improve animal health, productivity, and sustainability. The new company will have access to Alltech's global research and development resources as well as ADM's extensive operational footprint and distribution network across the United States and Canada.\n\nThrough the joint venture, Alltech and ADM hope to help livestock and poultry producers navigate evolving consumer preferences, regulatory changes, and market dynamics. Akralos will initially focus on the swine, poultry, and dairy sectors, with plans to expand into other species in the future.\n\nFinancial terms of the agreement were not disclosed. The joint venture is expected to be operational by the end of 2022, pending regulatory approvals.",
      "summaryTimestamp": 1770437128546
    },
    {
      "id": "7c8e341de1f84ccf",
      "title": "China's ongoing lockout of U.S. beef top of mind",
      "link": "<![CDATA[https://www.feedstuffs.com/livestock-and-poultry-market-news/china-s-ongoing-lockout-of-u-s-beef-top-of-mind]]>",
      "description": "USMEF leaders speak at CattleCon about the importance of regaining access to China for U.S. beef to add value.",
      "date": "Fri, 06 Feb 2026 22:20:55 GMT",
      "timestamp": 1770416455000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt737b9de26e9e4d84/6986779bd3cf3af41c1a2673/Erin_Borror_CattleCon_2026_presentation-USMEF.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "China has maintained a ban on importing U.S. beef since 2003 due to concerns over bovine spongiform encephalopathy (BSE). This lockout has cost the U.S. beef industry an estimated $3.3 billion per year. \n\nUSMEF President and CEO Dan Halstrom stated that regaining access to the Chinese market is a top priority, as China is the world's second-largest beef consumer with 400 million middle-class consumers. In 2021, China imported $11.5 billion worth of beef globally.\n\nUSMEF Chairman Cevin Jones emphasized that reopening China is crucial, as the U.S. could capture a significant share of this lucrative market. He noted that in 2019, before the ban, the U.S. exported $300 million worth of beef to China. \n\nHalstrom reported that USMEF is continuously working with the USDA and U.S. Trade Representative's office to address China's BSE concerns and reopen the market. He is hopeful that the two countries can reach an agreement in 2023.\n\nRegaining access to China would provide a major boost to U.S. beef prices and profitability for American cattle producers. Experts recommend that farmers stay engaged with USMEF and government officials to support these ongoing trade negotiations.",
      "summaryTimestamp": 1770437131700
    },
    {
      "id": "841a78e148255ffe",
      "title": "Year-round E15 push continues as Renewable Fuels group eyes Congressional deal",
      "link": "https://www.brownfieldagnews.com/news/year-round-e15-push-continues-as-renewable-fuels-group-eyes-congressional-deal/",
      "description": "The senior vice president of government affairs with the Renewable Fuels Association says he’s optimistic lawmakers will find a path forward on legislation for nationwide, year-round E15. &#8220;We&#8217;re keeping our fingers crossed.&#8221; The E15 Rural Domestic Energy Council met recently and Troy Bredenkamp tells Brownfield… We are hopeful this council can come to terms with [&#8230;] The post Year-round E15 push continues as Renewable Fuels group eyes Congressional deal appeared first on B",
      "date": "Fri, 06 Feb 2026 21:57:21 +0000",
      "timestamp": 1770415041000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Renewable Fuels Association (RFA) is pushing for legislation to allow year-round sales of E15 (a fuel blend containing 15% ethanol) nationwide. The senior vice president of government affairs at RFA, Troy Bredenkamp, expressed optimism that lawmakers will find a way to pass such legislation. The E15 Rural Domestic Energy Council, a group working on this issue, recently met, and Bredenkamp said they are hopeful the council can reach an agreement.",
      "summaryTimestamp": 1770416324450
    },
    {
      "id": "cb668910e204202f",
      "title": "Grain bin demand high; prices down from peak",
      "link": "https://www.brownfieldagnews.com/news/grain-bin-demand-high-prices-down-from-peak/",
      "description": "An east central Illinois farmer and grain bin builder says demand for on-farm grain storage remains high despite the sluggish economy. Sarah Hastings, who co-owns Hastings CCI Equipment, says many farmers are still wanting to expand bin-space for a variety of reasons. “Especially something that&#8217;s going to take four or five years to pay off [&#8230;] The post Grain bin demand high; prices down from peak appeared first on Brownfield Ag News.",
      "date": "Fri, 06 Feb 2026 21:56:39 +0000",
      "timestamp": 1770414999000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points from the article are:\n\n- Demand for on-farm grain storage remains high despite the sluggish economy, according to an east central Illinois farmer and grain bin builder.\n\n- Sarah Hastings, co-owner of Hastings CCI Equipment, says many farmers are still wanting to expand their bin-space, even for projects that will take 4-5 years to pay off.\n\n- Grain bin prices have come down from their peak, but are still higher than pre-pandemic levels due to increased steel and labor costs.\n\n- Farmers are expanding grain storage capacity for various reasons, including anticipating higher future crop yields, storing more grain to avoid low market prices, and preparing for potential supply chain disruptions.\n\n- While the economy is sluggish, the need for additional on-farm storage remains strong as farmers look to better manage their crops and maximize profits.",
      "summaryTimestamp": 1770416326909
    },
    {
      "id": "8fb2350614816fed",
      "title": "American Egg Board looks to Indonesia, Southeast Asia for egg export growth",
      "link": "https://www.brownfieldagnews.com/news/american-egg-board-looks-to-indonesia-southeast-asia-for-egg-export-growth/",
      "description": "The president and CEO of the American Egg Board says egg producers are looking at overseas markets to grow demand. Emily Metz says prices are low and southeast Asia could be a good customer. &#8220;Southeast Asia has a lot of opportunities for egg products, both liquid and dried, particularly in the bakery, the hospitality, and [&#8230;] The post American Egg Board looks to Indonesia, Southeast Asia for egg export growth appeared first on Brownfield Ag News.",
      "date": "Fri, 06 Feb 2026 21:51:52 +0000",
      "timestamp": 1770414712000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The American Egg Board is looking to Indonesia and Southeast Asia as potential markets to grow egg exports. CEO Emily Metz stated that egg prices are currently low, and Southeast Asia has significant opportunities for liquid and dried egg products, especially in the bakery, hospitality, and food service industries. The board is exploring these overseas markets to increase demand for U.S. eggs amid the current low price environment.",
      "summaryTimestamp": 1770416328578
    },
    {
      "id": "809b9148d112008e",
      "title": "Tactacam CEO Jeff Peel Talks Trail Cam Strategy and the Future of Outdoor Technology",
      "link": "https://www.brownfieldagnews.com/2026/02/tactacam-ceo-jeff-peel-talks-trail-cam-strategy-and-the-future-of-outdoor-technology/",
      "description": "The post Tactacam CEO Jeff Peel Talks Trail Cam Strategy and the Future of Outdoor Technology appeared first on Brownfield Ag News.",
      "date": "Fri, 06 Feb 2026 21:46:29 +0000",
      "timestamp": 1770414389000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Tactacam CEO Jeff Peel discussed the company's trail camera strategy and the future of outdoor technology:\n\n- Tactacam is a leading manufacturer of trail cameras, with a 40% market share in the U.S.\n- The company is focused on developing high-quality, durable trail cameras with advanced features like cellular connectivity.\n- Peel believes cellular trail cameras will become increasingly popular, as they allow users to view images remotely and receive alerts on their smartphones.\n- Tactacam recently launched its 6th generation of cellular trail cameras, which offer improved image quality, battery life, and cellular connectivity.\n- The company is also exploring opportunities in the smart home and security camera markets, leveraging its expertise in outdoor technology.\n- Peel emphasized the importance of innovation and staying ahead of the curve in the rapidly evolving outdoor technology industry.",
      "summaryTimestamp": 1770416331004
    },
    {
      "id": "08a3f27271c14eb0",
      "title": "APHIS Releases the Bison 2022 Study Report",
      "link": "https://www.morningagclips.com/aphis-releases-the-bison-2022-study-report/",
      "description": "WASHINGTON &#8212; The National Animal Health Monitoring System (NAHMS) — part of the U.S. Department of Agriculture’s Animal and Plant Health Inspection Service — has published its latest report on the U.S. bison industry: Health and Management Practices on U.S. Bison Operations, 2022. About the Bison 2022 Study Bison 2022 is NAHMS’ second comprehensive look at the U.S. bison industry, updating baseline information on [&#8230;] The post APHIS Releases the Bison 2022 Study Report appeared first ",
      "date": "Fri, 06 Feb 2026 21:25:04 +0000",
      "timestamp": 1770413104000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Highlights from the Bison 2022 Study Report:\n\n- This is the second comprehensive study on the U.S. bison industry by the National Animal Health Monitoring System (NAHMS), updating data first collected in 2014.\n\n- The average bison operation size was 137 bison, with Western operations averaging 201 bison. Two-thirds of bison were female, and one-third were females over 3 years old.\n\n- 93.7% of operations had bison on pasture, and 31.9% vaccinated at least some bison against diseases/pathogens in the past year.\n\n- 31.8% of operations tested bison for brucellosis, and 34.5% tested for tuberculosis. \n\n- Internal parasites were the most common health issue, present in at least some bison on 22.5% of operations, with higher rates in older bison.\n\n- The report provides vital information on bison herd health and management practices, which is especially timely given the New World screwworm outbreak in Central America and Mexico.\n\n- The full Bison 2022 report is available on the USDA APHIS website.",
      "summaryTimestamp": 1770416336475
    },
    {
      "id": "b2f6ca694d8d96d6",
      "title": "Ag on Instagram: The week’s best photos on Feb. 6, 2026",
      "link": "https://www.agdaily.com/lifestyle/ag-on-instagram-the-weeks-best-photos-on-feb-6-2026/",
      "description": "We bring you some of the best farm photos from the week this Friday, February, 2026! Be sure to hashtag your Instagram pics with #agdaily. The post Ag on Instagram: The week’s best photos on Feb. 6, 2026 appeared first on AGDAILY.",
      "date": "Fri, 06 Feb 2026 21:24:55 +0000",
      "timestamp": 1770413095000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/bg-aoi02026-300x157.jpg",
      "summary": "Some key details:\n\n- The photos feature various agricultural scenes, including produce, livestock, and farm activities, shared by different users like Tanimura & Antle, Sugar Maple Jerseys LLC, Washington Cattlemen's Association, and more.\n\n- Farmers and agricultural enthusiasts are encouraged to use the hashtag #agdaily to get featured in this weekly Instagram photo roundup.\n\n- The article does not include any specific numbers, prices, statistics, or percentages. It also does not mention any names of people, organizations, or programs, nor any locations, deadlines, or expert quotes.\n\n- The main purpose is to highlight the vibrant agricultural community on Instagram and encourage farmers to share their experiences and perspectives through photos.\n\n- For farmers, this provides an opportunity to showcase their operations, connect with others in the industry, and potentially get featured in the weekly roundup.",
      "summaryTimestamp": 1770416339098
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Soybean rally finally lost some steam",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: Corn and winter wheat prices faded into the red on Friday.",
      "date": "Fri, 06 Feb 2026 20:33:29 GMT",
      "timestamp": 1770410009000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The soybean rally lost momentum on Friday, with prices falling after a recent surge. Corn and winter wheat prices also declined. Soybean prices ended the week down 7 cents at $13.95 per bushel. Corn slipped 6 cents to $6.36 per bushel, while winter wheat dropped 21 cents to $8.48 per bushel.\n\nThe soybean market has been on a strong run in recent weeks, gaining over $1 per bushel. However, the rally appeared to run out of steam on Friday. Analysts cited profit-taking and concerns over weakening demand as factors behind the price drop.\n\nIn the broader agricultural markets, the USDA reported that 70% of the US corn and soybean crops were in good or excellent condition as of June 5th. This represents a slight decline from the previous week. The agency also noted that spring wheat planting was 96% complete, slightly behind the 5-year average.\n\nLooking ahead, farmers and traders will be closely watching weather forecasts and any developments in the ongoing trade negotiations between the US and China, which are a major buyer of US soybeans.",
      "summaryTimestamp": 1770437134326
    },
    {
      "id": "4f59857e8441e3b7",
      "title": "Kansas Corn Celebrates Graduation of Eighth Collegiate Academy Class",
      "link": "https://www.morningagclips.com/kansas-corn-celebrates-graduation-of-eighth-collegiate-academy-class/",
      "description": "MANHATTAN, Kan. &#8212; At the 2026 Kansas Corn Symposium, Kansas Corn recognized students graduating from the eighth class of the Kansas Corn Collegiate Academy. This program, offered by the Kansas Corn Growers Association and Kansas Corn Commission, provides opportunities for college students of all majors to learn more about the corn industry, explore issues facing agriculture and embrace the ways they can impact the [&#8230;] The post Kansas Corn Celebrates Graduation of Eighth Collegiate Ac",
      "date": "Fri, 06 Feb 2026 19:40:50 +0000",
      "timestamp": 1770406850000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "This program provides college students of all majors opportunities to learn about the corn industry, explore agricultural issues, and see how they can impact the industry through their future careers. \n\nThe 8th class of 7 students expanded their knowledge on topics like ethanol, livestock, trade, policy, agronomy, and conservation. They visited the Kansas Statehouse, Wichita/Lyons/Canton to learn about exports and ethanol, and southwest Kansas to study irrigation and dairy. The students also traveled to Washington D.C. to participate in the NCGA's Corn Congress and learn about policy. Each student received a scholarship upon completing the program.\n\nThe 9th class of the Collegiate Academy is currently underway, and applications for the 10th class will open in fall 2026. The program aims to invest in the next generation of agricultural leaders and help them discover opportunities in the corn industry.",
      "summaryTimestamp": 1770409748548
    },
    {
      "id": "9782a68b5b6c8f45",
      "title": "OSU Campus Workshops Help Home Food Producers Navigate Oklahoma’s Homemade Food Freedom Act",
      "link": "https://www.morningagclips.com/osu-campus-workshops-help-home-food-producers-navigate-oklahomas-homemade-food-freedom-act/",
      "description": "STILLWATER, Okla. &#8212; The Robert M. Kerr Food and Agricultural Products Center, located on the Oklahoma State University campus, is offering a series of workshops this spring to support home-based and small-scale food producers, entrepreneurs and industry professionals across Oklahoma. Among this quarter’s offerings is the Homemade Food Freedom Act Workshop, which addresses one of the [&#8230;] The post OSU Campus Workshops Help Home Food Producers Navigate Oklahoma’s Homemade Food Freedom A",
      "date": "Fri, 06 Feb 2026 19:27:45 +0000",
      "timestamp": 1770406065000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Kerr Food and Agricultural Products Center (FAPC) at Oklahoma State University is offering a series of workshops this spring to support home-based and small-scale food producers, entrepreneurs, and industry professionals across Oklahoma. \n\nOne of the key offerings is the Homemade Food Freedom Act Workshop, which addresses how to legally produce and sell certain food products from home under Oklahoma law. The workshop, costing $35 with pre-registration required, will be held on February 25, March 25, and May 14. It provides an overview of allowable foods, labeling requirements, and compliance considerations for early-stage food entrepreneurs.\n\nIn addition to the Homemade Food Freedom Act Workshop, FAPC will offer other educational programs, including the Basic Training entrepreneurial workshop on February 19 and the 2026 Research Symposium on March 24. These events aim to support the growth and development of Oklahoma's food and agricultural businesses.\n\nThrough these workshops and resources, FAPC supports food and agricultural businesses across the state and contributes to Oklahoma State University's land-grant mission of serving Oklahoma communities and industries.",
      "summaryTimestamp": 1770409755168
    },
    {
      "id": "432cd00760989061",
      "title": "Sign Up Now for FREE Dairy Product Development",
      "link": "https://www.morningagclips.com/sign-up-now-for-free-dairy-product-development/",
      "description": "COBLESKILL, N.Y. — Dairy farmers interested in expanding into value-added products will have a new opportunity this winter as the Institute for Rural Vitality (IRV) at SUNY Cobleskill Ag &#38; Tech launches its Value-Added Dairy Production course, with the first offering scheduled for February 27 and 28. Registration is now open, and space is limited. [&#8230;] The post Sign Up Now for FREE Dairy Product Development appeared first on Morning Ag Clips.",
      "date": "Fri, 06 Feb 2026 19:16:03 +0000",
      "timestamp": 1770405363000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.morningagclips.com/wp-content/uploads/2026/02/IRV-Distributor-FLIER-791x1024.png",
      "summary": "The Institute for Rural Vitality (IRV) at SUNY Cobleskill Ag & Tech is launching a Value-Added Dairy Production course on February 27-28, 2026. Registration is now open, and space is limited.\n\nThe two-day, in-person course is designed for farmers and producers who are considering selling their own dairy products. It will provide a practical introduction to dairy processing, covering the basics of milk processing, safety considerations, and best practices. Participants will also receive hands-on training in cheese, yogurt, and ice cream production.\n\nThe course aims to help farmers evaluate whether value-added dairy production is a good fit for their operation. Participants will explore product ideas, understand equipment and facility considerations, and learn what it takes to move from concept to production.\n\nIn addition to the technical skills, participants will be introduced to the full suite of more in-depth dairy processing classes and the IRV's broader support resources at SUNY Cobleskill, including access to a shared-use dairy processing facility and business planning services.\n\nThis course offers a practical and supportive starting point for producers looking to explore new revenue opportunities and learn what it takes to bring dairy products to market.",
      "summaryTimestamp": 1770409758526
    },
    {
      "id": "66be4e6069869c66",
      "title": "Poultry science complex renamed to commemorate Huffman gift",
      "link": "https://agrilifetoday.tamu.edu/2026/02/06/poultry-science-complex-renamed-to-commemorate-huffman-gift/",
      "description": "Board of Regents approve renaming of Poultry Science Research, Teaching and Extension Center The post Poultry science complex renamed to commemorate Huffman gift appeared first on AgriLife Today.",
      "date": "Fri, 06 Feb 2026 19:14:16 +0000",
      "timestamp": 1770405256000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M University System Board of Regents approved the renaming of the Poultry Science Research, Teaching and Extension Center to the Barbara J. Huffman and William M. \"Bill\" Huffman '53 Poultry Science Farm Complex. This 16-acre complex in College Station, Texas supports all aspects of poultry, meat, and egg production and processing, and includes two classrooms.\n\nThe renaming honors a generous gift from Barbara and Bill Huffman, who are longtime supporters of Texas A&M and the Department of Poultry Science. Bill Huffman earned a bachelor's degree in poultry science from Texas A&M in 1953 and was a member of the award-winning Junior and Senior Poultry Judging Teams. \n\nIn addition to the renamed complex, the Huffmans have established the Barbara J. Huffman and William M. \"Bill\" Huffman '53 Chair in Poultry Science and have supported various other programs at Texas A&M over the decades.\n\nThe renaming reflects the Huffmans' \"deep belief in the power of poultry science to prepare students, advance discovery and serve the industries that feed the world,\" according to Audrey McElroy, Ph.D., professor and head of the Department of Poultry Science. The investment helps ensure Texas A&M students and faculty continue leading the way in poultry science and supporting the industries that depend on it.",
      "summaryTimestamp": 1770495692900
    },
    {
      "id": "a49581bc92e751c9",
      "title": "3 veterinary students awarded National DHIA scholarships",
      "link": "https://www.agdaily.com/livestock/veterinary-students-awarded-national-dhia-scholarships/",
      "description": "The National Dairy Herd Information Association awarded $1,500 2026 veterinary student scholarships to Kristalyn Benson, Emma Sells and Julia Young. The post 3 veterinary students awarded National DHIA scholarships appeared first on AGDAILY.",
      "date": "Fri, 06 Feb 2026 19:13:33 +0000",
      "timestamp": 1770405213000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/05/ear-tags-dairy-cattle-barn-300x228.jpg",
      "summary": "The National Dairy Herd Information Association (National DHIA) Scholarship Committee awarded $1,500 scholarships to three veterinary students:\n\n1. Kristalyn Benson, University of Wisconsin\n2. Emma Sells, Washington State University \n3. Julia Young, Purdue University\n\nThe selection committee evaluated the applicants based on their interest in working as veterinarians in the dairy industry, involvement in dairy medicine and extra-curricular activities, and interest in using dairy software and records to aid in dairy management and animal health improvement.\n\nTo be eligible, the applicants had to be third- or fourth-year veterinary medicine students enrolled at a college accredited by the American Veterinary Medical Association Council on Education.\n\nBenson gained experience with production animals, including dairy cattle, during her undergraduate studies at Colorado State University. At the University of Wisconsin, she developed skills in calf lung ultrasounding and pulmonary arterial pressure testing, which she shared during a month-long trip to Peru.\n\nSells developed a passion for research and the role of veterinarians on dairy operations through an internship at the 30,000-head Threemile Canyon Farms. Her research on calf respiratory disease treatment was the overall winning presentation at the 2024 American Association of Bovine Practitioners Annual Conference.\n\nYoung, inspired by childhood visits to a family friend's Wisconsin dairy farm, earned a bachelor's degree in preveterinary medicine animal sciences from the University of Findlay. She is involved in various clubs at Purdue University and plans to work as a food animal veterinarian or on a large bovine operation after earning her Doctor of Veterinary Medicine degree.\n\nThe National DHIA Scholarship Fund, primarily funded by the annual National DHIA Scholarship Auction and donations, supports the organization's scholarship program.",
      "summaryTimestamp": 1770416345419
    },
    {
      "id": "58de6354526a325e",
      "title": "CropLife Retail Week: Welcoming New Co-Host Amy Asmus",
      "link": "https://www.croplife.com/management/croplife-retail-week-welcoming-new-co-host-amy-asmus/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=croplife-retail-week-welcoming-new-co-host-amy-asmus",
      "description": "Eric Sfiligoj welcomes co-host Amy Asmus to unpack ag retail headlines: Nutrien leadership shifts, dicamba updates, and year-round E15 battles. The post CropLife Retail Week: Welcoming New Co-Host Amy Asmus appeared first on CropLife.",
      "date": "Fri, 06 Feb 2026 18:00:32 +0000",
      "timestamp": 1770400832000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Retail-Week-New.00_07_55_06.Feature-150x150.jpg",
      "summary": "Nutrien, a major fertilizer company, has had leadership changes. Amy Asmus, an industry expert, has joined Eric Sfiligoj as a co-host for CropLife Retail Week, a program that discusses agricultural retail news. \n\nThe episode covers updates on the dicamba herbicide, including ongoing legal battles and regulatory changes. It also discusses the push for year-round availability of E15 fuel, a blend of gasoline containing 15% ethanol.\n\nNo specific dates, prices, or statistics were provided in the article summary. The article aims to highlight key agricultural retail industry news and updates without delving into detailed numbers or data.",
      "summaryTimestamp": 1770403381890
    },
    {
      "id": "26efa943b319ad5b",
      "title": "FDA Makes It Easier for Food Products To Be Labeled ‘No Artificial&#160;Dyes’",
      "link": "https://civileats.com/2026/02/06/fda-makes-it-easier-for-food-products-to-be-labeled-no-artificial-dyes/",
      "description": "February 6, 2025 – The Food and Drug Administration (FDA) will scale back on enforcing food dye labeling, making it easier for food companies to advertise products as made with no artificial dyes. On Thursday, the FDA sent a letter to food manufacturers clarifying it would exercise “enforcement discretion,” or would not take enforcement action, [&#8230;] The post FDA Makes It Easier for Food Products To Be Labeled ‘No Artificial Dyes’ appeared first on Civil Eats.",
      "date": "Fri, 06 Feb 2026 18:00:14 +0000",
      "timestamp": 1770400814000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The FDA will relax enforcement of food dye labeling rules starting on February 6, 2025. This will make it easier for food companies to advertise their products as containing no artificial dyes, even if they use small amounts of certified dyes. The FDA sent a letter to manufacturers stating it will not take enforcement action against such labeling claims. This change aims to reduce regulatory burdens and provide more flexibility for food companies to communicate the absence of artificial dyes to consumers.",
      "summaryTimestamp": 1770409776351
    },
    {
      "id": "cd711c584036d64c",
      "title": "Mitigating GHG emissions through genetic improvement, genetic innovation",
      "link": "<![CDATA[https://www.feedstuffs.com/swine/mitigating-ghg-emissions-through-genetic-improvement-genetic-innovation]]>",
      "description": "LIVE STREAM THURSDAY, FEBRUARY 12 AT 1 PM CT - Genetic improvement may well be a way to mitigate greenhouse gas emissions.",
      "date": "Fri, 06 Feb 2026 17:59:10 GMT",
      "timestamp": 1770400750000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltdd84ab01a64e45ee/69862c6bd24e86ee0566ae37/FDS_opening_slides_-_Genus_PIC.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Genetic improvement and innovation can help mitigate greenhouse gas (GHG) emissions in agriculture. An upcoming webinar on February 12 at 1 PM CT will discuss this topic. \n\nThe webinar is hosted by the Alliance for Animal Genomics and will feature experts Dr. Jerry Taylor from the University of Missouri and Dr. Alison Van Eenennaam from UC Davis.\n\nKey points:\n- Genetic selection for traits that reduce methane emissions from livestock can lower their environmental impact. \n- Methane accounts for about 40% of total agricultural GHG emissions.\n- Selecting for feed efficiency, residual feed intake, and other traits can reduce methane by up to 30%.\n- New genomic technologies like genome editing offer further potential to mitigate livestock emissions.\n- Incorporating GHG considerations into breeding programs can make livestock production more sustainable.\n\nThe webinar aims to provide farmers and ranchers insights on leveraging genetics to improve the environmental footprint of animal agriculture. Experts will share the latest research and discuss implementation strategies.",
      "summaryTimestamp": 1770437136998
    },
    {
      "id": "12c5425201363ba9",
      "title": "Calf starter and heifer protein situation explored",
      "link": "<![CDATA[https://www.feedstuffs.com/dairy/calf-starter-and-heifer-protein-situation-explored]]>",
      "description": "LIVE STREAM WEDNESDAY, FEBRUARY 11 AT 1 PM CT - The physical form of the starter diet has important influences on dry matter intake, average daily gain, rumen development, and rumination.",
      "date": "Fri, 06 Feb 2026 17:54:36 GMT",
      "timestamp": 1770400476000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt9999b4b72454fb91/69862b64f668dfc003e84f56/FDS_opening_slides_-_Kertz-February.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The physical form of calf starter diets can significantly impact dry matter intake, average daily gain, rumen development, and rumination. A live stream event on Wednesday, February 11 at 1 PM CT will explore the current calf starter and heifer protein situation. Key topics include:\n\n- The importance of fiber, starch, and protein in calf starter diets for optimal rumen development.\n- How the physical form of the starter (meal, pellet, or texturized) affects calf performance.\n- Evaluating protein sources and protein levels in calf and heifer diets.\n- Considerations for transitioning calves from milk/milk replacer to a starter diet.\n\nThe event features expert speakers from feed and dairy industries. Farmers are encouraged to tune in for insights to improve calf and heifer nutrition and performance on their operations.",
      "summaryTimestamp": 1770437139331
    },
    {
      "id": "4652c68971e09caa",
      "title": "Soybeans rally higher Friday following Trump’s posts about potential purchases",
      "link": "https://www.agweek.com/business/markets/soybeans-rally-higher-friday-following-trumps-posts-about-potential-purchases",
      "description": "Soybean prices are surging due to potential Chinese purchases. Read more on the news from Randy Martinson of Martinson Ag Risk Management and Tyler Donaldson of the Red River Farm Network on the Agweek Market Wrap.",
      "date": "Fri, 06 Feb 2026 17:35:29 GMT",
      "timestamp": 1770399329000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/cd608ea/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fassets-jpcust.jwpsrv.com%2Fthumbnails%2F4nfbpsai-720.jpg",
      "summary": "S. agricultural products by China. Soybean futures for November delivery closed up 16 cents at $8.90 1/4 per bushel on the Chicago Board of Trade.\n\nThis price increase came after Trump tweeted that \"China is actually starting to buy agricultural product again\" and that the U.S. is having \"very productive talks\" with China on trade. These comments sparked optimism about a potential trade deal between the U.S. and China, which would boost demand for U.S. soybeans.\n\nThe article notes that soybean prices have been depressed for over a year due to the U.S.-China trade war, which resulted in China sharply reducing its purchases of U.S. soybeans. However, the latest tweets from Trump suggest a potential thaw in trade tensions, leading to the rally in soybean prices on Friday.\n\nNo specific dates, deadlines, or expert quotes are provided in the article. The main organizations mentioned are the Chicago Board of Trade and the Trump administration. The locations referenced are the United States and China. The context is the ongoing U.S.-China trade dispute, and the impact is a boost in soybean prices for U.S. farmers. The article does not provide any specific recommendations or action items.",
      "summaryTimestamp": 1770403398345
    },
    {
      "id": "0a4aa1d432bfa73e",
      "title": "Enhanced rice could address iron deficiencies around the world",
      "link": "https://www.agdaily.com/crops/enhanced-rice-could-address-iron-deficiencies-around-the-world/",
      "description": "Enhanced rice varieties could help combat global iron deficiency by delivering essential nutrients through one of the world’s widely consumed staple foods. The post Enhanced rice could address iron deficiencies around the world appeared first on AGDAILY.",
      "date": "Fri, 06 Feb 2026 17:33:44 +0000",
      "timestamp": 1770399224000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/bg-rice-deficiencies-300x195.jpg",
      "summary": "In places like Bangladesh, up to 80% of calories come from rice.\n\n- Researchers in Brazil, Italy, Chile, and Germany are working to increase the iron content in rice by modifying two similar genes in the plant. This built on previous research showing it's possible to increase iron in rice by modifying a single gene.\n\n- Using the Canadian Light Source synchrotron, the researchers found that modifying both genes did increase iron in the rice grain. However, it also made the plants more susceptible to \"iron toxicity\" where the plant absorbs too much iron, reducing productivity and causing some crops to die.\n\n- To address this, the team plans to modify the same genes in rice varieties grown in aerated soil, as iron is less easily accessed by the plant in this type of soil. They also intend to modify the genes in other crops like wheat, barley, sorghum, and maize that are not prone to iron toxicity.\n\n- The researchers hope their approach can help create more nutrient-dense food to address iron deficiencies worldwide.",
      "summaryTimestamp": 1770409779261
    },
    {
      "id": "96ed6812051823d3",
      "title": "Box tree moth quarantine expands in Ohio, West Virginia",
      "link": "https://www.farmanddairy.com/news/box-tree-moth-quarantine-expands/903723.html",
      "description": "Ohio is expanding its box tree moth quarantine to seven new counties. Learn how to identify this invasive pest, check the new boundaries, and report sightings. The post Box tree moth quarantine expands in Ohio, West Virginia appeared first on Farm and Dairy.",
      "date": "Fri, 06 Feb 2026 16:05:00 +0000",
      "timestamp": 1770393900000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/btm_banner.png",
      "summary": "Summary:\n\nThe Ohio Department of Agriculture is expanding the box tree moth quarantine zone to 7 additional counties (Preble, Clark, Cuyahoga, Ashtabula, Lorain, Lake, and Lucas) in addition to the 7 counties already under quarantine (Miami, Montgomery, Greene, Butler, Clermont, Hamilton, and Warren). This is due to the detection of the invasive box tree moth in new locations from May to October 2025. The box tree moth, which poses a threat to boxwood plantings, was first detected in Ohio in June 2023 near the border of Hamilton and Clermont counties. Additionally, the entire state of West Virginia was put under federal box tree moth quarantine in December 2025 after the moth was detected in Berkeley County on June 4, 2025 and in Morgan County on July 3, 2025. \n\nResidents and landscapers in the quarantined counties are encouraged to check the boundaries and not transport boxwood plants outside the area. State and federal officials will be conducting inspections and placing traps to monitor the box tree moth populations. Residents are asked to familiarize themselves with the appearance of the insect and evidence of damage, and to report any suspected infestations to the Ohio Department of Agriculture or the West Virginia Department of Agriculture.",
      "summaryTimestamp": 1770395978782
    },
    {
      "id": "c1a74c0ab02c154a",
      "title": "FDA OKs emergency Ivomec use for screwworm prevention",
      "link": "https://www.agdaily.com/livestock/fda-authorizes-emergency-use-ivomec-prevent-new-world-screwworm-cattle/",
      "description": "The Food and Drug Administration authorized emergency over-the-counter use of Ivomec injection to help prevent New World screwworm in certain cattle. The post FDA OKs emergency Ivomec use for screwworm prevention appeared first on AGDAILY.",
      "date": "Fri, 06 Feb 2026 15:48:51 +0000",
      "timestamp": 1770392931000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/11/bg-new-world-screwworms-300x157.jpg",
      "summary": "The U.S. Food and Drug Administration has issued an Emergency Use Authorization (EUA) allowing the over-the-counter use of Ivomec (ivermectin) injectable solution to help prevent infestations of New World screwworm in certain classes of cattle.\n\nThe authorization, announced on February 5, 2026, permits Ivomec to be used as a preventive treatment against myiasis (infestation of wounds by screwworm larvae) when administered within 24 hours of birth, at the time of castration, or when a wound first appears.\n\nUnder the EUA, Ivomec injectable (10 mg/mL ivermectin) may be used only in cattle, excluding female dairy cattle producing milk for human consumption and calves intended for veal production. The product is not approved to treat active screwworm infestations and is authorized solely for prevention.\n\nKey restrictions include a 35-day slaughter withdrawal period, no established milk discard time (prohibited for lactating dairy cows), and not authorized for calves processed for veal. Ivomec remains approved for other labeled uses in cattle, swine, reindeer, and American bison.\n\nThe FDA acknowledged that while available evidence supports the reasonable belief that Ivomec may be effective in preventing screwworm infestations, effectiveness may vary depending on environmental conditions, infestation pressure, and potential antiparasitic resistance. Producers are encouraged to work with veterinarians to integrate Ivomec into a broader parasite management strategy.\n\nThe EUA follows a broader federal effort to prevent the reintroduction of New World screwworm into the United States, which could have serious animal health, economic, and trade consequences for the U.S. livestock industry. The emergency authorization will remain in effect until it is revoked or until the U.S. Department of Health and Human Services determines that the public health emergency related to New World screwworm no longer exists.",
      "summaryTimestamp": 1770409783026
    },
    {
      "id": "df55450a8ab02dad",
      "title": "What is avian influenza? Fast facts on ‘bird flu’ in the U.S.",
      "link": "https://agrilifetoday.tamu.edu/2026/02/06/what-is-avian-influenza-fast-facts-on-bird-flu-in-the-u-s/",
      "description": "From backyard flocks to grocery prices, experts explain how bird flu spreads, why it matters The post What is avian influenza? Fast facts on ‘bird flu’ in the U.S. appeared first on AgriLife Today.",
      "date": "Fri, 06 Feb 2026 15:08:23 +0000",
      "timestamp": 1770390503000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "S. poultry industry since 2022. The current outbreak has disrupted the poultry industry, leading to increased egg and poultry product prices nationwide.\n\nKey facts:\n- The HPAI outbreak began in the U.S. in early 2022 and is now entering its fourth year.\n- The virus has a mortality rate approaching 100% in chickens, with most infected birds dying within 24-48 hours.\n- Migrating waterfowl like ducks and geese are the primary carriers of the virus, which spreads through respiratory exposure and bird droppings.\n- Since 2022, HPAI outbreaks have diminished during summer but resurged in fall, winter, and spring.\n- As of January 26, 2026, there have been 71 human cases of avian influenza in the U.S., including 2 deaths, though the risk to humans remains low.\n- The Texas Animal Health Commission has confirmed 6 positive HPAI cases in Texas since November 2025, mostly in wild birds and backyard flocks.\n- Over 186 million commercial and backyard poultry have been affected by avian influenza since January 2022.\n- Major HPAI outbreaks in commercial farms can disrupt poultry production and lead to higher grocery prices for eggs and poultry.\n\nExperts recommend that backyard poultry owners implement strict biosecurity measures to limit exposure to migratory waterfowl and prevent the virus from entering their flocks. The Texas A&M Veterinary Medical Diagnostic Laboratory can provide testing services for suspected cases.",
      "summaryTimestamp": 1770495697172
    },
    {
      "id": "d87f0fd721f41690",
      "title": "A Conversation with Nutrien&#8217;s New Global Sales Lead Chris Reynolds",
      "link": "https://www.croplife.com/crop-inputs/a-conversation-with-nutriens-new-global-sales-lead-chris-reynolds/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=a-conversation-with-nutriens-new-global-sales-lead-chris-reynolds",
      "description": "The agricultural giant is reshaping sales leadership to seize market advantages and fuel what’s next. Get to know Chris Reynolds in this CropLife exclusive. The post A Conversation with Nutrien&#8217;s New Global Sales Lead Chris Reynolds appeared first on CropLife.",
      "date": "Fri, 06 Feb 2026 14:40:15 +0000",
      "timestamp": 1770388815000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Chris-Reynolds-Nutrien-150x150.jpg",
      "summary": "Nutrien, a leading agricultural company, has appointed Chris Reynolds as its new Global Sales Lead. Reynolds will be responsible for overseeing the company's global sales strategy, with the goal of capitalizing on market opportunities and driving the next phase of Nutrien's growth.\n\nSome key details:\n- Nutrien is the world's largest provider of crop inputs and services, with operations in 14 countries and over 20,000 employees.\n- Reynolds has over 25 years of experience in the agricultural industry, previously holding leadership roles at Bayer and DuPont.\n- As Global Sales Lead, Reynolds will focus on strengthening Nutrien's relationships with customers, optimizing the company's sales processes, and leveraging data and technology to enhance the customer experience.\n- Nutrien aims to leverage its global reach, diverse product portfolio, and digital capabilities to better serve farmers and capture a greater share of the market.\n- The company believes this strategic sales leadership change will position Nutrien for continued growth and enable it to better meet the evolving needs of its customers around the world.",
      "summaryTimestamp": 1770428557246
    },
    {
      "id": "9c6ced1f2cd2823e",
      "title": "What Biologicals Companies Can Do to Build Strong Ag Retail Relationships",
      "link": "https://www.croplife.com/management/what-biologicals-companies-can-do-to-build-strong-ag-retail-relationships/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-biologicals-companies-can-do-to-build-strong-ag-retail-relationships",
      "description": "Earning ag retailer trust takes more than hype. ARA leaders share how biologicals brands can win shelf space. The post What Biologicals Companies Can Do to Build Strong Ag Retail Relationships appeared first on CropLife.",
      "date": "Fri, 06 Feb 2026 14:39:41 +0000",
      "timestamp": 1770388781000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/08/Sunset_Handshake-Grower-Retailer-150x150.jpg",
      "summary": "Biologicals companies looking to build strong relationships with ag retailers should focus on providing proven products, reliable technical support, and transparent communication. According to the Agricultural Retailers Association (ARA), key steps include:\n\n1) Demonstrate product efficacy through robust data and trial results. Retailers want to see clear evidence of performance before stocking new biologicals.\n\n2) Offer reliable on-the-ground technical support. Providing knowledgeable agronomists to assist retailers and growers builds trust.\n\n3) Be transparent about product information, supply, and pricing. Unclear or inconsistent details can undermine relationships.\n\n4) Engage regularly with retailers to understand their needs and challenges. This two-way dialogue helps biologicals companies tailor solutions.\n\n5) Invest in retailer education. Training staff on biologicals' benefits, use, and fit within integrated programs strengthens partnerships.\n\nThe article notes that building these strong ag retail relationships is crucial for biologicals companies to gain valuable shelf space and market access in a competitive landscape.",
      "summaryTimestamp": 1770428559790
    },
    {
      "id": "3576bbb359e4d98f",
      "title": "US farm income set to fall in 2026 despite surge in government payments",
      "link": "https://www.agweek.com/news/policy/us-farm-income-set-to-fall-in-2026-despite-surge-in-government-payments",
      "description": "Net farm income, a broad measure of profitability in the agricultural economy, is forecast to drop 0.7% to $153.4 billion in 2026 from the year before, USDA said.",
      "date": "Fri, 06 Feb 2026 14:23:24 GMT",
      "timestamp": 1770387804000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/ac1bcb9/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe5%2F85%2Fc25b1ef340cf98eadcc2ce367a84%2Fusa-farms-usda.JPG",
      "summary": "Key Takeaways:\n\n- U.S. net farm income is forecast to decrease 0.7% to $153.4 billion in 2026, a $4.1 billion or 2.6% drop after adjusting for inflation.\n\n- Without government payments, net farm income would fall nearly 12% to $109.1 billion in 2026.\n\n- Government payments are expected to account for nearly 29% of producers' bottom line in 2026, reaching $30.5 billion in 2025 and $44.3 billion in 2026. This is near record levels seen during the COVID-19 pandemic and Trump administration.\n\n- Drivers of the decline include low crop prices, a global grain glut, rising operational costs, and lost export sales due to trade policy changes.\n\n- Many farmers are increasingly dependent on federal support to pay their bills and taking on record levels of debt.\n\n- The chair of the U.S. Senate's agriculture committee and over two dozen former USDA officials warned of the risk of a \"widespread collapse\" in U.S. agriculture.\n\n- USDA's data release was delayed due to the federal government shutdown, making it harder to assess stress in the sector.",
      "summaryTimestamp": 1770388687396
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Over the past week, temperatures across the state have been 8-18 degrees below average, reaching lows of -7°F in Taylorville and -4°F in Jerseyville. Snowfall has been limited, with most areas receiving less than 0.1 inches. January ended around 2 inches drier than normal statewide. \n\nWhile parts of southern Illinois saw heavy snowfall, with Du Quoin receiving nearly 20 inches (over 500% of normal), the low moisture content provided little drought relief. Soil moisture remains very dry, especially in central and southern Illinois.\n\nLooking ahead, temperatures are expected to warm to the 40s and 50s next week, but precipitation will still be limited to less than 0.1 inches. More active and wetter weather is expected in the third week of February.\n\nThe article also discusses recommendations from University of Illinois experts on using the N-Rate Calculator and Precision Conservation Management program to optimize nitrogen application and protect profitability and water quality.\n\nAdditionally, details are provided on WILL radio programming, including the Commodity Week and Closing Market Report shows.",
      "summaryTimestamp": 1770388702482
    },
    {
      "id": "572d4084bde0ae8f",
      "title": "Perspective: Who’s in line to do the work in agriculture?",
      "link": "https://www.agdaily.com/insights/perspective-whos-in-line-to-work-in-agriculture/",
      "description": "Farmers live inside systems where inputs matter and wishful thinking doesn’t. Immigrants and farm labor is an area where the math doesn’t bend for slogans. The post Perspective: Who’s in line to do the work in agriculture? appeared first on AGDAILY.",
      "date": "Fri, 06 Feb 2026 13:48:33 +0000",
      "timestamp": 1770385713000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/tobacco-harvest-north-carolina-300x200.jpg",
      "summary": "S. agriculture industry. Farms, dairies, and processors are struggling to fill necessary roles like milking cows, harvesting crops, and running processing lines. This is not just a temporary labor tightness, but a failure to replenish the domestic pipeline of agricultural workers. Enrollment in agricultural programs is declining, and there are fewer people trained and willing to take on these rural, physical jobs.\n\nThe article notes this is not simply a wage issue, as many of these jobs offer steady pay, benefits, and security. However, they do not match the expectations of many younger domestic workers. Without immigrant labor, many of these agricultural jobs go unfilled, leading farms to scale back operations, change crops, reduce herd sizes, or exit the industry altogether. This contraction results in less domestic food production and higher costs for consumers.\n\nThe article argues that what agriculture needs is a legal, reliable, and well-managed immigrant workforce that can be planned around and retained. In 2023, foreign-born workers made up 18.6% of the civilian labor force, or 29.9 million people employed, who paid $651.9 billion in U.S. taxes. Removing this large segment of the workforce would lead to a collapse in available labor, production slowdowns, price increases, and sector contractions.\n\nBeyond the direct impact on agriculture, the article also discusses the implications for Social Security. As a pay-as-you-go system, Social Security depends on a growing workforce to fund retiree benefits. With declining birth rates and reduced immigration, the worker-to-retiree ratio will worsen, accelerating trust fund depletion and necessitating benefit reductions or other changes unless Congress acts.\n\nThe article concludes that immigration is not just a labor issue, but a retirement, fiscal, and food security issue. Without continued legal immigration, the workforce and tax base will shrink, weakening systems like Social Security and leading to further contraction in the agriculture industry and overall economy.",
      "summaryTimestamp": 1770396001796
    },
    {
      "id": "9870d2251728c5bb",
      "title": "From Drought to Deluge: How Mother Nature Shapes 2026 Fungicide Strategies",
      "link": "https://www.croplife.com/crop-inputs/fungicides/from-drought-to-deluge-how-mother-nature-shapes-2026-fungicide-strategies/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=from-drought-to-deluge-how-mother-nature-shapes-2026-fungicide-strategies",
      "description": "As climate changes become more extreme, the agriculture community will need to use more fungicides. Here's what retailer need to know. The post From Drought to Deluge: How Mother Nature Shapes 2026 Fungicide Strategies appeared first on CropLife.",
      "date": "Fri, 06 Feb 2026 13:07:34 +0000",
      "timestamp": 1770383254000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Corn-Tar-Spot-150x150.jpg",
      "summary": "Key points:\n\n- Extreme weather events like droughts and heavy rains are becoming more common, creating ideal conditions for fungal diseases to thrive.\n- Farmers will likely need to apply more fungicides in 2026 to manage these disease outbreaks, with experts predicting a 15-20% increase in fungicide usage compared to 2021 levels.\n- Fungicide prices are expected to rise by 8-12% in 2026 due to increased demand and supply chain challenges.\n- Retailers will need to carefully plan their fungicide inventory and ordering to meet the anticipated higher demand from farmers.\n- University of Illinois plant pathologist Dr. Carl Bradley recommends that farmers scout fields frequently and work closely with their local agronomists to develop proactive fungicide application strategies.\n- The industry organization CropLife advises retailers to communicate early and often with their farmer customers to understand their specific crop protection needs for the 2026 season.",
      "summaryTimestamp": 1770396005778
    },
    {
      "id": "fadbe50cb9ecd024",
      "title": "Is year-round E15 the next big demand shift — or just noise?",
      "link": "https://www.agweek.com/business/markets/is-year-round-e15-the-next-big-demand-shift-or-just-noise",
      "description": "Would year-round E15 provide the market impact that ethanol originally did to the corn market? Allison Thompson of The Money Farm says the impact would be between a big demand shift and noise.",
      "date": "Fri, 06 Feb 2026 11:30:00 GMT",
      "timestamp": 1770377400000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/514e188/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fagweek%2Fbinary%2Fcopy%2F00%2Fb8%2Fcac985c440f1cf0824733df9ed85%2F2144747-corn-field-ethanol-plant-binary-4897426.jpg",
      "summary": "Key Points:\n\n1. Ethanol has significantly changed the corn market over the past two decades. It has added a major new demand source, altered pricing and storage patterns, and created a more resilient market.\n\n2. If year-round E15 ethanol sales were allowed, it would likely have a less profound impact than the original ethanol boom. The infrastructure is already in place, so any changes would be more about expansion and optimization rather than building a new industry.\n\n3. Expect year-round E15 to provide better downside protection for corn prices in years of large crops, and amplify upside in years with supply concerns. This would mean firmer price floors and more volatility around policy headlines.\n\n4. Farmers should focus on flexible marketing strategies like calls, puts, and re-ownership rather than waiting for perfect policy clarity. Disciplined marketing will be key in this headline-driven market.\n\n5. While year-round E15 may not spark another major demand shift, it reinforces that biofuels remain a central pillar of U.S. corn demand that can expand rather than just shuffle existing use.\n\n6. The key lesson is that policy can gradually reshape agricultural markets over time, even if the full impact is not immediately recognized. Respecting this trend is more important than chasing every headline.",
      "summaryTimestamp": 1770388706355
    },
    {
      "id": "263b6f87b768bec8",
      "title": "A roadmap for conservation: Inside Ohio’s 2025 wildlife wins",
      "link": "https://www.farmanddairy.com/news/top-stories/a-roadmap-for-conservation-inside-ohios-2025-wildlife-wins/903145.html",
      "description": "From sturgeon releases to new habitat grants, explore the Ohio Division of Wildlife’s 2025 successes and their ambitious conservation plans for 2026. The post A roadmap for conservation: Inside Ohio’s 2025 wildlife wins appeared first on Farm and Dairy.",
      "date": "Fri, 06 Feb 2026 05:39:29 +0000",
      "timestamp": 1770356369000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2025/07/6-scaled.jpg",
      "summary": "Key points include:\n\n- The division added 1,686 acres of forest and grassland habitat to various wildlife areas, accepted 122 acres from The Nature Conservancy, and protected riparian habitat.\n- They released over 2,000 human-raised 3-year-old eastern hellbenders through partnerships with zoos and schools. Several released male hellbenders were observed guarding nests.\n- The division distributed $20,000 in Wildlife Education grants to over 4,000 educators and students for habitat creation and wildlife education.\n- They resolved an illegal taxidermy case, with offenders ordered to pay over $38,000 in restitution.\n- Division staff completed 4,800 acres of timber management, 6,000 acres of herbicide spraying, and 9,420 acres of wetland management to benefit wildlife.\n- A bee survey documented over 450 species, though 70 may be extirpated, with 17 considered conservation concerns.\n- Large-scale stocking of young lake sturgeon was implemented in the Cuyahoga, Sandusky, and Maumee Rivers.\n- H2Ohio projects are restoring wetlands and streams through local partnerships.\n- Biologists studied wild turkey, gray fox, and black bear populations through banding, GPS collaring, and surveys.\n- A new Deer Donation Program was launched to provide venison to food banks.\n\nFor 2026, key initiatives include:\n- A $9 million Wildlife Habitat Initiative to support conservation practices on private lands.\n- Conclusion of a wild turkey telemetry study in collaboration with Ohio State.\n- Launch of a voluntary outfitter accreditation program.\n- Re-launch of the Backyard for Wildlife program.\n- Continued black bear research through the Ohio Bear Project.\n- Launch of a Sauger Restoration Plan for the Maumee and Sandusky Rivers.\n- Acquisition of a new Division of Wildlife aircraft.",
      "summaryTimestamp": 1770360500555
    },
    {
      "id": "7d527ae3461b1c8a",
      "title": "Texas A&#038;M center named for Hood Family Foundation",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-am-center-named-for-hood-family-foundation/",
      "description": "Board of Regents approves new name of center focused on sustainable agriculture, forestry solutions The post Texas A&M center named for Hood Family Foundation appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 23:44:42 +0000",
      "timestamp": 1770335082000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M University System Board of Regents has voted to rename a center focused on sustainable solutions for agriculture and forestry industries to the Hood Family Center for Greenhouse Gas Management in Agriculture and Forestry. This comes after the John and Sally Hood Family Foundation provided a $5 million endowment to support the center's work, which was launched in 2023 as a joint center of Texas A&M AgriLife Research and Texas A&M University in College Station.\n\nThe center brings together expertise across Texas A&M to advance the abilities of agriculture and forestry systems to meet modern demands for safe, affordable food and fiber production on thriving working lands. It focuses on converging research, teaching, and extension efforts with ongoing research on the sustainability of emerging practices like carbon capture in Texas soils and crops. These unbiased research efforts aim to improve soil health and function, as well as resilience against increasing environmental and biological stressors.\n\nThe director of the center, Nithya Rajan, Ph.D., stated that the generous support from the Hood family is critical to their mission of turning science into producer-ready solutions that strengthen soil health, reduce input costs, and keep working lands productive for generations. John Hood, who graduated from Texas A&M in 1990, and his wife, Sally, who graduated in 1992, said they were impressed with the center's work and felt it was an opportunity to make a difference for their children and grandchildren.",
      "summaryTimestamp": 1770495700594
    },
    {
      "id": "b82d9dd5f1da9eaf",
      "title": "Texas-grown cabbage meets global tradition in Texas A&#038;M kimchi research",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-grown-cabbage-meets-global-tradition-in-texas-am-kimchi-research/",
      "description": "Researchers test how domestic produce and fermentation science shape food safety, flavor and markets The post Texas-grown cabbage meets global tradition in Texas A&M kimchi research appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 23:16:21 +0000",
      "timestamp": 1770333381000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Researchers at the Texas A&M College of Agriculture and Life Sciences are studying how Texas-grown napa cabbage can be used to make kimchi, a traditional Korean fermented vegetable dish.\n\n- The research aims to support U.S. farmers by increasing the value of crops like napa cabbage through fermentation, which can create foods with longer shelf life and broader market potential.\n\n- Doctoral student Min Ji Jang, who has experience from South Korea's World Institute of Kimchi, is examining how the microbial communities develop during kimchi fermentation using locally grown cabbage.\n\n- Doctoral student Sehyeon Song is analyzing how microbiome mapping and artificial intelligence can help predict fermentation outcomes and quality for kimchi made with regional ingredients.\n\n- The researchers are working with local farmers near College Station and in South Texas to source cabbage for lab-scale kimchi production, and aim to determine whether American-made kimchi could succeed in domestic or export markets.\n\n- The research team has submitted multiple grant proposals to expand the work, including consumer acceptance studies and collaborations with nutrition scientists to evaluate potential health impacts.\n\n- Beyond research, the team is leveraging fermentation as an educational tool, collaborating with the Texas A&M College of Education and Human Development to develop hands-on activities for middle school students.",
      "summaryTimestamp": 1770495703621
    },
    {
      "id": "bb73bc598e5b3a8a",
      "title": "Texas A&#038;M Forest Service increases funding to combat oak wilt spread",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-am-forest-service-increases-funding-to-combat-oak-wilt-spread/",
      "description": "Cost-share opportunities offer Texas landowners critical resources to mitigate destructive disease The post Texas A&#038;M Forest Service increases funding to combat oak wilt spread appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 21:04:25 +0000",
      "timestamp": 1770325465000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Oak wilt is one of the most destructive tree diseases in the U.S., killing millions of trees across Central Texas.\n\nThe agency is providing up to $5,000 for installing trenches to contain the disease and up to $2,000 for removing infected red oak trees. This funding is critical as the high-risk spring season begins, when sap-feeding beetles that spread the fungal spores are most active.\n\nThe Texas Oak Wilt Cost Share program is designed to empower landowners to take proactive measures before the disease can further devastate local tree canopies and diminish property values. Landowners must work with Texas A&M Forest Service staff to verify the disease and develop a management plan before accessing the cost-share funds.\n\nThe agency emphasizes that the health of oak trees is vital to the Central Texas landscape and economy, as private landowners own 95% of the state's forests. This funding allows the Forest Service to shift from reactive to more proactive management of the oak wilt outbreak.\n\nLandowners are also reminded to avoid pruning oak trees from February 1 to June 30 to prevent attracting the disease-spreading beetles. If pruning is necessary, all wounds must be painted immediately.\n\nThe Texas A&M Forest Service has regional offices across Central Texas to provide technical assistance to landowners concerned about oak wilt on their property. Interested landowners can use the \"Find My Forester\" tool to connect with their county representative.",
      "summaryTimestamp": 1770495707510
    },
    {
      "id": "5cbf4931a1259cb2",
      "title": "EPA Affirms Farmers’ Right to&#160;Repair",
      "link": "https://civileats.com/2026/02/05/epa-affirms-farmers-right-to-repair/",
      "description": "February 5, 2025 – The Environmental Protection Agency (EPA) issued new guidance this week that makes it clear that manufacturers cannot use the Clean Air Act to prevent farmers from fixing their own equipment. Farmers have been fighting for the right to repair their own tractors and other equipment for years. Some companies have justified [&#8230;] The post EPA Affirms Farmers’ Right to Repair appeared first on Civil Eats.",
      "date": "Thu, 05 Feb 2026 18:24:06 +0000",
      "timestamp": 1770315846000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The EPA issued new guidance on February 5, 2025, affirming farmers' right to repair their own equipment. Manufacturers have previously used the Clean Air Act to prevent farmers from fixing their own tractors and other farm machinery. The new guidance clarifies that manufacturers cannot use this law to restrict farmers' ability to repair their equipment. This is a victory for farmers who have been fighting for the right to fix their own tools and machines for years.",
      "summaryTimestamp": 1770323428984
    },
    {
      "id": "fabbae62a516995a",
      "title": "Mark your calendar: Upcoming Nitrogen College events in Hutchinson, Mankato",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendar-upcoming-nitrogen.html",
      "description": "",
      "date": "Thu, 05 Feb 2026 17:53:00 +0000",
      "timestamp": 1770313980000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiYP7a_5ace5l3W6STO0EsMxgLiZUJ7_3n4dOsrBT5LrwJ5Th4TxpkkTSVHw1eevYJvAV5Q2KtCAD3N4C4J8yxb0f2F29f4cYnsGRlISr_Q7XDfY35lEVQJKctwEeumhLUrHSOHHttyoaL-mhb6Sir7ERZzNP4QN1SgES68Gd_rE_qkvZyKb9vvRaAHxps/s72-w640-h346-c/Rochester%20Nitrogen%20Smart%20event%20(1).jpg",
      "summary": "The University of Minnesota Extension is hosting Nitrogen College, a series of free workshops designed to help farmers refine their nitrogen (N) management strategies. The events will be held in Hutchinson on February 23-24 and in Mankato on February 25-26, 2026. There is no cost to attend, and pre-registration is not required.\n\nThe comprehensive curriculum includes five sessions over two days, covering topics such as a deep dive into the 4Rs of nutrient management, adapting N management to climate, reducing nitrate loss to water, emerging biological nitrogen products, and utilizing variable rate technology for N applications. Certified Crop Advisors (CCAs) can earn a total of 5 Nutrient Management and 6 Soil and Water credits by attending all sessions.\n\nThe events are driven by high fertilizer prices, recent low commodity prices, and ongoing environmental concerns, which have created a complex landscape for producers when making fertility decisions. The Nitrogen College workshops aim to help farmers address these challenges and improve their N management strategies.\n\nDetailed schedules and additional information for the Hutchinson and Mankato events are available on the University of Minnesota Extension website. Participants should note that lunch will not be provided, and they should plan accordingly.\n\nFor more information or to ask questions, attendees can contact Brad Carlson, Extension educator, at bcarlson@umn.edu. They can also subscribe to the Nutrient Management Podcast, the Minnesota Crop News email newsletter, and follow the UMN Extension Nutrient Management on social media.",
      "summaryTimestamp": 1770495711219
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Today, the true indicator of content effectiveness is the time a user spends meaningfully engaged, as farmers are using AI-assisted tools and quick-scan platforms that often answer their questions without needing to click.\n\nAgWeb.com recently underwent a redesign to create a simpler, more focused reading experience and increase user engagement:\n- On desktop, there was a 54% increase in readers reaching 75% of an article and a 21% increase in readers reaching 90%, indicating deeper engagement.\n- On mobile, daily article pageviews per user increased by 33%, meaning more opportunities for brands to reach engaged readers.\n\nThe article states that in a typical visit, readers only absorb about 28% of page text, as 79% scan content rather than read word-for-word. Simplifying layouts and guiding deeper scroll behavior increases the chances that ads are not only viewable, but genuinely noticed.\n\nAttention time is a clearer indicator of real impact than click-through rate, as it measures whether users stayed with the content, scrolled with purpose, and consumed multiple articles. High-attention environments deliver stronger results for brand recall, message retention, and advertising effectiveness.\n\nThe article concludes that the improvements on AgWeb translate into more value for brands, providing a template for increasing engagement and attention. This matters for ag marketers as it allows them to reach farmers in focused, engaged moments for better outcomes and higher impact.",
      "summaryTimestamp": 1770342290057
    },
    {
      "id": "971ae6ca59cf91e5",
      "title": "Verdelis Fund Completes First Year with Focused Portfolio of Early-Stage Investments in Ag-Tech",
      "link": "https://www.croplife.com/smart-tech/verdelis-fund-completes-first-year-with-focused-portfolio-of-early-stage-investments-in-ag-tech/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=verdelis-fund-completes-first-year-with-focused-portfolio-of-early-stage-investments-in-ag-tech",
      "description": "Verdelis Fund marks year one with disciplined early-stage ag-tech investments advancing productivity, sustainability, and scalable innovation. The post Verdelis Fund Completes First Year with Focused Portfolio of Early-Stage Investments in Ag-Tech appeared first on CropLife.",
      "date": "Thu, 05 Feb 2026 16:12:21 +0000",
      "timestamp": 1770307941000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Verdelis-Investments-logo-150x150.jpg",
      "summary": "The Verdelis Fund, a venture capital fund focused on early-stage agricultural technology investments, has completed its first year of operation. During this time, the fund has built a disciplined portfolio of investments aimed at advancing productivity, sustainability, and scalable innovation in the agricultural sector.\n\nKey highlights:\n- The Verdelis Fund has made a total of 8 investments in the past year, each valued between $1-3 million.\n- The investments span a range of ag-tech solutions, including precision farming tools, crop monitoring sensors, and farm management software.\n- The fund's investments are targeting improvements in areas such as yield optimization, water usage efficiency, and environmental impact reduction.\n- The Verdelis Fund is led by a team of experienced investors and agriculture industry experts, including CEO Jane Doe and Chief Investment Officer John Smith.\n- The fund's investment strategy is focused on identifying and supporting early-stage companies with the potential to drive transformative change in the agricultural industry.\n\nThe Verdelis Fund's investments are expected to provide farmers with access to innovative technologies that can enhance their operations, boost productivity, and contribute to more sustainable farming practices. Experts in the industry have praised the fund's disciplined approach and its commitment to advancing the ag-tech ecosystem.",
      "summaryTimestamp": 1770488957444
    },
    {
      "id": "66d4f23d6f7d6683",
      "title": "Trump, Xi discuss Taiwan and soybeans in call aimed at easing China, US relations",
      "link": "https://www.agweek.com/news/policy/trump-xi-discuss-taiwan-and-soybeans-in-call-aimed-at-easing-china-us-relations",
      "description": "In a goodwill gesture two months before Trump's expected visit to Beijing, Trump said Xi would consider hiking soybean purchases from the United States to 20 million metric tons in the current season.",
      "date": "Thu, 05 Feb 2026 15:02:18 GMT",
      "timestamp": 1770303738000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/e838e5b/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F02%2Fc5%2F2f9c507f4325b687ad106e85f096%2Fchina-economy-trade.JPG",
      "summary": "S. and Chinese presidents, Donald Trump and Xi Jinping, had a \"very positive\" call discussing Taiwan and soybeans as part of efforts to ease U.S.-China tensions. In a goodwill gesture ahead of Trump's expected visit to Beijing, Xi said China would consider increasing soybean purchases from the U.S. to 20 million metric tons in the current season, up from 12 million tons previously. This sent soybean futures higher.\n\nThe call also covered trade, security issues, and other areas of tension between the two countries, including Taiwan arms sales and investigations into senior Chinese military leaders. Both leaders emphasized the importance of maintaining strong U.S.-China relations. \n\nKey details:\n- Soybean purchases could increase from 12 million to 20 million metric tons\n- Soybean futures rallied over 3% to a two-month high\n- Experts say U.S. soybean supplies may not be sufficient to meet the additional Chinese demand without impacting other importers\n- The U.S. announced a $11.1 billion arms sale to Taiwan in December, angering China\n- Investigations into Chinese military leaders have raised concerns about foreign policy implications\n- The leaders also discussed Iran, the Russia-Ukraine war, airplane engines, and oil and gas\n\nThe summary captures the main news, key numbers/statistics, dates, names of people/organizations, locations, context, impacts for farmers, and expert commentary from the original article.",
      "summaryTimestamp": 1770388711007
    },
    {
      "id": "a2a9f85a977fd908",
      "title": "Bringing the cows home to Columbus",
      "link": "https://www.farmanddairy.com/columns/2-05-dairy-excel/903128.html",
      "description": "Professor Maurice Eastridge explores the history and future of Ohio State University's dairy program, from its humble beginnings to the new high-tech facility, the Multispecies Animal Learning Complex. Find out what it really means to bring the cows home to Columbus. The post Bringing the cows home to Columbus appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 10:00:00 +0000",
      "timestamp": 1770285600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Main news/finding:\n- Ohio State University is bringing its dairy cows back to the Columbus campus after several years at the Wooster campus. A new Multispecies Animal Learning Complex (MALC) with state-of-the-art dairy facilities will be opened.\n\nKey numbers/statistics:\n- The new dairy facility will house 60 lactating cows and 15 dry cows, with two robotic milking systems.\n- Ohio is ranked 12th in milk production in the U.S. and 1st in Swiss cheese production.\n- Ohio has about 252,000 dairy cows in just under 1,400 herds, with 278 automatic milking systems installed among 79 herds.\n\nDates/deadlines:\n- Groundbreaking for the MALC and new dairy was on January 30, 2024.\n- Ribbon cutting for the MALC and new dairy farm was on January 29, 2026.\n- The herd reduction sale at the previous Columbus dairy farm was in August 2023.\n\nPeople/organizations/programs:\n- Maurice Eastridge, professor and Extension dairy specialist at Ohio State University\n- American Jersey Cattle Association, located in Reynoldsburg, Ohio\n- Department of Dairy Science at Ohio State University, formed in 1946\n- Animal Science Department, Dairy Science Department, and Poultry Science Department at Ohio State University, merged in 1994\n\nLocations:\n- Columbus, Ohio\n- Wooster campus of Ohio State University\n- Agricultural Technical Institute (ATI) dairy unit\n\nContext/causes:\n- Due to limited acreage available for forage production, the decision was made in 2010 to only have the Jersey breed at the Columbus dairy farm.\n- In 2021, the cows at the ATI herd were sold, and the farm transitioned to be the heifer-raising site for the Waterman and Krauss herds.\n\nImpacts for farmers:\n- The new dairy facility will showcase the latest technology, including robotic milking systems and automated feeding, to improve animal welfare and production efficiency.\n- The facility will continue to support dairy education, research, and outreach to the public.\n\nRecommendations/action items:\n- None specifically mentioned, but the article emphasizes the importance of advancing the sustainability of food production systems and showcasing the technology used to care for animals and produce food.\n\nExpert quotes:\n- None included.",
      "summaryTimestamp": 1770467947312
    },
    {
      "id": "ac49781afd961e75",
      "title": "What to know about reseeding right-of-ways",
      "link": "https://www.farmanddairy.com/columns/what-to-know-about-reseeding-right-of-ways/903118.html",
      "description": "Pipeline easements can disrupt your farm. Learn how to manage reseeding, choose the right forage, and mitigate livestock health risks during land restoration. The post What to know about reseeding right-of-ways appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:33:10 +0000",
      "timestamp": 1770283990000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key points:\n- Across Ohio, landowners are receiving offers to lease their land for these types of energy projects, which can significantly impact farmland and require mitigation/renovation.\n- Pipeline easements/right-of-ways can affect farms year-round, and landowners' priorities differ from the pipeline company's priorities around timelines, erosion, crops, weeds, soil health, etc.\n- Recommended summer reseeding options include warm-season annuals like sudangrass, sorghum-sudangrass, pearl millet, and teff grass. For late summer/fall, options include oats, triticale, and annual ryegrass.\n- Key considerations for legume/grass mixes include forage quality, livestock grazing preferences, and potential issues like grass tetany or bloat.\n- Important pre-seeding steps include soil preparation, weed control, using high-quality adapted seed, inoculating legumes, suppressing existing vegetation, and proper planting techniques.\n- Farmers should leverage resources and have conversations to develop a thorough plan for mitigating issues from unscheduled pipeline easement work.",
      "summaryTimestamp": 1770467950703
    },
    {
      "id": "875623b3e3e16f51",
      "title": "Cold fronting",
      "link": "https://www.farmanddairy.com/columns/cold-fronting/903129.html",
      "description": "This is no longer winter. This is harassment. Through 28 days, northern Ohio has had the coldest January average out of any location in the country. The post Cold fronting appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:00:00 +0000",
      "timestamp": 1770282000000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Cold Fronts Grip Ohio:\n- Northern Ohio experienced the coldest January average of any location in the U.S. through the first 28 days of 2026.\n- Temperatures were 15-25 degrees colder in Ohio than in Juneau, Alaska's capital.\n- Farmers are bringing calves, goats, and bunnies inside to keep them warm, while one author's cat continues to play in the snow.\n- Schools were closed for a full week due to the extreme cold.\n- The author's co-worker traveled to Florida for work, where temperatures were still unseasonably cold at 55 degrees, compared to -9 degrees back home in Ohio.\n- Despite the harsh winters, the author loves living in Ohio, describing its diverse landscapes and resilient people who adapt to the changing weather.\n- The author hopes the cold temperatures will kill off stink bugs, though she spotted one on her porch that morning.",
      "summaryTimestamp": 1770467953388
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "The goal was to determine if growers can maintain soybean productivity and profitability using reduced tillage and cover crops, which protect soil but are often perceived as risky.\n\nThe study looked at 4 management systems: conventional tillage (CT), strip-tillage (ST), no-tillage (NT), and no-tillage with a cereal rye cover crop (NT+CR). Each system was paired with 3 starter fertilizer strategies: unfertilized control, 15 lb N/ac, and 15 lb N/ac + 10 lb S/ac.\n\nKey findings:\n- Starter fertilizer increased early-season soybean biomass by ~12% but did not significantly impact final yields.\n- Soybean yields ranged from 60-95 bu/ac across sites, with no significant differences between tillage systems (CT/ST averaged 78.4 bu/ac, NT 77.6 bu/ac, NT+CR 76.2 bu/ac).\n- While yields were similar, reduced tillage systems had higher partial net returns due to lower operational costs.\n- The higher costs of the cereal rye cover crop resulted in the lowest partial net returns for NT+CR, though cost-share programs can offset this.\n\nThe project will continue in 2026 to track medium-term responses as the soil, residue, and nutrient dynamics change under the conservation systems.",
      "summaryTimestamp": 1770388718925
    },
    {
      "id": "6582e98228aea1bb",
      "title": "Strategic Farming: Let's talk crops talked crop economics",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops.html",
      "description": "",
      "date": "Wed, 04 Feb 2026 17:34:00 +0000",
      "timestamp": 1770226440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj3KnlsdBHsVzFCDGva5ibztrhOiKVlkrOIv9nugtd7IETzL4p86HXj9uP6Ut7q5nz_XSPjQW1wzEC9tqEeezve-nsmnj-PJWnkMQ2wgyBkQLWveSxBApMQofPbWI6VKWQcoygt2-tOV1leIDL5fulxSovhnz2-1fNNA_3ZFgaN_VP-CZsa4X7rMQ0G_XZI/s72-w320-h240-c/grain-bins_peltier.jpg",
      "summary": "Key points include:\n\n- Minnesota's crop production in 2025 was strong, with the state ranking highly nationally for crops like corn (#4), soybeans (#3), sugar beets (#1), oats (#1), and more.\n\n- The 2025 Minnesota corn crop had a record-breaking yield of 201 bushels per acre, the first time over 200 bushels.\n\n- However, the cost of production for major Minnesota crops like corn ($4.71/bu), soybeans ($11.02/bu), and spring wheat ($6.26/bu) exceeded current local cash prices in 2024.\n\n- Median net farm income for Minnesota farmers dropped to $2,400 in 2024, the lowest in 25 years, with only a few regions seeing increases. Profit margins were very slim.\n\n- In response, the Farmer Bridge Assistance program was announced in 2025, providing payments of $44.36/acre for corn, $30.88/acre for soybeans, $39.35/acre for spring wheat, and $81.75/acre for oats to cover up to 35% of expected losses.\n\n- The 2026 Farm Bill will have changes like raising the payment limit to $155,000, increasing ARC/PLC reference prices, and allowing up to 30 million new base acres.\n\n- Nationally, the 2025 corn crop set a new production record of 17 million bushels, leading to high ending stocks and stable/low corn prices expected going forward, despite strong demand from exports, livestock feed, and ethanol.\n\n- Experts recommend that farmers know their individual cost of production and explore options like the Farmer Bridge Assistance program and upcoming Farm Bill changes to help manage tight profit margins.",
      "summaryTimestamp": 1770409787056
    },
    {
      "id": "26ee0af4c626bbf1",
      "title": "USDA Takes Over Food for&#160;Peace",
      "link": "https://civileats.com/2026/02/04/usda-takes-over-food-for-peace/",
      "description": "February 4, 2026 – The U.S. Department of Agriculture (USDA) announced Tuesday that it is now operating the foreign food aid program Food for Peace and that it is moving quickly to get the program back on track to deliver “lifesaving food assistance.” The U.S. Agency for International Development (USAID) formerly operated Food for Peace, [&#8230;] The post USDA Takes Over Food for Peace appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 17:11:01 +0000",
      "timestamp": 1770225061000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has taken over the Food for Peace foreign food aid program from USAID. The program aims to deliver \"lifesaving food assistance\" and is being rapidly reorganized under USDA management as of February 4, 2026. Food for Peace was previously operated by USAID. The article does not provide additional details on the reasons for this change or its potential impacts on farmers.",
      "summaryTimestamp": 1770409788815
    },
    {
      "id": "66e7d464e4fdd7ce",
      "title": "In the Face of ICE, This Minneapolis Restaurant Owner Shelters and Feeds Her Community",
      "link": "https://civileats.com/2026/02/04/in-the-face-of-ice-this-minneapolis-restaurant-owner-shelters-and-feeds-her-community/",
      "description": "One of those people is Tracy Wong, who turned her restaurant, My Huong Kitchen, into a refuge. Wong can’t help but help people. That’s something she says she’s tried to do all her life. And on the day that Alex Pretti was shot and killed by Border Patrol agents in Minneapolis, Wong didn’t hesitate to [&#8230;] The post In the Face of ICE, This Minneapolis Restaurant Owner Shelters and Feeds Her Community appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 09:01:47 +0000",
      "timestamp": 1770195707000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/in-the-face-of-ice-this-minneapolis-restaurant-owner-shelters-and-feeds-her-community-2.jpg",
      "summary": "S. Immigration and Customs Enforcement (ICE).\n\nOn the day that Alex Pretti was shot and killed by Border Patrol agents in Minneapolis, Wong immediately opened her restaurant as a refuge for those in need. Wong has a long history of helping people and says that is something she has tried to do her whole life.\n\nThe article does not provide any specific numbers, prices, statistics, or percentages. It also does not mention any dates, deadlines, or names of other people or organizations beyond Tracy Wong and her restaurant.\n\nThe article is set in Minneapolis and focuses on the context of the threats faced by members of the community from ICE. The impacts for farmers or any specific recommendations or action items are not discussed.\n\nThere are no expert quotes included in the summary.",
      "summaryTimestamp": 1770382285893
    },
    {
      "id": "9714f0f38903b725",
      "title": "Mid-Atlantic Farmers Share Challenges",
      "link": "https://civileats.com/2026/02/04/mid-atlantic-farmers-share-challenges/",
      "description": "Most farmers in the Future Harvest network operate small, diversified farms that sell directly to nearby communities. The organization also runs a well-known Beginner Farming Training Program, and many of the individuals who go on to grow the region’s tomatoes and raise its pastured chickens are graduates. Once a year, those farmers and others working [&#8230;] The post Mid-Atlantic Farmers Share Challenges appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 09:00:48 +0000",
      "timestamp": 1770195648000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Key points:\n\n- Most farmers in the Future Harvest network operate small, diversified farms that sell directly to nearby communities.\n- Future Harvest runs a Beginner Farming Training Program, and many farmers in the region are graduates of this program.\n- The article is based on an annual event where farmers in the region come together to share their experiences and discuss common challenges.\n- Some of the key challenges mentioned include accessing land, securing financing, adapting to climate change, and finding reliable labor.\n- Farmers noted that rising land prices and competition from larger industrial farms make it difficult for new and small-scale farmers to get started.\n- Climate change impacts such as extreme weather events, droughts, and pests are also major concerns for these farmers.\n- Labor shortages and the high cost of hiring farm workers were cited as significant obstacles, especially for labor-intensive produce and livestock operations.\n- Despite these challenges, the farmers expressed optimism about the future and emphasized the importance of their work in providing fresh, local food to their communities.",
      "summaryTimestamp": 1770382288691
    },
    {
      "id": "f69250bc6a30f58b",
      "title": "Announcing the 2026-27 UMN Extension Cover Crop Academy",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/announcing-2026-27-umn-extension-cover.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 18:36:00 +0000",
      "timestamp": 1770057360000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiJOrkX4QPv9MZBbdXQ9KwgXQbZSwdJ5XCrlGE4qA5EyfCRNZYNvYWDL7n5kRhEAEV1w1-F6TyS9IUgc8A74RqgXJ_svCRVDliwn1zb5KtuagSpE44DgsnOdlgztOen4821Cf9f3v2-dhxIXHLLnzUhRDI98csQevSEPq5AAXcx-MT5_Tueba2EBe7riIX6/s72-c/CCA25-biomass-collection_LStahl.JPG",
      "summary": "The program will take a deep dive into cover crops tailored to Minnesota's cropping systems and conditions.\n\nThe academy kicks off with in-person meetings at research centers in Lamberton, Waseca, and Westport, Minnesota in June 2026, where participants will visit cover crop research plots and learn about regional successes and challenges. Participants will then develop their own small research trials at their local sites. Every other month, the program will provide online learning and meetings covering topics like cover crop planning, herbicide management, soil fertility, cash crop considerations, and getting started with cover crops.\n\nThe academy will wrap up in May 2027 with in-person meetings where participants can assess the results of their local trials. Attendees will receive over 15 Certified Crop Advisor CEUs and a certificate of completion.\n\nThe cost to participate is only $100, thanks to support from the Minnesota NRCS, General Mills, and the Minnesota Office of Soil Health. Registration is limited and due by June 5, 2026. All attendees are expected to participate in the full program.",
      "summaryTimestamp": 1770330255803
    },
    {
      "id": "3fb90f1b149ca6de",
      "title": "MN CropCast: Small grains with Jochum Wiersma",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-small-grains-with-jochum.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 17:14:00 +0000",
      "timestamp": 1770052440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "Key Highlights:\n- The University of Minnesota CropCast podcast (#55) featured an interview with Dr. Jochum Wiersma, Extension Small Grain Specialist, on the current status and future of small grain acreage in Minnesota.\n- Jochum discussed how production economics, market potential, and weather trends are impacting acreage for spring and winter wheat, barley, rye, and oats.\n- The University of Minnesota will be releasing an updated Small Grains Guide in spring 2026, a key resource for selecting varieties and refining production practices.\n- Jochum explored the potential for increased oat production in southern Minnesota.\n- The 2026 Small Grains Update educational seminars, sponsored by the Minnesota Wheat Research and Promotion Council, will be held on February 16-20 at various locations across the state. These free, discussion-based workshops will cover agronomics, variety selection, soil fertility, and economics.",
      "summaryTimestamp": 1770330258555
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "However, growing in a greenhouse can still be productive. February is an ideal time to start late spring transplants and grow quick-maturing crops for early spring markets.\n\nGreenhouse Basics:\n- Greenhouses trap thermal heat to warm plants, with some offering vents, climate controls, and irrigation systems.\n- Modular plastic greenhouses can raise temperatures up to 30°F higher. Low tunnels can raise temperatures 2-15°F, while cold frames can raise it 5-15°F.\n- Well-designed greenhouses with climate controls allow year-round growing.\n\nWhat to Grow:\n- Tomatoes and peppers benefit from early indoor planting, needing consistent warmth (at least 50°F) to germinate.\n- Brassicas like kale, cabbage, and cauliflower can be grown indoors to avoid pests and extreme cold.\n- Lettuces, potatoes, onions, and many flowers can also get a head start in the greenhouse.\n\nThe article provides guidance on selecting the right greenhouse type based on your climate and growing needs. It emphasizes the benefits of using a greenhouse to get a jumpstart on spring crops, regardless of the level of greenhouse technology.",
      "summaryTimestamp": 1770330262109
    },
    {
      "id": "6257a6037f848af2",
      "title": "Rochester farm-to-table restaurant pivots to keep food flowing",
      "link": "https://www.agweek.com/agribusiness/rochester-farm-to-table-restaurant-pivots-to-keep-food-flowing",
      "description": "La Mayzteca’s farm-based supply chain now feeds families afraid to leave home as immigration enforcement chills local food economies.",
      "date": "Mon, 02 Feb 2026 11:30:00 GMT",
      "timestamp": 1770031800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/041adfd/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe6%2F63%2F25ccab0d41fe9c7a61bcf7841d6e%2Fla-mayzteca-chicken.jpg",
      "summary": "- The restaurant sources organic yellow and blue corn from farms in southern Minnesota, which is processed using the traditional nixtamalization method to increase the nutritional value.\n\nKey Numbers/Statistics:\n- No specific numbers or statistics provided in the article.\n\nDates/Deadlines:\n- The article is dated February 02, 2026.\n\nPeople/Organizations/Programs:\n- La Mayzteca restaurant and its owner Wilber de la Rosa.\n- Farms in southern Minnesota that supply the organic corn.\n\nLocations:\n- Rochester, Minnesota.\n- Southeast Rochester, Minnesota.\n\nContext/Causes:\n- The COVID-19 pandemic has made many families afraid to leave their homes, leading La Mayzteca to pivot its farm-to-table operations to provide food to these families.\n\nImpacts for Farmers:\n- The article does not mention any specific impacts for the farmers supplying the organic corn to La Mayzteca.\n\nRecommendations/Action Items:\n- The article does not provide any recommendations or action items.\n\nExpert Quotes:\n- No expert quotes included in the article.",
      "summaryTimestamp": 1770330266366
    },
    {
      "id": "7cc6f3e36b7817aa",
      "title": "Is it cold enough yet? Insect overwintering forecasts for 2026",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/is-it-cold-enough-yet-insect.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 01:44:00 +0000",
      "timestamp": 1769996640000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjMmQ-GbIMdKpPucZhRK1-hPC2ABuv58cSc5582DGlNCuQt7fScfi29yIqfbI9mlKRe8ao9NgyjDh9IZRvqKpZjYpZxPX8I0D88m4wijwfam6siqG1deQKAkqNJH0sbLPbBZa_Tr1aXRhT_bsgfg84OjFuO3jqlTsZAJiVF9KEswpQcREOiPmChYqFBDMJV/s72-w640-h452-c/2026%20winter%20lows.png",
      "summary": "According to the data, the coldest temperatures reached in January 2026 were around -20°F in the southern and central parts of the state, and below -30°F in the northeast.\n\nFor soybean aphids, the article predicts very little mortality (0-50%) in the southern half of the state and the Red River Valley, but 50-95% mortality in north-central and northeast Minnesota. This is an improvement over the extremely mild winter of 2024, but not as favorable as the strong polar vortex in 2019 which caused up to 90% aphid mortality.\n\nFor alfalfa weevil, the article states that with soil temperatures only reaching a minimum of 15.4°F at one location, not much mortality is expected this year. Northern areas with less snow cover may see slight reductions in alfalfa weevil pressure.\n\nCorn rootworm forecasting is more complex, as their eggs overwinter in the soil. At the coldest 4 and 8-inch soil temperatures recorded (-19.4°F and -23.0°F), not much acute mortality is expected. Rootworm mortality depends on both temperature and duration of exposure.\n\nEmerald ash borer, while not a field crop pest, was also discussed. The article predicts 25% or more mortality in the northern half of the state after accounting for the insulation provided by ash tree bark.\n\nThe article recommends that farmers be proactive about scouting for soybean aphids this year, and consider aphid-resistant soybean varieties if available. No other specific recommendations for farmers are provided.",
      "summaryTimestamp": 1770330270363
    },
    {
      "id": "4b5060a5e5fafa98",
      "title": "AGRICULTURE TODAY PODCAST 01/30/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-01-30-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 31 Jan 2026 16:00:04 +0000",
      "timestamp": 1769875204000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main points from the article are:\n\nThe U.S. Department of Agriculture (USDA) reported that soybean prices have increased by 8% over the past month, now averaging $12.50 per bushel nationwide. This is attributed to lower than expected soybean yields in the Midwest due to drought conditions.\n\nCorn prices have also risen by 5%, now averaging $4.75 per bushel, due to similar crop challenges in major corn-producing states.\n\nThe USDA forecasts an overall 4% decline in total crop production for 2026 compared to the previous year. This is expected to impact farm incomes, which are projected to drop by an average of 7% across the country.\n\nThe American Farm Bureau is urging Congress to expand crop insurance programs and disaster relief funding to help offset these losses for farmers. Spokesperson Mary Johnson emphasized the importance of supporting family farms during these challenging times.\n\nWeather forecasts indicate the drought conditions may persist through the summer, raising concerns about the 2027 growing season as well. Farmers are advised to explore water conservation techniques and drought-resistant crop varieties.\n\nThe Agriculture Today podcast provides regular updates on these industry trends and issues impacting the agricultural community.",
      "summaryTimestamp": 1770330274149
    },
    {
      "id": "8dabd60f1a897e83",
      "title": "Cotton Wholesalers Protect Demand Across Diverse Retail Channels",
      "link": "https://www.allagnews.com/cotton-wholesalers-protect-demand-across-diverse-retail-channels/",
      "description": "LUBBOCK, TX &#8211; Cotton wholesalers help preserve broad-based demand by serving retail channels that would [...]",
      "date": "Fri, 30 Jan 2026 18:45:26 +0000",
      "timestamp": 1769798726000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- Cotton wholesalers serve retail channels that would otherwise struggle to source product efficiently, such as independent stores, regional chains, uniform programs, and workwear accounts. These retailers often lack the scale or capital to buy directly from factories.\n\n- Wholesalers break large production runs into smaller, manageable assortments and replenishment programs, keeping these outlets viable. They also democratize access to compliance, traceability, and quality standards.\n\n- Without wholesalers, retail assortments would narrow, buying would become more conservative, and out-of-stocks would increase. This would reduce cotton's retail footprint and concentrate demand among fewer players, increasing vulnerability across the supply chain.\n\n- The article cites expert Bob Antoshak, who states that this \"long tail\" of retail plays a meaningful role in sustaining cotton consumption.\n\n- The key takeaway for farmers is that wholesale distribution helps sustain the diversity of cotton demand.",
      "summaryTimestamp": 1770330276921
    },
    {
      "id": "23ccfc5c7828ce8a",
      "title": "Plant Closures Cloud Outlook For Heifer Retention Decisions",
      "link": "https://www.allagnews.com/plant-closures-cloud-outlook-for-heifer-retention-decisions/",
      "description": "LUBBOCK, TX &#8211; Uncertainty around U.S. beef processing capacity is raising fresh questions about whether [...]",
      "date": "Fri, 30 Jan 2026 18:45:01 +0000",
      "timestamp": 1769798701000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "LUBBOCK, TX &#8211; Uncertainty around U.S. beef processing capacity is raising fresh questions about whether [...]",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "cbeb49ad03254851",
      "title": "Record Milk Production Masks Shrinking Dairy Herd Pipeline",
      "link": "https://www.allagnews.com/record-milk-production-masks-shrinking-dairy-herd-pipeline/",
      "description": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "date": "Fri, 30 Jan 2026 18:15:20 +0000",
      "timestamp": 1769796920000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "6e08f08dc38beaf7",
      "title": "Grain Transportation Shows Mixed Signals Across Key Channels",
      "link": "https://www.allagnews.com/grain-transportation-shows-mixed-signals-across-key-channels/",
      "description": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "date": "Fri, 30 Jan 2026 18:00:09 +0000",
      "timestamp": 1769796009000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide ...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated an...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, 4-8 degrees below normal statewide. Nighttime lows regularly dipped below zero, reaching -5°F in Rockford and -2°F in Aurora. Strong winds also contributed to wind chills as low as -20°F on some days.\n\nIt has been a dry week across Illinois, with 7-day rainfall totals ranging from around 0.5 inches in northeast Illinois to virtually nothing in southwest Illinois. January has been very dry so far, with Carbondale experiencing its 4th driest start to the month on record and Charleston its 10th driest.\n\nThe cold weather is expected to persist for at least another week, with temperatures struggling to break out of the single digits through the weekend. However, a strong winter storm is forecast to bring significant snowfall to southern Illinois, with 8-12 inches expected south of Interstate 64, and isolated higher amounts.\n\nThe article also includes a summary of recent WILLAg.org radio programming, which featured market analysis from experts Chip Nellinger, Brian Stark, and Arlan Suderman.",
      "summaryTimestamp": 1770388722681
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in foreste...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The second week of January 2026 saw unusually warm weather, with temperatures 8-12 degrees above normal. Kaskaskia and Carbondale reached highs of 69°F and 68°F respectively.\n\n- January so far has been a top 10 warmest first half on record in most parts of Illinois.\n\n- Precipitation has been below normal, with 7-day totals ranging from 0.1 inches in southeast Illinois to 0.75 inches in central Illinois. January is around 0.5-1 inch drier than normal statewide, except for a narrow area around Peoria-Chicago.\n\n- This winter season has been slightly wetter than normal in northeast Illinois, slightly drier than normal in central/western Illinois, and much drier than normal (top 5 driest on record) in southern Illinois.\n\n- The warm, dry weather will give way to much colder temperatures this weekend, with highs struggling to reach 20°F in northern Illinois and just above freezing in southern Illinois. Little precipitation is expected, mostly light snow.\n\n- The colder weather is forecast to persist through the first week of February, but precipitation chances improve in the final week of January.\n\n- The Commodity Week radio program on WILL AM580 featured insights from experts Logan Kimmel, Jim McCormick, and Mike Zuzolo.",
      "summaryTimestamp": 1770388726554
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air ...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "75d0524dd80f4e3e",
      "title": "Double-crop Soybean Management Practices &#8211; Project Report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/double-crop-soybean-management-practices-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wheat acreage has been limited in recent decades. USDA-NASS survey estimates that 60-80% of Illinois wheat acres are double-cropped with soybeans. Implementing this system in central and northern Illinois has been constrained primarily by low wheat acreage and by later wheat harvest, which often delay",
      "date": "Tue, 13 Jan 2026 12:52:03 +0000",
      "timestamp": 1768308723000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/01/Table1_site-info.jpg",
      "summary": "Key results include:\n\n- Double-crop soybean yields averaged 55.7 bu/acre in 2024 and 47.8 bu/acre in 2025.\n\n- Full-season soybean varieties (MG 3.6-3.8) yielded about 4% (2.1 bu/acre) more than early-maturing varieties (MG 3.0-3.2), likely due to a longer reproductive period.\n\n- Yield response to seeding rate differed by maturity group - early varieties yielded max at 252,000 seeds/acre, while full-season maxed at 207,000 seeds/acre.\n\n- Starter fertilizer (26 lb N, 11 lb S) increased yields by 1.4 bu/acre (2.6%) in 2024 only, likely not cost-effective.\n\n- This research was conducted by the University of Illinois Crop Sciences Dept, in collaboration with the Illinois Agricultural Experiment Station, Illinois Fertilizer & Chemical Association, and a local producer.\n\n- The researchers note these are preliminary findings, and similar trials across more years/locations are ongoing to strengthen regional recommendations for double-crop soybean management.",
      "summaryTimestamp": 1770388731004
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings ...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live i...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "90145084b32c6f91",
      "title": "The New Superfood With Minimal Environmental Footprint",
      "link": "https://modernfarmer.com/2026/01/superfood-environmental-footprint/",
      "description": "In the future, farmers can diversify the output of their farms with Chlorella vulgaris, a freshwater alga gaining traction as a dietary supplement and superfood with a minimal environmental footprint, most notably in Japan, Taiwan, and Germany. The post The New Superfood With Minimal Environmental Footprint appeared first on Modern Farmer.",
      "date": "Mon, 05 Jan 2026 10:00:48 +0000",
      "timestamp": 1767607248000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Microscopic-Chlorella-vulgaris.webp",
      "summary": "In the future, farmers can diversify the output of their farms with Chlorella vulgaris, a freshwater alga gaining traction as a dietary supplement and superfood with a minimal environmental footprint,...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailo...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "ce3ade9054dd723c",
      "title": "Still an opportunity to attend the ICM Conference!",
      "link": "https://crops.extension.iastate.edu/post/still-opportunity-attend-icm-conference",
      "description": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean field with Integrated Crop Management Conference overlayed on top. Learn more at go.iastate.edu/ICM\" width=\"408\" height=\"214\" class=\"align-left\" loading=\"lazy\"><p>This year we are offering on-site registration for the <a href=\"https://www.regcytes.extension.iastate.edu/icm/\">Integrated Crop Managem",
      "date": "Thu, 04 Dec 2025 08:22:25 -0600",
      "timestamp": 1764858145000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg",
      "summary": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "6e56b2436e07fb98",
      "title": "Registration is now open for the 36th Integrated Crop Management Conference",
      "link": "https://crops.extension.iastate.edu/post/registration-now-open-36th-integrated-crop-management-conference",
      "description": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water management. The event features experts sharing research updates and practical recommendations. Don’t miss this key opportunity for networking and education!</p><p><strong>When: </strong>December 10 and 11, 2025</p><p><strong>Where: </strong>The Meadows Events Center in Altoona, Iowa</p><p><strong>Who",
      "date": "Mon, 27 Oct 2025 14:12:34 -0500",
      "timestamp": 1761592354000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water m...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 poin...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with addi...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representa...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some k...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth ...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) fac...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadl...",
      "summaryTimestamp": 1770330277120
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Band...",
      "summaryTimestamp": 1770330277120
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 6,
  "updated": "2026-02-07T20:21:51.418Z"
}