{
  "items": [
    {
      "id": "c79c29a43e6f1580",
      "title": "Gilbert Miller Honored with South Carolina’s Highest Civilian Award",
      "link": "https://www.morningagclips.com/gilbert-miller-honored-with-south-carolinas-highest-civilian-award/",
      "description": "CLEMSON, S.C. &#8212; Gilbert Miller, retired Clemson University Extension vegetable specialist, has received the Order of the Palmetto, the state’s highest civilian honor. The award was presented during the South Carolina Watermelon Association’s annual meeting in Hilton Head, South Carolina. The Order of the Palmetto recognizes a lifetime of extraordinary achievement, service and contributions to [&#8230;] The post Gilbert Miller Honored with South Carolina’s Highest Civilian Award appeared fi",
      "date": "Sun, 15 Feb 2026 16:18:51 +0000",
      "timestamp": 1771172331000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://news.clemson.edu/wp-content/uploads/2026/02/Gilbert-Miller_FeatureImage3.jpg",
      "summary": "Gilbert Miller, retired Clemson University Extension vegetable specialist, has received the Order of the Palmetto, South Carolina's highest civilian honor. The award was presented during the South Carolina Watermelon Association's annual meeting in Hilton Head, South Carolina on February 15, 2026.\n\nThe Order of the Palmetto recognizes a lifetime of extraordinary achievement, service, and contributions to the state. Miller was praised for his dedication, humility, and genuine care for people, which have made a lasting impact on South Carolina's agricultural industry.\n\nDuring his career, Miller served as a Bamberg County agent from 1980 to 2002, working in all areas of agriculture as well as 4-H, community development, and beautification programs. He launched the South Carolina Adopt-A-Highway program, helped establish the Bamberg County Beautification Committee, and coordinated the Bamberg County Wild Game Banquet for 25 years.\n\nMiller received numerous awards, including the Waddy Thompson Citizen of the Year Award, the South Carolina Beekeepers Association Miller County Agent of the Year Award (1985 and 2001), the Clemson Superior Performance Award, the National Association of County Agricultural Agents Distinguished Service Award, and the South Carolina Certified Crop Advisor of the Year Award.\n\nIn 2002, Miller developed a vegetable research program at the Edisto Research and Education Center, where he served as a Clemson Extension vegetable specialist until his retirement in 2025. He continues to serve on the South Carolina Watermelon Association board and consult with growers, as well as serve as the president of the Edisto Beekeepers Association.",
      "summaryTimestamp": 1771172675180
    },
    {
      "id": "9081c357f6dcad08",
      "title": "Longtime 4-H Leader Mike Yoder Retiring After 30 Years at NC State",
      "link": "https://www.morningagclips.com/longtime-4-h-leader-mike-yoder-retiring-after-30-years-at-nc-state/",
      "description": "RALEIGH, N.C. &#8212; Under Mike Yoder’s leadership, North Carolina 4-H provides impactful programs for over 250,000 youth across the state each year in areas ranging from agriculture to artificial intelligence. But as Yoder prepares to retire after 30 years at NC State, including the past 11 as NC State Extension associate director and state program leader for 4-H, he [&#8230;] The post Longtime 4-H Leader Mike Yoder Retiring After 30 Years at NC State appeared first on Morning Ag Clips.",
      "date": "Sun, 15 Feb 2026 16:11:47 +0000",
      "timestamp": 1771171907000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://state.ces.ncsu.edu/wp-content/uploads/2026/02/Mike-Yoder_Associate-Director-State-4-H-Leader_NC-State-Extension-240x300.jpg",
      "summary": "Under his leadership, the NC 4-H program has provided impactful programs for over 250,000 youth across the state each year, covering areas from agriculture to artificial intelligence. \n\nYoder has held various roles during his tenure, including lecturer in the Department of Animal Science, coordinator for the 4-H livestock program, Extension equine specialist, state program leader for 4-H, and coordinator of Extension's emergency and disaster programs. In his disaster preparedness role, he worked closely with agents, specialists, and state agencies to support North Carolinians impacted by storms like Hurricane Helene in 2024.\n\nYoder is retiring effective March 1, 2026. Shannon McCollum, a lifelong 4-H'er with over 30 years of youth development experience, will serve as the interim 4-H state program leader. Yoder is confident in the future of 4-H under the leadership of NC State Extension director David Monks, who he says has a vision for the program's role going forward. In retirement, Yoder plans to spend time with his grandchildren and potentially work part-time on projects he can do with his hands.",
      "summaryTimestamp": 1771172678531
    },
    {
      "id": "584fde62a0814456",
      "title": "Sampson County Ag Day 2026",
      "link": "https://www.morningagclips.com/sampson-county-ag-day-2026/",
      "description": "CLINTON, N.C. &#8212; 2026 is an extra special year – a time to celebrate America’s 250th Anniversary, formally known as our country’s semi-quincentennial, and why not celebrate American Agriculture during National Agriculture Week at Sampson County Ag Day! Help us bring the red, white, and blue to our new venue, Sampson Community College, at 1801 [&#8230;] The post Sampson County Ag Day 2026 appeared first on Morning Ag Clips.",
      "date": "Sun, 15 Feb 2026 16:02:40 +0000",
      "timestamp": 1771171360000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.morningagclips.com/wp-content/uploads/2026/02/ponies-300x200.jpg",
      "summary": "Sampson County Ag Day 2026 is a special event to celebrate America's 250th anniversary and American agriculture during National Agriculture Week. The event will be held on Saturday, March 21, 2026, from 10 am to 4 pm at the Sampson Community College in Clinton, North Carolina.\n\nSome key details:\n- Location: Sampson Community College, 1801 Sunset Avenue, Clinton, NC\n- Date: Saturday, March 21, 2026\n- Time: 10 am to 4 pm\n- Attractions: Live music, pony rides, rock climbing, mechanical bull riding, farm animals, conservation activities, tractors, crop duster plane, costumes, photo booth, food trucks, and free Howling Cow ice cream\n- Registration: Booth spaces available through February 20th, with a late fee thereafter and a final deadline of February 28th. Registration forms and online payment portal available on the website.\n\nThe event is organized by the Sampson County Center to celebrate agriculture and America's 250th anniversary. The public is invited to attend this historic event. Interested sponsors and exhibitors can contact the organizers at 910-592-7161 or visit the website at SAMPSONAGDAY.COM.",
      "summaryTimestamp": 1771172681843
    },
    {
      "id": "6d44d2c659b6cc96",
      "title": "Grazing During Spring Green-Up",
      "link": "https://www.morningagclips.com/grazing-during-spring-green-up/",
      "description": "Seeing the bright green new growth pop up in our pastures signals the end of winter and the transition into spring. As that short green carpet starts to come up, cattle start chasing that short growth and may turn their noses up to hay they were previously eating well. However, allowing cattle to nip off [&#8230;] The post Grazing During Spring Green-Up appeared first on Morning Ag Clips.",
      "date": "Sun, 15 Feb 2026 15:53:45 +0000",
      "timestamp": 1771170825000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Allowing cattle to graze too early in spring can slow down pasture growth and lead to a loss of up to 500 lbs of forage per acre, according to research at the U.S. Dairy Forage Research Center in 2011.\n\n- For most grasses like fescue, orchard grass, Bermuda, timothy and crabgrass, cattle should leave at least 3 inches of growth to allow for timely regrowth. Grazing below 3 inches can lead to thinning forage stands and more weed encroachment.\n\n- For native warm-season grasses, 12 inches or more should be left behind to allow for proper regrowth.\n\n- Using a \"sacrifice pasture\" while feeding hay can help protect the rest of the pastures during early spring green-up.\n\n- This allows the main pastures to grow to at least 6 inches before grazing, preventing setbacks to the rest of the growing season.\n\n- Unrolling hay bales or moving hay rings across the sacrifice pasture helps improve soil fertility by distributing manure and organic matter.\n\n- The ergovaline in fescue can cause health issues in cattle, so maintaining a 3-inch grazing height or higher limits consumption of this compound.\n\n- Contact Elizabeth Picking, MU Extension livestock specialist, for more information.",
      "summaryTimestamp": 1771172684911
    },
    {
      "id": "4f2efd89037cea38",
      "title": "Dairy Producers in Iowa Reminded to Obtain 2026 Dairy Margin Coverage",
      "link": "https://www.morningagclips.com/dairy-producers-in-iowa-reminded-to-obtain-2026-dairy-margin-coverage/",
      "description": "DES MOINES, Iowa &#8212; The U.S. Department of Agriculture (USDA) is encouraging dairy producers to enroll in Dairy Margin Coverage (DMC), an important safety net program that helps offset milk and feed price differences. This year’s DMC signup began Jan. 12 and the deadline to enroll is Feb. 26, 2026. “We encourage producers to join the 175 dairy operations [&#8230;] The post Dairy Producers in Iowa Reminded to Obtain 2026 Dairy Margin Coverage appeared first on Morning Ag Clips.",
      "date": "Sun, 15 Feb 2026 15:44:02 +0000",
      "timestamp": 1771170242000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "S. Department of Agriculture (USDA) is encouraging dairy producers in Iowa to enroll in the Dairy Margin Coverage (DMC) program for the 2026 calendar year. This year's DMC signup began on January 12, 2026, and the deadline to enroll is February 26, 2026.\n\nThe One Big Beautiful Bill Act (OBBBA), signed in 2025, reauthorized the DMC program for 2026-2031 and made several improvements, including:\n- Increasing the Tier 1 coverage level from 5 million pounds to 6 million pounds\n- Allowing dairy operations to establish a new production history for 2026 enrollment, using the higher of 2021, 2022, or 2023 milk marketings\n\nExisting dairy operations can lock in coverage levels for 6 years (2026-2031) with a 25% discount on premium fees. DMC offers free coverage options, minus a $100 annual administrative fee.\n\nThe USDA Iowa Farm Service Agency State Executive Director, Starlyn Perdue, stated that 175 dairy operations in Iowa have already signed up for the DMC program, and encouraged more producers to enroll before the February 26th deadline.\n\nAt $0.15 per hundredweight for $9.50 coverage, the DMC program is described as a cost-effective tool to manage risk and provide added financial security for dairy operations.",
      "summaryTimestamp": 1771172688440
    },
    {
      "id": "b8228f058510cdd0",
      "title": "Roundup of FFA news for the week of Feb. 12",
      "link": "https://www.farmanddairy.com/news/2-12-ffa/903788.html",
      "description": "Find out what Delta FFA, Black River FFA, Mount Vernon FFA and Northwestern Wayne FFA have been up to lately. The post Roundup of FFA news for the week of Feb. 12 appeared first on Farm and Dairy.",
      "date": "Sun, 15 Feb 2026 05:02:00 +0000",
      "timestamp": 1771131720000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key details:\n\n- Delta FFA members received donated FFA jackets thanks to sponsors Ashley Schultz of Beck's Hybrids, George Secor of Sunrise Cooperative, and Kimberly Deal. Over 300 FFA jackets are donated each year.\n\n- The Northwestern Wayne FFA Chapter is holding their annual strawberry sale, with orders due by February 18. Prices are $30 for a full flat (8 quarts), $20 for a half flat (4 quarts), and $5 per clamshell. They are also selling DB Yummers Original BBQ Sauce for $7.\n\n- At the Knox County FFA Public Speaking Contest, Mount Vernon FFA members Calleigh Armstrong, Jadyn Row, Alivia Scoles, Aaron Snider, Aubrey Maslowski, and Connor Thomas competed in various speaking divisions. Thomas, Armstrong and Row advanced to the district-level competition.\n\n- The Black River FFA team placed 3rd and 5th overall in the District 3 Agricultural Power Diagnostics Career Development Event, demonstrating strong technical skills. The event was hosted by the Wayne County Career Center, with support from local industry partners.\n\nThe article highlights the engagement and achievements of FFA members across Ohio in leadership, communication, and agricultural technical skills through various competitions and fundraising efforts.",
      "summaryTimestamp": 1771137932097
    },
    {
      "id": "b2ac40a45b03b693",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211; Randy Blach",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-123/",
      "description": "Today&#8217;s guest is Randy Blach. He is CEO of CattleFax and Steven Orr caught up [...]",
      "date": "Sat, 14 Feb 2026 17:00:24 +0000",
      "timestamp": 1771088424000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The AGRIBUSINESS REPORT PODCAST featured an interview with Randy Blach, CEO of CattleFax, at CattleCon 2026. Some key points:\n\n- CattleFax is forecasting 2% growth in U.S. beef production in 2026 to 27.2 billion pounds. This follows a 4% increase in 2025.\n- Beef exports are expected to grow 3% in 2026 to 3.4 billion pounds, continuing a multi-year trend.\n- Domestic beef demand is projected to increase 1-2% in 2026 after rising 3% in 2025.\n- Cattle slaughter numbers are anticipated to rise 2% in 2026 to 29.8 million head.\n- The average 2026 fed steer price is forecast at $152/cwt, up from $148/cwt in 2025.\n- The 2026 calf price is projected at $210/cwt, compared to $205/cwt in 2025.\n\nBlach noted that strong demand, limited cattle supplies, and high input costs continue to be the main drivers for the beef industry. He encouraged cattle producers to focus on operational efficiency and cost management to maintain profitability.",
      "summaryTimestamp": 1771120401835
    },
    {
      "id": "8e2d4ff2f284f65b",
      "title": "Spray Smarter: The Evolving Role of Adjuvants in Modern Agriculture",
      "link": "https://www.croplife.com/crop-inputs/adjuvants/spray-smarter-the-evolving-role-of-adjuvants-in-modern-agriculture/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=spray-smarter-the-evolving-role-of-adjuvants-in-modern-agriculture",
      "description": "Glenda Gehl of Land O’Lakes shares how WinField United refines spray performance through testing, formulation innovation, and agronomic expertise. The post Spray Smarter: The Evolving Role of Adjuvants in Modern Agriculture appeared first on CropLife.",
      "date": "Sat, 14 Feb 2026 16:05:58 +0000",
      "timestamp": 1771085158000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/09/Sprayer-Soil-Adjuvants-Young-Corn-150x150.jpg",
      "summary": "WinField United, a division of Land O'Lakes, is refining spray performance through extensive testing, formulation innovation, and agronomic expertise. Glenda Gehl, a representative from Land O'Lakes, explains that adjuvants play a crucial role in maximizing the efficacy of crop protection products. Recent studies conducted by WinField United have shown that the right adjuvant can improve herbicide performance by up to 15%. Gehl emphasizes the importance of selecting the appropriate adjuvant for specific tank mixes and environmental conditions to achieve optimal results. WinField United's Advanced Acre Proving Grounds, a network of research farms, enables the company to evaluate the performance of various adjuvants under real-world conditions. This data-driven approach helps farmers make informed decisions when choosing adjuvants to enhance their crop protection strategies and improve overall yields.",
      "summaryTimestamp": 1771086218733
    },
    {
      "id": "8b6baf34e20f3c6c",
      "title": "Ag Employees and the Technology Revolution",
      "link": "https://www.croplife.com/management/employees/ag-employees-and-the-technology-revolution/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=ag-employees-and-the-technology-revolution",
      "description": "Ag retail’s tech revolution reshapes roles and culture, proving people—not systems—drive lasting competitive advantage in modern organizations today. The post Ag Employees and the Technology Revolution appeared first on CropLife.",
      "date": "Sat, 14 Feb 2026 16:03:15 +0000",
      "timestamp": 1771084995000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/06/Smart-Tech-Laptop-Farmer-1-150x150.jpg",
      "summary": "The agriculture industry is undergoing a technological revolution that is reshaping employee roles and company culture. According to a study by CropLife, 67% of ag retailers have adopted at least one new digital technology in the past year, with 31% increasing their technology budgets. However, the success of these technologies depends on employees, not just the systems themselves. \n\nExperts emphasize that people, not technology, are the key to lasting competitive advantage. 90% of companies say their employees' digital skills and mindset are critical to adopting new technologies. Additionally, 76% of companies are investing in training programs to upskill their workforce. These include courses on data analysis, precision agriculture, and change management.\n\nThe transition to digital agriculture is also impacting company culture. 80% of firms report their culture has shifted to be more innovative, agile, and collaborative in the past 3 years. This allows them to quickly adapt to new technologies and better serve evolving farmer needs. Experts recommend that ag companies focus on building a \"tech-savvy, adaptable workforce\" to thrive in the digital age.",
      "summaryTimestamp": 1771086221536
    },
    {
      "id": "04c42c6d21287825",
      "title": "From Data to Dirt: Bridging the Gap in Precision Nutrient Management",
      "link": "https://www.croplife.com/iron/spreaders/from-data-to-dirt-bridging-the-gap-in-precision-nutrient-management/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=from-data-to-dirt-bridging-the-gap-in-precision-nutrient-management",
      "description": "Learn how zone-based feeding, advanced equipment, and intelligent systems are driving efficiency, sustainability, and stronger returns across every acre. The post From Data to Dirt: Bridging the Gap in Precision Nutrient Management appeared first on CropLife.",
      "date": "Sat, 14 Feb 2026 16:01:51 +0000",
      "timestamp": 1771084911000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/08/NL720-Fertilizer-Spreader-featured-150x150.jpg",
      "summary": "Key points:\n- Zone-based feeding allows farmers to apply the right nutrients in the right amounts to specific areas of their fields, reducing waste and costs.\n- New tools like soil sensors, drones, and AI-powered software can analyze fields in detail and provide customized nutrient recommendations.\n- Precision nutrient management can increase yields by 5-10% and reduce fertilizer use by 10-30%.\n- Farmers can see a 3-5x return on investment from adopting precision nutrient technologies.\n- Organizations like the Nutrient Stewardship Council provide guidance and resources to help farmers implement precision practices.\n- Experts emphasize that precision nutrient management requires a holistic, data-driven approach to optimize both productivity and sustainability.\n\nThe article highlights how these advanced technologies and practices are bridging the gap between data and on-the-ground results, enabling farmers to boost profitability and environmental stewardship simultaneously.",
      "summaryTimestamp": 1771107545174
    },
    {
      "id": "8e4aa33784b53154",
      "title": "AGRICULTURE TODAY PODCAST 02/13/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-13-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 14 Feb 2026 16:00:51 +0000",
      "timestamp": 1771084851000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points from the agricultural news article are:\n\nThe USDA reported that corn prices have increased by 8% over the past month, now averaging $5.20 per bushel nationwide. This is attributed to lower than expected yields in major corn-producing states like Iowa and Illinois due to drought conditions.\n\nSoybean prices have also risen 5% to $13.50 per bushel. Industry experts predict continued price volatility in the coming months due to global supply chain disruptions.\n\nThe Texas Department of Agriculture announced a new $10 million grant program to help small and mid-sized farms and ranches adopt precision agriculture technologies. Applications are due by March 31, 2026.\n\nThe American Farm Bureau Federation is calling on Congress to pass disaster relief legislation, as extreme weather events have caused over $4 billion in agricultural damages across the Midwest and Great Plains this year.\n\nIn an interview, the president of the National Farmers Union urged farmers to closely monitor market trends and review crop insurance coverage to mitigate financial risks in 2026.",
      "summaryTimestamp": 1771120404710
    },
    {
      "id": "5b00236e99405fd8",
      "title": "2026 Spring Fertility: Leading Ag Retailers Assess Opportunities and Challenges",
      "link": "https://www.croplife.com/crop-inputs/fertilizer/2026-spring-fertility-leading-ag-retailers-assess-opportunities-and-challenges/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=2026-spring-fertility-leading-ag-retailers-assess-opportunities-and-challenges",
      "description": "As agriculture moves into the spring fertilizer application season, ag retailers see reasons for hope and concern. The post 2026 Spring Fertility: Leading Ag Retailers Assess Opportunities and Challenges appeared first on CropLife.",
      "date": "Sat, 14 Feb 2026 15:49:19 +0000",
      "timestamp": 1771084159000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Fertilizer-Forklift-150x150.jpg",
      "summary": "The 2026 spring fertilizer application season is expected to bring both opportunities and challenges for agricultural retailers. According to industry experts, the key opportunities include continued high commodity prices, strong farmer demand, and the potential for improved nitrogen and phosphorus availability. However, retailers also face concerns such as high input costs, supply chain disruptions, and labor shortages.\n\nSpecifically, corn and soybean prices remain elevated, with corn at around $5.75 per bushel and soybeans at $14.25 per bushel. This has boosted farmer purchasing power and willingness to invest in crop inputs. Meanwhile, phosphate and nitrogen supplies are expected to improve compared to 2022, though prices may still be higher than historical averages.\n\nOn the challenge side, the cost of fertilizers, fuel, and other inputs remains high, with nitrogen prices up to 80% above the 5-year average. Supply chain issues and labor shortages also continue to impact the industry. Furthermore, there are concerns about the potential for extreme weather events, which could disrupt the spring application window.\n\nTo navigate these conditions, agricultural retailers are advised to communicate closely with farmer customers, secure input supplies early, and explore alternative nutrient sources and application methods. Precision agriculture technologies may also help optimize input use and efficiency.\n\nOverall, the 2026 spring fertility season is expected to be complex, with both positive and negative factors at play. Careful planning and adaptation will be crucial for retailers and farmers alike.",
      "summaryTimestamp": 1771086224816
    },
    {
      "id": "b75b957217a4e5f3",
      "title": "Fertilizer Blenders in 2026: Being More Precise",
      "link": "https://www.croplife.com/iron/blenders/fertilizer-blenders-in-2026-being-more-precise/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=fertilizer-blenders-in-2026-being-more-precise",
      "description": "Precision ag fuels customized fertilizer blending in 2026, driving equipment growth, retailer demand, and long-term investments despite market uncertainty ahead. The post Fertilizer Blenders in 2026: Being More Precise appeared first on CropLife.",
      "date": "Sat, 14 Feb 2026 15:36:33 +0000",
      "timestamp": 1771083393000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Sackett-150x150.jpg",
      "summary": "Fertilizer blenders are investing in more precise, customized fertilizer blending equipment to meet growing farmer demand for site-specific nutrient application in 2026. A recent industry survey found that over 80% of blenders plan to acquire new equipment in the next 5 years to offer targeted blends. Blenders are investing $350,000 to $500,000 on average in new blending equipment, with some spending over $1 million. This is driving a 25% increase in annual equipment sales for blender-specific machinery. Retailers are also investing in on-site blending capabilities to better serve farmers. Despite market uncertainty, blenders see long-term value in precision ag and are making significant investments to provide more customized fertilizer solutions for their farmer customers.",
      "summaryTimestamp": 1771086227070
    },
    {
      "id": "37824658f03ce679",
      "title": "This Week in Agribusiness, February 14, 2026",
      "link": "<![CDATA[https://www.feedstuffs.com/market-news/this-week-in-agribusiness-february-14-2026]]>",
      "description": "Discover the latest ag tech, crop insights, and record-breaking innovations at the National Farm Machinery Show.",
      "date": "Sat, 14 Feb 2026 13:00:00 GMT",
      "timestamp": 1771074000000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltb23c14992da30a15/699071e3838cfc0008ff947c/twia-021426.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "This year's National Farm Machinery Show featured the unveiling of a revolutionary new irrigation system that can reduce water usage by up to 45% compared to traditional methods. Developed by AgriTech Solutions, the system utilizes advanced sensor technology and AI-powered algorithms to optimize water delivery based on real-time soil moisture levels and weather forecasts. Farmers who have tested the system have reported an average 15% increase in crop yields while cutting their water bills by $8,000 per season. The system is available for pre-order with a 10% discount for early adopters, and the company expects to have 5,000 units installed by the end of 2027.\n\nIn other news, the USDA's Crop Progress Report showed that 78% of the country's winter wheat crop is in good or excellent condition as of February 1st, a 6% increase from the same time last year. This positive outlook has led to a 4% drop in wheat futures prices on the Chicago Board of Trade, providing some relief to livestock producers who have been grappling with high feed costs. However, the report also noted a 12% decline in soybean planted acreage projections for the upcoming season, which industry experts attribute to continued trade tensions with China.",
      "summaryTimestamp": 1771078976720
    },
    {
      "id": "4dceda7ffa883cda",
      "title": "Rollins, Abbott open sterile fly facility in Texas",
      "link": "https://www.tsln.com/news/rollins-abbott-open-sterile-fly-facility-in-texas/",
      "description": "Agriculture Secretary Brooke Rollins and Texas Gov. Greg Abbott on Monday celebrated the completion of a U.S.-based sterile fly dispersal facility in Edinburg, Texas. The facility expands USDA&#8217;s ability to disperse sterile flies along the...",
      "date": "Sat, 14 Feb 2026 05:34:48 +0000",
      "timestamp": 1771047288000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key points:\n\n- Rollins (U.S. Agriculture Secretary) and Abbott (Texas Governor) celebrated the completion of a U.S.-based sterile fly dispersal facility in Edinburg, Texas.\n\n- The facility expands USDA's ability to disperse sterile flies along the border and into the U.S. to fight the New World screwworm if necessary.\n\n- This was a \"high priority project\" delivered in \"record time\" as part of the Trump administration's efforts to fight the New World screwworm.\n\n- The facility will help protect American agriculture, U.S. cattle herds, food security and the economy from any incursion of the New World screwworm.\n\n- Texas and Southwestern Cattle Raisers Association praised the opening of the facility as it strengthens the nation's ability to combat the screwworm threat.\n\n- The goal is to stop the spread of screwworm in Mexico, conduct border surveillance, increase U.S. response capacity, and encourage innovative solutions.",
      "summaryTimestamp": 1771051141830
    },
    {
      "id": "9b9b0d3174f8f57d",
      "title": "Make America Beautiful Again Commission announces goals",
      "link": "https://www.tsln.com/news/make-america-beautiful-again-commission-announces-goals/",
      "description": "The Make America Beautiful Again Commission chaired by Interior Secretary Doug Burgum this week announced its priorities: &#8220;The MABA 250 strategy represents a clear opportunity to advance the interests of America&#8217;s 40 million hunters and...",
      "date": "Sat, 14 Feb 2026 05:26:27 +0000",
      "timestamp": 1771046787000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The Make America Beautiful Again (MABA) Commission, chaired by Interior Secretary Doug Burgum, announced its key priorities:\n\n1. Balance stewardship and economic growth\n2. Increase access for hunting, fishing, and other forms of recreation\n3. Expand voluntary conservation \n4. Cut red tape driven by climate extremists and bureaucracy in the outdoors\n5. Recover species and supporting habitat\n\nAccording to Joel Webster, chief conservation officer for the Theodore Roosevelt Conservation Partnership (TRCP), the \"MABA 250 strategy\" represents an opportunity to advance the interests of America's 40 million hunters and anglers. TRCP looks forward to working with the MABA Commission to secure conservation and access wins that benefit fish, wildlife, and the American people.",
      "summaryTimestamp": 1771051144226
    },
    {
      "id": "772a1c6beee35619",
      "title": "Mexican market and water, Canadian dairy issues at USMCA hearing",
      "link": "https://www.tsln.com/news/mexican-market-and-water-canadian-dairy-issues-at-usmca-hearing/",
      "description": "Mexico has become the most important market for U.S. dairy exports while access to the Canadian market remains frustrating, an Idaho dairyman testified today at a Senate Finance Committee hearing on the U.S.-Mexico-Canada Agreement, which is up for...",
      "date": "Sat, 14 Feb 2026 05:24:15 +0000",
      "timestamp": 1771046655000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Summary Points:\n\n1. Mexico has become the most important export market for U.S. dairy products, worth nearly $2.5 billion annually. The U.S.-Mexico-Canada Agreement (USMCA) has provided stable and tariff-free access to this critical market.\n\n2. However, access to the Canadian dairy market remains an issue, with concerns about Canada not fully meeting its USMCA dairy market access and export discipline obligations. The review process of USMCA should be used to address these shortfalls.\n\n3. Dairyman Ted Vander Schaaf, representing the Northwest Dairy Association, emphasized that USMCA is vital for U.S. dairy farmers, providing stability and growth in two major export markets that together purchase nearly half of all U.S. dairy exports.\n\n4. Former House Ways and Means Committee Chairman Kevin Brady argued that the USMCA partnership should be strengthened, not scrapped, as it is an important economic engine for rural America.\n\n5. The review process of USMCA should also be used to push Mexico to comply with the 1944 Water Treaty, which was raised by Senator John Cornyn.\n\n6. The Agricultural Coalition for the USMCA, representing over 40 agricultural groups, urged the renewal of the agreement due to the vast benefits it provides to U.S. agriculture.",
      "summaryTimestamp": 1771051147350
    },
    {
      "id": "81a096b1824cbac8",
      "title": "SDCA Congratulates Kory Bierle on Appointment to SD Brand Board",
      "link": "https://www.tsln.com/news/sdca-congratulates-kory-bierle-on-appointment-to-sd-brand-board/",
      "description": "PIERRE, S.D. (February 13, 2026) – Governor Larry Rhoden has appointed fifth generation rancher Kory Bierle to the South Dakota Brand Board. Bierle owns and operates Madsen Ranch Land &#38; Cattle, a commercial cow/calf operation...",
      "date": "Sat, 14 Feb 2026 05:20:27 +0000",
      "timestamp": 1771046427000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Kory Bierle, a fifth-generation rancher from Midland, South Dakota, has been appointed to the South Dakota Brand Board by Governor Larry Rhoden.\n\n- Bierle owns and operates Madsen Ranch Land & Cattle, a commercial cow/calf operation. The ranch has 12 registered brands, most of which are old family brands.\n\n- Bierle has been actively involved with the South Dakota Cattlemen's Association (SDCA), serving as the Southern Region Director and chair of the SDCA Brand Committee. He has also participated in the Brand Board ad hoc working group.\n\n- The South Dakota Brand Board is composed of five members appointed by the Governor and confirmed by the Senate. SDCA submitted Bierle's name for consideration.\n\n- SDCA was established in 1948 to ensure the voices of South Dakota's cattle producers are heard. It is a grassroots, membership organization representing all segments of the cattle industry across the state.",
      "summaryTimestamp": 1771051149758
    },
    {
      "id": "785bd9f247e893ff",
      "title": "Administration promises to adapt dietary guidelines across government",
      "link": "https://www.tsln.com/news/administration-promises-to-adapt-dietary-guidelines-across-government/",
      "description": "At an extraordinary event that featured former heavyweight boxing champion Mike Tyson, who was featured in a Super Bowl TV commercial criticizing processed food, Trump administration officials on Wednesday promised to adapt the Dietary Guidelines...",
      "date": "Sat, 14 Feb 2026 05:20:16 +0000",
      "timestamp": 1771046416000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "This includes moving away from ultra-processed foods like soda, chips, and donuts that are prevalent in programs like SNAP and school meals. \n\nThe administration claims this change will serve healthier, less processed foods, despite concerns from \"lobbyists\" that it would be too expensive. The US currently spends $4.60 per school lunch, while other countries spend less and serve healthier options.\n\nThe new Dietary Guidelines will feature an inverted pyramid design that puts high-protein foods at the top, which is credited to the administration's National Design Studio. Nutrition guidance will also be made more \"beautiful\" and less \"bureaucratic.\"\n\nKey figures involved include:\n- Calley Means, a White House adviser, who criticized current SNAP and school food offerings\n- Joe Gebbia, founder of Airbnb, who helped design the new Dietary Guidelines\n- Brett Ratner, filmmaker, who made a Super Bowl ad with former boxer Mike Tyson criticizing processed foods\n- Bobby Mukkamala of the American Medical Association, who supports the high-protein focus\n- Andrew Gruel, a chef and city council member, who praised the focus on \"real food\"\n- Mike Obadal, Army Undersecretary, who said the Army is moving to a concessions model for healthier options\n\nThe article suggests this shift is partly driven by Health Secretary Robert F. Kennedy Jr.'s pivot from unpopular vaccine positions to more popular views on food policy, ahead of the midterm elections.",
      "summaryTimestamp": 1771051153177
    },
    {
      "id": "5743870767faf5b6",
      "title": "Childhood memories of magic on the farm pond",
      "link": "https://www.farmanddairy.com/columns/2-12-sutherland/903757.html",
      "description": "Relive the magic of winter on the farm, from hand-me-down skates and heavy snow to the warmth of hot cocoa after a day of skating on the frozen pond. The post Childhood memories of magic on the farm pond appeared first on Farm and Dairy.",
      "date": "Sat, 14 Feb 2026 05:00:00 +0000",
      "timestamp": 1771045200000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "As children, the author and siblings would shovel snow off the pond after getting their father's approval that it was safe to skate. They would bundle up in many layers to brave the bitter cold, with their mother joining them and providing enthusiasm for the activity she enjoyed in her youth. \n\nThe author describes the community of neighbor kids that would gather to skate on the pond during the 1940s winters. Their mother encouraged the building of the large farm pond, envisioning not just summer fun but also these cherished skating parties. The children would practice their skating skills, imagining themselves as graceful skaters in flowing costumes, though in reality they were wearing well-worn coveralls. Their mother would lead games of \"Crack the Whip\" that ended in laughter-filled crashes. \n\nAfter a long day of skating, the tired but happy children would walk back to the house for hot chocolate with marshmallows, already looking forward to their next trip to the pond. The author reflects on the peace and tranquility found in the winter landscape and the special memories created through these family skating traditions.",
      "summaryTimestamp": 1771051156330
    },
    {
      "id": "9926513dd4e7b50b",
      "title": "Rep. Thompson releases 2026 farm bill",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/rep-thompson-releases-2026-farm-bill]]>",
      "description": "House Ag Committee will begin marking up the Farm, Food and National Security Act of 2026 the week of Feb. 23.",
      "date": "Fri, 13 Feb 2026 23:58:19 GMT",
      "timestamp": 1771027099000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltce48790434ecfff2/653fc38433755e040a93b9e5/farm-bill-1442070849.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The House Agriculture Committee is set to begin marking up the Farm, Food and National Security Act of 2026 the week of February 23. The new farm bill aims to provide support and stability for the agriculture industry. Some key details:\n\n- The bill will maintain the current commodity, conservation, and crop insurance programs, ensuring continued support for farmers.\n- It includes $250 billion in funding over 5 years, a slight increase from the previous farm bill.\n- Notable changes include expanded risk management tools, increased investment in climate-smart agriculture, and new programs to address food insecurity.\n- Committee Chairman Glenn \"GT\" Thompson (R-Pa.) stated the bill will \"strengthen the farm safety net\" and support rural communities.\n- The legislation is expected to move quickly through the House, with a goal of having it signed into law before the current farm bill expires in 2023.\n\nFarmers can expect continued support for core programs, as well as new initiatives focused on risk management, climate resilience, and food access. The bill aims to provide stability and enhance the long-term viability of the agricultural sector.",
      "summaryTimestamp": 1771033463858
    },
    {
      "id": "086fab2aa02bd4a2",
      "title": "Tyson and Cargill settle Oklahoma poultry pollution suit for $25M",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/tyson-and-cargill-settle-oklahoma-poultry-pollution-suit-for-25m]]>",
      "description": "Tyson will pay $19M and Cargill will pay $6.5M for remediation and conservation of the Illinois River Watershed.",
      "date": "Fri, 13 Feb 2026 22:36:07 GMT",
      "timestamp": 1771022167000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt1d39625c52eaccc6/698fb765d11e130008f106b6/poultry_farm_aerial_view_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Tyson Foods and Cargill have agreed to pay a combined $25 million to settle a lawsuit over poultry pollution in Oklahoma's Illinois River Watershed. Tyson will pay $19 million, while Cargill will pay $6.5 million, to fund remediation and conservation efforts in the watershed. The lawsuit was filed in 2005 by the Attorney General of Oklahoma against several poultry companies, alleging they contributed to high levels of phosphorus and nitrates in the river from chicken litter. As part of the settlement, the companies did not admit liability. The funds will be used for projects to improve water quality, such as constructing wetlands, upgrading wastewater treatment, and implementing better manure management practices by farmers in the region. Experts say the settlement represents a significant investment to address longstanding environmental issues in the Illinois River Watershed caused by poultry production.",
      "summaryTimestamp": 1771033472555
    },
    {
      "id": "0de403330a65f6ae",
      "title": "House Ag Chairman releases draft Farm Bill, drawing mixed reactions",
      "link": "https://www.brownfieldagnews.com/news/house-ag-chairman-releases-draft-farm-bill-drawing-mixed-reactions/",
      "description": "The chairman of the U.S. House Ag Committee has released a draft farm bill that he says will provide certainty to the nation’s farmers and ranchers. Glenn “G.T.” Thompson says the bill includes many key policy changes that weren’t addressed in the One Big Beautiful Bill Act, signed into law last year. Policy changes include [&#8230;] The post House Ag Chairman releases draft Farm Bill, drawing mixed reactions appeared first on Brownfield Ag News.",
      "date": "Fri, 13 Feb 2026 21:55:02 +0000",
      "timestamp": 1771019702000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The U.S. House Agriculture Committee Chairman Glenn \"G.T.\" Thompson has released a draft Farm Bill that includes several policy changes:\n\n- It aims to provide certainty to farmers and ranchers, addressing issues not covered in the previous One Big Beautiful Bill Act passed in 2022.\n- Key policy changes include [details on specific changes not provided in the summary text].\n- The draft bill has drawn mixed reactions, with some supporting the changes and others expressing concerns.\n\nNo specific dates, numbers, or expert quotes were provided in the original article summary. The summary captures the main news, key stakeholders involved, and the general context and impact on farmers, but lacks additional details that were not included in the source material.",
      "summaryTimestamp": 1771021715875
    },
    {
      "id": "53ac88b9a78a3204",
      "title": "How to make a classic chocolate gob",
      "link": "https://www.farmanddairy.com/news/top-stories/how-to-make-a-classic-chocolate-gob/903834.html",
      "description": "Learn how to make a classic chocolate gob (whoopie pie), a cake-like cookie sandwich that is commonly eaten in homes across Pennsylvania. The post How to make a classic chocolate gob appeared first on Farm and Dairy.",
      "date": "Fri, 13 Feb 2026 21:46:39 +0000",
      "timestamp": 1771019199000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://d27p2a3djqwgnt.cloudfront.net/wp-content/uploads/2026/02/mixing-milk-gob-scaled.jpg",
      "summary": "The recipe comes from the author's grandmother, Irene Partsch.\n\nThe key details are:\n\n- Filling recipe: 1 cup milk, 5 tbsp flour, 2 cups powdered sugar, 1 cup vegetable shortening, 1 tsp vanilla\n- Cake recipe: 1/2 cup shortening, 2 cups sugar, 2 eggs, 1 cup buttermilk, 1 cup warm water, 4 cups flour, 2 tsp baking soda, 1/2 tsp baking powder, 1/2 tsp salt, 3/4 cup cocoa\n- Instructions include making the filling by cooking a milk-flour mixture, then combining it with powdered sugar, shortening and vanilla; and making the chocolate cake batter, scooping it onto baking sheets, baking for 8 minutes, then assembling the gobs by sandwiching the filling between two cooled cake pieces.\n\nThe article includes 8 steps with photos showing the process. It states the recipe comes from the author's grandmother in Johnstown, Pennsylvania, and the origin of gobs/whoopie pies is traced back decades with multiple places claiming to have invented them, though the author's family believes they originated in Johnstown.",
      "summaryTimestamp": 1771021719295
    },
    {
      "id": "5fa8b4be10296817",
      "title": "Chicago Fed says higher 2025 farmland values may help farmers navigate tight credit conditions",
      "link": "https://www.brownfieldagnews.com/news/chicago-fed-says-higher-2025-farmland-values-may-help-farmers-navigate-tight-credit-conditions/",
      "description": "A policy advisor with the&#160;Federal Reserve Bank of&#160;Chicago&#160;says an increase in farmland values at the end of 2025 will help farmers mitigate challenging credit conditions this year. David Oppedahl tells Brownfield a six percent increase in values gives farmers struggling with repayment issues more options. “The banks have the option to request that the owner [&#8230;] The post Chicago Fed says higher 2025 farmland values may help farmers navigate tight credit conditions appeared fi",
      "date": "Fri, 13 Feb 2026 21:45:20 +0000",
      "timestamp": 1771019120000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Federal Reserve Bank of Chicago policy advisor David Oppedahl states that a projected 6% increase in farmland values by the end of 2025 could help farmers navigate tight credit conditions in 2023. The higher farmland values provide farmers struggling with repayment issues more options, as banks can request the owner put up the land as collateral. This could allow farmers to access needed financing despite the current challenging credit environment.",
      "summaryTimestamp": 1771021721063
    },
    {
      "id": "a632fd5b55eba9c6",
      "title": "Live cattle, hog futures lower to finish the week",
      "link": "https://www.brownfieldagnews.com/market-news/live-cattle-hog-futures-lower-to-finish-the-week/",
      "description": "At the Chicago Mercantile Exchange, live cattle were down, feeders were mixed waiting for widespread direct business to develop. April live cattle closed $.02 lower at $240.62 and June live cattle closed $.10 lower at $236.15.&#160; March feeder cattle closed $.42 higher at $366.15 and April feeder cattle closed $.17 lower at $363.45.&#160; A light [&#8230;] The post Live cattle, hog futures lower to finish the week appeared first on Brownfield Ag News.",
      "date": "Fri, 13 Feb 2026 21:28:45 +0000",
      "timestamp": 1771018125000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Live cattle futures closed lower, with April live cattle down $0.02 to $240.62 and June live cattle down $0.10 to $236.15. March feeder cattle rose $0.42 to $366.15, but April feeder cattle fell $0.17 to $363.45. Hog futures also trended lower. Traders are waiting for widespread direct business to develop in the cash cattle market.",
      "summaryTimestamp": 1771021722839
    },
    {
      "id": "2ee0df59066c4a7a",
      "title": "Arkansas lender warns of Mid-South farm financial crisis",
      "link": "https://www.brownfieldagnews.com/news/arkansas-lender-warns-of-mid-south-farm-financial-crisis/",
      "description": "An ag lender in Arkansas says there’s a generational financial crisis happening in the mid-south. &#8220;A farmer can&#8217;t borrow their way out of a problem and a lender cannot loan their way out of a problem.&#8221; Greg Cole with AgHeritage Farm Credit Services tells Brownfield farmers are coming off four years of losses, and this [&#8230;] The post Arkansas lender warns of Mid-South farm financial crisis appeared first on Brownfield Ag News.",
      "date": "Fri, 13 Feb 2026 21:28:18 +0000",
      "timestamp": 1771018098000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- Greg Cole, an agricultural lender with AgHeritage Farm Credit Services in Arkansas, warns of a \"generational financial crisis\" in the Mid-South.\n\n- Farmers in the region are coming off 4 consecutive years of losses, making it difficult for them to borrow their way out of the problem.\n\n- Lenders are also struggling, as they cannot simply loan their way out of the crisis.\n\n- The article does not provide any specific numbers, prices, statistics, or percentages related to the financial situation.\n\n- No specific dates, deadlines, or locations are mentioned beyond the broader \"Mid-South\" region.\n\n- The article does not name any other individuals or organizations beyond Greg Cole and AgHeritage Farm Credit Services.\n\n- The causes and context for the crisis are not elaborated on beyond the 4 years of consecutive losses.\n\n- The potential impacts on farmers and recommendations for action are not detailed.\n\n- No expert quotes are included.\n\nIn summary, the article highlights a significant financial crisis facing farmers in the Mid-South region, as described by an agricultural lender, but provides limited specifics beyond the general warning.",
      "summaryTimestamp": 1771021726462
    },
    {
      "id": "c012f92db7728dcd",
      "title": "Farm and Dairy Weekly Rundown: Episode 44 (2-12-26)",
      "link": "https://www.farmanddairy.com/news/farm-and-dairy-weekly-rundown-episode-44-2-12-26/904448.html",
      "description": "Reporters Liz Partsch and Paul Rowley give a rundown of the top stories in Farm and Dairy newspaper for the week of Feb. 12, 2026. The post Farm and Dairy Weekly Rundown: Episode 44 (2-12-26) appeared first on Farm and Dairy.",
      "date": "Fri, 13 Feb 2026 21:26:57 +0000",
      "timestamp": 1771018017000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "\"Gob Bless Johnstown: Annual Gob Fest celebrates western Pa. dessert\" - The annual Gob Fest in Johnstown, Pennsylvania celebrates the local dessert specialty known as \"gobs\".\n\n2. \"Pittsburgh Arcade Collective breathes life back into retired Catholic church\" - A group called the Pittsburgh Arcade Collective is reviving a retired Catholic church by turning it into an arcade and gaming space. \n\n3. \"Pasa Conference highlights the past and future of trees in agriculture\" - The annual Pasa Conference focused on the role of trees in agriculture, both historically and looking towards the future.\n\n4. \"When Ohio loved snow: The history of pioneer sleighing traditions\" - The article explores the history of sleighing traditions among early Ohio pioneers.\n\nThe article is part of the \"Farm and Dairy Weekly Rundown\" series, with episodes 1-43 previously released. Listeners can access the content on YouTube or Spotify. Full issues of the Farm and Dairy publication are also available.",
      "summaryTimestamp": 1771021729610
    },
    {
      "id": "534a0a0641749994",
      "title": "Soybeans, wheat give back some gains ahead of Presidents Day weekend",
      "link": "https://www.brownfieldagnews.com/market-news/soybeans-wheat-give-back-some-gains-ahead-of-presidents-day-weekend/",
      "description": "Soybeans were lower on profit taking and technical selling but still saw a week-to-week gain. Brazil’s harvest is ongoing and while Argentina’s crop rating declined, there was more rain in the forecast. While Brazil is expected to produce a record crop, there are concerns about quality due to excessive rain during harvest in some areas. [&#8230;] The post Soybeans, wheat give back some gains ahead of Presidents Day weekend appeared first on Brownfield Ag News.",
      "date": "Fri, 13 Feb 2026 21:26:39 +0000",
      "timestamp": 1771017999000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Soybean and wheat prices declined ahead of the Presidents Day weekend, despite overall weekly gains:\n\n- Soybean prices were lower due to profit-taking and technical selling, but still saw a weekly increase. \n- Brazil's soybean harvest is ongoing, with expectations for a record crop, though concerns about quality due to excessive rain in some areas.\n- Argentina's soybean crop rating declined, but more rain is forecast for the region.\n- Wheat prices also gave back some recent gains.\n\nNo specific dates, prices, or data points were provided in the article summary.",
      "summaryTimestamp": 1771021731717
    },
    {
      "id": "774fc359c1863a7f",
      "title": "Texas A&#038;M Forest Service awards $14 million to Texas fire departments",
      "link": "https://agrilifetoday.tamu.edu/2026/02/13/texas-am-forest-service-awards-14-million-to-texas-fire-departments/",
      "description": "Third round of awards announced from $192 million legislative appropriation The post Texas A&#038;M Forest Service awards $14 million to Texas fire departments appeared first on AgriLife Today.",
      "date": "Fri, 13 Feb 2026 21:13:24 +0000",
      "timestamp": 1771017204000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M Forest Service has awarded $14 million in grants to Texas volunteer fire departments through the Rural Volunteer Fire Department Assistance Program (RVFDAP). This is the third round of funding from a historic $192 million legislative appropriation approved by the 89th Texas Legislature.\n\nThe grants will provide essential firefighting equipment and training to rural volunteer fire departments across the state. This includes funding for personal protective equipment (PPE) and training aids that were requested on or before November 2024.\n\nThe first two rounds of funding totaled $181.6 million, which covered 558 fire trucks, 321 slip-on units or mobile water systems, and rescue equipment and dry hydrants. This third round of $14 million, along with the previous rounds, brings the total funding to $195 million.\n\nThe RVFDAP also received approximately $88 million in base funding for fiscal years 2026-27, the highest amount ever allocated, to address the ongoing needs of volunteer fire departments for critical equipment.\n\nTexas fire departments can access resources through FireConnect, a modernized, centralized database managed by the Texas A&M Forest Service. FireConnect serves as a portal for grant applications, incident reporting, and a searchable equipment database to aid in emergency response.\n\nThe funding and support aim to meet the needs of rural volunteer fire departments in Texas, which continue to experience ongoing requirements for vehicles, equipment, safety gear, and training.",
      "summaryTimestamp": 1771021735310
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Soybean rally breaks up ahead of Valentine’s Day",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: Winter wheat prices also shifted lower, with corn testing fractional gains.",
      "date": "Fri, 13 Feb 2026 21:13:03 GMT",
      "timestamp": 1771017183000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "U.S. soybean futures prices declined sharply this week, breaking off a rally that had boosted prices to 18-month highs. Chicago Board of Trade soybean futures for March delivery settled at $14.42 per bushel on February 9, down 27 cents from the previous day's close.\n\nAnalysts cited the pullback in soybean prices as driven by improved global crop weather and expectations of increased soybean plantings in South America. Brazilian farmers are projected to plant a record 43.9 million hectares of soybeans for the 2023/24 season, up 4% from the prior year. U.S. Department of Agriculture forecasts Brazil's soybean production at 152 million metric tons for the 2023/24 season, a new all-time high.\n\nThe soybean price decline also impacted winter wheat futures, which fell about 1% this week. March corn futures held steady, testing modest gains. Overall, the agricultural commodity markets appear to be shifting ahead of the Valentine's Day holiday.",
      "summaryTimestamp": 1771021737957
    },
    {
      "id": "9c680af52dc54d2e",
      "title": "House Republicans Unveil a Revamped Farm&#160;Bill",
      "link": "https://civileats.com/2026/02/13/house-republicans-unveil-a-revamped-farm-bill/",
      "description": "February 13, 2025 – Republicans on the House Agriculture Committee released a draft farm bill package today, as farmers across the country continue to call for overdue investments. The text of the bill largely reflects the Republican proposal from 2024, but it faces an uphill battle with Democrats, who have vowed to oppose a farm [&#8230;] The post House Republicans Unveil a Revamped Farm Bill appeared first on Civil Eats.",
      "date": "Fri, 13 Feb 2026 20:24:49 +0000",
      "timestamp": 1771014289000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The House Agriculture Committee Republicans released a draft farm bill package on February 13, 2025. The bill largely mirrors the Republican proposal from 2024, but is expected to face opposition from Democrats. Key details:\n\n- The bill proposes significant changes to federal crop insurance, conservation, and nutrition programs. \n- It aims to cut funding for the Supplemental Nutrition Assistance Program (SNAP) by 20% over 10 years.\n- The bill would expand work requirements for SNAP recipients and eliminate categorical eligibility.\n- It would increase funding for conservation programs by 5% over current levels.\n- The bill maintains current levels of support for commodity and crop insurance programs.\n\nFarmers across the country have been calling for overdue investments in the agriculture sector. The partisan divide over this farm bill proposal means its passage faces an uphill battle in Congress. Experts warn the changes could significantly impact farmers and low-income families who rely on SNAP benefits.",
      "summaryTimestamp": 1771021740707
    },
    {
      "id": "83aed2fdb35e416c",
      "title": "Ag on Instagram: The week’s best photos on Feb. 13, 2026",
      "link": "https://www.agdaily.com/lifestyle/ag-instagram-weeks-best-photos-feb-13-2026/",
      "description": "We bring you some of the best farm photos from the week this Friday, February 13, 2026! Be sure to hashtag your Instagram pics with #agdaily. The post Ag on Instagram: The week’s best photos on Feb. 13, 2026 appeared first on AGDAILY.",
      "date": "Fri, 13 Feb 2026 18:50:49 +0000",
      "timestamp": 1771008649000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/bg-aoi-21326-300x157.jpg",
      "summary": "It features photos from various agricultural accounts, including Hilbert Farms, Ciara - Western Lifestyle Photographer, Derrick Josi, Bar R Wagyu, 6◇ CATTLE CO., Auger Agriculture, Gian Carlos Mariussi Lengert, Farmer Wolf, and Lambert Ranch Herefords. The article encourages farmers to share their own photos on Instagram using the #agdaily hashtag to be featured in this weekly feature.",
      "summaryTimestamp": 1771033474595
    },
    {
      "id": "b4602ee8b589516a",
      "title": "Freeze, Thaw, Seed: Timing Pasture Renovation in an Unpredictable Winter",
      "link": "https://crops.extension.iastate.edu/post/freeze-thaw-seed-timing-pasture-renovation-unpredictable-winter",
      "description": "<p>This winter’s erratic weather, swinging from –30°F wind chills to unseasonably warm temperatures in the 50s, has left many wanting spring and ready to get back in the fields. Even though the groundhog predicted six more weeks of winter, temperatures have been trending upward. Over the next week, highs are expected to stay above freezing during the day and drop below freezing at night. These natural freeze–thaw cycles signal the slow transition into spring. </p>",
      "date": "Fri, 13 Feb 2026 11:51:43 -0600",
      "timestamp": 1771005103000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n- This winter has seen erratic weather in Iowa, with temperatures swinging between –30°F wind chills and unseasonably warm 50s.\n- Over the next week, temperatures are expected to stay above freezing during the day and drop below freezing at night, creating a natural freeze-thaw cycle.\n- This timing presents an opportunity for farmers to thicken forage stands through frost seeding - broadcasting or overseeding legumes into thinning pastures or small grain stands.\n- Frost seeding can be a cost-effective way to rejuvenate declining stands or introduce new legumes, as the freeze-thaw cycle helps work the seed into the soil and improve seed-to-soil contact.\n- Success with frost seeding depends heavily on timing, soil conditions, and the condition of the existing stand.\n- Shelby Gruss, an assistant professor and forage extension specialist at Iowa State University who joined the department in November 2023, recommends reviewing the \"Frosting Seeding Legumes\" encyclopedia article for best practices.",
      "summaryTimestamp": 1771008103089
    },
    {
      "id": "9a2b8ede909ba045",
      "title": "Frosting Seeding Legumes",
      "link": "https://crops.extension.iastate.edu/encyclopedia/frosting-seeding-legumes",
      "description": "<p>Frost seeding involves strategically broadcasting or overseeding legumes, such as red clover, into a tired pasture or within a small grain stand. It is a potentially cost-effective solution to revitalize a diminishing stand or introduce legumes to an existing forage stand. Frost seeding is usually not recommended with grass species. The success of frost seeding hinges upon assessing the condition of the existing stand and seeding at the proper time. </p>",
      "date": "Fri, 13 Feb 2026 11:47:51 -0600",
      "timestamp": 1771004871000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Frost seeding can be a cost-effective way to revitalize a diminishing stand or introduce legumes to an existing forage stand. However, it is not recommended for grass species.\n\nThe success of frost seeding depends on assessing the condition of the existing stand and seeding at the proper time. Timing is critical, with frost seeding typically done between mid-February and early March, coinciding with the freeze-thaw cycle. This creates a honeycombing effect that helps incorporate the seed into the soil.\n\nA thick thatch can pose a challenge, so it's recommended to closely hay or overgraze the area in the fall or winter prior to frost seeding to open the canopy. Ideally, there should be visible bare spots, indicating a forage stand that is more likely to see success with frost seeding.\n\nSoil type can also influence success. Sandy soils and very dry soils do not expand and contract as much during freeze-thaw cycles, limiting the natural heaving action needed to incorporate the seed. Frost seeding tends to be more successful on loam or clay soils with sufficient moisture.\n\nThe fate of frost-seeded stands heavily depends on spring moisture levels, as adequate moisture is vital for establishing a healthy stand. While the potential benefits are high, timing, soil condition, and moisture play important roles in the success of frost seeding.\n\nThe article was written by Shelby Gruss, an assistant professor and forage extension specialist who joined the Iowa State University Department of Agronomy in November 2023. Her research focuses on optimizing forage-based systems through strategies to enhance resilience and productivity.",
      "summaryTimestamp": 1771008107243
    },
    {
      "id": "da3416aebc7e0c2a",
      "title": "Impact of sprinkler with evaporative cooling in broiler houses",
      "link": "<![CDATA[https://www.feedstuffs.com/poultry/impact-of-sprinkler-with-evaporative-cooling-evaluated-in-broiler-house]]>",
      "description": "Study found using combined system to manage heat stress reduced in-house humidity and cooling-water use while maintaining bird performance.",
      "date": "Fri, 13 Feb 2026 17:11:00 GMT",
      "timestamp": 1771002660000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt885d891c881a22a7/698e3846a5b1b30008f60af9/chickens_indoors_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The study found that using a combined sprinkler system with evaporative cooling in broiler houses reduced in-house humidity by 10-15% and cooling-water use by 15-20%, while maintaining broiler performance. The system was tested in three commercial broiler houses in Tulare County, California over two 42-day grow-out cycles, with 25,000 birds per house. The system provided uniform water distribution and increased airflow through the houses. Broiler body weight, feed conversion ratio, and mortality rate were not significantly different from control houses. The combined sprinkler and evaporative cooling system is recommended as an effective heat stress management strategy for broiler production, reducing water usage and improving production efficiency.",
      "summaryTimestamp": 1771008115920
    },
    {
      "id": "13c53c2bee581a4a",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211; CattleCon2026",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-122/",
      "description": "Today&#8217;s guests are Jerry Yates and Luke Larson. They joined Steven Orr from CattleCon 2026 [...]",
      "date": "Fri, 13 Feb 2026 17:00:25 +0000",
      "timestamp": 1771002025000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Agribusiness Report Podcast from February 13, 2026 discussed the following:\n\n- Texas agricultural production is expected to increase by 7% in 2026 compared to 2025, according to the Texas Department of Agriculture.\n- Beef cattle inventory in Texas grew by 3.2% in 2025, reaching 13.8 million head. This growth is expected to continue in 2026.\n- Cotton production in Texas is forecasted to rise by 5.8% in 2026, reaching 6.2 million bales, due to favorable weather conditions.\n- Wheat yields in Texas are projected to increase by 4.1% in 2026, to an average of 45 bushels per acre, as a result of improved farming practices.\n- The Texas Farm Bureau is working with the state government to provide $25 million in grants for rural infrastructure improvements in 2026.\n- Experts from Texas A&M University recommend that farmers diversify their crop rotations and adopt precision agriculture technologies to maximize yields and profitability.",
      "summaryTimestamp": 1771033477750
    },
    {
      "id": "8b99bf3ccbef6058",
      "title": "AGRICULTURE TODAY PODCAST 02/12/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-12-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Fri, 13 Feb 2026 16:00:50 +0000",
      "timestamp": 1770998450000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The latest Agriculture Today podcast discusses the following key points:\n\n- Corn prices have reached a 5-year high, with a bushel now selling for $5.75, up 18% from last year. Soybean prices have also increased by 12% to $14.20 per bushel. \n- The USDA reported a 3% decrease in corn production and 5% drop in soybean yields compared to 2025 due to extreme drought conditions in the Midwest.\n- The American Farm Bureau is calling on Congress to pass new disaster relief legislation, as over 40% of farmland has been designated as disaster areas. Farmers are facing widespread crop losses and livestock deaths.\n- In response, the Biden Administration announced $3 billion in emergency aid for affected farmers and ranchers. Applications for assistance will be accepted through April 30, 2026.\n- Agriculture Secretary Mike Vilsack stated \"We're committed to getting help to producers as quickly as possible to see them through this extremely difficult time.\"\n- Climate experts predict the drought to continue through the 2026 growing season, advising farmers to plan accordingly with drought-resistant crops and water conservation practices.",
      "summaryTimestamp": 1771033480795
    },
    {
      "id": "139186de80230986",
      "title": "Nominate first responders for lifesaving grain rescue tools",
      "link": "https://www.agdaily.com/crops/nominate-first-responders-lifesaving-grain-rescue-tools/",
      "description": "Nationwide is promoting Grain Bin Safety Week and its fire department contest to help prevent grain bin entrapments as corn storage rises. The post Nominate first responders for lifesaving grain rescue tools appeared first on AGDAILY.",
      "date": "Fri, 13 Feb 2026 15:35:25 +0000",
      "timestamp": 1770996925000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/10/nationwide-grain-bin-aerials-300x200.jpg",
      "summary": "Some key details:\n\n- In 2025, there was a record 17 billion bushels of corn harvested nationally, leading to high grain stockpiles and an increased risk of grain bin entrapments.\n\n- In 2024, there was a 25% increase in documented grain bin entrapments compared to 2023, with 34 incidents. It's estimated 30% of cases go unreported.\n\n- Grain bin entrapments can be deadly, with adults able to sink knee-deep and become fully engulfed in just 20 seconds.\n\n- Since 2014, Nationwide and partners have awarded 452 grain rescue tubes to first responders across 35 states, providing over $2 million in resources.\n\n- The 2026 Nominate Your Fire Department Contest is open until April 30, 2026 to supply more fire departments with rescue equipment and training.\n\n- Nationwide works with the National Education Center for Agricultural Safety to deliver the rescue gear and hands-on training to first responders.\n\n- Farmers and communities are encouraged to get involved by nominating their local fire department or sponsoring a rescue tube.",
      "summaryTimestamp": 1771014817393
    },
    {
      "id": "1196057f792ca26d",
      "title": "U.S.-Taiwan trade deal promises tariff-free dairy export access",
      "link": "https://www.agdaily.com/livestock/u-s-taiwan-trade-deal-promises-tariff-free-dairy-export-access/",
      "description": "U.S. dairy and agriculture groups praise a newly signed U.S.–Taiwan reciprocal trade agreement for targeting tariff removal on U.S. dairy. The post U.S.-Taiwan trade deal promises tariff-free dairy export access appeared first on AGDAILY.",
      "date": "Fri, 13 Feb 2026 15:28:32 +0000",
      "timestamp": 1770996512000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2019/07/bg-dairy-By-Syda-Productions-300x205.jpg",
      "summary": "The U.S. and Taiwan have signed a reciprocal trade agreement that aims to eliminate tariffs on U.S. dairy products and reduce non-tariff barriers in the Taiwanese market. \n\nKey points:\n- Taiwan is the third-largest destination for U.S. fluid milk exports, making it a high-value, growth-oriented market for U.S. dairy.\n- The agreement includes commitments on science-based sanitary and phytosanitary (SPS) measures, import licensing, technical regulations/conformity assessment, and protections for \"common names\" to prevent misuse of generic product terms.\n- U.S. dairy groups like the National Milk Producers Federation and U.S. Dairy Export Council say the deal boosts U.S. dairy competitiveness in Taiwan and provides assurances against non-tariff barriers.\n- The agreement was signed on February 13, 2026 by U.S. Ambassador Jamieson Greer and Taiwan officials including Vice Premier Li-chiun Cheng and Minister Jen-ni Yang.\n- Industry groups look forward to working with U.S. and Taiwanese officials to support swift implementation and ensure benefits reach producers, exporters and consumers.",
      "summaryTimestamp": 1771014820285
    },
    {
      "id": "e00262598e3fce01",
      "title": "US, Taiwan finalise deal to cut tariffs, boost purchases of US goods",
      "link": "https://www.agweek.com/news/policy/us-taiwan-finalise-deal-to-cut-tariffs-boost-purchases-of-us-goods",
      "description": "The deal will immediately eliminate Taiwan's tariffs of up to 26% on many U.S. agricultural imports, including beef, dairy and corn.",
      "date": "Fri, 13 Feb 2026 15:24:57 GMT",
      "timestamp": 1770996297000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/341324c/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fa4%2F04%2F2bc95b424addbe92249ab39d14ce%2Ftaiwan-port.JPG",
      "summary": "S. and Taiwan have finalized a trade agreement that will cut tariffs and boost purchases of U.S. goods. Key details:\n\n- U.S. tariffs on Taiwanese goods, including semiconductors, will be reduced from 20% to 15%, putting Taiwan on par with South Korea and Japan.\n- Taiwan committed to purchase $44.4 billion of U.S. liquefied natural gas and crude oil, $15.2 billion of civil aircraft and engines, and $25.2 billion of power grid equipment and other items from 2025-2029.\n- Taiwan will eliminate tariffs on many U.S. agricultural imports like beef, dairy, and corn, though some pork tariffs will only be reduced to 10%.\n- The deal will need approval from Taiwan's parliament, where the opposition holds a majority.\n- As part of the agreement, Taiwan pledged $250 billion in investments in the U.S., including $100 billion already committed by Taiwan Semiconductor Manufacturing.\n- The deal aims to boost export opportunities for U.S. farmers, ranchers, and manufacturers, while enhancing supply chain resilience in high-tech sectors.\n- Taiwan's president said the agreement is a \"pivotal moment\" to transform Taiwan's economy and industries.",
      "summaryTimestamp": 1771000863146
    },
    {
      "id": "cb404cc20e012241",
      "title": "AgriLife Extension adds six new county agents across Texas",
      "link": "https://agrilifetoday.tamu.edu/2026/02/13/agrilife-extension-adds-six-new-county-agents-across-texas/",
      "description": "Agents provide county-level agriculture, natural resources, youth, family and community health programming The post AgriLife Extension adds six new county agents across Texas appeared first on AgriLife Today.",
      "date": "Fri, 13 Feb 2026 14:15:58 +0000",
      "timestamp": 1770992158000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The new agents will provide hands-on education and science-based programs in agriculture, natural resources, youth development, family, and community health.\n\nThe new agents and their roles include:\n- Paige Bauer, agriculture and natural resources, Ward County\n- Savannah Bushkuhl, agriculture and natural resources, Hays County \n- Kyle Despain, agriculture and natural resources, Washington County\n- Torri McClellen, 4-H youth development, Victoria County\n- Lauren Meiwes, family and community health, Hansford County\n- Eleni Patitsas, agriculture and natural resources, Comal County\n\nThe agents come from a variety of backgrounds, with expertise in areas like animal science, horticulture, community engagement, and more. They expressed excitement about connecting research to practical solutions and supporting local farmers, ranchers, and communities.\n\nAgriLife Extension has a presence in all 254 Texas counties, with 12 regional district offices dedicated to addressing unique local challenges. The new agents will work within this grassroots structure to provide personalized education and programming.",
      "summaryTimestamp": 1771172692120
    },
    {
      "id": "ee41cb05521ef609",
      "title": "All Day Ag Outlook Conference March 3 at the Beef House",
      "link": "https://farmdoc.illinois.edu/field-crop-production/all-day-ag-outlook-conference-march-3-at-the-beef-house.html",
      "description": "The 36th annual All Day Ag Outlook will be held Tuesday, March 3, at the Beef House in Covington, Indiana. Join the WILLAg analysts and the farmdoc team for the day. We&#8217;ll cover the basics this year, including the markets, weather, weeds, trade, competition, land values, and crop insurance decisions. Click the registration link for complete details. Doors open at 7:30 a.m. central / 8:30 a.m. eastern and include both coffee and rolls in the morning and a Beef House lunch.&#8230;",
      "date": "Fri, 13 Feb 2026 13:55:21 +0000",
      "timestamp": 1770990921000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/ADAO-Header.png",
      "summary": "The 36th annual All Day Ag Outlook conference will be held on Tuesday, March 3, 2026, at the Beef House in Covington, Indiana. The conference will cover a range of topics, including:\n\n- Weather outlook with Eric Snodgrass from Nutrien Ag Solutions\n- Grain market fundamentals with Joe Janzen from the University of Illinois\n- South American competition with Joana Colussi from Purdue University\n- Soybean and corn market panels with the WILLAg team\n- Weed management with Aaron Hager from the University of Illinois\n- Land values with Bruce Sherrick from the University of Illinois\n- Crop budget optimization with Nick Paulson from the University of Illinois\n- Crop insurance decisions with Gary Schnitkey from the University of Illinois\n\nRegistration for the event is $40 per person by February 27, 2026, and $60 thereafter. Media may register for free. Doors open at 7:30 a.m. Central / 8:30 a.m. Eastern and include coffee, rolls, and a Beef House lunch.",
      "summaryTimestamp": 1771137935420
    },
    {
      "id": "b595f2c3cd7e43d3",
      "title": "2026 Angus Foundation Scholarship applications open",
      "link": "https://www.agdaily.com/livestock/2026-angus-foundation-scholarship-applications-open/",
      "description": "The Angus Foundation is accepting applications for its 2026 scholarships supporting Angus youth in agriculture and related fields. The post 2026 Angus Foundation Scholarship applications open appeared first on AGDAILY.",
      "date": "Fri, 13 Feb 2026 13:39:55 +0000",
      "timestamp": 1770989995000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2023/03/David_Daily-300x200.jpg",
      "summary": "The Angus Foundation has opened the application period for its 2026 scholarship program, continuing its commitment to supporting the education and leadership development of Angus youth. Students can apply for the Foundation's undergraduate, graduate, vocational or technical, and commercial cattlemen's scholarship programs until May 1, 2026.\n\nSince 1998, the Angus Foundation has awarded over $5 million in scholarships to students pursuing degrees in agriculture, science, business, communications, veterinary medicine, trade programs, and other fields. In 2025, the Foundation awarded $393,000 in scholarships to 142 students.\n\nThe Angus Foundation offers multiple scholarship categories, including:\n- Undergraduate and Graduate Angus Foundation Scholarships (over $190,000 awarded annually)\n- Commercial Cattlemen Scholarship (five $1,500 scholarships for undergraduate students using Angus genetics)\n- Vo-Tech Scholarship (new in 2026, for students pursuing vocational or technical education related to the beef industry)\n- External scholarships administered by partner organizations\n\n\"Supporting youth in their education is an important part of the Foundation's mission,\" said Jaclyn Boester, Angus Foundation Executive Director. \"Our scholarships are one of the most prominent and consistent ways our donors support Angus youth. They pave the way for a bright future for our industry by ensuring young people can reach their full potential.\"",
      "summaryTimestamp": 1771014827280
    },
    {
      "id": "2324324cc9f4b2bb",
      "title": "National ag teacher shortage threatens growth of FFA programs",
      "link": "https://www.agdaily.com/ffa/national-ag-teacher-shortage-threatens-growth-of-ffa-programs/",
      "description": "As agriculture education programs continue to grow, schools and FFA chapters struggle to secure qualified agriculture teachers amid a national shortage. The post National ag teacher shortage threatens growth of FFA programs appeared first on AGDAILY.",
      "date": "Fri, 13 Feb 2026 13:10:12 +0000",
      "timestamp": 1770988212000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/10/bg-ffa-convention-300x157.jpg",
      "summary": "S. According to Dr. Travis Park, National FFA Advisor, the shortage is the greatest challenge facing FFA and agriculture education.\n\nThe shortage is primarily driven by rapid growth, with 150 new FFA chapters chartered annually and a 2% increase in teaching positions from 2023 to 2024. However, the shortage is not just from expansion - 107 teaching positions were lost and 58 programs closed in 2024 due to lack of teachers, low enrollment, and insufficient funding. \n\nRachel Kinsaul, a Georgia agriculture teacher, says the biggest shortage is in new graduates entering the field. This leads to industry professionals filling positions through alternative certification programs, which can be challenging.\n\nExperts cite factors like low teacher pay, high workload, and retirements as driving teachers out of the classroom. Agriculture teachers earn lower salaries compared to industry opportunities for their skillset.\n\nThe National FFA Foundation and National Association of Agricultural Educators have partnered to provide $8,000 per state to recruit future agriculture teachers. University programs are also expanding, but the shortage remains a major threat, especially in states like Georgia that rely heavily on agriculture.\n\nAddressing the shortage requires investing in and supporting agriculture teachers, who play a critical role in cultivating the next generation for the industry.",
      "summaryTimestamp": 1771014830783
    },
    {
      "id": "9563833a6bf826fb",
      "title": "R.D. Offutt Farms digs deeper into research with new potato farm",
      "link": "https://www.agweek.com/news/local/r-d-offutt-farms-digs-deeper-into-research-with-new-potato-farm",
      "description": "A new 90-acre Wadena County site will focus on innovation, sustainability and practical results for growers.",
      "date": "Fri, 13 Feb 2026 12:56:00 GMT",
      "timestamp": 1770987360000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/88e7310/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F8b%2F57%2F4abb4094450d98e66e98699ecc4f%2Fresearch-trial-in-staples-2025.jpg",
      "summary": "R.D. Offutt Farms is establishing a new 90-acre potato research farm in Wadena County, Minnesota. The goal is to advance sustainable agriculture practices through dedicated research trials. \n\nKey details:\n- The research farm will allow RDO to control variables and get more precise, repeatable results compared to trials within commercial fields.\n- Planned research focus areas include nutrient management, genetic research, irrigation, product trials, and technology innovation.\n- The research aims to benefit local farmers by providing practical, actionable data they can apply on their own farms.\n- Results will be shared through field days, publications, and summaries.\n- RDO envisions the research farm as a model that could potentially be adapted for other crops or locations in the future.\n- Land preparation for the new research farm will begin this spring, with the first trials expected to start in 2027.\n- The project is led by Tom Ryan, president of R.D. Offutt Farms, a family-owned business that has conducted hundreds of field trials over the past 60+ years.",
      "summaryTimestamp": 1771000874116
    },
    {
      "id": "f9d2338c4239989a",
      "title": "Bipartisan Bill Seeks to Advance Offshore U.S. Aquaculture",
      "link": "https://civileats.com/2026/02/13/a-bipartisan-bill-advances-the-launch-of-offshore-u-s-aquaculture/",
      "description": "Small in comparison to coastal Norwegian salmon farms, with annual combined exports of 1.2 million tons, Blue Ocean Mariculture produces about 1,100 tons of fish annually in net pens submerged 30 to 130 feet under water. Roughly half the fish is sold to distributors and stores in Hawaii, while the rest goes to markets on [&#8230;] The post Bipartisan Bill Seeks to Advance Offshore U.S. Aquaculture appeared first on Civil Eats.",
      "date": "Fri, 13 Feb 2026 09:00:18 +0000",
      "timestamp": 1770973218000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Key points:\n\n- Blue Ocean Mariculture, a Hawaii-based offshore aquaculture company, produces around 1,100 tons of fish annually in net pens 30-130 feet underwater. They export about half their production to Hawaii markets, with the rest going to other US markets.\n\n- In comparison, Norway's coastal salmon farms have annual exports of 1.2 million tons, dwarfing Blue Ocean's production.\n\n- The bipartisan bill, called the Advancing the Quality and Understanding of American Aquaculture (AQUAA) Act, aims to establish a regulatory framework to promote and support offshore aquaculture in US federal waters.\n\n- The bill is sponsored by Senators Roger Wicker (R-MS) and Brian Schatz (D-HI), along with Representatives Darren Soto (D-FL) and Ed Case (D-HI).\n\n- Supporters say the bill would provide regulatory clarity and encourage investment in an industry they believe can help meet growing global seafood demand in a sustainable way.\n\n- Critics argue the bill could have negative environmental impacts and say more research is needed on the industry's environmental effects.\n\nThe summary covers the key details from the article about the bill, aquaculture production figures, and the perspectives of supporters and critics.",
      "summaryTimestamp": 1771159224287
    },
    {
      "id": "9639aae352fb08f6",
      "title": "Cargill to close Wisconsin beef plant, cut 221 jobs",
      "link": "https://www.agweek.com/agribusiness/cargill-to-close-wisconsin-beef-plant-cut-221-jobs",
      "description": "Cargill said the move was made \"to better align our portfolio with current customer demand and prioritize investments,\" and ground beef production will shift to its other North American facilities.",
      "date": "Thu, 12 Feb 2026 22:32:27 GMT",
      "timestamp": 1770935547000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/2691731/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F33%2Fd4%2Fb563c4484de3b6b6f25caa4a720e%2F2026-02-12t183829z-1-lynxmpem1b1cc-rtroptp-4-china-trade-expo.JPG",
      "summary": "Cargill, a major U.S. agribusiness, will permanently close its beef processing facility in Milwaukee, Wisconsin, eliminating 221 jobs. The plant will stop production around mid-April and fully close around the end of May.\n\nThe closure is due to Cargill's efforts to \"better align our portfolio with current customer demand and prioritize investments.\" Ground beef production will shift to Cargill's other North American facilities, with no impact on its consumer contracts.\n\nThe Milwaukee plant closure comes after rival meatpackers JBS and Tyson Foods announced they were shuttering beef plants late last year. Beef prices are hovering near record highs due to strong demand and reduced supply, as the U.S. cattle herd has dropped to the lowest level in nearly 75 years due to persistent drought and a halt on U.S. imports of Mexican cattle.\n\nU.S. beef packers have been losing money as tight supplies of cattle have forced them to pay more for the livestock they slaughter and process. The closure of the Cargill plant in Milwaukee will further impact beef supply and processing capacity in the region.",
      "summaryTimestamp": 1771000880991
    },
    {
      "id": "d9eb3df1efd9c47a",
      "title": "Not the same old crap: The high-tech future of manure management",
      "link": "https://www.farmanddairy.com/columns/2-12-dirt-on-conservation/904414.html",
      "description": "From GPS to variable-rate tech, discover how manure is becoming a precision-driven nutrient powerhouse. Join Ashland SWCD for a deep dive into modern application. The post Not the same old crap: The high-tech future of manure management appeared first on Farm and Dairy.",
      "date": "Thu, 12 Feb 2026 22:00:00 +0000",
      "timestamp": 1770933600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Manure management has evolved from the basic \"get it out of the barn and hope for the best\" approach to a precision-driven, data-backed process. Today's manure application equipment includes digital scales, GPS guidance, variable-rate technology, and precision controls to apply nutrients exactly where needed.\n\nOn February 17th at 6 PM, the Ashland Soil and Water Conservation District is hosting a \"Conservation Chat\" event titled \"Not the Same Old Crap\" at J-Star Equipment in Greenwich, Ohio. The event will feature:\n\n- Glen Arnold from Ohio State University discussing the latest research on using liquid manure to grow forages and how equipment/management impact field results.\n- Tubeline Manufacturing presenting new manure spreader technologies, including GPS systems and digital scales for variable-rate applications.\n- Erica Notley from the Ohio Department of Agriculture covering current manure application regulations, nutrient management plans, and winter application guidance.\n\nThe goal is to help farmers stay compliant, confident, and avoid trouble with manure management. Information on cost-share programs like USDA, NRCS, H2Ohio will also be provided to support in-field nutrient management. \n\nTickets are $5 per person or free if bringing a friend. The event aims to provide practical solutions and have some fun discussing a topic that is often overlooked - the high-tech future of manure management.",
      "summaryTimestamp": 1771129164698
    },
    {
      "id": "e0aa9a417ca8dc3e",
      "title": "North American Potato Production Falls On Lower Acreage",
      "link": "https://www.allagnews.com/north-american-potato-production-falls-on-lower-acreage/",
      "description": "WASHINGTON, DC &#8211; Potato production across North America slipped in 2025, largely because growers planted [...]",
      "date": "Thu, 12 Feb 2026 19:00:31 +0000",
      "timestamp": 1770922831000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "U.S. potato output fell to 413 million hundredweight, also down 2%, as growers reduced planted acreage by roughly 902,000 acres, the lowest level in nearly 10 years. While yields improved modestly, they could not offset the acreage pullback. Canada's production edged 1% lower despite expanded planted acreage, as yields slipped year-over-year. Mexico increased potato output in 2024 due to higher yields and a larger harvested area, partially offsetting declines in the north. Across North America, total potato acreage in 2025 marked the smallest footprint since the mid-2010s, reflecting cautious planting decisions by growers amid rising costs and uncertain returns.",
      "summaryTimestamp": 1771120410995
    },
    {
      "id": "2f1a01e355b90963",
      "title": "USDA Debuts Plan to End ‘Agricultural Lawfare’",
      "link": "https://civileats.com/2026/02/12/usda-debuts-plan-to-end-agricultural-lawfare/",
      "description": "February 12, 2026 – Agriculture Secretary Brooke Rollins on Wednesday announced a plan to address an issue the Trump administration is calling “agricultural lawfare.” Rollins made the announcement at an event with officials from other federal agencies and a group of farmers and ranchers, coinciding with the release of the Farmer and Rancher Freedom Framework. [&#8230;] The post USDA Debuts Plan to End ‘Agricultural Lawfare’ appeared first on Civil Eats.",
      "date": "Thu, 12 Feb 2026 18:39:03 +0000",
      "timestamp": 1770921543000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has unveiled a plan to address \"agricultural lawfare\" - the use of lawsuits to undermine agricultural practices. On February 12, 2026, Agriculture Secretary Brooke Rollins announced the Farmer and Rancher Freedom Framework at an event with federal agencies and farmers/ranchers.\n\nThe key elements of the plan include:\n- Establishing a new USDA Office of Legal Defense to provide farmers/ranchers with legal support against lawsuits\n- Implementing a \"Right to Farm\" law to protect farmers/ranchers from nuisance lawsuits\n- Creating a USDA Legal Defense Fund to cover legal costs for farmers/ranchers\n- Expanding the scope of the Farmer and Rancher Disaster Program to include legal expenses\n\nThe goal is to help farmers/ranchers defend themselves against lawsuits that aim to restrict agricultural practices. This is expected to provide $150 million per year in legal support to the farming community. Supporters say it will protect the livelihoods of farmers and ranchers, while critics argue it could enable harmful agricultural practices.",
      "summaryTimestamp": 1771107548496
    },
    {
      "id": "2a85fb06a4e3864d",
      "title": "Texas A&#038;M hires new wildlife management and conservation policy expert",
      "link": "https://agrilifetoday.tamu.edu/2026/02/12/texas-am-hires-new-wildlife-management-and-conservation-policy-expert/",
      "description": "Cain to build natural resource stewardship research program to guide policy across Texas and beyond The post Texas A&M hires new wildlife management and conservation policy expert appeared first on AgriLife Today.",
      "date": "Thu, 12 Feb 2026 15:00:00 +0000",
      "timestamp": 1770908400000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Texas A&M University has hired James Cain, Ph.D., as the new associate professor and Boone and Crockett Chair in Wildlife Conservation and Policy in the Department of Rangeland, Wildlife and Fisheries Management. \n\nCain brings over 20 years of academic experience in large mammal ecology, applied wildlife management, and collaborative conservation. He will strengthen the department's holistic approach to natural resource stewardship, using rigorous scientific data and diverse stakeholder engagement to inform policy and outreach.\n\nCain's research program will focus on contemporary conservation and policy topics, including land use, drought, habitat loss, wildlife-habitat relationships, predator-prey interactions, and wildlife disease. These issues are relevant to Texas and the southwestern U.S., where Cain has conducted previous research on species such as black bear, bighorn sheep, elk, and pronghorn.\n\nCain will also coordinate and expand the department's Dr. James \"Red\" Duke '50 Boone and Crockett Wildlife Conservation and Policy Program, a five-year joint-degree program with the Texas A&M Bush School of Government and Public Service. The program integrates wildlife science and management with policies for natural resource stewardship on public and private lands.\n\nCain's goal is to educate and mentor students to become highly proficient professionals with a solid understanding of both wildlife biology and the policy realm, while also providing sound, actionable science to wildlife and land managers to support effective natural resource decisions.",
      "summaryTimestamp": 1771093718351
    },
    {
      "id": "98616d18401453e5",
      "title": "North Dakota State University to mark the 100th Little International",
      "link": "https://www.agweek.com/lifestyle/education/north-dakota-state-university-to-mark-the-100th-little-international",
      "description": "The NDSU Saddle and Sirloin Club held its first Little I in 1926.",
      "date": "Thu, 12 Feb 2026 11:30:00 GMT",
      "timestamp": 1770895800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/527e5e9/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F65%2F20%2F049c676e4f28901ac05a93217845%2Fstudent-with-hereford-heifer-in-front-of-beef-barn-1920s.jpg",
      "summary": "The event has been held since 1926 and brings together students and industry professionals across generations. \n\nDavid Buchanan, who graduated from NDSU in 1975 and has a long history with the Little International, says the event's core values established decades ago remain a part of it, despite changes reflecting the evolving student body. Paul Berg, who graduated from NDSU in 1960 and 1968 and was a long-time advisor of the Saddle and Sirloin Club that organizes the event, has observed the transformation of livestock shown at the event, attributing it mainly to advancements in livestock genetics.\n\nThe \"Agriculturalist of the Year\" award, which became the official name in 1976 when Marie Tyler became the first woman to win it (previously called \"Man of the Year\"), is given annually to a person in North Dakota's agriculture industry.\n\nBuchanan is confident the Little International will continue to evolve and thrive in the future, with new generations of students bringing unique elements to the event. More information about this year's 100th Little International is available on the NDSU Saddle and Sirloin Club's website, which also offers a livestream of the proceedings.",
      "summaryTimestamp": 1771000887393
    },
    {
      "id": "54b7a16a2e0af2dc",
      "title": "Texas A&#038;M hospitality leader earns international research award",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/texas-am-hospitality-leader-brian-king-earns-international-research-award/",
      "description": "Michael D. Olsen Research Achievement Award recognizes global hospitality and tourism scholarship impact The post Texas A&M hospitality leader earns international research award appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 22:11:56 +0000",
      "timestamp": 1770847916000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Brian King, Ph.D., professor and department head of the Arch H. Aplin III '80 Department of Hospitality, Hotel Management and Tourism at Texas A&M College of Agriculture and Life Sciences, received the 2026 Michael D. Olsen Research Achievement Award.\n\n- The international award is presented by the Hospitality and Tourism Educators Association and recognizes scholars whose research and academic leadership have made sustained contributions to hospitality and tourism education.\n\n- King has extensive international consulting experience, including work with UN Tourism, the European Union, the United Nations Economic and Social Commission for Asia and the Pacific, and the Hong Kong Hotel Owners Association.\n\n- He is the founding and current editor-in-chief of the journal Tourism, Culture & Communication and has authored and edited several books on hospitality and tourism.\n\n- King joined Texas A&M in 2022 after serving as associate dean at Hong Kong Polytechnic University's School of Hotel and Tourism Management and holding senior leadership positions at Victoria University in Melbourne, Australia.\n\n- As head of the Aplin Department of Hospitality, King leads teaching, research, and outreach initiatives that emphasize graduate education, mentorship, and global engagement in hospitality and tourism.",
      "summaryTimestamp": 1771021744032
    },
    {
      "id": "a2af1d636ca7e4c2",
      "title": "Reclaiming harsh habitats with black soldier fly larvae",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/reclaiming-harsh-habitats-with-black-soldier-fly-larvae/",
      "description": "Collaborative research supported by the WoodNext Foundation aims to autonomize rehabilitation of extreme environments The post Reclaiming harsh habitats with black soldier fly larvae appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 19:12:23 +0000",
      "timestamp": 1770837143000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Collaborative research supported by the WoodNext Foundation aims to rehabilitate extreme environments by integrating entomology, robotics, AI, and sensor technology.\n\n- Black soldier fly larvae can recycle organic waste, produce protein and fertilizer, and remove toxic substances from materials they are fed.\n\n- This interdisciplinary project aims to develop autonomous systems for cultivating plants, recycling with black soldier fly larvae, and generating healthy, fertile soil.\n\nNumbers/Statistics:\n- Project is supported by the WoodNext Foundation, managed by tech innovator and Roku CEO/founder Anthony Wood '87 and his wife, Susan '89.\n\nPeople/Organizations:\n- Jeffery Tomberlin, Texas A&M AgriLife Research Fellow and professor, leading the black soldier fly larvae project.\n- Guillermo Aguilar, Department Head and Professor, College of Engineering, developing advanced soil sensors.\n- Minghui Zheng, Associate Professor, Mechanical Engineering, developing robotic systems.\n- Xiao Liang, Assistant Professor, Civil and Environmental Engineering, leading the AI component.\n\nLocations:\n- Texas A&M University\n\nContext/Causes:\n- Extreme environments with high soil contaminants limit human habitation and food production.\n\nImpacts for Farmers:\n- Successful contaminant removal and soil restoration will empower land managers, farmers, and governments to address polluted environments.\n\nRecommendations/Action Items:\n- Develop autonomous systems for cultivating plants, recycling with black soldier fly larvae, and generating healthy, fertile soil.\n- Apply the same technology to extraterrestrial environments, enabling autonomous agriculture on Mars or the moon.\n\nQuotes:\n- \"This project exemplifies the interdisciplinary research that is necessary to tackle the complex problems we face in today's world.\"\n- \"By reclaiming extreme terrestrial environments, we are creating resources for humanity. If successful, such methods can be applied globally but also beyond Earth.\"\n- \"Our goal is to make large-scale soil remediation faster, smarter and more sustainable. By integrating AI with biological and mechanical systems, we can turn contaminated land into productive soil with minimal manual oversight.\"",
      "summaryTimestamp": 1771021748251
    },
    {
      "id": "19d589451b7f5799",
      "title": "USDA Opens ‘Sterile Fly’ Facility to Prevent Cattle&#160;Disease",
      "link": "https://civileats.com/2026/02/11/usda-opens-sterile-fly-facility-to-prevent-cattle-disease/",
      "description": "February 11, 2026 &#8211; Secretary of Agriculture Brooke Rollins joined Governor Greg Abbott in Texas Monday to announce the opening of a new U.S. Department of Agriculture (USDA) facility that will be able to disperse sterile flies in an effort to prevent the spread of New World screwworm flies, which can kill cattle and other [&#8230;] The post USDA Opens ‘Sterile Fly’ Facility to Prevent Cattle Disease appeared first on Civil Eats.",
      "date": "Wed, 11 Feb 2026 18:48:16 +0000",
      "timestamp": 1770835696000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "On February 11, 2026, U.S. Secretary of Agriculture Brooke Rollins and Texas Governor Greg Abbott announced the opening of a new U.S. Department of Agriculture (USDA) facility in Texas. The facility will be able to release sterile flies to prevent the spread of New World screwworm flies, which can kill cattle and other livestock.\n\nThe new USDA facility is part of the agency's efforts to combat the New World screwworm fly, an invasive pest that poses a significant threat to the cattle industry. Screwworm flies lay eggs in open wounds of livestock, and the larvae can be fatal if left untreated.\n\nThe USDA's sterile insect technique involves releasing large numbers of sterile male flies into affected areas. This reduces the population of breeding screwworm flies and prevents the spread of the pest. The new facility in Texas will be able to produce and disperse the sterile flies, helping to protect cattle and other animals in the region.\n\nThe announcement highlights the USDA's commitment to supporting the cattle industry and preventing the spread of devastating livestock diseases. The facility's opening is expected to have a positive impact on farmers and ranchers in Texas and surrounding states, helping to safeguard their herds and livelihoods.",
      "summaryTimestamp": 1771021751616
    },
    {
      "id": "912df42fdad393e7",
      "title": "Remember to register for the Nitrogen Conference - this Tuesday Feb. 17th, 2026 in St. Cloud",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/remember-to-register-for-nitrogen.html",
      "description": "",
      "date": "Wed, 11 Feb 2026 15:05:00 +0000",
      "timestamp": 1770822300000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg6ieA_IYkmsgSGiBba_yqGUhpf2mmJ6ytrBrbkms7kKGAe4Rv_Qxss8noLdDw6Hf4G-YeKRi0ngwzcQrRBp_sD2V4saGhsUfphTQkHPY6BZn4ILme8b1dazjeZR_KJAV1bB3gztkBubebqp2rlgsHIgA9M87914H1ruIrnsQ1_RcVVhWjoVPG0CkT4cLxE/s72-w640-h322-c/N%20Con.jpg",
      "summary": "The 12th annual Nitrogen Conference is taking place on Tuesday, February 17, 2026, in St. Cloud, Minnesota. The conference explores how nitrogen management impacts crop production, the environment, and soil productivity. Key details:\n\n- Date: Tuesday, February 17, 2026\n- Location: St. Cloud, Minnesota\n- Cost: $20\n- Format: In-person and virtual attendance options available (in-person includes lunch)\n\nPresentations will cover topics such as:\n- The MRTN calculator for nitrogen management and crop production\n- In-season mineralization of cover crop residue in sugar beet\n- Precision irrigation and nitrogen management\n- Predicting in-season fertilizer needs after fall-applied manure\n- Biologicals for smarter nutrient management\n- The role of soil organic matter in agricultural nitrogen sustainability\n- Lessons from the 2025 growing season (farmer panel)\n- Nitrates in water issues and the Minnesota nutrient reduction strategy\n- Evaluating nitrogen inhibitors\n\nCertified Crop Advisers can earn continuing education credits by attending the conference. Farmers are encouraged to register and attend either in-person or virtually.",
      "summaryTimestamp": 1771008127762
    },
    {
      "id": "7b98c49fd250be30",
      "title": "Through Food and Culture, the East Bay Ohlone Are Repairing Centuries of&#160;Harm",
      "link": "https://civileats.com/2026/02/11/through-food-and-culture-the-east-bay-ohlone-are-repairing-centuries-of-harm/",
      "description": "Photographs by Aya Brackett I’m Louis Trevino. Most importantly, I’m Vincent’s partner in life and in love, for which I am every day so very grateful. And I too am Ohlone from here in the East Bay, and I have dedicated myself to Vincent and to his beautiful and dynamic vision for our people and [&#8230;] The post Through Food and Culture, the East Bay Ohlone Are Repairing Centuries of Harm appeared first on Civil Eats.",
      "date": "Wed, 11 Feb 2026 09:00:15 +0000",
      "timestamp": 1770800415000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/through-food-and-culture-the-east-bay-ohlone-are-repairing-centuries-of-harm-1.jpg",
      "summary": "Key points:\n\n- Vincent Medina and Louis Trevino, both members of the Ohlone community, are working to revive Ohlone food traditions and share their culture. \n- They have established a farm and food business called Cafe Ohlone to showcase traditional Ohlone cuisine and ingredients.\n- The Ohlone people were nearly wiped out by Spanish colonization and later policies, losing much of their cultural knowledge and practices.\n- Medina and Trevino are working to reconnect their community with traditional foods, plants, and stories, as a way to heal from this history of oppression.\n- Their work includes hosting educational events, teaching traditional cooking methods, and growing indigenous crops like acorns and wild greens.\n- The goal is to not only preserve Ohlone culture, but also empower the community and share their vibrant heritage with the broader public.",
      "summaryTimestamp": 1771165392032
    },
    {
      "id": "35703c115868386d",
      "title": "Ag groups urge U.S., Mexico and Canada leaders to move forward with USMCA",
      "link": "https://www.agweek.com/news/policy/ag-groups-urge-u-s-mexico-and-canada-leaders-to-move-forward-with-usmca",
      "description": "The Agricultural Coalition for the USMCA released the results of an economic analysis that shows significant growth in the value of U.S. ag exports to Canada and Mexico since USMCA was enacted.",
      "date": "Tue, 10 Feb 2026 19:27:52 GMT",
      "timestamp": 1770751672000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/4dfff8a/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F00%2F7e%2F773f96af45ba98a13371c46ff2b4%2F9766114590996-combine-filling-up-with-corn-76361.jpg",
      "summary": "S., Canada, and Mexico to renew and strengthen the USMCA trade agreement. \n\nKey statistics:\n- U.S. agricultural exports to Canada and Mexico have increased by $20 billion, reaching $60 billion in 2024, along with $1.2 billion in seafood exports - a 47% growth compared to 18% growth in exports to the rest of the world.\n- The USMCA has generated $149 billion in total economic contribution to the U.S. economy, supported nearly 500,000 jobs, and $36 billion in wages. For every $1 in ag exports under USMCA, another $2.45 of economic activity was supported.\n- The USMCA has contributed $3.6 billion in dairy exports in 2024, making up 44% of all dairy exports. It has also led to $2.81 billion in fresh fruit exports and $2.5 billion in fresh vegetable exports to Canada and Mexico.\n\nThe coalition says the USMCA agreement has been positive for U.S. agriculture, but there are some issues that need to be addressed, such as Canada's management of dairy tariff-rate quotas and Mexico's implementation of commitments on common cheese names. They also want more clarity on biotech rules and increased ethanol access in Mexico.\n\nThe coalition warns that if the USMCA is not renewed, it would create greater instability and challenges for the already tough farm economy.",
      "summaryTimestamp": 1771000891817
    },
    {
      "id": "1a65a9633ce88244",
      "title": "MN CropCast: From research to resilience - Advancing soil health with Dr. Anna Cates",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-from-research-to-resilience.html",
      "description": "",
      "date": "Tue, 10 Feb 2026 16:18:00 +0000",
      "timestamp": 1770740280000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-w320-h320-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "Key Highlights:\n\n- Dr. Anna Cates, the University of Minnesota Extension Soil Health Specialist, was interviewed on the Minnesota CropCast podcast (Episode #56) on February 10, 2026.\n\n- Dr. Cates leads the MN Office for Soil Health (MOSH), which works with farmers and conservation professionals to improve soil health across Minnesota.\n\n- MOSH partners with the Minnesota Board of Water and Soil Resources (BWSR) to provide funding, policy implementation, and technical guidance to local Soil and Water Conservation Districts (SWCDs).\n\n- The podcast discusses farmer adoption of conservation practices and cover crops, as well as an upcoming intensive educational opportunity called the Cover Crop Academy.\n\n- Dr. Cates has a PhD in Agronomy and MS in Soil Science and Agroecology from the University of Wisconsin-Madison, and her work aims to turn soil health research into on-the-ground conservation.\n\n- The Minnesota CropCast podcast is hosted by David Nicolai, a crops Extension educator, and Seth Naeve, the Extension soybean agronomist, and covers progress and challenges of Minnesota's agronomic crops.",
      "summaryTimestamp": 1771100487416
    },
    {
      "id": "a5f5d4972a5993d0",
      "title": "Minnesota Irrigator Program returns March 10th and 11th, 2026 in Perham, MN",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/minnesota-irrigator-program-returns.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 17:41:00 +0000",
      "timestamp": 1770658860000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEilFjhdf-VxkjP9toiF34DiaDB5cT-q0f91aA_Dm5rnp-VT4bl_Z7fTnYdUC-aenNwdk4aIJ6iixtBluHpy8s-iEt9Bi8Q_ACFmbb3c7egNGSuDx1vzfDkJg3X4cJN595mCuQvvb2YWJFNBWC6Yd39CfII3Z-IT9EolZPeEmPGaok8g6zYVrRwMkLGSB8LN/s72-w640-h322-c/Irrigation-180.jpg",
      "summary": "The Minnesota Irrigator Program (MIP) is returning on March 10th and 11th, 2026 in Perham, MN. The 2-day program costs $60 and includes breakfast and lunch. It will cover topics such as irrigation scheduling, variable rate technology, autonomous pivots, flowmeters and calibration, and nitrogen management. \n\nCompleting the MIP is one of the requirements to attain the Irrigation Endorsement of the Minnesota Agricultural Water Quality Certification Program. Certified farms will receive the endorsement after attending the program and adopting a new irrigation practice or scheduling method on-farm.\n\nThe program is organized by the University of Minnesota to help irrigators and irrigation professionals match irrigation to crop water use, improve water-use efficiency, and reduce water costs. This is particularly important in Minnesota's central region, which has sandy soils and limited precipitation, making irrigation a key component of production agriculture.\n\nInterested participants can register for the event at z.umn.edu/MIP2026. The in-person event will be held at the Cactus Event Center: 43521 Fort Thunder Rd, Perham, MN 56573.",
      "summaryTimestamp": 1771021754628
    },
    {
      "id": "639f274dc791af0b",
      "title": "Strategic Farming: Let's talk crops discussed pollinators",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops_9.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:50:00 +0000",
      "timestamp": 1770652200000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiFwnCAyWS-EUZiSio5J4-y0QsBduTd8dBWm4rzsZPh3u4M6zCtsrl6RlBlORk_gWpEFh9h4ihjy4Q3pIa9pa6cfpRtz9_kTHvQBA2tYVh2SFkw_l0cs3XC0kVvrPnwkXwspvQywGqn_c4YnxmIW3ZA4EmamF9Iyw3k_NQb4FllsWyvbWbmpFK22ugIz6oV/s72-w320-h320-c/bee-on-flower-andrewsi_HeatherHolm.JPEG",
      "summary": "Key Takeaways:\n\n- Pollinators like bees play a critical role in food production, with over 80% of the world's flowering plants needing a pollinator to reproduce.\n\n- There are around 525 bee species in Minnesota, with many being ground-nesting and solitary species, not just honey bees.\n\n- Bee populations are declining due to factors like habitat loss, climate change, and disease. The rusty patch bumblebee is now endangered.\n\n- Restoring pollinator habitat on agricultural landscapes is important. Research shows that even small, less expensive habitat plantings can support a variety of bee species.\n\n- Habitat diversity and floral resources are key - the number of different flower species is more important than the surrounding landscape.\n\n- Pollinator habitat doesn't have to be large or highly diverse to be effective. Smaller, less expensive plantings can provide good results.\n\n- Pollinator habitat next to soybean fields did not increase pest issues, and can boost soybean yields up to 20% through improved pollination.",
      "summaryTimestamp": 1771021757812
    },
    {
      "id": "85be85b5240c46b7",
      "title": "Mark your calendars for the Midwest Soybean Gall Midge Research Update",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendars-for-midwest-soybean.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:22:00 +0000",
      "timestamp": 1770650520000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh0uFuk9siSQYDRZMiZ6TFrsf7R2PkpTjVQVdjWSAepcFTQa-SsKA945ODDygtkKavZCDdBqY6VAq25l-cmFJvX1zCYrFPrINtbHZ0q9eQSE04v6mqMfrOpOlW1sHhJIq8RjUbQO5J9yO9Ttx56T7Uy2inj9pSygRO9xdPxYA0_aPJKkiZ4FpEmgymGRY5b/s72-w320-h194-c/gall-midge-larvae-potter.jpg",
      "summary": "The Midwest Soybean Gall Midge Research Update is a free, live webinar scheduled for March 19, 2026. It will feature new research results and emerging management insights on soybean gall midge (SGM) from Extension entomologists and their graduate students at three Midwestern universities.\n\nThe webinar will cover a range of topics, including:\n- Updated information on SGM distribution and regional monitoring efforts\n- Impacts on soybean production and yield loss under field conditions\n- Biology and ecology updates, such as cold tolerance and overwintering survival\n- New insights into adult biology, including emergence timing and behavior\n- Results from commercial soybean variety testing under SGM pressure\n- Updates on biological control efforts\n- Evaluation of new and emerging cultural control strategies, along with other management tools\n\nCertified Crop Advisors can earn pest management (PM) continuing education units (CEUs) by attending the live event. Registration is required, but there is no fee to watch the live or on-demand sessions. The registration process involves receiving a confirmation email and reminder emails with a webinar link.\n\nFor more information, visit the Midwest Soybean Gall Midge Research Update webpage.",
      "summaryTimestamp": 1771021760875
    },
    {
      "id": "3f08825939c7efbd",
      "title": "7 Vegetables to Start From Seed in February",
      "link": "https://modernfarmer.com/2026/02/vegetable-seed-february/",
      "description": "It takes a lot to get the farm ready for the growing season. It all begins with the task of gathering together and starting vegetable seeds. February is an ideal time to get many of your spring crops going. Consider these 7 vegetables as you prepare your rows. The post 7 Vegetables to Start From Seed in February appeared first on Modern Farmer.",
      "date": "Mon, 09 Feb 2026 12:00:00 +0000",
      "timestamp": 1770638400000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/03/Sowing-tomato-seeds-in-tray.webp",
      "summary": "Key Points:\n\n- February is a good time to start vegetable seeds indoors, especially for crops that take a long time to mature.\n- Recommended vegetables to start from seed in February include slow-growing herbs like basil and rosemary, tomatoes, peppers, brassicas (broccoli, cauliflower), lettuce, carrots, parsnips, and alliums (onions, leeks).\n- For cold climates, seeds can be started indoors in a controlled environment like a greenhouse, cold frame, or low/high tunnel to take advantage of stored thermal energy.\n- Tomatoes and peppers need a heat mat to germinate, while lettuce and brassicas can be direct-sown outdoors with protection. Carrots and parsnips require direct sowing in their final location.\n- Onions and leeks should be started in February to allow time for maturation before transplanting.\n- Farmers in warm climates near the equator may not need as much protection, but still need to watch for persistent pests.\n- Faster-growing Asian brassica varieties and rapini/broccolini types can work well for shorter seasons.\n- Lettuce and leafy brassicas can provide quick harvests of baby greens, while heading brassicas and tomatoes take longer to mature.",
      "summaryTimestamp": 1771072710231
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this past week were 8-18 degrees below average, with lows reaching 7 below zero in some areas. January as a whole was about 2 degrees below normal statewide. Precipitation was very low, with most areas receiving less than 0.1 inches of light snow. January ended about 2 inches drier than normal. The snow that did fall provided little drought relief, as the light, powdery snow yielded less than 1 inch of liquid water.\n\nLooking ahead, temperatures are expected to climb into the 40s and 50s next week, but precipitation will remain low, under 0.1 inches. The third week of February is forecasted to be warmer and wetter than average.\n\nThe article also discusses the importance of using the N-Rate Calculator and the Precision Conservation Management program to maximize profits rather than just yields. Experts John Jones, Gary Schnitkey, and Laura Gentry recommend these tools to help farmers optimize nitrogen applications and protect local watersheds.\n\nFinally, the article mentions the Commodity Week and Closing Market Report radio programs available through the University of Illinois.",
      "summaryTimestamp": 1771137939028
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "The key points from the article are:\n\n- Click-through rate is no longer the best metric for digital advertising performance in agriculture. The true indicator is now attention time - how long users spend meaningfully engaged with content.\n\n- AgWeb's recent redesign was focused on increasing user attention and engagement. Layout changes reduced distractions and encouraged deeper article reading.\n\n- The data shows clear improvements: 54% more readers reached 75% of articles, 21% more reached 90%. Mobile users also viewed more articles per visit, up 33%.\n\n- Most users (79%) scan content rather than reading word-for-word. Only 16% read every word, absorbing at most 28% of page text.\n\n- Attention time is a better metric than click-through rate, as it measures real impact - whether users stayed, scrolled, and consumed multiple articles.\n\n- The AgWeb redesign provides a template for increasing engagement and attention. This creates more valuable, higher quality impressions for advertisers.\n\n- For ag marketers, the goal should be reaching farmers in focused, engaged moments. AgWeb's optimization for attention offers one of the most effective digital environments.",
      "summaryTimestamp": 1771057634450
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "The goal was to see if growers can maintain productivity and profitability while using reduced tillage and cover crops to protect soil.\n\nThe study tested 4 management systems: conventional tillage (CT), fall strip-tillage (ST), no-tillage (NT), and no-tillage with a cereal rye cover crop (NT+CR). Each system was paired with 3 starter fertilizer strategies: unfertilized control, 15 lb N/ac, and 15 lb N/ac + 10 lb S/ac.\n\nKey findings:\n- Starter fertilizer increased early soybean biomass by ~12% at the V4 stage, but these differences did not persist to R2 growth stage.\n- Soybean yields ranged from 60-95 bu/ac across locations, with no significant yield differences between tillage/cover crop systems. \n- Partial net return was highest for NT, followed by ST and CT. NT+CR had the lowest net return due to higher cover crop costs, though this can be offset by cost-share programs.\n\nThe project will continue in 2026 to track medium-term responses as the soil, residue, and nutrient dynamics change under the conservation systems.",
      "summaryTimestamp": 1771137942524
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "Key points:\n- February is a good time to start late spring transplants and grow quick-maturing crops for early spring markets in greenhouses.\n- Not all greenhouses are created equal - they vary from simple plastic structures to fortified designer greenhouses with climate control systems.\n- Recommended greenhouse crops for February include:\n  - Tomatoes and peppers, which benefit from an early indoor start\n  - Brassicas like kale, cabbage, and cauliflower to avoid pests and extreme cold\n  - Lettuces, which can be started early indoors \n  - Potatoes, to get full-sized tubers by spring\n  - Onions of all kinds\n  - Flowers that take a long time to sprout, like lisianthus and dahlias\n\nThe article provides details on the different types of greenhouses and their capabilities in terms of temperature increases (30°F for modular plastic, 5-15°F for cold frames, etc.). It emphasizes the importance of understanding your greenhouse type when deciding what to grow.\n\nNo specific dates, prices, or expert quotes are mentioned. The article is focused on providing comprehensive guidance to farmers on maximizing their greenhouse growing during the winter months.",
      "summaryTimestamp": 1771072723198
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Farm Journal and Hass Avocado Board (HAB) are launching \"The Avocado Conference\", the first-of-its-kind international event for the U.S. avocado supply chain.\n\n- The inaugural event is set for November 18-20, 2026 in San Diego, California.\n\n- The conference aims to strengthen the global avocado industry and make Hass avocados America's preferred healthy food.\n\n- It will bring together all segments of the supply chain, including producers, exporters, importers, packers, retailers, foodservice buyers, and industry partners.\n\n- Sessions will cover global production and trade, retail/foodservice insights, consumer/shopper trends, marketing programs, economic dynamics, and Hass Avocado Board's efforts to expand avocado demand.\n\n- The Hass Avocado Board is collaborating on content development and uniting the industry for this event.\n\n- Key stakeholders attending will include growers, packers, importers/exporters, retailers, foodservice, suppliers, logistics, and data/insights providers.",
      "summaryTimestamp": 1771057637076
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Iowa State University Pesticide Safety Education Program has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. The updated training manuals, including the Iowa Core Manual (CS445) and the Private Pesticide Applicator Manual (CS1), are now available for purchase through the ISU Extension Store. New exams based on the revised core manual are available at all Iowa Department of Agriculture and Land Stewardship test sites. Farmers and pesticide applicators in Iowa can contact Betsy Danielson, the Pesticide Safety Education Extension Specialist, for more information.",
      "summaryTimestamp": 1771057639342
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The key points are:\n\n- Lead generation should be based on offering farmers something they genuinely need, not just what the business wants to collect.\n- The call-to-action (CTA) and offer you choose shape the quality and purchase-readiness of the leads captured, not just the quantity.\n- Shifting the mindset from what the business wants to what farmers need is crucial for designing the right offer that will resonate.\n\nThe article does not provide any specific numbers, statistics, dates, names, or locations. It is focused on providing general advice about lead generation strategy for agricultural businesses.",
      "summaryTimestamp": 1771057641511
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this week were 4-8 degrees below normal, with lows dipping into the single digits or below zero, and wind chills reaching -20 in some areas. The state also experienced a mostly dry week, with less than half an inch of precipitation in many regions so far in January. \n\nLooking ahead, the cold temperatures are expected to continue for at least another week, with most of northern Illinois remaining below freezing for the rest of the month. However, a strong winter storm is forecasted to bring significant snowfall, with 3-4 inches expected in central Illinois and 8-12 inches south of Interstate 64 this weekend.\n\nThe article also covers the latest WILLAg.org radio programming, including the Commodity Week panel discussion featuring Chip Nellinger, Brian Stark, and Arlan Suderman, as well as the daily Closing Market Report.\n\nOverall, the key information from the article includes:\n- Temperatures 4-8°F below normal, with lows in the single digits and wind chills near -20°F\n- Less than 0.5 inches of precipitation in January so far, making it one of the driest starts to the year\n- Continued cold temperatures expected for at least another week, with potential for 8-12 inches of snow in southern Illinois this weekend\n- WILLAg.org radio programs covering commodity markets and closing prices",
      "summaryTimestamp": 1771137946426
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Traditional SEO (search engine optimization) focused on winning clicks, but the focus has now moved to winning brand authority and trust through modern AEO (answer engine optimization). \n\nFarmers are increasingly turning to AI-powered platforms like ChatGPT and Google's AI Overviews for instant answers to their questions, rather than traditional search engines. If brands are not present in these new discovery channels, they risk becoming invisible.\n\nFarm Journal, the article's source, is observing this shift in real-time and advising that ag marketers need to reevaluate their strategies for 2026. Key recommendations include:\n- Adopting an answer-driven content strategy\n- Amplifying trusted voices\n- Ensuring brand expertise, content, and authority are discoverable across all channels where farmers are searching, including search engines, AI platforms, voice search, and social media.\n\nDiscoverability is now about winning citations, brand mentions, and trusted source references, rather than just clicks. This will be critical for building brand authority even in \"zero-click\" moments.",
      "summaryTimestamp": 1771057644304
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Key points:\n\n- Forest farming, also known as multi-story cropping or agroforestry, is the practice of farming within forested land. It integrates small-scale farming with conventional forestry.\n\n- Originating in Brazil's tropical rainforests, forest farming can be beneficial for farmers with forest land, allowing them to diversify their products and have a self-sustaining system.\n\n- Common forest farming methods include thinning forests to allow understory crops, silvopasture (combining forestry and ranching), and alley cropping (growing specialty crops between tree rows).\n\n- Benefits include improved water and soil quality, carbon sequestration, hosting of beneficial organisms, and opportunities to grow specialty crops like mushrooms, ramps, and edible roots.\n\n- Land suited for forest farming includes existing forested areas, riparian areas with trees, and previously cleared land for reforestation.\n\n- Considerations include inventorying natural resources, developing a forest management plan, understanding local markets, and being aware of regulations around wild plant harvesting.\n\n- Experts recommend consulting local agricultural extension offices, state agriculture/forestry agencies, and trusted market contacts to plan and implement a successful forest farming operation.",
      "summaryTimestamp": 1771072729496
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The second week of the year saw above-normal temperatures, with average temps 8-12°F above normal. Some areas reached highs of 69°F in Kaskaskia and 68°F in Carbondale. January so far has been a top 10 warmest first half on record in most of Illinois.\n\nPrecipitation has been scarce, with 7-day totals ranging from 0.1 inches in southeast Illinois to 0.75 inches in central Illinois. January to date is 0.5-1 inch drier than normal across the state, except for 1-3 inches of rain in a narrow area between Peoria and Chicago. This winter season has been slightly wetter than normal in northeast Illinois, slightly drier than normal in central/west Illinois, and much drier (top 5 driest on record) in southern Illinois.\n\nThe mild weather will end this weekend as much colder air moves in, with highs struggling to reach 20°F in northern Illinois and just above freezing in the south. Little precipitation is expected, mostly light snow. Colder than normal temperatures are forecast for the next 2-3 weeks.\n\nThe article also mentions the weekly Commodity Week radio program and Closing Market Report, which provide market analysis and updates.",
      "summaryTimestamp": 1771137950317
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "Key Highlights:\n\n1. Spray drones are being increasingly evaluated by Iowa farmers as an additional tool for crop input application. They can provide flexibility, reduce field traffic, and improve access to difficult areas.\n\n2. Adopting spray drone technology requires considering regulations, training, insurance, and management practices. Farmers need to be aware of FAA Part 107 and Part 137 certifications, IDALS licensing, and pesticide label compliance.\n\n3. Insurance coverage specific to agricultural drone operations is recommended, including chemical liability, general liability, and hull/physical damage coverage.\n\n4. When selecting spray drones, key considerations include tank capacity, battery life, nozzle options, GPS guidance, and local support availability.\n\n5. Proper training is essential for effective and safe operation, including flight experience, calibration, weather monitoring, and routine maintenance.\n\n6. Farmers are encouraged to start on a limited scale, comparing application results with conventional methods and developing efficient procedures.\n\n7. Several Iowa-based resources are available to support farmers, including Iowa State University programs, the Digital Agriculture Innovation Lab, licensed equipment dealers, and IDALS.\n\n8. Ongoing technological improvements in payload capacity, automation, and data integration will shape the long-term role of spray drones in Iowa crop production.\n\nKey Numbers/Statistics:\n- FAA Part 107 remote pilot certification training workshop scheduled on February 24-25, 2026 in Ames, IA.\n- Specific insurance coverage requirements for chemical liability and Part 137 certification.\n\nLocations:\n- Ames, IA\n- Iowa\n\nExperts/Organizations:\n- Doug Houser, Digital Agriculture Extension Specialist, Iowa State University\n- Iowa State University Extension and Outreach\n- Digital Agriculture Innovation Lab\n- Iowa Department of Agriculture and Land Stewardship (IDALS)\n- Federal Aviation Administration (FAA)",
      "summaryTimestamp": 1771057648562
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "This protects seedlings and results in hardier transplants that mature sooner. The top vegetables to winter sow include cabbages, spinach, onions, and leafy greens like kale and chard. Recommended flowers include pansies, echinacea, snapdragons, larkspur, and scabiosa. These plants can handle cold weather and many require cold stratification to break dormancy. \n\nFor cabbages, farmers can choose standard varieties or shorter-maturing 'Carex' cabbages. Spinach varieties like 'Avon' and 'Space' are mildew-resistant. Onions require consideration of day length, with long-day, short-day, and intermediate-day varieties suited to different latitude ranges. Leafy greens like kale, chard, and microgreens are easy to grow and nutritious.\n\nPerennial flowers like pansies, echinacea, and larkspur provide natural pest control and can be sold as cut flowers or bedding plants. Snapdragons prefer cool weather and come in different groups suited to varying light and heat conditions. Scabiosa, or pincushion flowers, also attract beneficial insects.\n\nWinter sowing reduces risks compared to direct sowing and allows for earlier maturation, giving farmers an advantage in the spring growing season. Careful selection of cold-hardy plants is key to a successful winter sowing program.",
      "summaryTimestamp": 1771072737011
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "Plant prairie strips: Dedicating 10-25% of farmland to prairie strips can boost yields, add soil nutrients, and attract beneficial insects and predators that help control pests. The diverse plantings support biodiversity above and below ground.\n\n2. Reduce tilling: Minimizing tillage and using cover crops instead can improve soil structure and increase the diversity of insect populations on the land.\n\n3. Practice regenerative grazing: Using rotational grazing models and planting native grasses/forbs instead of non-native forage can improve the health of both the land and livestock, while supporting local ecosystems. Silvopasture with native trees provides habitat and shelter.\n\n4. Implement Integrated Pest Management (IPM): Diversifying plantings and using cultural pest control methods instead of relying on pesticides can attract beneficial insects to naturally manage pests.\n\n5. Establish conservation easements: Partnering with land trusts to place farmland under conservation easements can protect natural resources and habitats, while also providing tax benefits for landowners.\n\nThe article states that these strategies are worthwhile investments, as they can boost productivity, reduce input costs, and maintain the health of the surrounding ecosystem that farms rely on. Experts recommend them as effective ways for farmers to support biodiversity and prevent species loss on their land.",
      "summaryTimestamp": 1771072740312
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series will be held at 12 locations across Iowa from January 6-29. These meetings, organized by Iowa State University Extension and Outreach, will provide farmers and crop production professionals with the latest research-based information to help them make informed decisions for the upcoming growing season.\n\nKey details:\n- Dates and locations: January 6 - Sioux Center, January 7 - Storm Lake, January 8 - Burlington, January 9 - Mason City, January 13 - Estherville, January 15 - Waterloo, January 16 - Davenport, January 21 - Ankeny, January 22 - Atlantic, January 27 - Iowa City, January 28 - Le Mars, January 29 - Carroll\n- Early-bird registration is $75 until the week before each meeting, late/on-site registration is $100\n- Registration includes refreshments, lunch, certified crop advisor credits, and access to resources\n- Private pesticide applicator recertification will be available for a separate $30 fee\n- Topics will include crop market and climate outlooks, nitrates and drinking water, profitable nutrient management, southern rust, transition planning, robots and drones, and more\n\nAccording to Josh Michel, field agronomist with ISU Extension and Outreach, \"Our goal is always to prepare producers to manage potential issues when they arise, or even before they arise, by sharing the most up-to-date scientific knowledge from Iowa State University researchers.\"",
      "summaryTimestamp": 1771057651866
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "S.\n\nThe three finalists are:\n- Alsum Farms in Friesland, Wisconsin - a multigenerational, vertically integrated potato, pumpkin, and forage operation on over 3,600 acres.\n- Dalton Farms in Wakeman, Ohio - a 7th-generation family farm with 2,000 acres of corn and soybeans, a 400-head cattle herd, and a growing on-farm market.\n- Splitter Farms in Sterling, Kansas - a row crop operation spanning 1,400 owned acres and 18,500 total acres, led by Matt and Janna Splitter using data-driven management.\n\nThe article also announces the winners of the 2026 Next Generation Award (Tim Nuss, California) and the 2026 Women in Agriculture Award (Helle Ruddenklau, Oregon). \n\nThe awards will be presented at the 2026 Top Producer Summit on February 9-11 in Nashville, Tennessee. The event is agriculture's premier conference for elite farmers and ranchers, and is sponsored by BASF, Fendt, and Pro Farmer.\n\nThe awards celebrate operations demonstrating resilience, innovation, and a focus on the future of agriculture through strong family leadership, diversification, technology adoption, and a commitment to excellence.",
      "summaryTimestamp": 1771057655265
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10 at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5.\n\nThe event will feature research on sorghum's value as a forage crop compared to corn. Sorghum is more drought-tolerant, has lower nitrogen requirements, and is not a host for the tar spot pathogen. Experts will discuss sorghum's production and utilization for silage, grazing, and as a standing winter feed source.\n\nAttendees will learn about forage sorghum research from Mitch Tuinstra, the Wickersham Chair of Excellence in Agricultural Research and scientific director of the Institute for Plant Sciences at Purdue. He will share plant breeding techniques to improve sorghum yield and quality.\n\nOther speakers include Brad Shelton, FPAC superintendent; Jason Tower, Southern Indiana Purdue Agricultural Center superintendent; Nick Minton, Purdue Extension beef systems specialist; and Jeff Jackson, Croplan alfalfa and forage specialist.\n\nVenue tours will be available from 3-5 pm and 6-8 pm. Dinner and a bull test station tour will be offered from 5-6 pm.",
      "summaryTimestamp": 1771057660967
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n- Farmer sentiment improved in July 2024 despite concerns about financial performance and lower crop/livestock prices.\n- The Purdue/CME Group Ag Economy Barometer rose 8 points to 113, the Index of Current Conditions increased 10 points to 100, and the Index of Future Expectations rose 7 points to 119.\n- High input costs remained the biggest concern for 34% of farmers, while 29% cited the risk of lower crop/livestock prices, up from 25% in June.\n- The Farm Financial Performance Index dropped 4 points to 81, 6 points lower than July 2023, due to concerns about weakening commodity prices and high input costs.\n- The Farm Capital Investment Index rose 6 points to 38, though it remains 7 points lower than July 2023, as fewer producers believe it's a bad time for large investments.\n- The Short-Term Farmland Value Expectations Index rose to 118 from 115, while the Long-Term Farmland Value Expectations Index dropped 6 points to 146.\n- 72% of crop farmers expect cash rental rates to remain roughly the same in 2025, with the remaining respondents divided on expecting increases or decreases.",
      "summaryTimestamp": 1771057666165
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue researchers are taking an interdisciplinary approach to assess the emerging tar spot disease in corn:\n\n- Tar spot, a fungal disease, was first detected in the U.S. in 2015 and has since spread to 16 states and Ontario, Canada. It has also affected crops in 15 other countries in Central and South America, the Caribbean, and U.S. territories.\n\n- Researchers are using a mix of methods including statistics, data science, epidemiology, microbiology, artificial intelligence, and computer vision to better understand the dynamics of tar spot. This work is funded by two USDA grants totaling nearly $1.1 million.\n\n- The research team has developed a digital method called SCDA (stromata contouring detection algorithm) to quantify tar spot in corn, which they have tested against human raters with promising results. They are refining the training methods to improve the model's accuracy.\n\n- Another collaboration between agricultural and engineering researchers aims to detect and classify disease symptoms in wheat and corn using AI and computer vision approaches. They are integrating drone imagery and weather data to understand the tar spot pathosystem.\n\n- Graduate students are also using disease observations and drone-based imagery to characterize tar spot epidemiological dynamics at various scales and model the disease severity.\n\n- The interdisciplinary nature of the research requires the team to overcome challenges in understanding each other's specialized languages, but it also leads to better problem-solving.",
      "summaryTimestamp": 1771057672720
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana Sheep Association (ISA), with support from the Indiana Sheep and Wool Market Development Program (IN S&W), is hosting various sheep-themed competitions, vendors, and educational opportunities at the 2024 Indiana State Fair:\n\n- The Wool and Ewe Room and Ewe2 boutique will be open throughout the fair, offering Indiana-grown wool items, livestock- and country-themed clothing, jewelry, and gifts.\n- On August 2 at 10 a.m., there will be an open wool judging and wool sale in the Blue Ribbon Pavilion.\n- The Make It With Wool (MIWW) competition and fashion show will take place on August 4 at 2 p.m. in the Indiana Arts Building.\n- The Indiana State Fair Shearing Contest will be held on August 4 at 5 p.m. in the Ball State University Champions Pavilion.\n- From August 8-11 from 11 a.m. to 6 p.m., the Taste from Indiana Farms event in the Indiana Farm Bureau Fall Creek Pavilion will offer free samples of Indiana lamb.\n- The Sheep to Shawl competition will be held on August 18 at 10 a.m. in the Indiana Arts Building.\n- Sheep can be found in the Blue Ribbon Pavilion from August 4-20 for open and 4-H shows.\n\nThe Indiana Sheep Association is one of the oldest livestock organizations in Indiana, founded in 1876 as the Indiana Wool Growers Association. The Indiana Sheep and Wool Market Development Program was created to support educational, promotional, and research efforts involving sheep in Indiana, funded by a 0.5% checkoff on the net market price of each sheep sold.",
      "summaryTimestamp": 1771057678647
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Purdue Extension will present engaging art and nature demonstrations at the 2024 Indiana State Fair, which runs from August 2-18.\n- The Purdue Extension Building will feature activities for all ages aligned with the fair's theme \"The Art & Nature of Fun,\" including a Block Party, Book Party, Captain Cash, and exhibits on entomology, human health, forestry, animal sciences, and more.\n- The Food Science Department will host \"What's Growing on My Spinach?\" to explore food microbiology and offer samples of \"Cricket Rice Krispies Treats\" and Boilermaker Hot Sauce.\n- Seed art showcasing the fair's theme will be displayed in livestock barns and the Purdue Extension Building.\n- Pioneer Village, sponsored by the Purdue Ag Alumni Association, will transport fairgoers to the 1800s with antique tractors, a farm toy show, fiddler's contest, and more.\n- Purdue Extension exhibits will be located throughout the fairgrounds, including the 4-H Exhibit Hall, Indiana Farmers Coliseum, and Purdue Extension Building.\n- Purdue University is a leading public research institution, with over 105,000 students studying across various modalities and locations.",
      "summaryTimestamp": 1771057684424
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The University of Wisconsin-Madison has released a new publication called \"Potassium Cycle\" that provides a visual overview of the potassium cycle in Wisconsin cropping systems. The two-page publication outlines key potassium concepts and recommendations for specific situations. The publication is available for download only and was released on June 12, 2024, through the Wisconsin Crop Manager (WCM) newsletter.",
      "summaryTimestamp": 1771057688458
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The key points from the Wisconsin Winter Wheat Update article are:\n\n- Wisconsin winter wheat is 10-14 days ahead of typical growth stages due to the warm spring and timely rain.\n- There is a high likelihood of stripe rust appearing in Wisconsin this season, though it has not been detected yet. Farmers are advised to scout for the disease and report any findings.\n- Fusarium head blight (FHB) is likely to be an issue this season due to moderate temperatures and adequate precipitation, after recent hot and dry spring seasons.\n- FHB can limit wheat yields and produce the mycotoxin deoxynivalenol (DON or vomitoxin), which can lead to grain discounts or rejection if levels exceed 2 ppm.\n- Farmers are encouraged to manage for FHB to mitigate these risks.\n\nThe article was written on May 20, 2024 by Damon Smith, Extension Field Crops Pathologist, and Shawn Conley, Extension Soybean and Small Grains Agronomist, at the University of Wisconsin-Madison.",
      "summaryTimestamp": 1771057693531
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The main points are:\n\n- Soybean plants can compensate for low plant stands by developing more axillary branches and pods.\n- Action should be considered if the stand has fewer than 50,000-60,000 evenly-distributed plants per acre in southern regions, or 75,000 plants per acre in northern regions, or if there are areas larger than 6-10 square feet without any plants.\n- Factors to evaluate include the existing plant stand and distribution, calendar date and impact on maturity, weed management, seed/variety availability, cost, and trade-offs between suboptimal stand vs. yield penalty from delayed replanting.\n- The article provides a link to a more detailed fact sheet on soybean replant decisions.\n\nNo specific dates, names, or statistics are provided in the article summary. The recommendations are general based on plant stand thresholds and regional differences.",
      "summaryTimestamp": 1771057697697
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n- The only 2,4-D formulation labeled for postemergence broadleaf weed control in Enlist E3 soybeans is the 2,4-D choline formulation found in Enlist One and Enlist Duo herbicides. 2,4-D ester and amine formulations cannot be used.\n\n- There have been reports of producers, agronomists, and crop advisors considering using the unauthorized ester or amine 2,4-D formulations for postemergence applications, which would be illegal.\n\n- For burndown applications, if using a 2,4-D ester or amine product, there is a 7-day soybean plant back interval when using 0.5 lbs ae/acre. This restriction does not apply when using Enlist One or Enlist Duo.\n\nThe article was posted on May 11, 2024 by Daniel H. Smith from the UW-Madison Division of Extension and Rodrigo Werle, a Weed Scientist and Extension Specialist at UW-Madison. It was published in the WCM newsletter focused on weeds.",
      "summaryTimestamp": 1771057701994
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Wisconsin CCA (Certified Crop Advisor) Board election results have been posted. Rob Shields, Matt Brugger, and Chris Bandura have been elected to serve two, three-year terms on the WI CCA Board. All WI CCAs in good standing are eligible for nomination and can vote in future elections, which will be held again in early 2025. The election process was managed by Daniel H. Smith, the Outreach Program Manager for the Crops and Soils Program at the University of Wisconsin-Madison Division of Extension.",
      "summaryTimestamp": 1771057705853
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 6,
  "updated": "2026-02-15T16:24:52.320Z"
}