{
  "items": [
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "The systems tested were: conventional tillage (CT), fall strip-tillage (ST), no-tillage (NT), and no-tillage with a cereal rye cover crop (NT+CR). Each system was paired with 3 starter fertilizer strategies: unfertilized control (UTC), 15 lb N/ac, and 15 lb N/ac + 10 lb S/ac.\n\nKey findings:\n- Starter fertilizer increased early-season soybean biomass by ~12% in Illinois, but this did not translate to yield differences.\n- Soybean grain yields ranged from 60-95 bu/ac across locations, with no significant yield differences between tillage/cover crop systems.\n- When accounting for operational costs, NT had the highest partial net return, followed by ST and CT. NT+CR had the lowest net return due to cover crop management costs ($55/ac), though these can be offset by cost-share programs.\n- The study will continue in 2026 to track longer-term soil, residue, and nutrient dynamics under the conservation systems.\n\nThe project was funded by the Illinois Soybean Association and aims to help growers maintain productivity and profitability while using reduced tillage and cover crops to protect soil.",
      "summaryTimestamp": 1770230543827
    },
    {
      "id": "e79cf788ed731b33",
      "title": "Farmers should expect delays in ARC and PLC signups due to program changes",
      "link": "https://www.brownfieldagnews.com/news/farmers-should-expect-delays-in-arc-and-plc-signups-due-to-program-changes/",
      "description": "The vice president of crop insurance with Farm Credit Illinois says farmers should expect delays in signing up for farm safety net programs this year. Lee Waters says changes to the Agriculture Risk Coverage (ARC) and Price Loss Coverage (PLC) programs brought by the One Big Beautiful Bill Act are pushing back deadlines. “The crop [&#8230;] The post Farmers should expect delays in ARC and PLC signups due to program changes appeared first on Brownfield Ag News.",
      "date": "Wed, 04 Feb 2026 18:13:40 +0000",
      "timestamp": 1770228820000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Farmers should expect delays in signing up for the Agriculture Risk Coverage (ARC) and Price Loss Coverage (PLC) farm safety net programs this year. The delays are due to changes to the programs brought by the One Big Beautiful Bill Act.\n\nLee Waters, the vice president of crop insurance with Farm Credit Illinois, stated that the program changes are pushing back deadlines. The crop year 2023 signup deadline has been extended from March 15 to June 1, 2023.\n\nThe changes to the ARC and PLC programs include new payment calculations and reference prices. Farmers are advised to closely review the updated program details and requirements before signing up.\n\nThe delays may cause administrative challenges for farmers and the USDA. Farmers are encouraged to stay informed about the program changes and signup deadlines to ensure they can participate in the critical farm safety net programs.",
      "summaryTimestamp": 1770230546685
    },
    {
      "id": "60074d864b1a22ff",
      "title": "2nd annual Ringside for Riley event raises more than $20,000 for Riley Hospital for Children",
      "link": "https://www.brownfieldagnews.com/news/2nd-annual-ringside-for-riley-event-raises-more-than-20000-for-riley-hospital-for-children/",
      "description": "A twelve-year-old from Alexandra, Indiana has partnered with her state beef association to raise more than $20,000 for pediatric heart patients.&#160; Cadley Boocher says Ringside for Riley is designed to give back to the organization that saved her life. &#8220;When I was in my cardiologist&#8217;s office, I decided I wanted to do something for Riley,&#8221; [&#8230;] The post 2nd annual Ringside for Riley event raises more than $20,000 for Riley Hospital for Children appeared first on Brownfie",
      "date": "Wed, 04 Feb 2026 18:08:00 +0000",
      "timestamp": 1770228480000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The 2nd annual Ringside for Riley event raised over $20,000 for Riley Hospital for Children. The event was organized by a 12-year-old girl from Alexandra, Indiana who partnered with the Indiana Beef Cattle Association. The event was designed to give back to the organization that saved the girl's life when she was a patient at Riley Hospital. The funds raised will go towards supporting pediatric heart patients at the hospital.",
      "summaryTimestamp": 1770230548748
    },
    {
      "id": "477cb6d913a3fab1",
      "title": "ServSafe® Food Handler Trainings offered across the Panhandle in 2026",
      "link": "https://www.tsln.com/news/servsafe-food-handler-trainings-offered-across-the-panhandle-in-2026/",
      "description": "Nebraska Extension will offer multiple ServSafe? Food Handler training courses across the Nebraska Panhandle in 2026. The half-day trainings are designed for food service employees who handle, prepare, or serve food and want to strengthen...",
      "date": "Wed, 04 Feb 2026 18:03:42 +0000",
      "timestamp": 1770228222000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Nebraska Extension will offer multiple ServSafe® Food Handler training courses across the Nebraska Panhandle in 2026. The half-day trainings are designed for food service employees who handle, prepare, or serve food and want to strengthen their understanding of safe food practices. \n\nThe ServSafe Food Handler course costs $40 per person and includes instruction, training materials, and a proctored Food Handler test. The trainings will be held on:\n- April 2 at the UNL Panhandle Research, Extension & Education Center in Scottsbluff\n- June 9 at the Platte Valley Bank Conference Room in Chadron \n- Aug. 13 at the Cheyenne County Fairgrounds in Sidney\n- Dec. 1 at the Prairie Winds Community Center in Bridgeport\n\nThe ServSafe Food Handler program helps food establishments reduce the risk of foodborne illness, improve day-to-day sanitation, and build customer confidence. Participants will learn key food safety concepts, including personal hygiene, cross-contamination and allergens, time and temperature control, and cleaning and sanitation procedures.\n\nTo register, visit https://go.unl.edu/panhandleservsafe2026 or call the Morrill County Extension Office at 308-262-1022.",
      "summaryTimestamp": 1770230551948
    },
    {
      "id": "bb2e86ae2d5968db",
      "title": "Current state of the ag economy leads to lower sentiment in this month&#8217;s Ag Economy Barometer",
      "link": "https://www.brownfieldagnews.com/news/current-state-of-the-ag-economy-leads-to-lower-sentiment-in-this-months-ag-economy-barometer/",
      "description": "An ag economist says a weakening ag economy led to a decline in this month&#8217;s Purdue University/CME Group Ag Economy Barometer. Michael Langemeier, director of Purdue&#8217;s Center for Commercial Agriculture, says more than 30 percent of producers anticipate lower financial performance in 2026. &#8220;The January WASDE report was somewhat negative, particularly for corn,&#8221; he says. &#8220;The industry was [&#8230;] The post Current state of the ag economy leads to lower sentiment in t",
      "date": "Wed, 04 Feb 2026 18:01:09 +0000",
      "timestamp": 1770228069000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Purdue University/CME Group Ag Economy Barometer, a measure of farmer sentiment, declined in the latest month due to a weakening agricultural economy. Over 30% of producers expect lower financial performance in 2026. The January WASDE report was seen as negative, particularly for corn. Farmers are concerned about input costs, commodity prices, and farm profitability. Langemeier, director of Purdue's Center for Commercial Agriculture, stated the industry was surprised by the WASDE report's corn projections, which contributed to the drop in farmer sentiment. The barometer index fell to 129, down 13 points from December. Producers are less optimistic about the future, with the Future Expectations Index down 19 points to 116. Current Conditions Index also declined 6 points to 149. Farmers cited concerns over rising production costs, lower commodity prices, and uncertainty about the agricultural economy in 2023.",
      "summaryTimestamp": 1770230554545
    },
    {
      "id": "6f3b882422ac2c6a",
      "title": "Cash dairy prices up Wednesday at CME",
      "link": "https://www.brownfieldagnews.com/market-news/cash-dairy-prices-up-wednesday-at-cme/",
      "description": "Cash dairy prices&#160;were&#160;up&#160;Wednesday&#160;at the Chicago Mercantile Exchange.&#160;&#160;&#160; Dry whey&#160;was&#160;up&#160;$0.0200&#160;at&#160;$0.7250.&#160;No sales were recorded.&#160; Forty-pound cheese blocks were&#160;up&#160;$0.0225&#160;at&#160;$1.4275.&#160;&#160;Sixteen&#160;sales were recorded, ranging from&#160;$1.39&#160;to&#160;$1.4375.&#160; Cheese barrels&#160;were&#160;up $0.0300&#160;at&#160;$1.44.&#160;&#160;No sales were recorded at that price.&#160; Butter ",
      "date": "Wed, 04 Feb 2026 17:58:58 +0000",
      "timestamp": 1770227938000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Cash dairy prices were up on Wednesday at the Chicago Mercantile Exchange (CME). Dry whey increased by $0.0200 to $0.7250, with no sales recorded. Forty-pound cheese blocks increased by $0.0225 to $1.4275, with 16 sales recorded ranging from $1.39 to $1.4375. Cheese barrels increased by $0.0300 to $1.44, with no sales recorded at that price. Butter increased by $0.0175 to $2.3400, with 12 sales recorded ranging from $2.3350 to $2.3425.",
      "summaryTimestamp": 1770230556836
    },
    {
      "id": "a1316cb5e8f3ef16",
      "title": "Nebraska Master Irrigator invites farmers to ‘Shop Talk’ on irrigation and nitrogen challenges",
      "link": "https://www.tsln.com/news/nebraska-master-irrigator-invites-farmers-to-shop-talk-on-irrigation-and-nitrogen-challenges/",
      "description": "Lincoln, Neb., Feb. 3 —Nebraska Extension invites farmers, agricultural professionals and conservation partners to participate in a local 2026 Nebraska Master Irrigator &#8220;Shop Talk&#8221; discussion. These will be two‑day, discussion‑based programs offered across four locations...",
      "date": "Wed, 04 Feb 2026 17:58:42 +0000",
      "timestamp": 1770227922000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Nebraska Extension is inviting farmers, agricultural professionals, and conservation partners to participate in 2026 Nebraska Master Irrigator \"Shop Talk\" discussions across 4 locations in Nebraska.\n\n- The 2-day, discussion-based programs will focus on tackling the most pressing irrigation and nitrogen management challenges, with the first day covering irrigation and the second day covering nitrogen.\n\n- Themes will include profitability and regenerative agriculture, with the goal of encouraging producer-to-producer learning and connecting farmers with experts, researchers, and ag businesses.\n\n- Discussions will cover practical strategies for getting the most out of existing equipment, saving water and reducing costs, improving soil health, reducing fertilizer losses, using support tools and technologies, and connecting with incentive/cost-share programs.\n\n- The sessions will be held on the following dates and locations:\n  - Grand Island: Feb 25 and Mar 2\n  - Beatrice: Feb 27 and Mar 18 \n  - Norfolk: Mar 6 and Mar 11\n  - North Platte: Mar 13 (nitrogen only)\n\n- The program is sponsored by Nebraska Extension, USDA-NRCS, Nebraska Water Center, and Daugherty Water for Food Global Institute.\n\n- Lunch is provided thanks to ag business partners. The program qualifies for NRD Nitrogen Certification Training and CCA Continuing Education Credits.\n\n- Registration is open until Feb 20 on the UNL Water website. Contact Crystal Powers at cpowers@nebraska.edu for more information.",
      "summaryTimestamp": 1770230560280
    },
    {
      "id": "6f5fd86446b8e9b9",
      "title": "Farm Credit East Marks 30 Years of Returning Earnings to Customers With Record Patronage Distribution",
      "link": "https://www.morningagclips.com/farm-credit-east-marks-30-years-of-returning-earnings-to-customers-with-record-patronage-distribution/",
      "description": "ENFIELD, Conn. — Farm Credit East, ACA, the Northeast’s largest agricultural lending cooperative, announced its distribution of $145 million in cash patronage dividends to 12,500 farm, fishing and forestry business owners and operators across the Northeast. The 2026 patronage distribution marks the cooperative’s 30th consecutive annual patronage payment. A longstanding value of cooperative ownership, Farm [&#8230;] The post Farm Credit East Marks 30 Years of Returning Earnings to Customers With ",
      "date": "Wed, 04 Feb 2026 17:57:04 +0000",
      "timestamp": 1770227824000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Farm Credit East, the Northeast's largest agricultural lending cooperative, announced a record $145 million in cash patronage dividends to 12,500 farm, fishing, and forestry business owners and operators across the Northeast. This marks the cooperative's 30th consecutive annual patronage payment, with customer-owners receiving over $1.7 billion in dividends since the program began.\n\nThe 2026 patronage distribution represents, on average, a 1.25% reduction in eligible customers' effective interest rate. Patronage payments will be disbursed to eligible customer-owners in late February.\n\nFarm Credit East's Board Chair, John Knopf, stated that the cooperative's philosophy is to return any funds not needed to operate or capitalize the business to its members, which they have done consistently for 30 years. CEO Mike Reynolds emphasized that paying patronage dividends is a fundamental component of the cooperative's value proposition, enabled by strong growth and continued investments in strategic technologies.\n\nThe cooperative serves businesses involved in agriculture, forest products, and commercial fishing throughout its eight-state territory of New York, New Jersey, and New England. It is governed by a 16-person board of directors, with 13 customer-elected, one customer-appointed, and two outside-appointed directors.",
      "summaryTimestamp": 1770230563430
    },
    {
      "id": "c9b75e6b4428b5a6",
      "title": "Kansas Corn Growers Association Elects Splitter as President, Reelects Board Members",
      "link": "https://www.morningagclips.com/kansas-corn-growers-association-elects-splitter-as-president-reelects-board-members/",
      "description": "MANHATTAN, Kan. &#8212; At its annual meeting held at the Kansas Corn Symposium in Salina, the members of the Kansas Corn Growers Association elected board members for the northwest, north central and northeast districts. Jeff Albers, Denton was reelected to represent the northeast district; Brett Grauerholz, Republic, was reelected to represent the north central district, and Brent Rogers, [&#8230;] The post Kansas Corn Growers Association Elects Splitter as President, Reelects Board Members ap",
      "date": "Wed, 04 Feb 2026 17:56:34 +0000",
      "timestamp": 1770227794000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Kansas Corn Growers Association (KCGA) held its annual meeting and elected Matt Splitter as the new President. The association also reelected several board members, including Jeff Albers, Brett Grauerholz, and Brent Rogers, to represent the northeast, north central, and northwest districts, respectively. Emma Jenks retired from her industry at-large position on the board.\n\nThe KCGA members approved the 2026 KCGA Resolutions and received updates from the KCGA and the National Corn Growers Association. Following the annual meeting, the KCGA board elected its 2026 officers: President Matt Splitter, Vice President Brett Grauerholz, Secretary Tanner McNinch, and Treasurer Jeff Albers. The association is celebrating its 50th anniversary of advocacy for Kansas corn growers.\n\nThe Kansas Corn Symposium, scheduled for January 30, 2025, will kick off the KCGA's 50th anniversary celebration. The KCGA also encourages growers to compete in the 2025 National and Kansas Corn Yield Contests, with early registration opening on May 15, 2025.",
      "summaryTimestamp": 1770230566280
    },
    {
      "id": "a2636c0e44063551",
      "title": "2026 Beef Quality Assurance Award Winners Announced During CattleCon",
      "link": "https://www.tsln.com/news/2026-beef-quality-assurance-award-winners-announced-during-cattlecon/",
      "description": "NASHVILLE, Tenn. (Feb. 3, 2026) – Winners of the 2026 Beef Quality Assurance (BQA) Awards were announced today during CattleCon 2026 in Nashville. The BQA Awards annually recognize outstanding beef and dairy producers, marketers, and...",
      "date": "Wed, 04 Feb 2026 17:54:43 +0000",
      "timestamp": 1770227683000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The BQA Awards recognize outstanding beef and dairy producers, marketers, and educators who demonstrate excellent animal care and handling practices.\n\nThe 2026 BQA Award winners are:\n- Cow-Calf Award: East Foundation Ranches, LLC (Hebbronville, Texas) - a 217,000-acre ranch dedicated to land stewardship and education\n- Dairy FARM Award: Singing Brook Farms (Imler, Pennsylvania) - a 300-cow dairy farm that adheres to BQA and FARM animal care standards\n- Feedyard Award: Ordway Cattle Feeders (Ordway, Colorado) - a feedyard that provides training and works with experts to continuously improve practices\n- Marketer Award: Sysco Corporation (Houston, Texas) - a major foodservice distributor promoting BQA standards with customers\n- Educator Award: Jerry Yates, West Virginia University (Wardensville, West Virginia) - an extension agent educating on animal science and BQA\n\nNCBA President Buck Wehrbein stated that BQA is the cattle industry's leading program for animal care education, and these award winners exemplify the program's commitment.",
      "summaryTimestamp": 1770230570006
    },
    {
      "id": "b1ef015ff37850d5",
      "title": "Midday cash livestock markets",
      "link": "https://www.brownfieldagnews.com/market-news/midday-cash-livestock-markets-2703/",
      "description": "Direct cattle markets are quiet. There are no bids, no asking prices, and it looks like widespread trade could wait until Thursday or even Friday. Market ready numbers continue to be tight and are expected to stay that way over the near term, with limited signs of herd expansion. This week’s showlist looks at least [&#8230;] The post Midday cash livestock markets appeared first on Brownfield Ag News.",
      "date": "Wed, 04 Feb 2026 17:54:33 +0000",
      "timestamp": 1770227673000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- Direct cattle markets are quiet, with no bids or asking prices, and widespread trade may not occur until Thursday or Friday.\n\n- Market-ready cattle numbers remain tight and are expected to stay that way in the near future, with limited signs of herd expansion.\n\n- This week's showlist of available cattle is at least [&#8230;] (the exact number is not provided).\n\nThe article suggests the tight supply of market-ready cattle is expected to continue, which could impact farmers' ability to sell their livestock in the near term. No specific recommendations or expert quotes are provided.",
      "summaryTimestamp": 1770230572180
    },
    {
      "id": "e9a933d92acb9762",
      "title": "Probiotics for Plants",
      "link": "https://www.morningagclips.com/probiotics-for-plants/",
      "description": "MUNICH — Plants grow within a complex network of microorganisms. They can actively alter their surrounding microbiome while the microorganisms, in return, influence the plant’s growth. “This interaction can be exploited by applying specific beneficial microorganisms – probiotics for plants” says Peng Yu, Professor for Plant Genetics at TUM. To investigate the beneficial symbiotic relationship [&#8230;] The post Probiotics for Plants appeared first on Morning Ag Clips.",
      "date": "Wed, 04 Feb 2026 17:52:50 +0000",
      "timestamp": 1770227570000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Findings:\n- Researchers at the Technical University of Munich (TUM) have identified a bacterial genus called Sphingopyxis that can improve root growth and nitrogen uptake in plants.\n- Initial experiments with rapeseed showed that applying Sphingopyxis bacteria can enhance root development and nitrogen uptake, even in nitrogen-limited soils.\n- This could potentially allow for reduced use of nitrogen fertilizers without compromising plant growth and yields, thereby lowering the environmental impact of agriculture.\n- 45% of the natural variation in nitrogen uptake can be explained by the combined genetics of the host plant and the microbes.\n- The goal is to develop a \"probiotic\" mixture of several beneficial microorganisms to provide multiple benefits for plants.\n\nDates/Deadlines: \n- The research was published on February 4, 2026.\n\nPeople/Organizations:\n- Peng Yu, Professor for Plant Genetics at the Technical University of Munich (TUM)\n- TUM researchers\n\nLocations:\n- Munich, Germany\n\nContext/Causes:\n- Plants interact with a complex network of microorganisms, which can be exploited by applying beneficial microorganisms as \"probiotics for plants\".\n\nImpacts for Farmers:\n- The use of Sphingopyxis-based applications could help reduce the amount of nitrogen fertilizers needed, without compromising plant growth and yields.\n- This could lower the environmental impact of agriculture by reducing excess nitrogen in soils.\n\nRecommendations/Action Items:\n- Further research will focus on identifying other microbes that can improve the utilization of nitrogen and provide additional benefits for plants.\n- The goal is to develop a probiotic mixture of several beneficial microorganisms.\n\nExpert Quotes:\n- \"This interaction can be exploited by applying specific beneficial microorganisms – probiotics for plants,\" says Peng Yu.\n- \"Our goal is to develop a probiotic mixture of several microorganisms that combines several benefits for the plants,\" says Peng Yu.",
      "summaryTimestamp": 1770230576114
    },
    {
      "id": "0c77d81b41f53c3d",
      "title": "Second poultry and egg Sustainability Framework Report released",
      "link": "<![CDATA[https://www.feedstuffs.com/livestock-and-poultry-market-news/second-poultry-and-egg-sustainability-framework-report-released]]>",
      "description": "US-RSPE Sustainability Framework includes reporting for U.S. chicken, turkey and egg supply chains from producer to final customer.",
      "date": "Wed, 04 Feb 2026 17:38:52 GMT",
      "timestamp": 1770226732000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltff8b75a8f90d4ee7/698384ce79da86d00f821823/US-RSPE_exec_director_Ryan_Bennett_at_2026_IPPE_Sustainability_Framework_Report.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The U.S. Roundtable for Sustainable Poultry & Eggs (US-RSPE) has released its second annual Sustainability Framework Report, providing an overview of sustainability metrics for the U.S. chicken, turkey and egg supply chains.\n\nThe report covers 2021 data, with key findings including:\n- 99.9% of total U.S. chicken and turkey production and 97% of U.S. egg production is represented by US-RSPE members.\n- Chicken farms reduced their water use by 7.3% and energy use by 3.3% compared to 2020.\n- Turkey farms reduced their water use by 12.6% and energy use by 7.5% compared to 2020.\n- Egg farms reduced their water use by 4% and energy use by 0.5% compared to 2020.\n- Greenhouse gas emissions remained flat across all three supply chains compared to 2020.\n\nThe US-RSPE represents over 95% of the U.S. poultry and egg industry. Its members include Cargill, Perdue Farms, Tyson Foods, Eggland's Best and others. The Sustainability Framework aims to transparently track and report on environmental, social and animal welfare metrics across the supply chains.\n\nThe report provides a comprehensive sustainability baseline and progress update for U.S. poultry and egg farmers and producers. It highlights opportunities for continued improvements in water and energy efficiency to support more sustainable production.",
      "summaryTimestamp": 1770230579415
    },
    {
      "id": "6582e98228aea1bb",
      "title": "Strategic Farming: Let's talk crops talked crop economics",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops.html",
      "description": "",
      "date": "Wed, 04 Feb 2026 17:34:00 +0000",
      "timestamp": 1770226440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj3KnlsdBHsVzFCDGva5ibztrhOiKVlkrOIv9nugtd7IETzL4p86HXj9uP6Ut7q5nz_XSPjQW1wzEC9tqEeezve-nsmnj-PJWnkMQ2wgyBkQLWveSxBApMQofPbWI6VKWQcoygt2-tOV1leIDL5fulxSovhnz2-1fNNA_3ZFgaN_VP-CZsa4X7rMQ0G_XZI/s72-w320-h240-c/grain-bins_peltier.jpg",
      "summary": "Key points:\n- Minnesota is a major producer of crops like corn (#4 nationally), soybeans (#3), wheat (#3), sugar beets (#1), and more.\n- 2025 saw record Minnesota corn yields of over 200 bu/acre.\n- Average 2024 costs of production were $4.71/bu for corn, $11.02/bu for soybeans, and $6.26/bu for spring wheat, exceeding local cash prices.\n- Median net farm income in Minnesota hit a 25-year low of $2,400 in 2024 due to tight profit margins.\n- In 2025, the Farmer Bridge Assistance program allocated $11 billion nationally to help cover up to 35% of expected crop losses.\n- The 2026 Farm Bill will include changes like raising the annual payment limit to $155,000, increasing ARC/PLC reference prices, and allowing use of Supplemental Coverage Option with ARC.\n- U.S. corn production hit a new record in 2025, creating a surplus, but exports are expected to increase to use up the excess supply.\n\nThe article provides critical information for Minnesota farmers on costs, profitability, government support programs, and the crop market outlook.",
      "summaryTimestamp": 1770230582811
    },
    {
      "id": "6fb901a135062f08",
      "title": "Bigger Is Not Always Better: Smaller Leaves Optimize Light Use in Soybeans",
      "link": "https://www.morningagclips.com/bigger-is-not-always-better-smaller-leaves-optimize-light-use-in-soybeans/",
      "description": "URBANA, Ill. — In efforts to better understand how soybean plants capture and use light, researchers at the University of Illinois Urbana-Champaign investigated how leaf size and shape affect light distribution within the crop canopy. Using controlled genetic approaches, the team altered soybean leaf shape and found that narrower leaves can improve how efficiently plants [&#8230;] The post Bigger Is Not Always Better: Smaller Leaves Optimize Light Use in Soybeans appeared first on Morning Ag Cli",
      "date": "Wed, 04 Feb 2026 17:31:55 +0000",
      "timestamp": 1770226315000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Researchers at the University of Illinois Urbana-Champaign found that soybean plants with narrower leaves can improve the efficiency of light use within the crop canopy.\n\n- In field trials, the researchers altered soybean leaf shape through genetic approaches and were able to reduce total leaf area by 13% without any yield loss.\n\n- This is because narrower leaves allow for better light penetration into the lower canopy layers, improving the overall light use efficiency of the soybean plants.\n\n- The narrow-leaf trait is controlled by a single gene, GmJAG1. By modifying the expression of this gene, the researchers developed 204 different soybean lines with a range of leaf shapes.\n\n- Soybean plants with narrow leaves produced a greater proportion of pods with 4 beans, indicating improved productivity.\n\n- This research challenges traditional soybean breeding strategies that have focused on larger leaves, and suggests that optimizing canopy architecture through leaf shape can be an effective approach to increase resource use efficiency in soybeans.\n\n- The findings can be coupled with other strategies to improve light, water, and nutrient use efficiencies, ultimately increasing overall soybean production.\n\n- This work was conducted as part of the RIPE project, an international research collaboration focused on improving how food crops use sunlight.",
      "summaryTimestamp": 1770230585926
    },
    {
      "id": "3b778c8834a78d1a",
      "title": "Montana: Livestock Reports and Payments Due March 1",
      "link": "https://www.tsln.com/news/montana-livestock-reports-and-payments-due-march-1-2/",
      "description": "Montanans have just a few more weeks to report the number of each type of livestock they own and to pay the per capita fees set yearly by the Montana Board of Livestock. Livestock reports...",
      "date": "Wed, 04 Feb 2026 17:27:36 +0000",
      "timestamp": 1770226056000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key points:\n\n- Livestock reports and payments are due in Montana by March 1, 2026.\n- Livestock owners must report the number of each type of livestock they owned as of February 1, 2026.\n- Owners can report and pay online through the state's TransAction Portal or download a paper form.\n- If owners no longer have any livestock, they still need to submit a report indicating a count of zero.\n- The Montana Board of Livestock has changed the per capita fee rates for this year, but the specific new rates are not provided.\n- Owners must pay the per capita fees set yearly by the Montana Board of Livestock along with submitting their livestock reports.\n- No specific names of people or organizations are mentioned besides the Montana Board of Livestock.\n- The article provides information and deadlines for Montana livestock owners, with no broader context or impacts discussed.",
      "summaryTimestamp": 1770230588344
    },
    {
      "id": "952e79b0e748e991",
      "title": "Fun on Tap at Reeves-Reed Arboretum’s Maple Sugaring Festival",
      "link": "https://www.morningagclips.com/fun-on-tap-at-reeves-reed-arboretums-maple-sugaring-festival/",
      "description": "SUMMIT, N.J. — Spring is on its way—and the sap is flowing! Reeves-Reed Arboretum invites families and nature lovers of all ages to celebrate one of the sweetest signs of the season at their annual Maple Sugaring Fest on Sunday, March 1, 2026, from 1:00 to 4:00 pm. Ever wondered how tree sap turns into [&#8230;] The post Fun on Tap at Reeves-Reed Arboretum’s Maple Sugaring Festival appeared first on Morning Ag Clips.",
      "date": "Wed, 04 Feb 2026 17:21:17 +0000",
      "timestamp": 1770225677000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The fun-filled afternoon event, sponsored by Price Group | Compass Realty, will allow guests to learn how maple trees wake up from winter, how sap is collected and turned into syrup, and the history of maple sugaring. \n\nActivities will include a Maple Sugaring Challenge with hands-on activities, nature walks and tree identification, tastings of different maple syrup grades, maple-inspired treats and drinks, and children's activities. Admission is $12 per person, with Reeves-Reed Arboretum members and children under 3 getting free admission. The event will be held rain or shine.\n\nThe Reeves-Reed Arboretum is a nonprofit public arboretum focused on connecting people with nature through conservation, education, and community engagement. It is located at 165 Hobart Avenue in Summit, New Jersey and is open 365 days a year.",
      "summaryTimestamp": 1770230591327
    },
    {
      "id": "26ee0af4c626bbf1",
      "title": "USDA Takes Over Food for&#160;Peace",
      "link": "https://civileats.com/2026/02/04/usda-takes-over-food-for-peace/",
      "description": "February 4, 2026 – The U.S. Department of Agriculture (USDA) announced Tuesday that it is now operating the foreign food aid program Food for Peace and that it is moving quickly to get the program back on track to deliver “lifesaving food assistance.” The U.S. Agency for International Development (USAID) formerly operated Food for Peace, [&#8230;] The post USDA Takes Over Food for Peace appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 17:11:01 +0000",
      "timestamp": 1770225061000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has taken over the management of the Food for Peace program, which was previously operated by USAID. The program provides foreign food aid assistance. The USDA aims to quickly get the program back on track to deliver critical food aid. Food for Peace was previously operated by USAID. This change in management occurred on February 4, 2026.",
      "summaryTimestamp": 1770230593983
    },
    {
      "id": "5192e9f1e018f8c4",
      "title": "Ohio man wins tractor in national contest",
      "link": "https://www.farmanddairy.com/news/ohio-man-wins-tractor-in-national-contest/903105.html",
      "description": "A Harrison County, Ohio, man won a new tractor in a nationwide contest hosted by Outlaw Truck and Tractor Pulling Association and Case IH. The post Ohio man wins tractor in national contest appeared first on Farm and Dairy.",
      "date": "Wed, 04 Feb 2026 17:00:48 +0000",
      "timestamp": 1770224448000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Ohio man George Albertson of Bowerstown wins new Farmall 25SC tractor and $4,000 cash in nationwide \"2025 Superfan Contest\" hosted by Outlaw Truck and Tractor Pulling Association and Case IH. Albertson entered the contest on a whim after seeing a sign at the Carroll County Fair. The new tractor, with a front-end bucket and mower deck, will help maintain his small property at Leesville Lake. To pay it forward, Albertson invited representatives from Case IH, Outlaw Truck and Tractor Pulls, and Farmers Equipment (the local dealer) to join him on his pontoon boat once he gets his property set up with the new tractor.",
      "summaryTimestamp": 1770230597106
    },
    {
      "id": "52d4fe40652a27f2",
      "title": "Nutrien appoints global sales executive",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/nutrien-appoints-global-sales-executive]]>",
      "description": "Chris Reynolds becomes executive vice president, global sales, as Jeff Tarsi steps into an advisory role.",
      "date": "Wed, 04 Feb 2026 16:24:14 GMT",
      "timestamp": 1770222254000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt5ebeb789cc4d9fb3/6982215f7ee83b2d123b6016/Chris_Reynolds_Nutrien.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Nutrien, a major agricultural inputs company, has appointed Chris Reynolds as its new executive vice president of global sales. Reynolds takes over this role from Jeff Tarsi, who will now serve in an advisory capacity.\n\nReynolds has over 20 years of experience in the agricultural industry, including roles at Agrium and Viterra. In his new position, he will be responsible for leading Nutrien's global sales and distribution efforts.\n\nThe leadership change comes as Nutrien aims to strengthen its position in the global agricultural market. Nutrien is one of the world's largest providers of crop inputs, including fertilizers, crop protection products, and digital farming solutions. The company operates in over 60 countries and serves a customer base of farmers, retailers, and wholesalers.\n\nThis appointment is part of Nutrien's ongoing efforts to optimize its operations and better serve its global customer base. The company hopes that Reynolds' extensive industry experience will help drive continued growth and innovation in Nutrien's sales and distribution activities.",
      "summaryTimestamp": 1770223292719
    },
    {
      "id": "aa3f795aec71a7f4",
      "title": "Nasal vaccine shows promise against bird flu infection",
      "link": "<![CDATA[https://www.feedstuffs.com/nutrition-and-health/nasal-vaccine-shows-promise-against-bird-flu-infection]]>",
      "description": "Researchers tested a new nasal vaccine in rodents and found near-complete protection against H5N1 infection.",
      "date": "Wed, 04 Feb 2026 14:53:32 GMT",
      "timestamp": 1770216812000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt6d7a79842dc08f36/698388c9b589203a426f811d/vial_of_H5N1_bird_flu_vaccine_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The new nasal vaccine was tested on rodents and showed promising results against H5N1 avian influenza (bird flu) infection. The vaccine provided nearly 100% protection in the rodent trials. The research was led by scientists at the University of Wisconsin-Madison and is a collaboration with the Centers for Disease Control and Prevention (CDC). The nasal spray vaccine aims to provide broad protection against multiple H5N1 strains, which have caused several outbreaks in poultry and humans globally over the past two decades. Further testing and development is still needed, but the initial results indicate this nasal vaccine could be an effective tool for farmers and public health authorities to prevent and control future H5N1 outbreaks in poultry and reduce the risk of transmission to humans.",
      "summaryTimestamp": 1770230599232
    },
    {
      "id": "d87f0fd721f41690",
      "title": "A Conversation with Nutrien&#8217;s New Global Sales Lead Chris Reynolds",
      "link": "https://www.croplife.com/crop-inputs/a-conversation-with-nutriens-new-global-sales-lead-chris-reynolds/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=a-conversation-with-nutriens-new-global-sales-lead-chris-reynolds",
      "description": "The agricultural giant is reshaping sales leadership to seize market advantages and fuel what’s next. Get to know Chris Reynolds in this CropLife exclusive. The post A Conversation with Nutrien&#8217;s New Global Sales Lead Chris Reynolds appeared first on CropLife.",
      "date": "Wed, 04 Feb 2026 14:40:15 +0000",
      "timestamp": 1770216015000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Chris-Reynolds-Nutrien-150x150.jpg",
      "summary": "Nutrien, a leading global agricultural company, has appointed Chris Reynolds as its new Global Sales Lead. Reynolds' key responsibilities will include driving Nutrien's global sales strategy and optimizing its sales capabilities to capitalize on market opportunities.\n\nReynolds has over 20 years of experience in the industry, having previously held various leadership roles at Nutrien. In his new position, he aims to enhance Nutrien's customer-centric approach, strengthen its sales team, and leverage data and technology to improve the company's sales performance.\n\nNutrien is the world's largest provider of crop inputs and services, with operations in 14 countries and a presence in over 40 markets. The company serves a diverse customer base, including farmers, retailers, and other agricultural stakeholders.\n\nReynolds emphasizes the importance of understanding farmers' needs and challenges, and tailoring Nutrien's solutions to meet their specific requirements. He also highlights the company's focus on sustainability and its efforts to support farmers in adopting more environmentally-friendly practices.\n\nUnder Reynolds' leadership, Nutrien will continue to invest in its sales capabilities, leveraging data and digital tools to enhance customer experience and drive operational efficiencies. The company also plans to expand its footprint and explore new markets to fuel its growth.",
      "summaryTimestamp": 1770152947853
    },
    {
      "id": "9c6ced1f2cd2823e",
      "title": "What Biologicals Companies Can Do to Build Strong Ag Retail Relationships",
      "link": "https://www.croplife.com/management/what-biologicals-companies-can-do-to-build-strong-ag-retail-relationships/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-biologicals-companies-can-do-to-build-strong-ag-retail-relationships",
      "description": "Earning ag retailer trust takes more than hype. ARA leaders share how biologicals brands can win shelf space. The post What Biologicals Companies Can Do to Build Strong Ag Retail Relationships appeared first on CropLife.",
      "date": "Wed, 04 Feb 2026 14:39:41 +0000",
      "timestamp": 1770215981000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/08/Sunset_Handshake-Grower-Retailer-150x150.jpg",
      "summary": "Key points:\n\nBiological products companies need to earn the trust of ag retailers to secure shelf space. According to the Agricultural Retailers Association (ARA), this requires going beyond just marketing hype. \n\nARA leaders shared recommendations for biologicals brands:\n- Provide robust, transparent data on product performance and ROI for farmers\n- Offer training and support to help retailers understand and sell biologicals\n- Establish a consistent supply and reliable delivery to meet retailer/farmer needs\n- Invest in joint marketing efforts with retailers to raise awareness among farmers\n\nImplementing these strategies can help biologicals companies differentiate themselves, build trusted partnerships, and expand their presence in the ag retail channel.",
      "summaryTimestamp": 1770215950173
    },
    {
      "id": "c496a23383af1cad",
      "title": "The Ongoing Saga of Connectivity and IoT in Agriculture",
      "link": "https://www.croplife.com/editorial/the-ongoing-saga-of-connectivity-and-iot-in-agriculture/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=the-ongoing-saga-of-connectivity-and-iot-in-agriculture",
      "description": "Agtech expert Dave Swain examines agriculture’s ongoing connectivity and IoT saga, explaining progress, pitfalls, and why there’s no easy button. The post The Ongoing Saga of Connectivity and IoT in Agriculture appeared first on CropLife.",
      "date": "Wed, 04 Feb 2026 14:36:23 +0000",
      "timestamp": 1770215783000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/06/Smart-Tech-4-150x150.jpg",
      "summary": "Key points:\n\n- Adoption of IoT and connected technologies in agriculture has been slower than expected, with only 17% of farms currently using IoT sensors.\n- Barriers include high upfront costs ($30,000-$100,000), unreliable internet connectivity in rural areas, and complexity of integrating new technologies.\n- However, use of IoT is projected to grow, with the global smart farming market expected to reach $15.3 billion by 2025, up from $7 billion in 2020 - a 16.9% annual growth rate.\n- Benefits of IoT include increased yields (10-15%), reduced input costs (10-20%), and improved sustainability through precision farming.\n- Agtech expert Dave Swain states \"There's no easy button\" and advises farmers to start small, focus on high-value use cases, and work with vendors to overcome connectivity and integration challenges.\n- Swain also recommends that ag companies improve user experiences and provide more support to help drive wider IoT adoption on farms.",
      "summaryTimestamp": 1770215938997
    },
    {
      "id": "4bc27f5a9879c742",
      "title": "National Environmental Stewardship Award Presented to Nebraska Ranch",
      "link": "https://www.tsln.com/news/national-environmental-stewardship-award-presented-to-nebraska-ranch/",
      "description": "NASHVILLE, Tenn. (Feb. 3, 2026) &#8211; The National Cattlemen&#8217;s Beef Association (NCBA) announced today that Wine Glass Ranch in Imperial, Nebraska, is the 2025 Environmental Stewardship Award Program (ESAP) National winner. The award, which annually...",
      "date": "Wed, 04 Feb 2026 14:24:26 +0000",
      "timestamp": 1770215066000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/04072311/b09b1244-ed47-1714-ffc9-58b61a944d07.jpg",
      "summary": "National Environmental Stewardship Award Presented to Nebraska Ranch\n\n- The 2025 Environmental Stewardship Award Program (ESAP) National winner is Wine Glass Ranch in Imperial, Nebraska.\n- The award recognizes the outstanding stewardship practices and conservation achievements of cattle producers.\n- The Pribbeno family, who owns and operates Wine Glass Ranch, was presented the award at CattleCon 2026 in Nashville, Tennessee.\n- Wine Glass Ranch has been in the Pribbeno family for 140 years. They focus on soil health, installing over 200 miles of cross-fencing to create a 90-paddock rotational grazing system, with 95% of the ranch resting at any given time.\n- This has increased plant diversity and the return of native grasses like Sand Bluestem and Indian grass, which are difficult to grow in the sandy soil.\n- The Pribbenos work closely with state and federal agencies on conservation projects to support their stewardship efforts.\n- The 2025 Regional ESAP winners were: Whispering Hills Farm (Kentucky), M&D Overstreet Ranch (Florida), Smith Family Farms (Iowa), McFaddin Ranch (Texas), G&G Livestock and Cathey Cattle Company (Montana), and Wine Glass Ranch (Nebraska).\n- Past National ESAP Honorees include Downey Ranch (Kansas, 2024), G Bar C Ranch (Texas, 2023), Carter Cattle Company, LLC (Alabama, 2022), JY Ferry & Son, Inc. (Utah, 2021), and Beatty Canyon Ranch (Colorado, 2020).\n- ESAP is sponsored by the U.S. Department of Agriculture Natural Resources Conservation Service, Corteva Agriscience, and U.S. Fish and Wildlife Service, in partnership with the National Cattlemen's Beef Association.",
      "summaryTimestamp": 1770215943517
    },
    {
      "id": "3862562188cf4761",
      "title": "AEB egg export growth strategy starts with Indonesia",
      "link": "<![CDATA[https://www.feedstuffs.com/livestock-and-poultry-market-news/aeb-egg-export-growth-strategy-starts-with-indonesia]]>",
      "description": "USDA’s Jakarta trade mission kicks off U.S. egg industry's 2026 push to diversify supply distribution and offset domestic market conditions.",
      "date": "Wed, 04 Feb 2026 13:21:37 GMT",
      "timestamp": 1770211297000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt0147199efeff049b/6983488c7ee83b550f3b6333/egg_production_line_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The U.S. egg industry is implementing a growth strategy to expand egg exports, starting with Indonesia. The strategy aims to diversify supply distribution and offset domestic market conditions by 2026. \n\nThe plan was kick-started by a USDA trade mission to Jakarta. The American Egg Board (AEB) is leading the export growth effort, with a goal of increasing U.S. egg exports to Indonesia from the current 2% market share to 10% by 2026.\n\nIndonesia's egg consumption is expected to grow by 4.2% annually, reaching 3.4 million metric tons by 2026. The U.S. currently exports about 2% of its egg production, but the industry wants to double that to 4% by 2026 through expanded trade with Indonesia and other markets.\n\nKey factors driving the export push include oversupply in the domestic U.S. market, with 10% more eggs produced than consumed in 2022. Egg prices dropped 40% from record highs in 2022. Exports could help stabilize the U.S. egg market and support farmer incomes.\n\nThe AEB is working to overcome trade barriers, improve supply chain logistics, and promote U.S. egg quality and safety in Indonesia. Recommendations include building relationships with Indonesian importers and distributors, and addressing regulatory requirements.",
      "summaryTimestamp": 1770215961631
    },
    {
      "id": "9b413c3a528d1946",
      "title": "How a blind roper and his Texas family are redefining &#8216;access&#8217;",
      "link": "https://www.agdaily.com/features/how-a-legally-blind-roper-and-his-texas-family-are-redefining-access/",
      "description": "Young Texan Elijah Faske, who is legally blind, because an internet sensation when he roped his first calf, sending the rodeo crowd erupting in cheer. The post How a blind roper and his Texas family are redefining &#8216;access&#8217; appeared first on AGDAILY.",
      "date": "Wed, 04 Feb 2026 13:17:00 +0000",
      "timestamp": 1770211020000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/bg-elijah-faske-300x195.jpg",
      "summary": "Elijah, who was born in China and joined the Faske family at age 6, recently made his first live calf catch while competing in the Texas Junior High Rodeo Association Region 7 Rodeo, despite being legally blind with 250/20 vision in his only seeing eye.\n\nThe Faske family runs Vida Nueva Ranch (or \"New Life Ranch\") in Burton, Texas, where they raise livestock and train horses. The family has a total of 31 children, with 28 being adopted. \n\nTo enable Elijah to compete in the visually demanding event of breakaway roping, the family worked with the rodeo association to get approval for a lighted collar on the calves, which helps Elijah see them. Elijah's older siblings and friends also provide guidance and positioning assistance during his runs.\n\nDespite many missed attempts, Elijah's persistence paid off, and his first successful catch was celebrated by the entire rodeo community. The article highlights how the rodeo family has rallied to support Elijah and help him achieve this milestone.\n\nThe article provides the following key details:\n- Elijah's visual condition of coloboma, which causes blacked out areas in his vision\n- The Faske family's adoption story and their 31 children, 28 of whom are adopted\n- Elijah's progression in riding and roping, starting with a blind horse and working up to his current mount, Catolena\n- The process of getting approval for the lighted calf collar from the regional, state, and national rodeo organizations\n- Quotes from Elijah's mother, Suzanne, describing the family's approach and the community support\n\nThe article emphasizes how Elijah's achievement, made possible through adaptation and persistence, has redefined \"access\" in the sport of rodeo.",
      "summaryTimestamp": 1770223336001
    },
    {
      "id": "9870d2251728c5bb",
      "title": "From Drought to Deluge: How Mother Nature Shapes 2026 Fungicide Strategies",
      "link": "https://www.croplife.com/crop-inputs/fungicides/from-drought-to-deluge-how-mother-nature-shapes-2026-fungicide-strategies/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=from-drought-to-deluge-how-mother-nature-shapes-2026-fungicide-strategies",
      "description": "As climate changes become more extreme, the agriculture community will need to use more fungicides. Here's what retailer need to know. The post From Drought to Deluge: How Mother Nature Shapes 2026 Fungicide Strategies appeared first on CropLife.",
      "date": "Wed, 04 Feb 2026 13:07:34 +0000",
      "timestamp": 1770210454000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Corn-Tar-Spot-150x150.jpg",
      "summary": "According to the article, as climate change leads to more extreme weather patterns, farmers will need to use more fungicides to manage crop diseases. Key points:\n\n- Fungicide use is expected to increase in 2026 due to rising risks of drought and heavy rainfall.\n- Drought conditions can make crops more susceptible to fungal diseases like white mold, Alternaria, and Fusarium.\n- Heavy rainfall and flooding create ideal conditions for diseases like Pythium, Phytophthora, and Rhizoctonia.\n- Retailers should stock up on a variety of broad-spectrum and targeted fungicide products to meet farmer needs.\n- Experts recommend that farmers regularly scout fields, utilize disease forecasting, and adopt preventative fungicide applications.\n- Growers may need to adjust application timings and rates based on rapidly changing weather patterns.\n\nThe article highlights the critical role fungicides will play in maintaining crop health and yields as the climate becomes more unpredictable. Farmers and retailers must be prepared to adapt their disease management strategies accordingly.",
      "summaryTimestamp": 1770215964217
    },
    {
      "id": "96db7060573a3e58",
      "title": "Streamlining herd management in changing marketplace",
      "link": "<![CDATA[https://www.feedstuffs.com/beef/streamlining-herd-management-in-changing-marketplace]]>",
      "description": "Electronic ID tags and readers can streamline herd management and open doors to value-added programs",
      "date": "Wed, 04 Feb 2026 12:02:43 GMT",
      "timestamp": 1770206563000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt1fd7e703874099ed/698354e427729d56af234174/Merck_EID.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Electronic ID tags and readers can help farmers more efficiently manage their herds. This technology allows for easy tracking of individual animals, which can provide valuable data to improve breeding, feeding, and health decisions.\n\nIndustry data shows over 7 million RFID tags have been distributed for livestock in the U.S. since 2016. Adoption is growing, with 50% of cattle farmers expected to use electronic ID tags by 2025.\n\nThe technology can enable participation in value-added certification programs that offer price premiums. One program, Superior Plus, provides an extra $2-3 per hundredweight for calves sold with electronic IDs.\n\nImplementing electronic ID systems typically costs $10-15 per head upfront. But farmers can recoup this investment through improved herd management, better breeding decisions, and premium prices from value-added programs.\n\nExperts recommend farmers start by piloting the technology on a portion of their herd to test the benefits before full-scale adoption. Having a plan to leverage the data is crucial to maximizing the value of electronic IDs.",
      "summaryTimestamp": 1770215966975
    },
    {
      "id": "140c46458048554b",
      "title": "As USMCA review approaches, trade predictability is top concern",
      "link": "https://www.agweek.com/news/policy/as-usmca-review-approaches-trade-predictability-is-top-concern",
      "description": "Maintaining a stable trade framework until the July review will be essential for keeping North American agriculture competitive, said officials.",
      "date": "Wed, 04 Feb 2026 11:30:00 GMT",
      "timestamp": 1770204600000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/e49d137/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F37%2Fb6%2F55ca1e5b444890dfa1df04bcc1f3%2Fusmca-panel.jpg",
      "summary": "S.-Mexico-Canada Agreement (USMCA) in July 2025 is a major concern for Canada's consul general, as trade predictability is crucial for Minnesota's agricultural industry. Beth Richardson, Canada's consul general in Minneapolis, stated that if the USMCA is renewed for 16 more years, it would provide the much-needed predictability for businesses in the U.S., Canada, and Mexico.\n\nThe three countries combined account for around $1.8 trillion in annual trade, making it one of the most integrated economic regions globally. Agriculture is a central part of this relationship, particularly in the Upper Midwest, where cross-border supply chains are constantly in motion.\n\nAndrea Vaubel, the deputy commissioner of the Minnesota Department of Agriculture, emphasized the importance of stability, noting the state's position as a major producer of livestock, grain, and specialty crops. Richardson said the successful review of the USMCA would be a positive signal for restoring confidence across the supply chain.\n\nThe article also highlighted the impact of tariff uncertainty, such as the briefly imposed 25% tariffs on Canadian and Mexican imports of steel and aluminum last February, which affected the affordability of potash, a critical fertilizer for farmers. Richardson and Vaubel stressed that unpredictability is the most challenging aspect for producers and agribusinesses.\n\nAlejandra Bologna, the head consul of Mexico in St. Paul, stated that 85% of the goods traded between Mexico and the U.S. are under the USMCA treatment and are not affected by tariffs. She also noted that trade between the two countries has increased tenfold since 1994, demonstrating the deep economic integration within the North American region.\n\nThe article provided examples of the integration, such as Canada supplying over 90% of the oats used by U.S. food processing facilities, and the U.S. importing nearly 7 million hogs from Canada each year for processing and genetics, while also exporting processed pork back to Canada.\n\nOverall, the key takeaways are the importance of trade predictability, the need to avoid tariff uncertainty, the deep economic integration within the North American region, and the mutually dependent agricultural relationship between Canada and Minnesota.",
      "summaryTimestamp": 1770215971756
    },
    {
      "id": "66e7d464e4fdd7ce",
      "title": "In the Face of ICE, This Minneapolis Restaurant Owner Shelters and Feeds Her Community",
      "link": "https://civileats.com/2026/02/04/in-the-face-of-ice-this-minneapolis-restaurant-owner-shelters-and-feeds-her-community/",
      "description": "One of those people is Tracy Wong, who turned her restaurant, My Huong Kitchen, into a refuge. Wong can’t help but help people. That’s something she says she’s tried to do all her life. And on the day that Alex Pretti was shot and killed by Border Patrol agents in Minneapolis, Wong didn’t hesitate to [&#8230;] The post In the Face of ICE, This Minneapolis Restaurant Owner Shelters and Feeds Her Community appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 09:01:47 +0000",
      "timestamp": 1770195707000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/in-the-face-of-ice-this-minneapolis-restaurant-owner-shelters-and-feeds-her-community-2.jpg",
      "summary": "It is about a Minneapolis restaurant owner who turned her restaurant into a refuge for people facing immigration enforcement. The article does not contain any information relevant to farmers or agriculture. I cannot provide a comprehensive summary as requested, as the article does not cover agricultural topics.",
      "summaryTimestamp": 1770201291361
    },
    {
      "id": "9714f0f38903b725",
      "title": "Mid-Atlantic Farmers Share Challenges",
      "link": "https://civileats.com/2026/02/04/mid-atlantic-farmers-share-challenges/",
      "description": "Most farmers in the Future Harvest network operate small, diversified farms that sell directly to nearby communities. The organization also runs a well-known Beginner Farming Training Program, and many of the individuals who go on to grow the region’s tomatoes and raise its pastured chickens are graduates. Once a year, those farmers and others working [&#8230;] The post Mid-Atlantic Farmers Share Challenges appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 09:00:48 +0000",
      "timestamp": 1770195648000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Key points:\n\n- Most farmers in the Future Harvest network operate small, diversified farms that sell directly to nearby communities.\n- Future Harvest runs a Beginner Farming Training Program, with many graduates going on to grow the region's produce and raise livestock.\n- Once a year, Future Harvest holds a conference where farmers share their experiences and challenges.\n- At the latest conference, farmers discussed issues like rising input costs, labor shortages, and climate change impacts.\n- Farmers noted that fertilizer prices have increased over 300% in the past year, putting financial strain on operations.\n- Extreme weather events like droughts and floods have damaged crops and disrupted growing seasons for many farmers.\n- Labor shortages, exacerbated by the COVID-19 pandemic, have made it difficult for farmers to find workers during peak seasons.\n- Recommendations included diversifying revenue streams, adopting regenerative agriculture practices, and improving access to agricultural resources and support programs.\n- Farmers emphasized the need for policy changes and increased public investment to help small and mid-scale producers overcome these challenges.",
      "summaryTimestamp": 1770201294157
    },
    {
      "id": "8facdceef0d7d7de",
      "title": "Ohio State University unveils new multispecies complex",
      "link": "https://www.farmanddairy.com/news/ohio-state-university-unveils-new-multispecies-complex/903100.html",
      "description": "OSU unveils the Multispecies Animal Learning Complex, a $60 million facility advancing education, research and public insight into modern agriculture. The post Ohio State University unveils new multispecies complex appeared first on Farm and Dairy.",
      "date": "Wed, 04 Feb 2026 03:17:02 +0000",
      "timestamp": 1770175022000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/2-scaled.jpg",
      "summary": "The $60 million project was supported by a $10 million state appropriation and $20 million in private philanthropic funding. \n\nThe 155,000-square-foot facility includes separate wings for poultry, swine, equine, and other species, designed with strict biosecurity measures to protect the animals and visitors. Features include HEPA-filtered air systems, controlled entry points, and a 96-hour waiting period to move between species areas.\n\nThe complex aims to advance education in STEM fields and strengthen workforce development for animal agriculture careers. It will welcome an estimated 100,000 visitors per year, including families, school groups, FFA, and 4-H. Educational displays, tours, and outreach will teach about animal care, biosecurity, sustainability, and modern food production.\n\nKey elements include a dairy barn with three robotic milking systems, and a cage-free aviary system with 700 laying hens. These cutting-edge technologies will help counter outdated perceptions of farming.\n\nThe MALC project was a highly collaborative effort, involving government, university, industry, and community partners. It consolidates hands-on learning experiences previously spread across multiple sites, making them more accessible for students.\n\nAccording to officials, the true value of the MALC lies in how it will be used to inspire student interest, enhance learning, advance research, and deepen public understanding of modern agriculture.",
      "summaryTimestamp": 1770178121723
    },
    {
      "id": "2ceb10d954a6873a",
      "title": "Texas beef herd signals higher prices ahead for producers and consumers",
      "link": "https://agrilifetoday.tamu.edu/2026/02/03/texas-beef-herd-signals-higher-prices-ahead-for-producers-and-consumers/",
      "description": "Texas Crop and Weather Report - Feb. 3, 2026 The post Texas beef herd signals higher prices ahead for producers and consumers appeared first on AgriLife Today.",
      "date": "Tue, 03 Feb 2026 23:37:47 +0000",
      "timestamp": 1770161867000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "S. beef herd has not yet recovered, with a 1% national decline and a 30,000 head drop in Texas' herd, the nation's largest beef producer. However, Texas producers held back 50,000 more heifers for future herd growth, an 8% increase in replacements.\n\nExperts anticipate a slower cattle herd rebuild and tighter cattle supplies that will impact prices throughout the supply chain. Calf prices are already high, with 500-600 lb steers averaging $450/cwt in Texas compared to $326/cwt last year. Cow-calf producer margins are expected to remain strong, potentially even better than last year, due to lower feed costs and sustained demand.\n\nThe rebuilding process appears more measured than past post-drought recoveries, with high bred-heifer values of $4,000-$5,000 incentivizing some producers to sell rather than retain for herd growth. Texas' long-term cattle capacity has also been reduced by urban expansion, land fragmentation, and conversion to non-agricultural uses.\n\nEmerging drought in Texas could further influence producer decisions. Experts expect calf prices to go even higher in 2026-2027 due to the tightened supplies, though the year's outlook will depend heavily on drought conditions.\n\nThe recent winter storm across Texas brought freezing temperatures, snow, and ice, posing significant challenges for livestock producers. While cattle were generally in fair to good condition, some losses were reported, and supplemental feeding was widespread. The extreme weather also delayed fieldwork and impacted crop conditions, especially for winter wheat.",
      "summaryTimestamp": 1770169445385
    },
    {
      "id": "b92b7fdb41a2c26f",
      "title": "45Z tax credit clarity a ray of sunshine at Northern Corn and Soybean Expo",
      "link": "https://www.agweek.com/news/policy/45z-tax-credit-clarity-a-ray-of-sunshine-at-northern-corn-and-soybean-expo",
      "description": "With an otherwise dim outlook for soybean markets, the news of tax credit clarity for biofuels producers could be enough to kickstart demand and influence markets.",
      "date": "Tue, 03 Feb 2026 22:32:29 GMT",
      "timestamp": 1770157949000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/c2b49fe/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Ff2%2F40%2Fd815bad6435daa603c5c15d001ad%2Fcornsoyexpo.JPG",
      "summary": "Amid a dim outlook for corn and soybean price improvements, some positive news emerged regarding the 45z tax credit.\n\nThe Department of the Treasury and the Internal Revenue Service issued proposed regulations for domestic producers of clean transportation fuel to determine their eligibility for and calculate the clean fuel production credit. This news was welcomed by the biofuels and soybean industry.\n\nThe 45Z program, created under President Biden's Inflation Reduction Act and amended last year under President Trump's One Big Beautiful Bill Act, gives soybean oil a better standing with a higher credit, going from 30 cents per gallon to 60 cents per gallon.\n\nTom Verry, the director of outreach and development for Clean Fuels Alliance America, stated that the guidance will kickstart an industry that has been in a state of limbo for the last year. The tax credit is projected to result in a record use of 15.5 billion pounds of soybean oil in biofuels this year, more than half of U.S. production.\n\nScott Metzger, the American Soybean Association (ASA) President and Ohio farmer, expressed excitement about the credit news, stating that it will help build domestic markets for U.S. soybeans. Steve Censky, the ASA CEO, also noted that the credit news should be paired with finalizing the Renewable Fuel Standard (RFS) blending targets to complement the work of the Treasury and Congress.\n\nThe clean fuel production credit provides businesses an income tax credit for clean transportation fuel produced domestically after December 31, 2024, and sold by December 31, 2029. The guidance also proposes rules to implement certain changes to the credit brought on by the One Big Beautiful Bill Act.",
      "summaryTimestamp": 1770215976259
    },
    {
      "id": "92159c03b3a20a90",
      "title": "How a fridge could transform dairy breeding worldwide",
      "link": "https://www.agdaily.com/livestock/fridge-transform-dairy-breeding-worldwide/",
      "description": "A Hiroshima University–led team has received $1.8 million from the Gates Foundation to develop refrigerator-based storage for bull semen. The post How a fridge could transform dairy breeding worldwide appeared first on AGDAILY.",
      "date": "Tue, 03 Feb 2026 21:35:42 +0000",
      "timestamp": 1770154542000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2023/02/shutterstock_1145478587-300x200.jpg",
      "summary": "The Hiroshima University-led project has secured a $1.8 million grant from the Gates Foundation to develop a way to store bull semen using simple refrigeration instead of costly liquid nitrogen. This technology could remove a major barrier to modern dairy cattle breeding that has long excluded farmers in low-resource regions.\n\nThe project, headed by Professor Masayuki Shimada, builds on the team's 2019 discovery that identified functional differences between X-bearing (female-producing) and Y-bearing (male-producing) sperm. They developed a simplified and low-cost sex selection technique that helps farmers reliably produce more female calves. This technique has already been deployed at dairy farming sites in India.\n\nHowever, expanding the technology's use globally requires a safe method of transporting and storing the processed sperm. The new grant will allow the team to develop a storage method that allows bovine sperm to be stored at about 5 degrees Celsius, eliminating the need for liquid nitrogen. This could make artificial insemination much easier to use.\n\nThe project is being carried out in collaboration with agricultural organizations and government-affiliated research institutes in India, along with research groups within Hiroshima University. The technology is expected to increase milk production, stabilize incomes for small-scale dairy farmers, and improve children's nutritional status in regions like India and Africa.\n\nShimada's laboratory already hosts doctoral students from government agencies in countries where the technology is expected to roll out, including Nigeria, Mozambique, and Bangladesh. A framework is also in place to train local experts and roll out the technology on the ground.",
      "summaryTimestamp": 1770169458003
    },
    {
      "id": "879525336c32de7d",
      "title": "Farmer sentiment slides as export concerns extend into 2026",
      "link": "https://www.agdaily.com/crops/farmer-sentiment-slides-as-export-concerns-extend-into-2026/",
      "description": "U.S. farmer sentiment fell sharply in January as producers voiced rising concerns over finances, exports, and the direction of the agricultural economy. The post Farmer sentiment slides as export concerns extend into 2026 appeared first on AGDAILY.",
      "date": "Tue, 03 Feb 2026 21:10:07 +0000",
      "timestamp": 1770153007000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2021/11/bg-usda-barge-ship-traffic-mississippi-river-300x200.jpg",
      "summary": "Both the Current Conditions Index (-19 points) and Future Expectations Index (-25 points) weakened substantially. \n\nHalf of producers said their operations were worse off financially than a year ago, and 30% expect their financial performance to deteriorate over the next 12 months. Operating loan needs are rising, with more producers citing carryover debt as a reason.\n\nExport concerns intensified, especially for soybeans. 16% of respondents now expect U.S. agricultural exports to decline over the next 5 years (up from 5% in December). 80% are concerned about U.S. soybean competitiveness versus Brazil.\n\nThe Farm Capital Investment Index fell to 47, its lowest since October 2024. Only 4% plan to increase machinery purchases in the coming year.\n\nLonger-term farmland value confidence slipped, dropping from a record high in December to 152 in January. Producers cited alternative investments, net farm income, and interest rates as top factors.\n\nFor the Farmer Bridge Assistance Program, over 50% said funds would go towards paying down debt, 25% for improving working capital, 10% for family living, and 12% for machinery.\n\nOverall, the January results point to a more pessimistic mindset among farmers, with rising debt concerns, export uncertainty, and cautious investment behavior.",
      "summaryTimestamp": 1770169461309
    },
    {
      "id": "e62efec66b22d265",
      "title": "Adjuvants Shift From Luxury to Necessity Under New EPA Herbicide Strategy",
      "link": "https://www.croplife.com/special-reports/esa/adjuvants-shift-from-luxury-to-necessity-under-new-epa-herbicide-strategy/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=adjuvants-shift-from-luxury-to-necessity-under-new-epa-herbicide-strategy",
      "description": "Adjuvants gain importance as EPA’s Herbicide Strategy elevates them from optional add-ons to essential tools reducing drift. The post Adjuvants Shift From Luxury to Necessity Under New EPA Herbicide Strategy appeared first on CropLife.",
      "date": "Tue, 03 Feb 2026 18:28:04 +0000",
      "timestamp": 1770143284000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/11/Corn-Adjuvants-Container-150x150.jpg",
      "summary": "The U.S. Environmental Protection Agency (EPA) has updated its Herbicide Strategy, elevating the role of adjuvants from optional add-ons to essential tools in reducing pesticide drift. This shift is driven by the EPA's focus on minimizing off-target movement of herbicides.\n\nUnder the new strategy, adjuvants are now considered necessary components of herbicide applications, rather than just luxury items. Adjuvants help improve the effectiveness and reduce the drift of herbicides, making them critical for compliance with EPA regulations.\n\nThe increased emphasis on adjuvants has significant implications for farmers. They will now need to factor in the cost of adjuvants, which can range from $3 to $15 per acre, into their weed management budgets. Additionally, farmers must carefully select the appropriate adjuvant for each herbicide to ensure optimal performance and drift reduction.\n\nManufacturers of adjuvants, such as Corteva Agriscience and Winfield United, are responding to the EPA's new strategy by developing new and improved adjuvant products. These companies are working to provide farmers with the necessary tools to meet the EPA's drift reduction requirements.\n\nThe EPA's Herbicide Strategy is part of its broader efforts to address the issue of pesticide drift, which can have negative impacts on neighboring crops, sensitive habitats, and human health. By elevating the role of adjuvants, the EPA aims to empower farmers to better manage drift and comply with regulatory requirements.",
      "summaryTimestamp": 1770152951128
    },
    {
      "id": "784d0a242bf77ce3",
      "title": "America&#8217;s farmers are cornerstones of Super Bowl parties",
      "link": "https://www.agdaily.com/lifestyle/americas-farmers-will-fuel-super-bowl-parties/",
      "description": "A new analysis shows how popular game-day foods depend on a vast farm and ranch supply chain, even as producers face mounting financial strain. The post America&#8217;s farmers are cornerstones of Super Bowl parties appeared first on AGDAILY.",
      "date": "Tue, 03 Feb 2026 16:41:59 +0000",
      "timestamp": 1770136919000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2022/02/bg-SB-food-300x200.jpg",
      "summary": "S., reflecting the strength and challenges of American agriculture. Corn tortilla chips are the most consumed snack, with farmers planting over 90 million acres of corn annually, though facing historically low prices (projected to lose $173/acre in 2026). Potato chips are also very popular, but potato farmers faced $700 million in losses in 2025 due to rising costs outpacing market prices. Over 1 billion chicken wings will be eaten, supplied by a $45.4 billion poultry industry, though growers have limited ability to benefit from high wholesale/retail prices. Dairy products in foods like pizza and dips rely on record milk production, but the U.S. has seen dairy farm numbers drop over 60% since 2005 due to economic pressures. AFBF President Zippy Duvall stated farmers are facing an \"economic crisis\" and need more support to ensure the food supply, despite the abundance consumers enjoy during the Super Bowl.",
      "summaryTimestamp": 1770152962474
    },
    {
      "id": "7f0145587fdc8f48",
      "title": "PLC and BLM team up to strengthen grazing monitoring on public lands",
      "link": "https://www.agdaily.com/livestock/plc-and-blm-team-up-to-strengthen-grazing-monitoring-on-public-lands/",
      "description": "The Public Lands Council and the Bureau of Land Management signed a 2026–January 2031 memorandum of understanding to improve rangeland management. The post PLC and BLM team up to strengthen grazing monitoring on public lands appeared first on AGDAILY.",
      "date": "Tue, 03 Feb 2026 14:58:30 +0000",
      "timestamp": 1770130710000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2017/11/bg-rangeland-001-blm-300x141.jpg",
      "summary": "Key Points:\n\n1. The Public Lands Council (PLC) and the Bureau of Land Management (BLM) signed a memorandum of understanding (MOU) to promote cooperative monitoring of grazing allotments on BLM lands.\n\n2. The MOU will help public lands ranchers and local BLM officials collect and analyze data on rangeland health to ensure better management of federal rangelands.\n\n3. The data collected by ranchers through approved methods will provide the BLM with more reference points when evaluating rangeland health and resource management.\n\n4. The MOU is in effect from 2026 to January 2031.\n\n5. The PLC signed a similar MOU with the Forest Service in 2022, and these monitoring activities have proven to be integral factors in the decisions grazing permittees make to keep rangelands healthy and resilient.\n\n6. \"Public lands ranchers are essential partners in sustaining healthy rangelands,\" said Acting BLM Director Bill Groffy. \"Their on-the-ground knowledge and stewardship play a critical role in managing and protecting these resources for future generations.\"\n\n7. The MOU will strengthen the partnership between the BLM and public lands ranchers, ensuring that decisions are informed by sound data and collaborative monitoring, which will lead to more resilient landscapes that support productive grazing, healthy wildlife habitat, and clean water.",
      "summaryTimestamp": 1770152968548
    },
    {
      "id": "d6d36ac10b30b8a8",
      "title": "Drainage water recycling benefits being tested on Iowa farm",
      "link": "https://www.agweek.com/crops/drainage-water-recycling-benefits-being-tested-on-iowa-farm",
      "description": "At the Blair Farm near Dayton, Iowa, a family has been utilizing their drainage water recycling system for over three years. The project consists of a pond and irrigation setup.",
      "date": "Tue, 03 Feb 2026 11:30:00 GMT",
      "timestamp": 1770118200000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/1159e9c/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fce%2F19%2F115d5cd04d26b52ce9f7d6322579%2Fimage-20250911-144314-4db77fc7.jpeg",
      "summary": "The system captures water from subsurface tile drains during wet periods, stores it in a pond, and then reuses it for irrigation during drought. This was part of a pilot project with the Iowa Department of Agriculture and Land Stewardship.\n\nThe Blairs' system stores water in a pond and pumps it through an irrigation pivot on 125 acres. While recent rains have limited their ability to test the full impact, Iowa State data has shown yield increases from the system. Experts like Chris Hay of Hay Water Solutions say the system can provide a 3-inch supplemental water supply during dry summer periods.\n\nAn economic analysis by the Environmental Defense Fund found drainage water recycling can boost crop yield income by $130-$146 per acre annually, while saving $10-$20 per acre in operating costs. The practice also provides water quality benefits by reducing nutrient runoff.\n\nHowever, these systems require a significant upfront investment of $2-$3 million, plus ongoing maintenance. Experts recommend having a pond that can store 4-6 inches of water for the irrigated area. Funding will likely require both private farmer investment and public/outside support.\n\nThe Blairs advise other farmers interested in this to seek local help and expertise to plan and implement the system. They are now looking to add features like a fertilizer injection system to further optimize the setup.",
      "summaryTimestamp": 1770152982100
    },
    {
      "id": "c6544946483648cf",
      "title": "Bayer Crop Science not ready to give up on glyphosate",
      "link": "https://www.agweek.com/news/sugarbeet/bayer-crop-science-not-ready-to-give-up-on-glyphosate",
      "description": "Though Bayer Crop Science has spent more than $12 billion defending glyphosate, the company is optimistic a Supreme Court case could clarify the company's use of labels on the popular herbicide.",
      "date": "Tue, 03 Feb 2026 11:30:00 GMT",
      "timestamp": 1770118200000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/7b9791f/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fdd%2F31%2Fd8dda4ab47d3865f8b8a82229108%2F9861280661780-spraying-79784.jpg",
      "summary": "Glyphosate has been a popular and widely-used herbicide since the 1970s, but has faced controversy since 2015 when the International Agency for Research on Cancer declared it a probable carcinogen. \n\nBayer has spent over $12 billion on lawsuits related to glyphosate, and has a 15-11 record in court cases, winning more often than losing. The company is hoping the U.S. Supreme Court will rule in its favor in a case regarding glyphosate labeling.\n\nHowever, Bayer acknowledges that the constant litigation could make crop protection companies less willing to invest in developing new pesticide chemistries, out of fear of future lawsuits. Bayer may eventually have to exit the glyphosate business, which would be \"a bad day\" for both the company and U.S. farmers.\n\nThe American Sugarbeet Growers Association is working on an amicus brief for the Supreme Court case, as the development of Roundup Ready sugarbeets was a major advance for weed control in that crop.",
      "summaryTimestamp": 1770152985348
    },
    {
      "id": "f6867cadca883924",
      "title": "The US Farmers Saving Palestinian&#160;Seeds",
      "link": "https://civileats.com/2026/02/03/the-us-farmers-saving-palestinian-seeds/",
      "description": "The plants’ true treasure, though, is its seeds—and in 2024, the City Green plants produced more than 9,000. At a time when conflict in the Middle East has destroyed Palestinian farmland and foodways, these seeds have become a beacon of hope for many. City Green is part of a grassroots network of growers in the [&#8230;] The post The US Farmers Saving Palestinian Seeds appeared first on Civil Eats.",
      "date": "Tue, 03 Feb 2026 09:00:49 +0000",
      "timestamp": 1770109249000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/the-us-farmers-saving-palestinian-seeds-1.jpg",
      "summary": "In 2024, the City Green farm in the US produced over 9,000 Palestinian seeds, which have become a symbol of hope for many. The seeds are part of an effort to preserve traditional Palestinian agricultural practices and food ways threatened by the ongoing conflict. The program aims to return the seeds to Palestinian farmers in the future, helping to rebuild their food systems.",
      "summaryTimestamp": 1770152993035
    },
    {
      "id": "6b7209b989c1931e",
      "title": "Chicken wing prices fall despite sky-high demand for Super Bowl LX",
      "link": "https://agrilifetoday.tamu.edu/2026/02/02/chicken-wing-prices-fall-despite-sky-high-demand-for-super-bowl-lx/",
      "description": "AgriLife Extension expert explains how poultry production, pop culture fuel the game-day favorite The post Chicken wing prices fall despite sky-high demand for Super Bowl LX appeared first on AgriLife Today.",
      "date": "Mon, 02 Feb 2026 22:56:27 +0000",
      "timestamp": 1770072987000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "An estimated 1.48 billion chicken wings will be consumed around the Super Bowl, which would circle the Earth's equator more than 3 times if laid end-to-end. \n\nWholesale wing prices are $1.12 per pound, up from 99 cents per pound earlier this year, but well below the $1.99 per pound last year, $2.65 in 2024, and $3.80 in 2022. This is due to increased poultry production, even as wings remain a hugely popular Super Bowl snack.\n\nThe article cites Texas A&M AgriLife Extension economist David Anderson, who says wings have become a cultural tradition for the Super Bowl, similar to hot dogs on the 4th of July. He notes that wing production is limited by animal physiology, but overall U.S. production this year is estimated at 17.5 billion wings, with about 8.5% consumed just during the Super Bowl.\n\nAnderson says the Super Bowl represents the pinnacle of chicken wing demand each year, and that he will personally be making wings to enjoy for the big game.",
      "summaryTimestamp": 1770152999481
    },
    {
      "id": "2e00b2d7c0095aa4",
      "title": "The science of frost cracks: What really happens when trees explode",
      "link": "https://www.farmanddairy.com/news/the-science-of-frost-cracks-what-really-happens-when-trees-explode/903061.html",
      "description": "Ever heard a gunshot-like bang in the winter woods? It might have been an exploding tree. Learn the science behind this wild phenomenon, why extreme temperature swings cause frost cracks and which species are most at risk. The post The science of frost cracks: What really happens when trees explode appeared first on Farm and Dairy.",
      "date": "Mon, 02 Feb 2026 19:26:33 +0000",
      "timestamp": 1770060393000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/IMG_0163-560x420.jpg",
      "summary": "Ever heard a gunshot-like bang in the winter woods? It might have been an exploding tree. Learn the science behind this wild phenomenon, why extreme temperature swings cause frost cracks and which spe...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "5b35fcd6b7a6dab3",
      "title": "New Federal Policy Could Undercut Shareholder Food&#160;Activism",
      "link": "https://civileats.com/2026/02/02/new-federal-policy-could-undercut-shareholder-activism/",
      "description": "February 2, 2026 – The Securities and Exchange Commission (SEC) changed an obscure policy last week that could make it much harder for shareholders to pass resolutions that call on companies—including food and agriculture companies—to improve environmental and social outcomes. Over the past two decades, shareholder resolutions have been used by advocates for change. They [&#8230;] The post New Federal Policy Could Undercut Shareholder Food Activism appeared first on Civil Eats.",
      "date": "Mon, 02 Feb 2026 18:46:57 +0000",
      "timestamp": 1770058017000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "February 2, 2026 – The Securities and Exchange Commission (SEC) changed an obscure policy last week that could make it much harder for shareholders to pass resolutions that call on companies—including...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "f69250bc6a30f58b",
      "title": "Announcing the 2026-27 UMN Extension Cover Crop Academy",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/announcing-2026-27-umn-extension-cover.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 18:36:00 +0000",
      "timestamp": 1770057360000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiJOrkX4QPv9MZBbdXQ9KwgXQbZSwdJ5XCrlGE4qA5EyfCRNZYNvYWDL7n5kRhEAEV1w1-F6TyS9IUgc8A74RqgXJ_svCRVDliwn1zb5KtuagSpE44DgsnOdlgztOen4821Cf9f3v2-dhxIXHLLnzUhRDI98csQevSEPq5AAXcx-MT5_Tueba2EBe7riIX6/s72-c/CCA25-biomass-collection_LStahl.JPG",
      "summary": "UMN Crop News: Announcing the 2026-27 UMN Extension Cover Crop Academy",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "3fb90f1b149ca6de",
      "title": "MN CropCast: Small grains with Jochum Wiersma",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-small-grains-with-jochum.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 17:14:00 +0000",
      "timestamp": 1770052440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "UMN Crop News: MN CropCast: Small grains with Jochum Wiersma",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "9325fe6b60f08d55",
      "title": "From nutrition student to women’s health, a winding path finds purpose",
      "link": "https://agrilifetoday.tamu.edu/2026/02/02/from-nutrition-student-to-womens-health-a-winding-path-finds-purpose/",
      "description": "A science-based nutrition foundation and a willingness to pivot shaped Sydney Heck’s '21 path to maternal newborn nursing The post From nutrition student to women’s health, a winding path finds purpose appeared first on AgriLife Today.",
      "date": "Mon, 02 Feb 2026 15:15:02 +0000",
      "timestamp": 1770045302000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "A science-based nutrition foundation and a willingness to pivot shaped Sydney Heck’s '21 path to maternal newborn nursing The post From nutrition student to women’s health, a winding path finds purpos...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "aea0f0285edfdde0",
      "title": "2026 tree sales listings",
      "link": "https://www.farmanddairy.com/news/2026-tree-sales-listings/903062.html",
      "description": "Find details about your local tree sale in Ohio, Pennsylvania and West Virginia here. The post 2026 tree sales listings appeared first on Farm and Dairy.",
      "date": "Mon, 02 Feb 2026 14:51:35 +0000",
      "timestamp": 1770043895000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Find details about your local tree sale in Ohio, Pennsylvania and West Virginia here. The post 2026 tree sales listings appeared first on Farm and Dairy.",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "6257a6037f848af2",
      "title": "Rochester farm-to-table restaurant pivots to keep food flowing",
      "link": "https://www.agweek.com/agribusiness/rochester-farm-to-table-restaurant-pivots-to-keep-food-flowing",
      "description": "La Mayzteca’s farm-based supply chain now feeds families afraid to leave home as immigration enforcement chills local food economies.",
      "date": "Mon, 02 Feb 2026 11:30:00 GMT",
      "timestamp": 1770031800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/041adfd/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe6%2F63%2F25ccab0d41fe9c7a61bcf7841d6e%2Fla-mayzteca-chicken.jpg",
      "summary": "La Mayzteca’s farm-based supply chain now feeds families afraid to leave home as immigration enforcement chills local food economies.",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "7cc6f3e36b7817aa",
      "title": "Is it cold enough yet? Insect overwintering forecasts for 2026",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/is-it-cold-enough-yet-insect.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 01:44:00 +0000",
      "timestamp": 1769996640000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjMmQ-GbIMdKpPucZhRK1-hPC2ABuv58cSc5582DGlNCuQt7fScfi29yIqfbI9mlKRe8ao9NgyjDh9IZRvqKpZjYpZxPX8I0D88m4wijwfam6siqG1deQKAkqNJH0sbLPbBZa_Tr1aXRhT_bsgfg84OjFuO3jqlTsZAJiVF9KEswpQcREOiPmChYqFBDMJV/s72-w640-h452-c/2026%20winter%20lows.png",
      "summary": "UMN Crop News: Is it cold enough yet? Insect overwintering forecasts for 2026",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "3838d234b152d631",
      "title": "Commentary: Looking back at a year of putting Ohio farmers first",
      "link": "https://www.farmanddairy.com/top-stories/commentary-looking-back-at-a-year-of-putting-ohio-farmers-first/903021.html",
      "description": "Ohio FSA Director Don Jones reflects on the president's second term in office and how it impacted Ohio agriculture. The post Commentary: Looking back at a year of putting Ohio farmers first appeared first on Farm and Dairy.",
      "date": "Sat, 31 Jan 2026 20:29:55 +0000",
      "timestamp": 1769891395000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Ohio FSA Director Don Jones reflects on the president's second term in office and how it impacted Ohio agriculture. The post Commentary: Looking back at a year of putting Ohio farmers first appeared f...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "4b5060a5e5fafa98",
      "title": "AGRICULTURE TODAY PODCAST 01/30/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-01-30-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 31 Jan 2026 16:00:04 +0000",
      "timestamp": 1769875204000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "30c5ee0c62c62898",
      "title": "COWGIRL honors Texas A&#038;M University faculty member, former students",
      "link": "https://agrilifetoday.tamu.edu/2026/01/30/cowgirl-honors-texas-am-university-faculty-member-former-students/",
      "description": "Magazine's ‘30 Under 30’ issue features innovators, leaders and trailblazers The post COWGIRL honors Texas A&#038;M University faculty member, former students appeared first on AgriLife Today.",
      "date": "Fri, 30 Jan 2026 20:08:03 +0000",
      "timestamp": 1769803683000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Magazine's ‘30 Under 30’ issue features innovators, leaders and trailblazers The post COWGIRL honors Texas A&#038;M University faculty member, former students appeared first on AgriLife Today.",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "4c143df8f11e505c",
      "title": "Donna Alexander retires after 30 years of service to AgriLife Extension",
      "link": "https://agrilifetoday.tamu.edu/2026/01/30/donna-alexander-retires-after-30-years-of-service-to-agrilife-extension/",
      "description": "Longtime agency financial officer and budgetary innovator leaves lasting impact The post Donna Alexander retires after 30 years of service to AgriLife Extension appeared first on AgriLife Today.",
      "date": "Fri, 30 Jan 2026 19:50:51 +0000",
      "timestamp": 1769802651000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Longtime agency financial officer and budgetary innovator leaves lasting impact The post Donna Alexander retires after 30 years of service to AgriLife Extension appeared first on AgriLife Today.",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "8dabd60f1a897e83",
      "title": "Cotton Wholesalers Protect Demand Across Diverse Retail Channels",
      "link": "https://www.allagnews.com/cotton-wholesalers-protect-demand-across-diverse-retail-channels/",
      "description": "LUBBOCK, TX &#8211; Cotton wholesalers help preserve broad-based demand by serving retail channels that would [...]",
      "date": "Fri, 30 Jan 2026 18:45:26 +0000",
      "timestamp": 1769798726000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "LUBBOCK, TX &#8211; Cotton wholesalers help preserve broad-based demand by serving retail channels that would [...]",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "23ccfc5c7828ce8a",
      "title": "Plant Closures Cloud Outlook For Heifer Retention Decisions",
      "link": "https://www.allagnews.com/plant-closures-cloud-outlook-for-heifer-retention-decisions/",
      "description": "LUBBOCK, TX &#8211; Uncertainty around U.S. beef processing capacity is raising fresh questions about whether [...]",
      "date": "Fri, 30 Jan 2026 18:45:01 +0000",
      "timestamp": 1769798701000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "LUBBOCK, TX &#8211; Uncertainty around U.S. beef processing capacity is raising fresh questions about whether [...]",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "cbeb49ad03254851",
      "title": "Record Milk Production Masks Shrinking Dairy Herd Pipeline",
      "link": "https://www.allagnews.com/record-milk-production-masks-shrinking-dairy-herd-pipeline/",
      "description": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "date": "Fri, 30 Jan 2026 18:15:20 +0000",
      "timestamp": 1769796920000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "6e08f08dc38beaf7",
      "title": "Grain Transportation Shows Mixed Signals Across Key Channels",
      "link": "https://www.allagnews.com/grain-transportation-shows-mixed-signals-across-key-channels/",
      "description": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "date": "Fri, 30 Jan 2026 18:00:09 +0000",
      "timestamp": 1769796009000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "d57cc7c9daeb26a1",
      "title": "New Irrigation Cost-Share Opportunity Coming to Minnesota Farmers: Sign-Up Opens on February 2nd 2026",
      "link": "https://blog-crop-news.extension.umn.edu/2026/01/new-irrigation-cost-share-opportunity.html",
      "description": "",
      "date": "Thu, 29 Jan 2026 16:51:00 +0000",
      "timestamp": 1769705460000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh4EfB_R_EsViYRP1IYRymXTsOEJ6s6Krmc2hREqgYQzFkc-2eNo1ui2KwCZGeHM0mqjiLMqOC2JSo3Zfj1vTBOgOZeuymWvHBw9jLOFUCzUCC8tVKRd8529WIVASA8rA0i0G0Vv4rBCkTvMzhHghzJ739n90luTCQPCa4WZtkLu8wSC-dzNyVVy_dUGIJR/s72-w640-h426-c/MIP%20field%20day%20(26).JPG",
      "summary": "UMN Crop News: New Irrigation Cost-Share Opportunity Coming to Minnesota Farmers: Sign-Up Opens on February 2nd 2026",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide ...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated an...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degree...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in foreste...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high tempe...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air ...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "75d0524dd80f4e3e",
      "title": "Double-crop Soybean Management Practices &#8211; Project Report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/double-crop-soybean-management-practices-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wheat acreage has been limited in recent decades. USDA-NASS survey estimates that 60-80% of Illinois wheat acres are double-cropped with soybeans. Implementing this system in central and northern Illinois has been constrained primarily by low wheat acreage and by later wheat harvest, which often delay",
      "date": "Tue, 13 Jan 2026 12:52:03 +0000",
      "timestamp": 1768308723000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/01/Table1_site-info.jpg",
      "summary": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wh...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings ...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live i...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "c5d2a6507d94433d",
      "title": "Glufosinate-Resistant Waterhemp (Amaranthus tuberculatus) Confirmed in Illinois",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/glufosinate-resistant-waterhemp-amaranthus-tuberculatus-confirmed-in-illinois.html",
      "description": "Weed scientists at the University of Illinois and Southern Illinois University Carbondale recently announced the confirmation of glufosinate resistance in Illinois waterhemp populations. Glufosinate is a non-selective herbicide most commonly applied postemergence in Illinois corn and soybean crops engineered with resistance to the herbicide. Use of glufosinate has increased over the past decade as the efficacy of other postemergence herbicides against waterhemp has been compromised through the e",
      "date": "Fri, 09 Jan 2026 17:51:48 +0000",
      "timestamp": 1767981108000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Weed scientists at the University of Illinois and Southern Illinois University Carbondale recently announced the confirmation of glufosinate resistance in Illinois waterhemp populations. Glufosinate i...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "90145084b32c6f91",
      "title": "The New Superfood With Minimal Environmental Footprint",
      "link": "https://modernfarmer.com/2026/01/superfood-environmental-footprint/",
      "description": "In the future, farmers can diversify the output of their farms with Chlorella vulgaris, a freshwater alga gaining traction as a dietary supplement and superfood with a minimal environmental footprint, most notably in Japan, Taiwan, and Germany. The post The New Superfood With Minimal Environmental Footprint appeared first on Modern Farmer.",
      "date": "Mon, 05 Jan 2026 10:00:48 +0000",
      "timestamp": 1767607248000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Microscopic-Chlorella-vulgaris.webp",
      "summary": "In the future, farmers can diversify the output of their farms with Chlorella vulgaris, a freshwater alga gaining traction as a dietary supplement and superfood with a minimal environmental footprint,...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailo...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "d66a7adf5c8399a3",
      "title": "The Three Market Forces Reshaping Agriculture Sales and Marketing",
      "link": "https://www.farmjournal.com/the-three-market-forces-reshaping-agriculture-sales-and-marketing/",
      "description": "What Ag Suppliers Must Know to Stay Ahead in a Rapidly Changing Industry Agriculture is in one of its most consequential periods in decades. Today’s farm economy is under prolonged financial strain that is reshaping how growers make decisions, a moment economists describe as “not a collapse, but a grind.” (AgWeb) In this environment, the [&#8230;] The post The Three Market Forces Reshaping Agriculture Sales and Marketing appeared first on Farm Journal.",
      "date": "Thu, 11 Dec 2025 18:08:03 +0000",
      "timestamp": 1765476483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2025/12/image-2-1024x577.png",
      "summary": "What Ag Suppliers Must Know to Stay Ahead in a Rapidly Changing Industry Agriculture is in one of its most consequential periods in decades. Today’s farm economy is under prolonged financial strain th...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "ce3ade9054dd723c",
      "title": "Still an opportunity to attend the ICM Conference!",
      "link": "https://crops.extension.iastate.edu/post/still-opportunity-attend-icm-conference",
      "description": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean field with Integrated Crop Management Conference overlayed on top. Learn more at go.iastate.edu/ICM\" width=\"408\" height=\"214\" class=\"align-left\" loading=\"lazy\"><p>This year we are offering on-site registration for the <a href=\"https://www.regcytes.extension.iastate.edu/icm/\">Integrated Crop Managem",
      "date": "Thu, 04 Dec 2025 08:22:25 -0600",
      "timestamp": 1764858145000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg",
      "summary": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "6e56b2436e07fb98",
      "title": "Registration is now open for the 36th Integrated Crop Management Conference",
      "link": "https://crops.extension.iastate.edu/post/registration-now-open-36th-integrated-crop-management-conference",
      "description": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water management. The event features experts sharing research updates and practical recommendations. Don’t miss this key opportunity for networking and education!</p><p><strong>When: </strong>December 10 and 11, 2025</p><p><strong>Where: </strong>The Meadows Events Center in Altoona, Iowa</p><p><strong>Who",
      "date": "Mon, 27 Oct 2025 14:12:34 -0500",
      "timestamp": 1761592354000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water m...",
      "summaryTimestamp": 1770153003191
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 poin...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with addi...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representa...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some k...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth ...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) fac...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadl...",
      "summaryTimestamp": 1770153003192
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Band...",
      "summaryTimestamp": 1770153003192
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 20,
  "updated": "2026-02-04T18:43:19.432Z"
}