{
  "items": [
    {
      "id": "ab10de189804770c",
      "title": "Hello San Antonio!",
      "link": "https://www.morningagclips.com/hello-san-antonio/",
      "description": "San Antonio, here I come! It’s a Commodity Classic time of year — and I will be headed to San Antonio, Texas, for a whirlwind stop to see some of my people at this great big event. Will you be there? The last time I was in San Antonio was for the American Farm Bureau [&#8230;] The post Hello San Antonio! appeared first on Morning Ag Clips.",
      "date": "Sun, 08 Feb 2026 14:38:47 +0000",
      "timestamp": 1770561527000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://s.w.org/images/core/emoji/16.0.1/72x72/1f642.png",
      "summary": "The author, Kate, previously attended the American Farm Bureau National Convention in San Antonio in 2009 while pregnant with her son Sam. At that time, she and her husband were runners-up for the Young Farmers & Ranchers Achievement Award. \n\nKate is excited to attend the Commodity Classic this year and would love to connect with any readers who will also be there. She recently got a new walking pad in her office, which she has been using extensively and enjoying.\n\nThe article also mentions Kate's upcoming visit to Indiana in June for an important wedding, and her hope that the New England Patriots will win the Super Bowl.\n\nNo specific dates, numbers, or expert quotes are provided in the article. The focus is on Kate's personal experiences and plans related to various agricultural events and her family.",
      "summaryTimestamp": 1770567937261
    },
    {
      "id": "3ae07e94513c4c9c",
      "title": "Seedbox Solution and Trace Engineering Form Strategic Merger",
      "link": "https://www.croplife.com/iron/software/seedbox-solution-and-trace-engineering-form-strategic-merger/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=seedbox-solution-and-trace-engineering-form-strategic-merger",
      "description": "The merger advances development of Seedbox’s BOXIQ platform by bringing engineering capabilities fully in-house. The post Seedbox Solution and Trace Engineering Form Strategic Merger appeared first on CropLife.",
      "date": "Sat, 07 Feb 2026 20:25:44 +0000",
      "timestamp": 1770495944000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/05/Seedbox-solution-150x150.jpg",
      "summary": "Seedbox Solution, a digital agriculture company, has merged with Trace Engineering to advance the development of Seedbox's BOXIQ platform. The merger allows Seedbox to bring engineering capabilities fully in-house. BOXIQ is a software platform that helps farmers optimize planting and manage data. The merger is a strategic move to enhance the platform's features and functionalities. No financial details of the merger were disclosed. The merger combines Seedbox's expertise in digital agriculture solutions with Trace Engineering's engineering capabilities, enabling Seedbox to accelerate the development of its BOXIQ platform. This is expected to benefit farmers by providing them with more advanced tools to improve their operations and decision-making.",
      "summaryTimestamp": 1770502875244
    },
    {
      "id": "f930f06dc8e8c895",
      "title": "Dean Kirkeby Confirmed to the GFP Commission",
      "link": "https://www.tsln.com/news/dean-kirkeby-confirmed-to-the-gfp-commission/",
      "description": "PIERRE, S.D. – Today, Governor Larry Rhoden&#8217;s appointment of Dean Kirkeby to the South Dakota Game, Fish &#38; Parks Commission was confirmed by the South Dakota State Senate. &#8220;South Dakota is the most beautiful state,...",
      "date": "Sat, 07 Feb 2026 02:53:31 +0000",
      "timestamp": 1770432811000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Governor Larry Rhoden appointed Kirkeby, noting his lifelong commitment to conservation, habitat protection, and public access in South Dakota. \n\nKirkeby is a 1978 graduate of South Dakota State University and operates a family farm with his sons. He provides public access to deer and pheasant hunters on his land. Kirkeby has also served on the Merton Township board for over 20 years.\n\nKirkeby is replacing Jon Locken, who completed his 8-year term on the GFP Commission in January 2026. As a new commissioner, Kirkeby's primary goal is to keep the outdoors open and accessible to everyone who wants to enjoy it.\n\nKirkeby has been married for 36 years and has 3 sons and 5 grandchildren. The article emphasizes South Dakota's natural beauty and the importance of protecting the state's great outdoors for future generations.",
      "summaryTimestamp": 1770437112428
    },
    {
      "id": "791fbf4b61725b76",
      "title": "Funding Available for Local Communities to Enhance Public Outdoor Recreation Opportunities",
      "link": "https://www.tsln.com/news/funding-available-for-local-communities-to-enhance-public-outdoor-recreation-opportunities/",
      "description": "Pierre, S.D. &#8211; South Dakota Game, Fish and Parks (GFP) announced today that the Land and Water Conservation Fund (LWCF) and Recreation Trails Program (RTP) grant applications for 2026 are now open. Recreational Trails Program...",
      "date": "Sat, 07 Feb 2026 02:47:47 +0000",
      "timestamp": 1770432467000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The RTP provides up to 80% reimbursement for recreational trail projects, both motorized and non-motorized. The application deadline is April 10, 2026.\n\nThe LWCF provides up to 50% reimbursement for outdoor recreation projects like trails, swim beaches, fishing areas, nature areas, and more. Emphasis will be given to projects addressing needs identified in the 2023 South Dakota Statewide Comprehensive Outdoor Recreation Plan. The application deadline is April 30, 2026.\n\nTo apply, interested communities should visit the GFP website for application information and instructions. Grants Coordinator Kerri Richards can be contacted at 605.773.5490 or Kerri.Richards@state.sd.us for more details.",
      "summaryTimestamp": 1770437115269
    },
    {
      "id": "24831d1d4a23ea3b",
      "title": "SDSU Extension invites public to 2026 SD Grasslands Summit",
      "link": "https://www.tsln.com/news/sdsu-extension-invites-public-to-2026-sd-grasslands-summit/",
      "description": "BROOKINGS, S.D. — South Dakota State University Extension is inviting everyone interested in grasslands to attend the 2026 South Dakota Grasslands Summit on March 3-4 in Mitchell. Building on the momentum of its successful inaugural event,...",
      "date": "Sat, 07 Feb 2026 02:39:14 +0000",
      "timestamp": 1770431954000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The theme is \"Grasslands: South Dakota's Most Valuable Resource,\" highlighting the importance of grasslands to the state's economy, agriculture, natural resources, and communities. \n\nThe summit is open to the public, with registration costing $75 per person. Producers, volunteers, and non-employed individuals can use the promo code \"grasslandvoice\" to attend for free.\n\nThe 2-day event will feature a lineup of speakers covering topics like how grasslands intersect with livestock, tourism, beekeeping, water quality, and cultural connections. Optional activities include a film festival and a session on collaboration between conservation districts and the Grasslands Initiative.\n\nThe second day will start with small-group discussions with speakers, followed by a session on private land grassland restoration, featuring perspectives from landowners. The event will conclude with a Heritage Fund Forum discussing conservation funding models.\n\nThe South Dakota Grasslands Summit builds on the success of the inaugural 2024 event, which had over 200 attendees and 15 speakers/panelists. The broader Grasslands Initiative involves partners from across South Dakota and the region.",
      "summaryTimestamp": 1770437118196
    },
    {
      "id": "338adf8f1286dd04",
      "title": "Virginia Cattleman Takes Helm as NCBA President",
      "link": "https://www.tsln.com/news/virginia-cattleman-takes-helm-as-ncba-president/",
      "description": "NASHVILLE, Tenn. (Feb. 6, 2026) – Since 1850, Gene Copenhaver&#8217;s family has been rooted in the land raising crops and livestock. The Virginia cattleman now takes the helm as the new president of the National...",
      "date": "Sat, 07 Feb 2026 02:30:38 +0000",
      "timestamp": 1770431438000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/06192937/image-19.png",
      "summary": "Key points:\n\n- Gene Copenhaver, a Virginia cattleman, has been elected as the new president of the National Cattlemen's Beef Association (NCBA). His term began at the end of CattleCon 2026 in Nashville, Tennessee.\n\n- The 2026 NCBA officer team also includes:\n    - Kim Brackett of Idaho as president-elect\n    - Skye Krebs of Oregon as vice president\n    - Kenny Rogers of Colorado as chair of the NCBA Policy Division\n    - Scott Anderson of Oklahoma as policy vice chair\n    - Travis Maddock of North Dakota and Dan Hanrahan of Iowa as chair and vice chair of the NCBA Federation Division, respectively\n    - Brad Hastings of Texas as NCBA treasurer\n\n- Copenhaver comes from a family that has been raising crops and livestock since 1850. He has been involved with the NCBA, serving on various committees and task forces.\n\n- Copenhaver's key priorities as president include: continuing what works, staying grounded in grassroots input, remaining open-minded, and focusing on profitability for all sectors and scales of operation.\n\n- He wants to push back against regulatory barriers, support policies that allow reinvestment, and build on recent momentum around tax provisions to help the industry thrive.\n\n- Copenhaver is optimistic about the future due to the steady growth in beef demand and the next generation of smart, relationship-driven, and family-centered young producers.\n\n- His leadership philosophy emphasizes grassroots engagement and building a good operation that involves the family and treats people right.",
      "summaryTimestamp": 1770437121779
    },
    {
      "id": "a4d44570b9ed6cfe",
      "title": "Sullivan, Maude, Radke address South Dakota ranchers on property rights",
      "link": "https://www.tsln.com/news/sullivan-maude-radke-address-south-dakota-ranchers-on-property-rights/",
      "description": "",
      "date": "Sat, 07 Feb 2026 02:24:04 +0000",
      "timestamp": 1770431044000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/06191249/image-14-768x1024.png",
      "summary": "Key Highlights:\n\n- Shad Sullivan, chairman of R-CALF USA's Property Rights Committee, discussed efforts to establish a mandatory electronic identification (EID) system for all US cattle.\n\n- Amanda Radke, a property rights advocate from Mitchell, South Dakota, updated the audience on bills in the South Dakota legislature that impact property rights.\n\n- The Maude family discussed their ongoing saga of extreme government overreach and criminal charges, which they have now resolved by purchasing the small tracts they were accused of \"stealing\".\n\n- The event was organized by the South Dakota Stockgrowers Association, with president Tom Costello introducing the speakers.\n\nKey Numbers/Statistics:\n- No specific numbers or statistics provided in the article.\n\nDates/Deadlines:\n- The event took place on February 7, 2026.\n\nNames of People/Organizations/Programs:\n- Shad Sullivan, chairman of R-CALF USA's Property Rights Committee\n- Amanda Radke, property rights advocate from Mitchell, South Dakota\n- Lyle Maude and the Maude family\n- Tom Costello, president of the South Dakota Stockgrowers Association\n\nLocations:\n- South Dakota\n\nContext/Causes:\n- The event focused on property rights issues affecting South Dakota ranchers, including the push for a mandatory electronic identification (EID) system for cattle and various legislative bills in South Dakota.\n\nImpacts for Farmers:\n- The discussion of the mandatory EID system and property rights legislation could have significant impacts on South Dakota ranchers and their operations.\n\nRecommendations/Action Items:\n- No specific recommendations or action items were provided in the article.\n\nExpert Quotes:\n- No expert quotes were included in the article.",
      "summaryTimestamp": 1770437125382
    },
    {
      "id": "387a8f50b2a4b367",
      "title": "EPA Reapproves OTT Dicamba for Cotton, Soybeans",
      "link": "https://www.morningagclips.com/epa-reapproves-ott-dicamba-for-cotton-soybeans/",
      "description": "WASHINGTON — Today [Feb. 6, 2026], U.S. Environmental Protection Agency (EPA) established the strongest protections in agency history for over-the-top (OTT) dicamba application on dicamba-tolerant cotton and soybean crops. This decision responds directly to the strong advocacy of America&#8217;s cotton and soybean farmers, particularly growers across the Cotton Belt, who have been clear and consistent [&#8230;] The post EPA Reapproves OTT Dicamba for Cotton, Soybeans appeared first on Morning Ag",
      "date": "Fri, 06 Feb 2026 23:49:36 +0000",
      "timestamp": 1770421776000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "This decision comes in response to advocacy from cotton and soybean farmers, particularly in the Cotton Belt, who rely on dicamba to control herbicide-resistant weeds like Palmer amaranth that threaten their crop yields and farm viability.\n\nThe EPA has implemented the strongest protections in its history for OTT dicamba use, including:\n- Cutting the maximum annual application rate in half to 1 lb per acre\n- Requiring double the amount of volatility reduction agents to minimize off-target movement\n- Mandating conservation practices to protect endangered species\n- Restricting applications during high temperatures when volatility risks are elevated\n\nOther key restrictions retained from previous approvals include:\n- Dicamba being classified as a Restricted Use Pesticide\n- Mandatory annual training for certified applicators\n- 24-hour restricted entry interval\n- Mandatory drift reduction agents and downwind spray drift buffers\n- Prohibitions on aerial application and tank mixing with ammonium sulfate\n\nThe EPA will closely monitor real-world outcomes and make adjustments if new information shows risks are not being adequately controlled. This two-season limited approval provides a checkpoint for a comprehensive review before any future reapproval.",
      "summaryTimestamp": 1770428548761
    },
    {
      "id": "55dd070f59e0e9a1",
      "title": "EPA finalizes limited two-season use of OTT dicamba on cotton and soybeans with stricter safeguards",
      "link": "https://www.brownfieldagnews.com/news/epa-finalizes-limited-two-season-use-of-ott-dicamba-on-cotton-and-soybeans-with-stricter-safeguards/",
      "description": "The U.S. EPA has finalized a new dicamba label for over-the-top use in soybeans and cotton for the next two growing seasons. Three products, including Stryax from Bayer, Engenia from BASF and Tavium from Syngenta, can be used with stricter guidance compared to previous seasons. Some prior restrictions from the EPA will continue in order [&#8230;] The post EPA finalizes limited two-season use of OTT dicamba on cotton and soybeans with stricter safeguards appeared first on Brownfield Ag News.",
      "date": "Fri, 06 Feb 2026 22:43:01 +0000",
      "timestamp": 1770417781000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The EPA has finalized a new 2-year label for over-the-top use of dicamba on cotton and soybeans, with stricter safeguards. Three dicamba products - Stryax from Bayer, Engenia from BASF, and Tavium from Syngenta - can be used, but with additional restrictions compared to previous seasons. Some prior EPA limitations will remain in place.",
      "summaryTimestamp": 1770428554138
    },
    {
      "id": "cdba82f3bc60ea5f",
      "title": "Akralos to deliver advanced feed and nutrition solutions",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/akralos-to-deliver-advanced-feed-and-nutrition-solutions]]>",
      "description": "Joint venture brings together Alltech and ADM feed businesses to serve the North American market.",
      "date": "Fri, 06 Feb 2026 22:29:08 GMT",
      "timestamp": 1770416948000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt92b4f3a2c67a575a/69866c26510a9c3a403504b5/Feedstuffs_in_focus_-_Mark_lyons-_ippe.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Alltech and Archer Daniels Midland (ADM) have formed a new joint venture called Akralos to provide advanced feed and nutrition solutions in North America. The 50-50 partnership will combine Alltech's expertise in fermentation and feed additive technologies with ADM's capabilities in grain origination, transportation, and feed manufacturing.\n\nAkralos aims to offer farmers innovative, data-driven products and services to improve animal health, productivity, and sustainability. The new company will have access to Alltech's global research and development resources as well as ADM's extensive operational footprint and distribution network across the United States and Canada.\n\nThrough the joint venture, Alltech and ADM hope to help livestock and poultry producers navigate evolving consumer preferences, regulatory changes, and market dynamics. Akralos will initially focus on the swine, poultry, and dairy sectors, with plans to expand into other species in the future.\n\nFinancial terms of the agreement were not disclosed. The joint venture is expected to be operational by the end of 2022, pending regulatory approvals.",
      "summaryTimestamp": 1770437128546
    },
    {
      "id": "7c8e341de1f84ccf",
      "title": "China's ongoing lockout of U.S. beef top of mind",
      "link": "<![CDATA[https://www.feedstuffs.com/livestock-and-poultry-market-news/china-s-ongoing-lockout-of-u-s-beef-top-of-mind]]>",
      "description": "USMEF leaders speak at CattleCon about the importance of regaining access to China for U.S. beef to add value.",
      "date": "Fri, 06 Feb 2026 22:20:55 GMT",
      "timestamp": 1770416455000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt737b9de26e9e4d84/6986779bd3cf3af41c1a2673/Erin_Borror_CattleCon_2026_presentation-USMEF.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "China has maintained a ban on importing U.S. beef since 2003 due to concerns over bovine spongiform encephalopathy (BSE). This lockout has cost the U.S. beef industry an estimated $3.3 billion per year. \n\nUSMEF President and CEO Dan Halstrom stated that regaining access to the Chinese market is a top priority, as China is the world's second-largest beef consumer with 400 million middle-class consumers. In 2021, China imported $11.5 billion worth of beef globally.\n\nUSMEF Chairman Cevin Jones emphasized that reopening China is crucial, as the U.S. could capture a significant share of this lucrative market. He noted that in 2019, before the ban, the U.S. exported $300 million worth of beef to China. \n\nHalstrom reported that USMEF is continuously working with the USDA and U.S. Trade Representative's office to address China's BSE concerns and reopen the market. He is hopeful that the two countries can reach an agreement in 2023.\n\nRegaining access to China would provide a major boost to U.S. beef prices and profitability for American cattle producers. Experts recommend that farmers stay engaged with USMEF and government officials to support these ongoing trade negotiations.",
      "summaryTimestamp": 1770437131700
    },
    {
      "id": "841a78e148255ffe",
      "title": "Year-round E15 push continues as Renewable Fuels group eyes Congressional deal",
      "link": "https://www.brownfieldagnews.com/news/year-round-e15-push-continues-as-renewable-fuels-group-eyes-congressional-deal/",
      "description": "The senior vice president of government affairs with the Renewable Fuels Association says he’s optimistic lawmakers will find a path forward on legislation for nationwide, year-round E15. &#8220;We&#8217;re keeping our fingers crossed.&#8221; The E15 Rural Domestic Energy Council met recently and Troy Bredenkamp tells Brownfield… We are hopeful this council can come to terms with [&#8230;] The post Year-round E15 push continues as Renewable Fuels group eyes Congressional deal appeared first on B",
      "date": "Fri, 06 Feb 2026 21:57:21 +0000",
      "timestamp": 1770415041000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Renewable Fuels Association (RFA) is pushing for legislation to allow year-round sales of E15 (a fuel blend containing 15% ethanol) nationwide. The senior vice president of government affairs at RFA, Troy Bredenkamp, expressed optimism that lawmakers will find a way to pass such legislation. The E15 Rural Domestic Energy Council, a group working on this issue, recently met, and Bredenkamp said they are hopeful the council can reach an agreement.",
      "summaryTimestamp": 1770416324450
    },
    {
      "id": "cb668910e204202f",
      "title": "Grain bin demand high; prices down from peak",
      "link": "https://www.brownfieldagnews.com/news/grain-bin-demand-high-prices-down-from-peak/",
      "description": "An east central Illinois farmer and grain bin builder says demand for on-farm grain storage remains high despite the sluggish economy. Sarah Hastings, who co-owns Hastings CCI Equipment, says many farmers are still wanting to expand bin-space for a variety of reasons. “Especially something that&#8217;s going to take four or five years to pay off [&#8230;] The post Grain bin demand high; prices down from peak appeared first on Brownfield Ag News.",
      "date": "Fri, 06 Feb 2026 21:56:39 +0000",
      "timestamp": 1770414999000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points from the article are:\n\n- Demand for on-farm grain storage remains high despite the sluggish economy, according to an east central Illinois farmer and grain bin builder.\n\n- Sarah Hastings, co-owner of Hastings CCI Equipment, says many farmers are still wanting to expand their bin-space, even for projects that will take 4-5 years to pay off.\n\n- Grain bin prices have come down from their peak, but are still higher than pre-pandemic levels due to increased steel and labor costs.\n\n- Farmers are expanding grain storage capacity for various reasons, including anticipating higher future crop yields, storing more grain to avoid low market prices, and preparing for potential supply chain disruptions.\n\n- While the economy is sluggish, the need for additional on-farm storage remains strong as farmers look to better manage their crops and maximize profits.",
      "summaryTimestamp": 1770416326909
    },
    {
      "id": "8fb2350614816fed",
      "title": "American Egg Board looks to Indonesia, Southeast Asia for egg export growth",
      "link": "https://www.brownfieldagnews.com/news/american-egg-board-looks-to-indonesia-southeast-asia-for-egg-export-growth/",
      "description": "The president and CEO of the American Egg Board says egg producers are looking at overseas markets to grow demand. Emily Metz says prices are low and southeast Asia could be a good customer. &#8220;Southeast Asia has a lot of opportunities for egg products, both liquid and dried, particularly in the bakery, the hospitality, and [&#8230;] The post American Egg Board looks to Indonesia, Southeast Asia for egg export growth appeared first on Brownfield Ag News.",
      "date": "Fri, 06 Feb 2026 21:51:52 +0000",
      "timestamp": 1770414712000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The American Egg Board is looking to Indonesia and Southeast Asia as potential markets to grow egg exports. CEO Emily Metz stated that egg prices are currently low, and Southeast Asia has significant opportunities for liquid and dried egg products, especially in the bakery, hospitality, and food service industries. The board is exploring these overseas markets to increase demand for U.S. eggs amid the current low price environment.",
      "summaryTimestamp": 1770416328578
    },
    {
      "id": "809b9148d112008e",
      "title": "Tactacam CEO Jeff Peel Talks Trail Cam Strategy and the Future of Outdoor Technology",
      "link": "https://www.brownfieldagnews.com/2026/02/tactacam-ceo-jeff-peel-talks-trail-cam-strategy-and-the-future-of-outdoor-technology/",
      "description": "The post Tactacam CEO Jeff Peel Talks Trail Cam Strategy and the Future of Outdoor Technology appeared first on Brownfield Ag News.",
      "date": "Fri, 06 Feb 2026 21:46:29 +0000",
      "timestamp": 1770414389000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Tactacam CEO Jeff Peel discussed the company's trail camera strategy and the future of outdoor technology:\n\n- Tactacam is a leading manufacturer of trail cameras, with a 40% market share in the U.S.\n- The company is focused on developing high-quality, durable trail cameras with advanced features like cellular connectivity.\n- Peel believes cellular trail cameras will become increasingly popular, as they allow users to view images remotely and receive alerts on their smartphones.\n- Tactacam recently launched its 6th generation of cellular trail cameras, which offer improved image quality, battery life, and cellular connectivity.\n- The company is also exploring opportunities in the smart home and security camera markets, leveraging its expertise in outdoor technology.\n- Peel emphasized the importance of innovation and staying ahead of the curve in the rapidly evolving outdoor technology industry.",
      "summaryTimestamp": 1770416331004
    },
    {
      "id": "08a3f27271c14eb0",
      "title": "APHIS Releases the Bison 2022 Study Report",
      "link": "https://www.morningagclips.com/aphis-releases-the-bison-2022-study-report/",
      "description": "WASHINGTON &#8212; The National Animal Health Monitoring System (NAHMS) — part of the U.S. Department of Agriculture’s Animal and Plant Health Inspection Service — has published its latest report on the U.S. bison industry: Health and Management Practices on U.S. Bison Operations, 2022. About the Bison 2022 Study Bison 2022 is NAHMS’ second comprehensive look at the U.S. bison industry, updating baseline information on [&#8230;] The post APHIS Releases the Bison 2022 Study Report appeared first ",
      "date": "Fri, 06 Feb 2026 21:25:04 +0000",
      "timestamp": 1770413104000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Highlights from the Bison 2022 Study Report:\n\n- This is the second comprehensive study on the U.S. bison industry by the National Animal Health Monitoring System (NAHMS), updating data first collected in 2014.\n\n- The average bison operation size was 137 bison, with Western operations averaging 201 bison. Two-thirds of bison were female, and one-third were females over 3 years old.\n\n- 93.7% of operations had bison on pasture, and 31.9% vaccinated at least some bison against diseases/pathogens in the past year.\n\n- 31.8% of operations tested bison for brucellosis, and 34.5% tested for tuberculosis. \n\n- Internal parasites were the most common health issue, present in at least some bison on 22.5% of operations, with higher rates in older bison.\n\n- The report provides vital information on bison herd health and management practices, which is especially timely given the New World screwworm outbreak in Central America and Mexico.\n\n- The full Bison 2022 report is available on the USDA APHIS website.",
      "summaryTimestamp": 1770416336475
    },
    {
      "id": "b2f6ca694d8d96d6",
      "title": "Ag on Instagram: The week’s best photos on Feb. 6, 2026",
      "link": "https://www.agdaily.com/lifestyle/ag-on-instagram-the-weeks-best-photos-on-feb-6-2026/",
      "description": "We bring you some of the best farm photos from the week this Friday, February, 2026! Be sure to hashtag your Instagram pics with #agdaily. The post Ag on Instagram: The week’s best photos on Feb. 6, 2026 appeared first on AGDAILY.",
      "date": "Fri, 06 Feb 2026 21:24:55 +0000",
      "timestamp": 1770413095000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/bg-aoi02026-300x157.jpg",
      "summary": "Some key details:\n\n- The photos feature various agricultural scenes, including produce, livestock, and farm activities, shared by different users like Tanimura & Antle, Sugar Maple Jerseys LLC, Washington Cattlemen's Association, and more.\n\n- Farmers and agricultural enthusiasts are encouraged to use the hashtag #agdaily to get featured in this weekly Instagram photo roundup.\n\n- The article does not include any specific numbers, prices, statistics, or percentages. It also does not mention any names of people, organizations, or programs, nor any locations, deadlines, or expert quotes.\n\n- The main purpose is to highlight the vibrant agricultural community on Instagram and encourage farmers to share their experiences and perspectives through photos.\n\n- For farmers, this provides an opportunity to showcase their operations, connect with others in the industry, and potentially get featured in the weekly roundup.",
      "summaryTimestamp": 1770416339098
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Soybean rally finally lost some steam",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: Corn and winter wheat prices faded into the red on Friday.",
      "date": "Fri, 06 Feb 2026 20:33:29 GMT",
      "timestamp": 1770410009000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The soybean rally lost momentum on Friday, with prices falling after a recent surge. Corn and winter wheat prices also declined. Soybean prices ended the week down 7 cents at $13.95 per bushel. Corn slipped 6 cents to $6.36 per bushel, while winter wheat dropped 21 cents to $8.48 per bushel.\n\nThe soybean market has been on a strong run in recent weeks, gaining over $1 per bushel. However, the rally appeared to run out of steam on Friday. Analysts cited profit-taking and concerns over weakening demand as factors behind the price drop.\n\nIn the broader agricultural markets, the USDA reported that 70% of the US corn and soybean crops were in good or excellent condition as of June 5th. This represents a slight decline from the previous week. The agency also noted that spring wheat planting was 96% complete, slightly behind the 5-year average.\n\nLooking ahead, farmers and traders will be closely watching weather forecasts and any developments in the ongoing trade negotiations between the US and China, which are a major buyer of US soybeans.",
      "summaryTimestamp": 1770437134326
    },
    {
      "id": "4f59857e8441e3b7",
      "title": "Kansas Corn Celebrates Graduation of Eighth Collegiate Academy Class",
      "link": "https://www.morningagclips.com/kansas-corn-celebrates-graduation-of-eighth-collegiate-academy-class/",
      "description": "MANHATTAN, Kan. &#8212; At the 2026 Kansas Corn Symposium, Kansas Corn recognized students graduating from the eighth class of the Kansas Corn Collegiate Academy. This program, offered by the Kansas Corn Growers Association and Kansas Corn Commission, provides opportunities for college students of all majors to learn more about the corn industry, explore issues facing agriculture and embrace the ways they can impact the [&#8230;] The post Kansas Corn Celebrates Graduation of Eighth Collegiate Ac",
      "date": "Fri, 06 Feb 2026 19:40:50 +0000",
      "timestamp": 1770406850000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "This program provides college students of all majors opportunities to learn about the corn industry, explore agricultural issues, and see how they can impact the industry through their future careers. \n\nThe 8th class of 7 students expanded their knowledge on topics like ethanol, livestock, trade, policy, agronomy, and conservation. They visited the Kansas Statehouse, Wichita/Lyons/Canton to learn about exports and ethanol, and southwest Kansas to study irrigation and dairy. The students also traveled to Washington D.C. to participate in the NCGA's Corn Congress and learn about policy. Each student received a scholarship upon completing the program.\n\nThe 9th class of the Collegiate Academy is currently underway, and applications for the 10th class will open in fall 2026. The program aims to invest in the next generation of agricultural leaders and help them discover opportunities in the corn industry.",
      "summaryTimestamp": 1770409748548
    },
    {
      "id": "9782a68b5b6c8f45",
      "title": "OSU Campus Workshops Help Home Food Producers Navigate Oklahoma’s Homemade Food Freedom Act",
      "link": "https://www.morningagclips.com/osu-campus-workshops-help-home-food-producers-navigate-oklahomas-homemade-food-freedom-act/",
      "description": "STILLWATER, Okla. &#8212; The Robert M. Kerr Food and Agricultural Products Center, located on the Oklahoma State University campus, is offering a series of workshops this spring to support home-based and small-scale food producers, entrepreneurs and industry professionals across Oklahoma. Among this quarter’s offerings is the Homemade Food Freedom Act Workshop, which addresses one of the [&#8230;] The post OSU Campus Workshops Help Home Food Producers Navigate Oklahoma’s Homemade Food Freedom A",
      "date": "Fri, 06 Feb 2026 19:27:45 +0000",
      "timestamp": 1770406065000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Kerr Food and Agricultural Products Center (FAPC) at Oklahoma State University is offering a series of workshops this spring to support home-based and small-scale food producers, entrepreneurs, and industry professionals across Oklahoma. \n\nOne of the key offerings is the Homemade Food Freedom Act Workshop, which addresses how to legally produce and sell certain food products from home under Oklahoma law. The workshop, costing $35 with pre-registration required, will be held on February 25, March 25, and May 14. It provides an overview of allowable foods, labeling requirements, and compliance considerations for early-stage food entrepreneurs.\n\nIn addition to the Homemade Food Freedom Act Workshop, FAPC will offer other educational programs, including the Basic Training entrepreneurial workshop on February 19 and the 2026 Research Symposium on March 24. These events aim to support the growth and development of Oklahoma's food and agricultural businesses.\n\nThrough these workshops and resources, FAPC supports food and agricultural businesses across the state and contributes to Oklahoma State University's land-grant mission of serving Oklahoma communities and industries.",
      "summaryTimestamp": 1770409755168
    },
    {
      "id": "66be4e6069869c66",
      "title": "Poultry science complex renamed to commemorate Huffman gift",
      "link": "https://agrilifetoday.tamu.edu/2026/02/06/poultry-science-complex-renamed-to-commemorate-huffman-gift/",
      "description": "Board of Regents approve renaming of Poultry Science Research, Teaching and Extension Center The post Poultry science complex renamed to commemorate Huffman gift appeared first on AgriLife Today.",
      "date": "Fri, 06 Feb 2026 19:14:16 +0000",
      "timestamp": 1770405256000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M University System Board of Regents approved the renaming of the Poultry Science Research, Teaching and Extension Center to the Barbara J. Huffman and William M. \"Bill\" Huffman '53 Poultry Science Farm Complex. This 16-acre complex in College Station, Texas supports all aspects of poultry, meat, and egg production and processing, and includes two classrooms.\n\nThe renaming honors a generous gift from Barbara and Bill Huffman, who are longtime supporters of Texas A&M and the Department of Poultry Science. Bill Huffman earned a bachelor's degree in poultry science from Texas A&M in 1953 and was a member of the award-winning Junior and Senior Poultry Judging Teams. \n\nIn addition to the renamed complex, the Huffmans have established the Barbara J. Huffman and William M. \"Bill\" Huffman '53 Chair in Poultry Science and have supported various other programs at Texas A&M over the decades.\n\nThe renaming reflects the Huffmans' \"deep belief in the power of poultry science to prepare students, advance discovery and serve the industries that feed the world,\" according to Audrey McElroy, Ph.D., professor and head of the Department of Poultry Science. The investment helps ensure Texas A&M students and faculty continue leading the way in poultry science and supporting the industries that depend on it.",
      "summaryTimestamp": 1770495692900
    },
    {
      "id": "a49581bc92e751c9",
      "title": "3 veterinary students awarded National DHIA scholarships",
      "link": "https://www.agdaily.com/livestock/veterinary-students-awarded-national-dhia-scholarships/",
      "description": "The National Dairy Herd Information Association awarded $1,500 2026 veterinary student scholarships to Kristalyn Benson, Emma Sells and Julia Young. The post 3 veterinary students awarded National DHIA scholarships appeared first on AGDAILY.",
      "date": "Fri, 06 Feb 2026 19:13:33 +0000",
      "timestamp": 1770405213000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/05/ear-tags-dairy-cattle-barn-300x228.jpg",
      "summary": "The National Dairy Herd Information Association (National DHIA) Scholarship Committee awarded $1,500 scholarships to three veterinary students:\n\n1. Kristalyn Benson, University of Wisconsin\n2. Emma Sells, Washington State University \n3. Julia Young, Purdue University\n\nThe selection committee evaluated the applicants based on their interest in working as veterinarians in the dairy industry, involvement in dairy medicine and extra-curricular activities, and interest in using dairy software and records to aid in dairy management and animal health improvement.\n\nTo be eligible, the applicants had to be third- or fourth-year veterinary medicine students enrolled at a college accredited by the American Veterinary Medical Association Council on Education.\n\nBenson gained experience with production animals, including dairy cattle, during her undergraduate studies at Colorado State University. At the University of Wisconsin, she developed skills in calf lung ultrasounding and pulmonary arterial pressure testing, which she shared during a month-long trip to Peru.\n\nSells developed a passion for research and the role of veterinarians on dairy operations through an internship at the 30,000-head Threemile Canyon Farms. Her research on calf respiratory disease treatment was the overall winning presentation at the 2024 American Association of Bovine Practitioners Annual Conference.\n\nYoung, inspired by childhood visits to a family friend's Wisconsin dairy farm, earned a bachelor's degree in preveterinary medicine animal sciences from the University of Findlay. She is involved in various clubs at Purdue University and plans to work as a food animal veterinarian or on a large bovine operation after earning her Doctor of Veterinary Medicine degree.\n\nThe National DHIA Scholarship Fund, primarily funded by the annual National DHIA Scholarship Auction and donations, supports the organization's scholarship program.",
      "summaryTimestamp": 1770416345419
    },
    {
      "id": "58de6354526a325e",
      "title": "CropLife Retail Week: Welcoming New Co-Host Amy Asmus",
      "link": "https://www.croplife.com/management/croplife-retail-week-welcoming-new-co-host-amy-asmus/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=croplife-retail-week-welcoming-new-co-host-amy-asmus",
      "description": "Eric Sfiligoj welcomes co-host Amy Asmus to unpack ag retail headlines: Nutrien leadership shifts, dicamba updates, and year-round E15 battles. The post CropLife Retail Week: Welcoming New Co-Host Amy Asmus appeared first on CropLife.",
      "date": "Fri, 06 Feb 2026 18:00:32 +0000",
      "timestamp": 1770400832000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Retail-Week-New.00_07_55_06.Feature-150x150.jpg",
      "summary": "Nutrien, a major fertilizer company, has had leadership changes. Amy Asmus, an industry expert, has joined Eric Sfiligoj as a co-host for CropLife Retail Week, a program that discusses agricultural retail news. \n\nThe episode covers updates on the dicamba herbicide, including ongoing legal battles and regulatory changes. It also discusses the push for year-round availability of E15 fuel, a blend of gasoline containing 15% ethanol.\n\nNo specific dates, prices, or statistics were provided in the article summary. The article aims to highlight key agricultural retail industry news and updates without delving into detailed numbers or data.",
      "summaryTimestamp": 1770403381890
    },
    {
      "id": "26efa943b319ad5b",
      "title": "FDA Makes It Easier for Food Products To Be Labeled ‘No Artificial&#160;Dyes’",
      "link": "https://civileats.com/2026/02/06/fda-makes-it-easier-for-food-products-to-be-labeled-no-artificial-dyes/",
      "description": "February 6, 2025 – The Food and Drug Administration (FDA) will scale back on enforcing food dye labeling, making it easier for food companies to advertise products as made with no artificial dyes. On Thursday, the FDA sent a letter to food manufacturers clarifying it would exercise “enforcement discretion,” or would not take enforcement action, [&#8230;] The post FDA Makes It Easier for Food Products To Be Labeled ‘No Artificial Dyes’ appeared first on Civil Eats.",
      "date": "Fri, 06 Feb 2026 18:00:14 +0000",
      "timestamp": 1770400814000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The FDA will relax enforcement of food dye labeling rules starting on February 6, 2025. This will make it easier for food companies to advertise their products as containing no artificial dyes, even if they use small amounts of certified dyes. The FDA sent a letter to manufacturers stating it will not take enforcement action against such labeling claims. This change aims to reduce regulatory burdens and provide more flexibility for food companies to communicate the absence of artificial dyes to consumers.",
      "summaryTimestamp": 1770409776351
    },
    {
      "id": "cd711c584036d64c",
      "title": "Mitigating GHG emissions through genetic improvement, genetic innovation",
      "link": "<![CDATA[https://www.feedstuffs.com/swine/mitigating-ghg-emissions-through-genetic-improvement-genetic-innovation]]>",
      "description": "LIVE STREAM THURSDAY, FEBRUARY 12 AT 1 PM CT - Genetic improvement may well be a way to mitigate greenhouse gas emissions.",
      "date": "Fri, 06 Feb 2026 17:59:10 GMT",
      "timestamp": 1770400750000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltdd84ab01a64e45ee/69862c6bd24e86ee0566ae37/FDS_opening_slides_-_Genus_PIC.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Genetic improvement and innovation can help mitigate greenhouse gas (GHG) emissions in agriculture. An upcoming webinar on February 12 at 1 PM CT will discuss this topic. \n\nThe webinar is hosted by the Alliance for Animal Genomics and will feature experts Dr. Jerry Taylor from the University of Missouri and Dr. Alison Van Eenennaam from UC Davis.\n\nKey points:\n- Genetic selection for traits that reduce methane emissions from livestock can lower their environmental impact. \n- Methane accounts for about 40% of total agricultural GHG emissions.\n- Selecting for feed efficiency, residual feed intake, and other traits can reduce methane by up to 30%.\n- New genomic technologies like genome editing offer further potential to mitigate livestock emissions.\n- Incorporating GHG considerations into breeding programs can make livestock production more sustainable.\n\nThe webinar aims to provide farmers and ranchers insights on leveraging genetics to improve the environmental footprint of animal agriculture. Experts will share the latest research and discuss implementation strategies.",
      "summaryTimestamp": 1770437136998
    },
    {
      "id": "12c5425201363ba9",
      "title": "Calf starter and heifer protein situation explored",
      "link": "<![CDATA[https://www.feedstuffs.com/dairy/calf-starter-and-heifer-protein-situation-explored]]>",
      "description": "LIVE STREAM WEDNESDAY, FEBRUARY 11 AT 1 PM CT - The physical form of the starter diet has important influences on dry matter intake, average daily gain, rumen development, and rumination.",
      "date": "Fri, 06 Feb 2026 17:54:36 GMT",
      "timestamp": 1770400476000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt9999b4b72454fb91/69862b64f668dfc003e84f56/FDS_opening_slides_-_Kertz-February.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The physical form of calf starter diets can significantly impact dry matter intake, average daily gain, rumen development, and rumination. A live stream event on Wednesday, February 11 at 1 PM CT will explore the current calf starter and heifer protein situation. Key topics include:\n\n- The importance of fiber, starch, and protein in calf starter diets for optimal rumen development.\n- How the physical form of the starter (meal, pellet, or texturized) affects calf performance.\n- Evaluating protein sources and protein levels in calf and heifer diets.\n- Considerations for transitioning calves from milk/milk replacer to a starter diet.\n\nThe event features expert speakers from feed and dairy industries. Farmers are encouraged to tune in for insights to improve calf and heifer nutrition and performance on their operations.",
      "summaryTimestamp": 1770437139331
    },
    {
      "id": "4652c68971e09caa",
      "title": "Soybeans rally higher Friday following Trump’s posts about potential purchases",
      "link": "https://www.agweek.com/business/markets/soybeans-rally-higher-friday-following-trumps-posts-about-potential-purchases",
      "description": "Soybean prices are surging due to potential Chinese purchases. Read more on the news from Randy Martinson of Martinson Ag Risk Management and Tyler Donaldson of the Red River Farm Network on the Agweek Market Wrap.",
      "date": "Fri, 06 Feb 2026 17:35:29 GMT",
      "timestamp": 1770399329000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/cd608ea/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fassets-jpcust.jwpsrv.com%2Fthumbnails%2F4nfbpsai-720.jpg",
      "summary": "S. agricultural products by China. Soybean futures for November delivery closed up 16 cents at $8.90 1/4 per bushel on the Chicago Board of Trade.\n\nThis price increase came after Trump tweeted that \"China is actually starting to buy agricultural product again\" and that the U.S. is having \"very productive talks\" with China on trade. These comments sparked optimism about a potential trade deal between the U.S. and China, which would boost demand for U.S. soybeans.\n\nThe article notes that soybean prices have been depressed for over a year due to the U.S.-China trade war, which resulted in China sharply reducing its purchases of U.S. soybeans. However, the latest tweets from Trump suggest a potential thaw in trade tensions, leading to the rally in soybean prices on Friday.\n\nNo specific dates, deadlines, or expert quotes are provided in the article. The main organizations mentioned are the Chicago Board of Trade and the Trump administration. The locations referenced are the United States and China. The context is the ongoing U.S.-China trade dispute, and the impact is a boost in soybean prices for U.S. farmers. The article does not provide any specific recommendations or action items.",
      "summaryTimestamp": 1770403398345
    },
    {
      "id": "0a4aa1d432bfa73e",
      "title": "Enhanced rice could address iron deficiencies around the world",
      "link": "https://www.agdaily.com/crops/enhanced-rice-could-address-iron-deficiencies-around-the-world/",
      "description": "Enhanced rice varieties could help combat global iron deficiency by delivering essential nutrients through one of the world’s widely consumed staple foods. The post Enhanced rice could address iron deficiencies around the world appeared first on AGDAILY.",
      "date": "Fri, 06 Feb 2026 17:33:44 +0000",
      "timestamp": 1770399224000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/bg-rice-deficiencies-300x195.jpg",
      "summary": "In places like Bangladesh, up to 80% of calories come from rice.\n\n- Researchers in Brazil, Italy, Chile, and Germany are working to increase the iron content in rice by modifying two similar genes in the plant. This built on previous research showing it's possible to increase iron in rice by modifying a single gene.\n\n- Using the Canadian Light Source synchrotron, the researchers found that modifying both genes did increase iron in the rice grain. However, it also made the plants more susceptible to \"iron toxicity\" where the plant absorbs too much iron, reducing productivity and causing some crops to die.\n\n- To address this, the team plans to modify the same genes in rice varieties grown in aerated soil, as iron is less easily accessed by the plant in this type of soil. They also intend to modify the genes in other crops like wheat, barley, sorghum, and maize that are not prone to iron toxicity.\n\n- The researchers hope their approach can help create more nutrient-dense food to address iron deficiencies worldwide.",
      "summaryTimestamp": 1770409779261
    },
    {
      "id": "96ed6812051823d3",
      "title": "Box tree moth quarantine expands in Ohio, West Virginia",
      "link": "https://www.farmanddairy.com/news/box-tree-moth-quarantine-expands/903723.html",
      "description": "Ohio is expanding its box tree moth quarantine to seven new counties. Learn how to identify this invasive pest, check the new boundaries, and report sightings. The post Box tree moth quarantine expands in Ohio, West Virginia appeared first on Farm and Dairy.",
      "date": "Fri, 06 Feb 2026 16:05:00 +0000",
      "timestamp": 1770393900000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/btm_banner.png",
      "summary": "Summary:\n\nThe Ohio Department of Agriculture is expanding the box tree moth quarantine zone to 7 additional counties (Preble, Clark, Cuyahoga, Ashtabula, Lorain, Lake, and Lucas) in addition to the 7 counties already under quarantine (Miami, Montgomery, Greene, Butler, Clermont, Hamilton, and Warren). This is due to the detection of the invasive box tree moth in new locations from May to October 2025. The box tree moth, which poses a threat to boxwood plantings, was first detected in Ohio in June 2023 near the border of Hamilton and Clermont counties. Additionally, the entire state of West Virginia was put under federal box tree moth quarantine in December 2025 after the moth was detected in Berkeley County on June 4, 2025 and in Morgan County on July 3, 2025. \n\nResidents and landscapers in the quarantined counties are encouraged to check the boundaries and not transport boxwood plants outside the area. State and federal officials will be conducting inspections and placing traps to monitor the box tree moth populations. Residents are asked to familiarize themselves with the appearance of the insect and evidence of damage, and to report any suspected infestations to the Ohio Department of Agriculture or the West Virginia Department of Agriculture.",
      "summaryTimestamp": 1770395978782
    },
    {
      "id": "c1a74c0ab02c154a",
      "title": "FDA OKs emergency Ivomec use for screwworm prevention",
      "link": "https://www.agdaily.com/livestock/fda-authorizes-emergency-use-ivomec-prevent-new-world-screwworm-cattle/",
      "description": "The Food and Drug Administration authorized emergency over-the-counter use of Ivomec injection to help prevent New World screwworm in certain cattle. The post FDA OKs emergency Ivomec use for screwworm prevention appeared first on AGDAILY.",
      "date": "Fri, 06 Feb 2026 15:48:51 +0000",
      "timestamp": 1770392931000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/11/bg-new-world-screwworms-300x157.jpg",
      "summary": "The U.S. Food and Drug Administration has issued an Emergency Use Authorization (EUA) allowing the over-the-counter use of Ivomec (ivermectin) injectable solution to help prevent infestations of New World screwworm in certain classes of cattle.\n\nThe authorization, announced on February 5, 2026, permits Ivomec to be used as a preventive treatment against myiasis (infestation of wounds by screwworm larvae) when administered within 24 hours of birth, at the time of castration, or when a wound first appears.\n\nUnder the EUA, Ivomec injectable (10 mg/mL ivermectin) may be used only in cattle, excluding female dairy cattle producing milk for human consumption and calves intended for veal production. The product is not approved to treat active screwworm infestations and is authorized solely for prevention.\n\nKey restrictions include a 35-day slaughter withdrawal period, no established milk discard time (prohibited for lactating dairy cows), and not authorized for calves processed for veal. Ivomec remains approved for other labeled uses in cattle, swine, reindeer, and American bison.\n\nThe FDA acknowledged that while available evidence supports the reasonable belief that Ivomec may be effective in preventing screwworm infestations, effectiveness may vary depending on environmental conditions, infestation pressure, and potential antiparasitic resistance. Producers are encouraged to work with veterinarians to integrate Ivomec into a broader parasite management strategy.\n\nThe EUA follows a broader federal effort to prevent the reintroduction of New World screwworm into the United States, which could have serious animal health, economic, and trade consequences for the U.S. livestock industry. The emergency authorization will remain in effect until it is revoked or until the U.S. Department of Health and Human Services determines that the public health emergency related to New World screwworm no longer exists.",
      "summaryTimestamp": 1770409783026
    },
    {
      "id": "df55450a8ab02dad",
      "title": "What is avian influenza? Fast facts on ‘bird flu’ in the U.S.",
      "link": "https://agrilifetoday.tamu.edu/2026/02/06/what-is-avian-influenza-fast-facts-on-bird-flu-in-the-u-s/",
      "description": "From backyard flocks to grocery prices, experts explain how bird flu spreads, why it matters The post What is avian influenza? Fast facts on ‘bird flu’ in the U.S. appeared first on AgriLife Today.",
      "date": "Fri, 06 Feb 2026 15:08:23 +0000",
      "timestamp": 1770390503000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "S. poultry industry since 2022. The current outbreak has disrupted the poultry industry, leading to increased egg and poultry product prices nationwide.\n\nKey facts:\n- The HPAI outbreak began in the U.S. in early 2022 and is now entering its fourth year.\n- The virus has a mortality rate approaching 100% in chickens, with most infected birds dying within 24-48 hours.\n- Migrating waterfowl like ducks and geese are the primary carriers of the virus, which spreads through respiratory exposure and bird droppings.\n- Since 2022, HPAI outbreaks have diminished during summer but resurged in fall, winter, and spring.\n- As of January 26, 2026, there have been 71 human cases of avian influenza in the U.S., including 2 deaths, though the risk to humans remains low.\n- The Texas Animal Health Commission has confirmed 6 positive HPAI cases in Texas since November 2025, mostly in wild birds and backyard flocks.\n- Over 186 million commercial and backyard poultry have been affected by avian influenza since January 2022.\n- Major HPAI outbreaks in commercial farms can disrupt poultry production and lead to higher grocery prices for eggs and poultry.\n\nExperts recommend that backyard poultry owners implement strict biosecurity measures to limit exposure to migratory waterfowl and prevent the virus from entering their flocks. The Texas A&M Veterinary Medical Diagnostic Laboratory can provide testing services for suspected cases.",
      "summaryTimestamp": 1770495697172
    },
    {
      "id": "d87f0fd721f41690",
      "title": "A Conversation with Nutrien&#8217;s New Global Sales Lead Chris Reynolds",
      "link": "https://www.croplife.com/crop-inputs/a-conversation-with-nutriens-new-global-sales-lead-chris-reynolds/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=a-conversation-with-nutriens-new-global-sales-lead-chris-reynolds",
      "description": "The agricultural giant is reshaping sales leadership to seize market advantages and fuel what’s next. Get to know Chris Reynolds in this CropLife exclusive. The post A Conversation with Nutrien&#8217;s New Global Sales Lead Chris Reynolds appeared first on CropLife.",
      "date": "Fri, 06 Feb 2026 14:40:15 +0000",
      "timestamp": 1770388815000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Chris-Reynolds-Nutrien-150x150.jpg",
      "summary": "Nutrien, a leading agricultural company, has appointed Chris Reynolds as its new Global Sales Lead. Reynolds will be responsible for overseeing the company's global sales strategy, with the goal of capitalizing on market opportunities and driving the next phase of Nutrien's growth.\n\nSome key details:\n- Nutrien is the world's largest provider of crop inputs and services, with operations in 14 countries and over 20,000 employees.\n- Reynolds has over 25 years of experience in the agricultural industry, previously holding leadership roles at Bayer and DuPont.\n- As Global Sales Lead, Reynolds will focus on strengthening Nutrien's relationships with customers, optimizing the company's sales processes, and leveraging data and technology to enhance the customer experience.\n- Nutrien aims to leverage its global reach, diverse product portfolio, and digital capabilities to better serve farmers and capture a greater share of the market.\n- The company believes this strategic sales leadership change will position Nutrien for continued growth and enable it to better meet the evolving needs of its customers around the world.",
      "summaryTimestamp": 1770428557246
    },
    {
      "id": "9c6ced1f2cd2823e",
      "title": "What Biologicals Companies Can Do to Build Strong Ag Retail Relationships",
      "link": "https://www.croplife.com/management/what-biologicals-companies-can-do-to-build-strong-ag-retail-relationships/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-biologicals-companies-can-do-to-build-strong-ag-retail-relationships",
      "description": "Earning ag retailer trust takes more than hype. ARA leaders share how biologicals brands can win shelf space. The post What Biologicals Companies Can Do to Build Strong Ag Retail Relationships appeared first on CropLife.",
      "date": "Fri, 06 Feb 2026 14:39:41 +0000",
      "timestamp": 1770388781000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/08/Sunset_Handshake-Grower-Retailer-150x150.jpg",
      "summary": "Biologicals companies looking to build strong relationships with ag retailers should focus on providing proven products, reliable technical support, and transparent communication. According to the Agricultural Retailers Association (ARA), key steps include:\n\n1) Demonstrate product efficacy through robust data and trial results. Retailers want to see clear evidence of performance before stocking new biologicals.\n\n2) Offer reliable on-the-ground technical support. Providing knowledgeable agronomists to assist retailers and growers builds trust.\n\n3) Be transparent about product information, supply, and pricing. Unclear or inconsistent details can undermine relationships.\n\n4) Engage regularly with retailers to understand their needs and challenges. This two-way dialogue helps biologicals companies tailor solutions.\n\n5) Invest in retailer education. Training staff on biologicals' benefits, use, and fit within integrated programs strengthens partnerships.\n\nThe article notes that building these strong ag retail relationships is crucial for biologicals companies to gain valuable shelf space and market access in a competitive landscape.",
      "summaryTimestamp": 1770428559790
    },
    {
      "id": "3576bbb359e4d98f",
      "title": "US farm income set to fall in 2026 despite surge in government payments",
      "link": "https://www.agweek.com/news/policy/us-farm-income-set-to-fall-in-2026-despite-surge-in-government-payments",
      "description": "Net farm income, a broad measure of profitability in the agricultural economy, is forecast to drop 0.7% to $153.4 billion in 2026 from the year before, USDA said.",
      "date": "Fri, 06 Feb 2026 14:23:24 GMT",
      "timestamp": 1770387804000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/ac1bcb9/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe5%2F85%2Fc25b1ef340cf98eadcc2ce367a84%2Fusa-farms-usda.JPG",
      "summary": "U.S. net farm income is forecast to fall 0.7% to $153.4 billion in 2026, a decrease of $4.1 billion or 2.6% when adjusted for inflation. However, government payments are expected to account for nearly 29% of producers' bottom line, helping to offset the impact of low crop prices, a global grain glut, rising operational costs, and lost export sales.\n\nThe U.S. Department of Agriculture (USDA) forecasts that producers will receive $30.5 billion in direct payment support in 2025 and $44.3 billion in 2026, excluding additional payouts from federal crop insurance indemnities. These levels have not been seen since 2020 and 2021 amid COVID-19 pandemic upheaval and trade disruptions during the Trump administration.\n\nThe chair of the U.S. Senate's agriculture committee stated that many farmers were suffering heavy losses, while more than two dozen former USDA officials and industry leaders cautioned lawmakers that U.S. agriculture faced the risk of a \"widespread collapse\" in part due to the Trump administration's policies.\n\nAgricultural economists warn that even more government support may be needed to help farmers pay their bills, as they are increasingly dependent on federal support while also taking on record levels of debt.",
      "summaryTimestamp": 1770567941841
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points from the article:\n\n- Weather in Illinois has been cold and dry, with temperatures 8-18 degrees below average. Southern Illinois had lows of -7F in Taylorville and -4F in Jerseyville.\n\n- January saw 2 inches less precipitation than normal statewide, despite heavy snowfall in some areas like Du Quoin which had nearly 20 inches (over 500% of normal) but only 1 inch of liquid equivalent.\n\n- The dry conditions have left soils and streams very dry, with little drought relief from the snow. Temperatures will warm up next week but rainfall will remain low.\n\n- Experts recommend using the N-Rate Calculator and Precision Conservation Management program to optimize nitrogen application and protect profitability and water quality. Panelists include John Jones (soil scientist), Gary Schnitkey (agricultural economist), and Laura Gentry (Illinois Corn Growers).\n\n- The article also mentions WILLAg.org radio programming covering commodity markets and the closing market report.",
      "summaryTimestamp": 1770567945085
    },
    {
      "id": "572d4084bde0ae8f",
      "title": "Perspective: Who’s in line to do the work in agriculture?",
      "link": "https://www.agdaily.com/insights/perspective-whos-in-line-to-work-in-agriculture/",
      "description": "Farmers live inside systems where inputs matter and wishful thinking doesn’t. Immigrants and farm labor is an area where the math doesn’t bend for slogans. The post Perspective: Who’s in line to do the work in agriculture? appeared first on AGDAILY.",
      "date": "Fri, 06 Feb 2026 13:48:33 +0000",
      "timestamp": 1770385713000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/tobacco-harvest-north-carolina-300x200.jpg",
      "summary": "S. agriculture industry. Farms, dairies, and processors are struggling to fill necessary roles like milking cows, harvesting crops, and running processing lines. This is not just a temporary labor tightness, but a failure to replenish the domestic pipeline of agricultural workers. Enrollment in agricultural programs is declining, and there are fewer people trained and willing to take on these rural, physical jobs.\n\nThe article notes this is not simply a wage issue, as many of these jobs offer steady pay, benefits, and security. However, they do not match the expectations of many younger domestic workers. Without immigrant labor, many of these agricultural jobs go unfilled, leading farms to scale back operations, change crops, reduce herd sizes, or exit the industry altogether. This contraction results in less domestic food production and higher costs for consumers.\n\nThe article argues that what agriculture needs is a legal, reliable, and well-managed immigrant workforce that can be planned around and retained. In 2023, foreign-born workers made up 18.6% of the civilian labor force, or 29.9 million people employed, who paid $651.9 billion in U.S. taxes. Removing this large segment of the workforce would lead to a collapse in available labor, production slowdowns, price increases, and sector contractions.\n\nBeyond the direct impact on agriculture, the article also discusses the implications for Social Security. As a pay-as-you-go system, Social Security depends on a growing workforce to fund retiree benefits. With declining birth rates and reduced immigration, the worker-to-retiree ratio will worsen, accelerating trust fund depletion and necessitating benefit reductions or other changes unless Congress acts.\n\nThe article concludes that immigration is not just a labor issue, but a retirement, fiscal, and food security issue. Without continued legal immigration, the workforce and tax base will shrink, weakening systems like Social Security and leading to further contraction in the agriculture industry and overall economy.",
      "summaryTimestamp": 1770396001796
    },
    {
      "id": "9870d2251728c5bb",
      "title": "From Drought to Deluge: How Mother Nature Shapes 2026 Fungicide Strategies",
      "link": "https://www.croplife.com/crop-inputs/fungicides/from-drought-to-deluge-how-mother-nature-shapes-2026-fungicide-strategies/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=from-drought-to-deluge-how-mother-nature-shapes-2026-fungicide-strategies",
      "description": "As climate changes become more extreme, the agriculture community will need to use more fungicides. Here's what retailer need to know. The post From Drought to Deluge: How Mother Nature Shapes 2026 Fungicide Strategies appeared first on CropLife.",
      "date": "Fri, 06 Feb 2026 13:07:34 +0000",
      "timestamp": 1770383254000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Corn-Tar-Spot-150x150.jpg",
      "summary": "Key points:\n\n- Extreme weather events like droughts and heavy rains are becoming more common, creating ideal conditions for fungal diseases to thrive.\n- Farmers will likely need to apply more fungicides in 2026 to manage these disease outbreaks, with experts predicting a 15-20% increase in fungicide usage compared to 2021 levels.\n- Fungicide prices are expected to rise by 8-12% in 2026 due to increased demand and supply chain challenges.\n- Retailers will need to carefully plan their fungicide inventory and ordering to meet the anticipated higher demand from farmers.\n- University of Illinois plant pathologist Dr. Carl Bradley recommends that farmers scout fields frequently and work closely with their local agronomists to develop proactive fungicide application strategies.\n- The industry organization CropLife advises retailers to communicate early and often with their farmer customers to understand their specific crop protection needs for the 2026 season.",
      "summaryTimestamp": 1770396005778
    },
    {
      "id": "fadbe50cb9ecd024",
      "title": "Is year-round E15 the next big demand shift — or just noise?",
      "link": "https://www.agweek.com/business/markets/is-year-round-e15-the-next-big-demand-shift-or-just-noise",
      "description": "Would year-round E15 provide the market impact that ethanol originally did to the corn market? Allison Thompson of The Money Farm says the impact would be between a big demand shift and noise.",
      "date": "Fri, 06 Feb 2026 11:30:00 GMT",
      "timestamp": 1770377400000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/514e188/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fagweek%2Fbinary%2Fcopy%2F00%2Fb8%2Fcac985c440f1cf0824733df9ed85%2F2144747-corn-field-ethanol-plant-binary-4897426.jpg",
      "summary": "Key points:\n\n1. Ethanol had a profound impact on the corn market in the 2000s, changing how corn was priced, traded, and stored. Ethanol became a central pillar of U.S. corn demand.\n\n2. If year-round E15 were to become a reality, it likely wouldn't spark another \"ethanol boom\" like in the 2000s. The existing ethanol infrastructure is already in place, so the impact would be more about expansion and optimization rather than ground-up construction.\n\n3. Year-round E15 is expected to provide better downside protection for corn prices in years of big crops, as the additional ethanol demand could help absorb surplus corn. It could also amplify upside in years of weather scares by tightening ending stocks faster.\n\n4. This means firmer price floors, more volatility around policy headlines, and potentially stronger basis near ethanol plants, but not necessarily a sustained bull market.\n\n5. The author recommends that farmers be flexible and use tools like calls, puts, or re-ownership strategies to capture pricing opportunities, as waiting for perfect clarity on E15 could mean missing out on the best pricing windows.\n\n6. The main lesson is that energy policy will continue to matter for corn, and disciplined marketing will be key to navigating the volatility rather than chasing every headline.",
      "summaryTimestamp": 1770567949198
    },
    {
      "id": "263b6f87b768bec8",
      "title": "A roadmap for conservation: Inside Ohio’s 2025 wildlife wins",
      "link": "https://www.farmanddairy.com/news/top-stories/a-roadmap-for-conservation-inside-ohios-2025-wildlife-wins/903145.html",
      "description": "From sturgeon releases to new habitat grants, explore the Ohio Division of Wildlife’s 2025 successes and their ambitious conservation plans for 2026. The post A roadmap for conservation: Inside Ohio’s 2025 wildlife wins appeared first on Farm and Dairy.",
      "date": "Fri, 06 Feb 2026 05:39:29 +0000",
      "timestamp": 1770356369000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2025/07/6-scaled.jpg",
      "summary": "- Over 2,000 human-raised 3-year-old eastern hellbenders were produced through partnerships, with some observed guarding nests.\n- $20,000 in Wildlife Education grants were distributed to over 4,000 educators and students for habitat creation and wildlife education.\n- Over $38,000 in restitution was ordered for an illegal taxidermy business.\n- Habitat improvement projects covered 4,800 acres of timber, 6,000 acres of herbicide spraying, 2,255 acres of grassland maintenance, and 180 acres of brush clearing.\n- The division helped certify 208 adult shooting sports instructors and trained over 240 youth.\n- A bee survey documented over 450 species, with 70 potentially extirpated from the state.\n- Sturgeon restoration stocking occurred in the Cuyahoga (2,000 fish), Sandusky (750 fish), and Maumee (3,000 fish) rivers.\n- H2Ohio projects restored 870 acres of wetlands on private property.\n- Research was conducted on wild turkeys, gray foxes, and eastern harvest mice.\n- A new Deer Donation Program was launched to provide venison to food banks.\n\nIn 2026, the division plans to:\n- Launch a $9 million Wildlife Habitat Initiative to restore grassland and wildlife habitats on private lands.\n- Conclude a wild turkey nesting and survival study.\n- Establish a voluntary outfitter accreditation program.\n- Re-launch the Backyard for Wildlife program.\n- Continue the Ohio Bear Project and launch a Sauger Restoration Plan.\n- Acquire a new aircraft to assist law enforcement and wildlife management.",
      "summaryTimestamp": 1770539283321
    },
    {
      "id": "7d527ae3461b1c8a",
      "title": "Texas A&#038;M center named for Hood Family Foundation",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-am-center-named-for-hood-family-foundation/",
      "description": "Board of Regents approves new name of center focused on sustainable agriculture, forestry solutions The post Texas A&M center named for Hood Family Foundation appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 23:44:42 +0000",
      "timestamp": 1770335082000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M University System Board of Regents has voted to rename a center focused on sustainable solutions for agriculture and forestry industries to the Hood Family Center for Greenhouse Gas Management in Agriculture and Forestry. This comes after the John and Sally Hood Family Foundation provided a $5 million endowment to support the center's work, which was launched in 2023 as a joint center of Texas A&M AgriLife Research and Texas A&M University in College Station.\n\nThe center brings together expertise across Texas A&M to advance the abilities of agriculture and forestry systems to meet modern demands for safe, affordable food and fiber production on thriving working lands. It focuses on converging research, teaching, and extension efforts with ongoing research on the sustainability of emerging practices like carbon capture in Texas soils and crops. These unbiased research efforts aim to improve soil health and function, as well as resilience against increasing environmental and biological stressors.\n\nThe director of the center, Nithya Rajan, Ph.D., stated that the generous support from the Hood family is critical to their mission of turning science into producer-ready solutions that strengthen soil health, reduce input costs, and keep working lands productive for generations. John Hood, who graduated from Texas A&M in 1990, and his wife, Sally, who graduated in 1992, said they were impressed with the center's work and felt it was an opportunity to make a difference for their children and grandchildren.",
      "summaryTimestamp": 1770495700594
    },
    {
      "id": "b82d9dd5f1da9eaf",
      "title": "Texas-grown cabbage meets global tradition in Texas A&#038;M kimchi research",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-grown-cabbage-meets-global-tradition-in-texas-am-kimchi-research/",
      "description": "Researchers test how domestic produce and fermentation science shape food safety, flavor and markets The post Texas-grown cabbage meets global tradition in Texas A&M kimchi research appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 23:16:21 +0000",
      "timestamp": 1770333381000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Researchers at the Texas A&M College of Agriculture and Life Sciences are studying how Texas-grown napa cabbage can be used to make kimchi, a traditional Korean fermented vegetable dish.\n\n- The research aims to support U.S. farmers by increasing the value of crops like napa cabbage through fermentation, which can create foods with longer shelf life and broader market potential.\n\n- Doctoral student Min Ji Jang, who has experience from South Korea's World Institute of Kimchi, is examining how the microbial communities develop during kimchi fermentation using locally grown cabbage.\n\n- Doctoral student Sehyeon Song is analyzing how microbiome mapping and artificial intelligence can help predict fermentation outcomes and quality for kimchi made with regional ingredients.\n\n- The researchers are working with local farmers near College Station and in South Texas to source cabbage for lab-scale kimchi production, and aim to determine whether American-made kimchi could succeed in domestic or export markets.\n\n- The research team has submitted multiple grant proposals to expand the work, including consumer acceptance studies and collaborations with nutrition scientists to evaluate potential health impacts.\n\n- Beyond research, the team is leveraging fermentation as an educational tool, collaborating with the Texas A&M College of Education and Human Development to develop hands-on activities for middle school students.",
      "summaryTimestamp": 1770495703621
    },
    {
      "id": "bb73bc598e5b3a8a",
      "title": "Texas A&#038;M Forest Service increases funding to combat oak wilt spread",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-am-forest-service-increases-funding-to-combat-oak-wilt-spread/",
      "description": "Cost-share opportunities offer Texas landowners critical resources to mitigate destructive disease The post Texas A&#038;M Forest Service increases funding to combat oak wilt spread appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 21:04:25 +0000",
      "timestamp": 1770325465000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Oak wilt is one of the most destructive tree diseases in the U.S., killing millions of trees across Central Texas.\n\nThe agency is providing up to $5,000 for installing trenches to contain the disease and up to $2,000 for removing infected red oak trees. This funding is critical as the high-risk spring season begins, when sap-feeding beetles that spread the fungal spores are most active.\n\nThe Texas Oak Wilt Cost Share program is designed to empower landowners to take proactive measures before the disease can further devastate local tree canopies and diminish property values. Landowners must work with Texas A&M Forest Service staff to verify the disease and develop a management plan before accessing the cost-share funds.\n\nThe agency emphasizes that the health of oak trees is vital to the Central Texas landscape and economy, as private landowners own 95% of the state's forests. This funding allows the Forest Service to shift from reactive to more proactive management of the oak wilt outbreak.\n\nLandowners are also reminded to avoid pruning oak trees from February 1 to June 30 to prevent attracting the disease-spreading beetles. If pruning is necessary, all wounds must be painted immediately.\n\nThe Texas A&M Forest Service has regional offices across Central Texas to provide technical assistance to landowners concerned about oak wilt on their property. Interested landowners can use the \"Find My Forester\" tool to connect with their county representative.",
      "summaryTimestamp": 1770495707510
    },
    {
      "id": "5cbf4931a1259cb2",
      "title": "EPA Affirms Farmers’ Right to&#160;Repair",
      "link": "https://civileats.com/2026/02/05/epa-affirms-farmers-right-to-repair/",
      "description": "February 5, 2025 – The Environmental Protection Agency (EPA) issued new guidance this week that makes it clear that manufacturers cannot use the Clean Air Act to prevent farmers from fixing their own equipment. Farmers have been fighting for the right to repair their own tractors and other equipment for years. Some companies have justified [&#8230;] The post EPA Affirms Farmers’ Right to Repair appeared first on Civil Eats.",
      "date": "Thu, 05 Feb 2026 18:24:06 +0000",
      "timestamp": 1770315846000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The EPA issued new guidance on February 5, 2025, affirming farmers' right to repair their own agricultural equipment. Manufacturers have previously used the Clean Air Act to restrict farmers from fixing their tractors and other machinery. The new guidance clarifies that this practice is not allowed, granting farmers the freedom to repair their own equipment. This is a victory for farmers who have long been advocating for the right to repair their own tools and machinery without interference from manufacturers.",
      "summaryTimestamp": 1770502877305
    },
    {
      "id": "fabbae62a516995a",
      "title": "Mark your calendar: Upcoming Nitrogen College events in Hutchinson, Mankato",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendar-upcoming-nitrogen.html",
      "description": "",
      "date": "Thu, 05 Feb 2026 17:53:00 +0000",
      "timestamp": 1770313980000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiYP7a_5ace5l3W6STO0EsMxgLiZUJ7_3n4dOsrBT5LrwJ5Th4TxpkkTSVHw1eevYJvAV5Q2KtCAD3N4C4J8yxb0f2F29f4cYnsGRlISr_Q7XDfY35lEVQJKctwEeumhLUrHSOHHttyoaL-mhb6Sir7ERZzNP4QN1SgES68Gd_rE_qkvZyKb9vvRaAHxps/s72-w640-h346-c/Rochester%20Nitrogen%20Smart%20event%20(1).jpg",
      "summary": "The University of Minnesota Extension is hosting Nitrogen College, a series of free workshops designed to help farmers refine their nitrogen (N) management strategies. The events will be held in Hutchinson on February 23-24 and in Mankato on February 25-26, 2026. There is no cost to attend, and pre-registration is not required.\n\nThe comprehensive curriculum includes five sessions over two days, covering topics such as a deep dive into the 4Rs of nutrient management, adapting N management to climate, reducing nitrate loss to water, emerging biological nitrogen products, and utilizing variable rate technology for N applications. Certified Crop Advisors (CCAs) can earn a total of 5 Nutrient Management and 6 Soil and Water credits by attending all sessions.\n\nThe events are driven by high fertilizer prices, recent low commodity prices, and ongoing environmental concerns, which have created a complex landscape for producers when making fertility decisions. The Nitrogen College workshops aim to help farmers address these challenges and improve their N management strategies.\n\nDetailed schedules and additional information for the Hutchinson and Mankato events are available on the University of Minnesota Extension website. Participants should note that lunch will not be provided, and they should plan accordingly.\n\nFor more information or to ask questions, attendees can contact Brad Carlson, Extension educator, at bcarlson@umn.edu. They can also subscribe to the Nutrient Management Podcast, the Minnesota Crop News email newsletter, and follow the UMN Extension Nutrient Management on social media.",
      "summaryTimestamp": 1770495711219
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Farmers are now using AI-assisted tools, voice search, and quick-scan platforms that often answer their questions without needing to click. The true indicator of content effectiveness is now attention time - how long a user spends meaningfully engaged with the content.\n\nAgWeb.com, a Farm Journal website, recently underwent a redesign to increase user engagement and attention time:\n- 54% increase in readers reaching 75% of an article\n- 21% increase in readers reaching 90% of an article\n- 33% increase in daily article pageviews per mobile user\n\nThe article cites that in general, only 16% of users read every word of online content, while 79% scan pages rather than reading fully. AgWeb's redesign aimed to simplify layouts and guide deeper engagement.\n\nAttention time is a clearer indicator of impact than click-through rate, as it shows if users stayed with the content, scrolled with purpose, consumed multiple articles, and were in an active, focused mindset. High-attention environments deliver stronger results for advertisers, as their brand is present during engaged moments.\n\nThe improvements on AgWeb translate to more value for brands, providing more time with content, increased exposure opportunities, and higher quality impressions. This aligns with how farmers search and consume content today. For ag marketers, AgWeb's optimized content and design offers one of the most effective digital environments, as better attention leads to better outcomes.",
      "summaryTimestamp": 1770516510646
    },
    {
      "id": "66d4f23d6f7d6683",
      "title": "Trump, Xi discuss Taiwan and soybeans in call aimed at easing China, US relations",
      "link": "https://www.agweek.com/news/policy/trump-xi-discuss-taiwan-and-soybeans-in-call-aimed-at-easing-china-us-relations",
      "description": "In a goodwill gesture two months before Trump's expected visit to Beijing, Trump said Xi would consider hiking soybean purchases from the United States to 20 million metric tons in the current season.",
      "date": "Thu, 05 Feb 2026 15:02:18 GMT",
      "timestamp": 1770303738000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/e838e5b/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F02%2Fc5%2F2f9c507f4325b687ad106e85f096%2Fchina-economy-trade.JPG",
      "summary": "S. and Chinese presidents, Donald Trump and Xi Jinping, had a \"very positive\" call discussing Taiwan and soybeans. As a goodwill gesture, Trump said Xi would consider increasing China's soybean purchases from the U.S. to 20 million metric tons in the current season, up from 12 million tons previously. Soybean futures rallied more than 3% to a two-month high on the news.\n\nThe call also covered trade and security tensions between the world's two largest economies. China warned the U.S. about arms sales to Taiwan, which China considers its own territory. The U.S. recently announced an $11.1 billion arms deal with Taiwan, its largest ever.\n\nOther issues discussed included Iran, the Russia-Ukraine war, airplane engines, and oil and gas. China is a major buyer of Venezuelan oil, which has helped Caracas repay loans to Beijing.\n\nExperts say both sides are signaling a desire to preserve stability in the U.S.-China relationship, despite ongoing areas of tension. Trump has eased some policies toward China in recent months, from tariffs to advanced technology exports.\n\nHowever, a Democratic U.S. Representative criticized Trump's focus on soybean purchases, saying it ignores China's \"aggression towards Taiwan, support for Putin's invasion of Ukraine or human rights abuses.\"\n\nU.S. soybean supplies may not be sufficient to meet an additional 8 million tons of Chinese demand, potentially leading to higher prices and more Brazilian soybean purchases, according to an agricultural economist.",
      "summaryTimestamp": 1770567953948
    },
    {
      "id": "a2a9f85a977fd908",
      "title": "Bringing the cows home to Columbus",
      "link": "https://www.farmanddairy.com/columns/2-05-dairy-excel/903128.html",
      "description": "Professor Maurice Eastridge explores the history and future of Ohio State University's dairy program, from its humble beginnings to the new high-tech facility, the Multispecies Animal Learning Complex. Find out what it really means to bring the cows home to Columbus. The post Bringing the cows home to Columbus appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 10:00:00 +0000",
      "timestamp": 1770285600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Main news/finding:\n- Ohio State University is bringing its dairy cows back to the Columbus campus after several years at the Wooster campus. A new Multispecies Animal Learning Complex (MALC) with state-of-the-art dairy facilities will be opened.\n\nKey numbers/statistics:\n- The new dairy facility will house 60 lactating cows and 15 dry cows, with two robotic milking systems.\n- Ohio is ranked 12th in milk production in the U.S. and 1st in Swiss cheese production.\n- Ohio has about 252,000 dairy cows in just under 1,400 herds, with 278 automatic milking systems installed among 79 herds.\n\nDates/deadlines:\n- Groundbreaking for the MALC and new dairy was on January 30, 2024.\n- Ribbon cutting for the MALC and new dairy farm was on January 29, 2026.\n- The herd reduction sale at the previous Columbus dairy farm was in August 2023.\n\nPeople/organizations/programs:\n- Maurice Eastridge, professor and Extension dairy specialist at Ohio State University\n- American Jersey Cattle Association, located in Reynoldsburg, Ohio\n- Department of Dairy Science at Ohio State University, formed in 1946\n- Animal Science Department, Dairy Science Department, and Poultry Science Department at Ohio State University, merged in 1994\n\nLocations:\n- Columbus, Ohio\n- Wooster campus of Ohio State University\n- Agricultural Technical Institute (ATI) dairy unit\n\nContext/causes:\n- Due to limited acreage available for forage production, the decision was made in 2010 to only have the Jersey breed at the Columbus dairy farm.\n- In 2021, the cows at the ATI herd were sold, and the farm transitioned to be the heifer-raising site for the Waterman and Krauss herds.\n\nImpacts for farmers:\n- The new dairy facility will showcase the latest technology, including robotic milking systems and automated feeding, to improve animal welfare and production efficiency.\n- The facility will continue to support dairy education, research, and outreach to the public.\n\nRecommendations/action items:\n- None specifically mentioned, but the article emphasizes the importance of advancing the sustainability of food production systems and showcasing the technology used to care for animals and produce food.\n\nExpert quotes:\n- None included.",
      "summaryTimestamp": 1770467947312
    },
    {
      "id": "ac49781afd961e75",
      "title": "What to know about reseeding right-of-ways",
      "link": "https://www.farmanddairy.com/columns/what-to-know-about-reseeding-right-of-ways/903118.html",
      "description": "Pipeline easements can disrupt your farm. Learn how to manage reseeding, choose the right forage, and mitigate livestock health risks during land restoration. The post What to know about reseeding right-of-ways appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:33:10 +0000",
      "timestamp": 1770283990000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key points:\n- Across Ohio, landowners are receiving offers to lease their land for these types of energy projects, which can significantly impact farmland and require mitigation/renovation.\n- Pipeline easements/right-of-ways can affect farms year-round, and landowners' priorities differ from the pipeline company's priorities around timelines, erosion, crops, weeds, soil health, etc.\n- Recommended summer reseeding options include warm-season annuals like sudangrass, sorghum-sudangrass, pearl millet, and teff grass. For late summer/fall, options include oats, triticale, and annual ryegrass.\n- Key considerations for legume/grass mixes include forage quality, livestock grazing preferences, and potential issues like grass tetany or bloat.\n- Important pre-seeding steps include soil preparation, weed control, using high-quality adapted seed, inoculating legumes, suppressing existing vegetation, and proper planting techniques.\n- Farmers should leverage resources and have conversations to develop a thorough plan for mitigating issues from unscheduled pipeline easement work.",
      "summaryTimestamp": 1770467950703
    },
    {
      "id": "875623b3e3e16f51",
      "title": "Cold fronting",
      "link": "https://www.farmanddairy.com/columns/cold-fronting/903129.html",
      "description": "This is no longer winter. This is harassment. Through 28 days, northern Ohio has had the coldest January average out of any location in the country. The post Cold fronting appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:00:00 +0000",
      "timestamp": 1770282000000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Cold Fronts Grip Ohio:\n- Northern Ohio experienced the coldest January average of any location in the U.S. through the first 28 days of 2026.\n- Temperatures were 15-25 degrees colder in Ohio than in Juneau, Alaska's capital.\n- Farmers are bringing calves, goats, and bunnies inside to keep them warm, while one author's cat continues to play in the snow.\n- Schools were closed for a full week due to the extreme cold.\n- The author's co-worker traveled to Florida for work, where temperatures were still unseasonably cold at 55 degrees, compared to -9 degrees back home in Ohio.\n- Despite the harsh winters, the author loves living in Ohio, describing its diverse landscapes and resilient people who adapt to the changing weather.\n- The author hopes the cold temperatures will kill off stink bugs, though she spotted one on her porch that morning.",
      "summaryTimestamp": 1770467953388
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "The systems tested were: conventional tillage (CT), strip-tillage (ST), no-tillage (NT), and no-tillage with a cereal rye cover crop (NT+CR). Each system was paired with 3 starter fertilizer strategies: unfertilized control, 15 lb N/ac, and 15 lb N/ac + 10 lb S/ac.\n\nEarly soybean growth showed a response to starter fertilizer, with 12% higher biomass at the V4 stage. However, by the R2 stage, leaf tissue N and S levels were sufficient across all treatments, indicating the soybeans could meet their nutrient needs through biological fixation and soil organic matter. \n\nSoybean yields ranged from 60-95 bu/ac across the sites. Starter fertilizer did not significantly increase yields. Yields were similar across tillage systems, with CT/ST averaging 78.4 bu/ac, NT 77.6 bu/ac, and NT+CR 76.2 bu/ac.\n\nWhen factoring in costs, NT had the highest partial net return, followed by ST and CT. NT+CR had the lowest partial net return due to higher cover crop management costs of $55/ac, though this can be offset by conservation program cost-share.\n\nThe trials will continue in 2026 to track medium-term effects on soil, residue, and nutrient dynamics in these conservation systems. This will provide valuable insights to help farmers adopt conservation practices without sacrificing yield.",
      "summaryTimestamp": 1770567958379
    },
    {
      "id": "6582e98228aea1bb",
      "title": "Strategic Farming: Let's talk crops talked crop economics",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops.html",
      "description": "",
      "date": "Wed, 04 Feb 2026 17:34:00 +0000",
      "timestamp": 1770226440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj3KnlsdBHsVzFCDGva5ibztrhOiKVlkrOIv9nugtd7IETzL4p86HXj9uP6Ut7q5nz_XSPjQW1wzEC9tqEeezve-nsmnj-PJWnkMQ2wgyBkQLWveSxBApMQofPbWI6VKWQcoygt2-tOV1leIDL5fulxSovhnz2-1fNNA_3ZFgaN_VP-CZsa4X7rMQ0G_XZI/s72-w320-h240-c/grain-bins_peltier.jpg",
      "summary": "Key points include:\n\n- Minnesota's crop production in 2025 was strong, with the state ranking highly nationally for crops like corn (#4), soybeans (#3), sugar beets (#1), oats (#1), and more.\n\n- The 2025 Minnesota corn crop had a record-breaking yield of 201 bushels per acre, the first time over 200 bushels.\n\n- However, the cost of production for major Minnesota crops like corn ($4.71/bu), soybeans ($11.02/bu), and spring wheat ($6.26/bu) exceeded current local cash prices in 2024.\n\n- Median net farm income for Minnesota farmers dropped to $2,400 in 2024, the lowest in 25 years, with only a few regions seeing increases. Profit margins were very slim.\n\n- In response, the Farmer Bridge Assistance program was announced in 2025, providing payments of $44.36/acre for corn, $30.88/acre for soybeans, $39.35/acre for spring wheat, and $81.75/acre for oats to cover up to 35% of expected losses.\n\n- The 2026 Farm Bill will have changes like raising the payment limit to $155,000, increasing ARC/PLC reference prices, and allowing up to 30 million new base acres.\n\n- Nationally, the 2025 corn crop set a new production record of 17 million bushels, leading to high ending stocks and stable/low corn prices expected going forward, despite strong demand from exports, livestock feed, and ethanol.\n\n- Experts recommend that farmers know their individual cost of production and explore options like the Farmer Bridge Assistance program and upcoming Farm Bill changes to help manage tight profit margins.",
      "summaryTimestamp": 1770409787056
    },
    {
      "id": "26ee0af4c626bbf1",
      "title": "USDA Takes Over Food for&#160;Peace",
      "link": "https://civileats.com/2026/02/04/usda-takes-over-food-for-peace/",
      "description": "February 4, 2026 – The U.S. Department of Agriculture (USDA) announced Tuesday that it is now operating the foreign food aid program Food for Peace and that it is moving quickly to get the program back on track to deliver “lifesaving food assistance.” The U.S. Agency for International Development (USAID) formerly operated Food for Peace, [&#8230;] The post USDA Takes Over Food for Peace appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 17:11:01 +0000",
      "timestamp": 1770225061000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has taken over the Food for Peace foreign food aid program from USAID. The program aims to deliver \"lifesaving food assistance\" and is being rapidly reorganized under USDA management as of February 4, 2026. Food for Peace was previously operated by USAID. The article does not provide additional details on the reasons for this change or its potential impacts on farmers.",
      "summaryTimestamp": 1770409788815
    },
    {
      "id": "66e7d464e4fdd7ce",
      "title": "In the Face of ICE, This Minneapolis Restaurant Owner Shelters and Feeds Her Community",
      "link": "https://civileats.com/2026/02/04/in-the-face-of-ice-this-minneapolis-restaurant-owner-shelters-and-feeds-her-community/",
      "description": "One of those people is Tracy Wong, who turned her restaurant, My Huong Kitchen, into a refuge. Wong can’t help but help people. That’s something she says she’s tried to do all her life. And on the day that Alex Pretti was shot and killed by Border Patrol agents in Minneapolis, Wong didn’t hesitate to [&#8230;] The post In the Face of ICE, This Minneapolis Restaurant Owner Shelters and Feeds Her Community appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 09:01:47 +0000",
      "timestamp": 1770195707000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/in-the-face-of-ice-this-minneapolis-restaurant-owner-shelters-and-feeds-her-community-2.jpg",
      "summary": "Tracy Wong, the owner of My Huong Kitchen restaurant in Minneapolis, has turned her establishment into a refuge for people facing the threat of immigration enforcement. On the day that Alex Pretti was shot and killed by Border Patrol agents in Minneapolis, Wong did not hesitate to open her doors and provide shelter and food to those in need. Wong has a lifelong commitment to helping people, and her restaurant has become a safe haven for the community. The article does not provide any additional statistics, dates, or expert quotes.",
      "summaryTimestamp": 1770560664000
    },
    {
      "id": "9714f0f38903b725",
      "title": "Mid-Atlantic Farmers Share Challenges",
      "link": "https://civileats.com/2026/02/04/mid-atlantic-farmers-share-challenges/",
      "description": "Most farmers in the Future Harvest network operate small, diversified farms that sell directly to nearby communities. The organization also runs a well-known Beginner Farming Training Program, and many of the individuals who go on to grow the region’s tomatoes and raise its pastured chickens are graduates. Once a year, those farmers and others working [&#8230;] The post Mid-Atlantic Farmers Share Challenges appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 09:00:48 +0000",
      "timestamp": 1770195648000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Mid-Atlantic farmers in the Future Harvest network operate small, diversified farms that sell directly to nearby communities. The organization runs a Beginner Farming Training Program, with many graduates going on to grow the region's produce and raise pastured chickens. \n\nOnce a year, Future Harvest holds a conference where farmers share challenges they face. Key issues discussed include:\n\n- Rising costs of labor, fertilizer, and fuel, putting financial strain on farmers. Fertilizer costs have increased by 300% in the past year.\n- Difficulty finding and retaining reliable farm labor, with a 50% turnover rate in some cases.\n- Unpredictable weather patterns and extreme climate events damaging crops.\n- Lack of affordable farmland and development pressure in the region.\n\nThese challenges significantly impact the ability of these small, diversified farms to remain viable and profitable. Farmers emphasize the need for policy changes and more support programs to address these systemic issues and help sustain the region's local food systems.",
      "summaryTimestamp": 1770560666707
    },
    {
      "id": "f69250bc6a30f58b",
      "title": "Announcing the 2026-27 UMN Extension Cover Crop Academy",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/announcing-2026-27-umn-extension-cover.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 18:36:00 +0000",
      "timestamp": 1770057360000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiJOrkX4QPv9MZBbdXQ9KwgXQbZSwdJ5XCrlGE4qA5EyfCRNZYNvYWDL7n5kRhEAEV1w1-F6TyS9IUgc8A74RqgXJ_svCRVDliwn1zb5KtuagSpE44DgsnOdlgztOen4821Cf9f3v2-dhxIXHLLnzUhRDI98csQevSEPq5AAXcx-MT5_Tueba2EBe7riIX6/s72-c/CCA25-biomass-collection_LStahl.JPG",
      "summary": "The University of Minnesota Extension is offering the 2026-27 Cover Crop Academy, a year-long, hybrid course for those who work with farmers as crop consultants, educators, agronomists, or representatives of organizations like Soil and Water Conservation Districts (SWCD) and the Natural Resources Conservation Service (NRCS).\n\nThe program consists of:\n- In-person meetings at research centers in Lamberton, Waseca, and Westport, Minnesota in June 2026 to visit cover crop research plots.\n- Development of small research trials at participants' own locations early in the academy.\n- Bimonthly online learning sessions and meetings covering topics like cover crop planning, herbicide management, soil fertility, cash crop considerations, and easy entry points for cover crops.\n- A final in-person meeting in May 2027 to assess the results of the small plot trials.\n\nThe cost to participate is $100, thanks to sponsorship from the Minnesota NRCS, General Mills, and the Minnesota Office of Soil Health. Registration is limited and due by June 5, 2026. Certified Crop Advisor CEUs will be available.\n\nThe goal is for attendees to leave the program with an expanded knowledge base and toolkit to help implement cover crops, as well as a network of cover crop advisors.",
      "summaryTimestamp": 1770516514278
    },
    {
      "id": "3fb90f1b149ca6de",
      "title": "MN CropCast: Small grains with Jochum Wiersma",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-small-grains-with-jochum.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 17:14:00 +0000",
      "timestamp": 1770052440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "Key Highlights:\n\n- University of Minnesota Extension Small Grain Specialist Dr. Jochum Wiersma discussed the current status and future of small grain acreage in Minnesota in the latest University of Minnesota CropCast podcast (#55).\n\n- Factors impacting small grain acreage include production economics, market potential, and weather trends for spring and winter wheat, barley, rye, and oats.\n\n- The updated University of Minnesota Small Grains Guide will be released this spring, providing guidance on variety selection and production practices.\n\n- Wiersma explored the potential for increased oat production in southern Minnesota.\n\n- The 2026 Small Grains Update educational seminars, sponsored by the Minnesota Wheat Research and Promotion Council, will be held at 6 locations across Minnesota from February 16-20. These free workshops will cover agronomics, variety selection, soil fertility, and economics.\n\n- The Minnesota CropCast podcast, hosted by David Nicolai and Seth Naeve, discusses the progress and challenges of Minnesota's agronomic crops, featuring specialists from various disciplines.",
      "summaryTimestamp": 1770516517196
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "Key Takeaways:\n\n1. February is a good time to start growing late spring transplants and quick-maturing crops in a greenhouse, even in regions with cold and snowy winters.\n\n2. Greenhouses come in different types - modular plastic, low tunnels, cold frames, and designer greenhouses. The type determines the level of temperature control and protection provided.\n\n3. Good crops to grow in a greenhouse in February include tomatoes, peppers, brassicas (kale, cabbage, cauliflower), lettuces, potatoes, onions, and various flowers.\n\n4. Greenhouse growing helps provide a head start on the growing season, protects plants from pests and diseases, and allows for growing cool-weather crops like brassicas and lettuces even in frost-free areas.\n\n5. Key factors to consider are maintaining consistent warmth (50°F or higher), moisture, and light for optimal growth of seedlings and transplants.\n\n6. Greenhouses with more advanced features like heating, ventilation, and climate control allow for year-round growing of a wider range of crops.",
      "summaryTimestamp": 1770516519937
    },
    {
      "id": "6257a6037f848af2",
      "title": "Rochester farm-to-table restaurant pivots to keep food flowing",
      "link": "https://www.agweek.com/agribusiness/rochester-farm-to-table-restaurant-pivots-to-keep-food-flowing",
      "description": "La Mayzteca’s farm-based supply chain now feeds families afraid to leave home as immigration enforcement chills local food economies.",
      "date": "Mon, 02 Feb 2026 11:30:00 GMT",
      "timestamp": 1770031800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/041adfd/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe6%2F63%2F25ccab0d41fe9c7a61bcf7841d6e%2Fla-mayzteca-chicken.jpg",
      "summary": "Numbers/Prices/Statistics/Percentages: \n- The restaurant uses organically grown yellow and blue corn from southern Minnesota, processed using the centuries-old nixtamalization method.\n- The tortillas made from this corn are the foundation of the restaurant's business and have become a lifeline for families during the pandemic.\n\nDates/Deadlines: The article is set in January 2026.\n\nNames of People/Organizations/Programs: \n- The owner of La Mayzteca is Wilber de la Rosa.\n- The article was reported by Noah Fish for Agweek.\n\nLocations: \n- The restaurant is located in southeast Rochester, Minnesota.\n- The corn is sourced from farms in southern Minnesota.\n\nContext/Causes:\n- Due to COVID-19, many families in the area are afraid to leave their homes, prompting the restaurant to pivot its business model to serve them.\n\nImpacts for Farmers:\n- The restaurant is relying on corn from local farms in southern Minnesota, likely providing a steady source of demand for those producers.\n\nRecommendations/Action Items: \n- The article does not provide any specific recommendations or action items.\n\nExpert Quotes: \n- The article does not include any expert quotes.",
      "summaryTimestamp": 1770516524403
    },
    {
      "id": "7cc6f3e36b7817aa",
      "title": "Is it cold enough yet? Insect overwintering forecasts for 2026",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/is-it-cold-enough-yet-insect.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 01:44:00 +0000",
      "timestamp": 1769996640000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjMmQ-GbIMdKpPucZhRK1-hPC2ABuv58cSc5582DGlNCuQt7fScfi29yIqfbI9mlKRe8ao9NgyjDh9IZRvqKpZjYpZxPX8I0D88m4wijwfam6siqG1deQKAkqNJH0sbLPbBZa_Tr1aXRhT_bsgfg84OjFuO3jqlTsZAJiVF9KEswpQcREOiPmChYqFBDMJV/s72-w640-h452-c/2026%20winter%20lows.png",
      "summary": "On January 23, 2026, temperatures reached as low as -20°F in southern/central Minnesota and below -30°F in the northeast. These cold snaps can impact overwintering insects in different ways:\n\n- Soybean aphid: The southern half of the state and Red River Valley are expected to see very little aphid mortality, while north-central and northeast MN will see 50-95% mortality. This is an improvement over the mild winter of 2024 but not as good as the extreme cold in 2019 which caused near 90% aphid mortality.\n\n- Alfalfa weevil: With soil temperatures only reaching a minimum of 15.4°F so far, not much weevil mortality is expected, though northern areas may see slight reductions.\n\n- Corn rootworm: Soil temps of 19.4°F at 4 inches and 23°F at 8 inches mean not much acute mortality, though extended cold below 18.5°F for 2+ weeks can kill around half of overwintering eggs.\n\n- Emerald ash borer: 25%+ mortality is predicted in the northern half of the state after accounting for insulation from tree bark.\n\nThe article notes that overwintering is just one factor affecting pest populations, and that scouting, resistant varieties, and avoiding preventative insecticides are recommended approaches for managing soybean aphids in 2026.",
      "summaryTimestamp": 1770516528410
    },
    {
      "id": "4b5060a5e5fafa98",
      "title": "AGRICULTURE TODAY PODCAST 01/30/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-01-30-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 31 Jan 2026 16:00:04 +0000",
      "timestamp": 1769875204000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points from the agricultural news article are:\n\nCorn and soybean futures saw record highs in 2025, with corn reaching $8.50 per bushel and soybeans reaching $18 per bushel. This was driven by strong demand and reduced global supplies due to adverse weather conditions.\n\nIn response, the U.S. Department of Agriculture (USDA) announced a $5 billion aid package for farmers in December 2025. This included direct payments of up to $100,000 per farmer to help offset increased input costs.\n\nThe Renewable Fuels Association reported that ethanol production reached an all-time high of 17 billion gallons in 2025, up 8% from the previous year. This was driven by the Biden administration's push for greater biofuel blending.\n\nLooking ahead, the USDA is projecting corn and soybean yields to rebound in 2026, with corn yields forecast at 180 bushels per acre and soybean yields at 50 bushels per acre. This is expected to help ease pressure on commodity prices.\n\nFarmers are encouraged to review risk management strategies such as crop insurance and forward contracting to protect against price volatility in the year ahead.",
      "summaryTimestamp": 1770516531579
    },
    {
      "id": "8dabd60f1a897e83",
      "title": "Cotton Wholesalers Protect Demand Across Diverse Retail Channels",
      "link": "https://www.allagnews.com/cotton-wholesalers-protect-demand-across-diverse-retail-channels/",
      "description": "LUBBOCK, TX &#8211; Cotton wholesalers help preserve broad-based demand by serving retail channels that would [...]",
      "date": "Fri, 30 Jan 2026 18:45:26 +0000",
      "timestamp": 1769798726000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- Cotton wholesalers serve independent stores, regional chains, uniform programs, and workwear accounts that lack the scale or capital to buy directly from factories. \n\n- Wholesalers break large production runs into smaller, manageable assortments and replenishment programs that keep these outlets viable.\n\n- Wholesalers also democratize access to compliance, traceability, and quality standards, raising overall market discipline while reducing the burden on individual retailers.\n\n- Without wholesalers, assortments would narrow, buying would become more conservative, and out-of-stocks would increase. This would reduce cotton's retail footprint and concentrate demand among fewer players, increasing vulnerability across the supply chain.\n\n- The article emphasizes that wholesale distribution helps sustain the diversity of cotton demand.",
      "summaryTimestamp": 1770516534354
    },
    {
      "id": "23ccfc5c7828ce8a",
      "title": "Plant Closures Cloud Outlook For Heifer Retention Decisions",
      "link": "https://www.allagnews.com/plant-closures-cloud-outlook-for-heifer-retention-decisions/",
      "description": "LUBBOCK, TX &#8211; Uncertainty around U.S. beef processing capacity is raising fresh questions about whether [...]",
      "date": "Fri, 30 Jan 2026 18:45:01 +0000",
      "timestamp": 1769798701000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Recent plant closures and production cuts by Tyson Foods at its Lexington, Nebraska and Amarillo, Texas beef plants have reduced U.S. beef processing capacity.\n\n- With less need for fed cattle, feedyards may be able to meet demand using existing cattle inventories, reducing the need to aggressively bid for feeder cattle.\n\n- USDA data shows heifer retention for herd rebuilding has not meaningfully started yet, with heifers on feed remaining flat through Q3.\n\n- Years of cow liquidation in both beef and dairy sectors have left an aging herd with limited replacement depth.\n\n- Analyst Don Close warns that further reductions in processing capacity could discourage herd expansion, leading to tighter supplies and slower industry recovery.\n\n- The uncertainty around processing capacity is raising questions about whether large-scale heifer retention is necessary as the industry looks to rebuild the cow herd.\n\n- The plant closures and production cuts by Tyson have altered the balance between fed cattle supply and slaughter capacity.\n\n- Shrinking slaughter capacity may delay heifer retention, complicating herd rebuilding plans for farmers.",
      "summaryTimestamp": 1770516537441
    },
    {
      "id": "cbeb49ad03254851",
      "title": "Record Milk Production Masks Shrinking Dairy Herd Pipeline",
      "link": "https://www.allagnews.com/record-milk-production-masks-shrinking-dairy-herd-pipeline/",
      "description": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "date": "Fri, 30 Jan 2026 18:15:20 +0000",
      "timestamp": 1769796920000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key Points:\n\n1. U.S. milk production is at record levels, but the dairy herd pipeline is shrinking. Milk cow inventories reached 9.57 million head in late 2025 - the highest since 1993. However, replacement heifer numbers fell to 3.91 million head - the lowest since 1978.\n\n2. Culling has remained low, keeping older cows in production longer and inflating short-term milk supplies. This has boosted output but weakened the biological pipeline needed to sustain production over time.\n\n3. A key driver is beef-on-dairy economics. Strong beef prices and premiums for beef-on-dairy calves have encouraged producers to shift breeding toward beef genetics, improving cash flow but reducing dairy-bred heifers entering the replacement pool.\n\n4. Expanding milk production globally has weighed on farm-level prices, though record butter and cheese exports have provided some relief. Milk pricing is no longer the primary signal guiding herd decisions.\n\n5. The concern is that with supply sustained by aging cows and a thinning replacement pipeline, future supply adjustments could be faster and more volatile when they occur.\n\nTakeaway for Farmers: Record milk output looks strong today, but shrinking replacement numbers mean future supply adjustments could be sharper than in past cycles.",
      "summaryTimestamp": 1770516540865
    },
    {
      "id": "6e08f08dc38beaf7",
      "title": "Grain Transportation Shows Mixed Signals Across Key Channels",
      "link": "https://www.allagnews.com/grain-transportation-shows-mixed-signals-across-key-channels/",
      "description": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "date": "Fri, 30 Jan 2026 18:00:09 +0000",
      "timestamp": 1769796009000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- U.S. Class I railroads originated 31,877 grain carloads during the week ending January 17, down 1% from the prior week but still 31% higher than a year ago and 26% above the three-year average.\n\n- Railcar availability tightened sharply, with February shuttle secondary bids averaging $750 per car above tariff - $200 higher than the previous week and nearly $600 above last year.\n\n- Barge traffic improved, with grain movements totaling 567,800 tons for the week ending January 24, up 27% from the previous week, though still 13% below last year. Downbound traffic increased, but unloads at the Gulf declined.\n\n- Ocean freight rates continued to firm, while diesel prices climbed to $3.624 per gallon, adding cost pressure.\n\nImpacts for Farmers:\n- Strong rail demand and higher fuel costs raise transportation risk even as barge and export flows stabilize.\n\nRecommendations:\n- Farmers should closely monitor transportation costs and availability, as logistical and cost pressures continue to impact the grain supply chain.",
      "summaryTimestamp": 1770516543945
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Points:\n\n1. Farm Journal and Hass Avocado Board are launching \"The Avocado Conference\", a first-of-its-kind international event for the U.S. avocado supply chain.\n\n2. The inaugural event is scheduled for November 18-20, 2026, at the Hilton San Diego Bayfront.\n\n3. The conference directly supports the Hass Avocado Board's (HAB) mission to strengthen the global avocado industry and make Hass avocados America's preferred healthy food.\n\n4. The conference aims to serve as a premier forum for collaboration, data-driven insights, supply-and-demand analysis, and strategic industry alignment among producers, exporters, importers, packers, retail and foodservice buyers, and other supply-chain partners.\n\n5. The program will cover global avocado production and trade, differentiated retail and foodservice market insights, consumer and shopper trends, evolving avocado marketing programs, economic and investment dynamics, and the Hass Avocado Board's efforts to expand avocado demand.\n\n6. Stakeholders attending the event will include growers, packers and shippers, importers and exporters, retail and foodservice buyers, input suppliers, logistics and packaging companies, storage and ripening professionals, financial and consulting services, and data and insights providers.\n\n7. The Hass Avocado Board is collaborating on the content development and will play a critical role in uniting the avocado industry for this event.",
      "summaryTimestamp": 1770516547839
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Iowa State University Pesticide Safety Education Program has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. The updated training manuals, including the Iowa Core Manual (CS445), are now available for purchase through the ISU Extension Store. New exams based on the revised core manual are available at all Iowa Department of Agriculture and Land Stewardship test sites. Additionally, the Private Pesticide Applicator Manual (CS1) now includes a two-page informational update, and all private exams now include content from this insert. Farmers can contact Betsy Danielson, the Pesticide Safety Education Extension Specialist, at betsydan@iastate.edu for more information.",
      "summaryTimestamp": 1770516550216
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The key points are:\n\n- Lead generation should be about delivering real value to farmers in exchange for their time and attention, not just capturing leads.\n- The call-to-action (CTA) and offer you choose shape how many leads are captured, and how qualified, motivated and purchase-ready those prospects are.\n- Shifting the mindset from what you want to collect to what farmers genuinely need is crucial for designing the right offer.\n\nThere are no specific numbers, prices, dates, or expert quotes provided in the article. The article is focused on a general marketing strategy recommendation for businesses targeting farmers.",
      "summaryTimestamp": 1770516552333
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Temperatures this week in Illinois were 4-8 degrees below normal, with lows reaching -5°F in Rockford and -2°F in Aurora. Strong winds led to wind chills near -20°F on some days.\n\n- Precipitation has been very low, with the first two-thirds of January being the 4th driest on record in Carbondale and 10th driest in Charleston, both receiving less than 0.5 inches.\n\n- The cold weather is expected to continue for at least another week, with most of northern Illinois likely staying below freezing for the rest of the month.\n\n- A strong winter storm is forecast to bring significant snowfall of 8-12 inches to areas south of Interstate 64 in Illinois this weekend, with 3-4 inches expected in central Illinois.\n\n- The WILL radio programs \"Commodity Week\" and \"Closing Market Report\" discussed the weather and market conditions with experts Chip Nellinger, Brian Stark, and Arlan Suderman.",
      "summaryTimestamp": 1770567964429
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Instead, the emphasis is now on building brand authority and trust through \"answer engine optimization\" (AEO) strategies.\n\nKey points:\n- Farmers are increasingly using AI-powered platforms like ChatGPT and Google's AI Overviews to find information, moving away from traditional search engines.\n- Ag marketers need to adapt their strategies to be present and credible in these new discovery channels, or they risk becoming invisible to their target audience.\n- At Farm Journal, the focus is on developing an \"answer-driven content strategy\" and amplifying trusted voices to improve discoverability across various platforms.\n- Discoverability is no longer just about winning the click; it's about winning citations, brand mentions, and establishing the brand as a trusted source, even in \"zero-click\" moments.\n\nThe article suggests that ag marketers need to reevaluate their 2026 strategies to align with these changes in how farmers discover and consume information.",
      "summaryTimestamp": 1770516554827
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Key points:\n\n- Forest farming, also known as multi-story cropping or agroforestry, refers to farming within treed land. It originated in Brazil's tropical rainforests.\n\n- Benefits include improved water and soil quality, increased carbon storage, and a diversity of specialty crops like mushrooms, syrups, and edible roots.\n\n- Ideal for farms with existing forest or riparian areas surrounded by trees. Doesn't require a large-scale operation - even small farms with some forest can benefit.\n\n- Before starting, inventory natural resources, manage invasive trees, and develop a forest management plan. Consult local ag extension and forestry agencies.\n\n- Consider market opportunities beyond farmer's markets and restaurants, like mail order, pick-your-own, and direct market associations.\n\n- Regulations around wild plants may apply, so check CITES guidelines.\n\n- Overall, forest farming can seamlessly integrate the farm into the landscape and diversify farm products in an ecologically beneficial way.",
      "summaryTimestamp": 1770516557701
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Daytime highs reached 69°F in Kaskaskia and 68°F in Carbondale. However, precipitation was light, with just 0.1-0.75 inches over the past 7 days. Most of the state has been 0.5-1 inch drier than normal so far this winter, with southern Illinois experiencing a top 5 driest winter on record.\n\nThis warm, dry weather will come to an end this weekend as much colder air moves in. Highs will struggle to reach 20°F in northern Illinois and above freezing in the south, with lows in the single digits on Monday. Little precipitation is expected, just light, intermittent snow. Colder than normal temperatures are forecast to continue through the first week of February.\n\nThe article also includes updates on WILL's Commodity Week and Closing Market Report radio programs, which feature market analysis from experts like Logan Kimmel, Jim McCormick, and Mike Zuzolo.",
      "summaryTimestamp": 1770567968041
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "Spray drones can provide flexibility, reduce field traffic, and improve access to difficult areas. However, adopting the technology requires careful consideration of regulations, training, insurance, and management practices.\n\nKey points:\n- Spray drones can be useful for applications when soils are wet, applying to tall crops, reducing compaction, and supplementing existing spraying capacity.\n- Regulatory requirements include an FAA Part 107 remote pilot certificate, FAA Part 137 certification for aerial pesticide application, and IDALS licensing. A 2-day Part 107 training workshop is scheduled for February 24-25, 2026 in Ames, IA.\n- Specialized insurance is required, including chemical liability, general liability, and hull/physical damage coverage. \n- Equipment selection factors include spray tank capacity, battery life, nozzle options, and GPS capabilities.\n- Proper training on safe operation, calibration, and weather monitoring is essential.\n- Farmers are encouraged to start with small acreage trials before full adoption.\n- Iowa State University, IDALS, and industry partners offer educational resources to support spray drone use.\n\nThe article recommends a gradual, cautious approach to adopting spray drone technology in Iowa, utilizing available educational and regulatory guidance.",
      "summaryTimestamp": 1770516561528
    },
    {
      "id": "75d0524dd80f4e3e",
      "title": "Double-crop Soybean Management Practices &#8211; Project Report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/double-crop-soybean-management-practices-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wheat acreage has been limited in recent decades. USDA-NASS survey estimates that 60-80% of Illinois wheat acres are double-cropped with soybeans. Implementing this system in central and northern Illinois has been constrained primarily by low wheat acreage and by later wheat harvest, which often delay",
      "date": "Tue, 13 Jan 2026 12:52:03 +0000",
      "timestamp": 1768308723000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/01/Table1_site-info.jpg",
      "summary": "Key Findings:\n\n1. Double-crop soybean yield averaged 55.7 bushels/acre in 2024 and 47.8 bushels/acre in 2025 in Piatt County, Illinois.\n\n2. Full-season soybean varieties (MG 3.6-3.8) yielded about 4% (2.1 bushels/acre) more than early-maturing varieties (MG 3.0-3.2), across seeding rates and fertility treatments.\n\n3. Yield response to seeding rate differed by soybean maturity group:\n   - Early-maturing varieties reached maximum yield (52.3 bu/acre) at about 252,000 seeds/acre.\n   - Full-season varieties reached maximum yield (53.4 bu/acre) at about 207,000 seeds/acre.\n\n4. Starter fertilizer (N+S) increased double-crop soybean yield by 1.4 bushels/acre (2.6%) in 2024, but had no impact in 2025 or on average.\n\n5. This research was supported by the Illinois Agricultural Experiment Station, Illinois Fertilizer & Chemical Association, and a local producer.\n\n6. The findings are considered preliminary, and similar trials across years and locations are ongoing to strengthen regional recommendations.",
      "summaryTimestamp": 1770567971816
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "Vegetables:\n- Cabbages (standard, Napa, and 'Carex' short-maturity varieties) - hardy Brassicas that can handle cold weather\n- Spinach - varieties like 'Avon' and 'Space' that resist mildew and bolting\n- Onions (long-day, short-day, and intermediate-day types) - take advantage of their long maturation period\n- Leafy greens like kale, collards, chard, watercress, and microgreens - highly nutritious and fast-growing\n\nFlowers:\n- Pansies - hardy, cold-loving flowers that make great cut flowers and bedding plants\n- Echinacea - important for integrated pest management, and needs cold stratification \n- Snapdragons - 4 groups to choose from based on climate, do well with winter sowing\n- Larkspur/Delphinium - provide rare true-blue color and attract pollinators\n- Scabiosa - attract beneficial insects and work well for fresh and dried arrangements\n\nThe winter sowing method involves starting seeds in protected containers outdoors, allowing the cold, moist conditions to help break seed dormancy. This results in hardier transplants that mature faster than direct sown seeds.",
      "summaryTimestamp": 1770516565139
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "However, there are several agri-environmental strategies farmers can employ to support biodiversity:\n\n1. Plant prairie strips - Devoting 10-25% of farmland to prairie strips can boost yields, improve soil nutrients, and attract beneficial predators and pollinators. The diverse plants and flowers support a healthy above and below-ground ecosystem.\n\n2. Reduce tilling and use cover crops - Minimizing tillage and planting cover crops instead improves soil structure and increases insect biodiversity. This supports more animal species on the land.\n\n3. Practice regenerative grazing - Using a rotational grazing model and planting native grasses/forbs instead of non-native forage can boost biodiversity in grazing areas, especially when combined with techniques like prescribed burning and silvopasture.\n\n4. Implement Integrated Pest Management (IPM) - Attracting beneficial insects through diverse plantings and cultural pest control methods reduces the need for harmful pesticides that damage biodiversity.\n\n5. Establish conservation easements - Partnering with land trusts to protect farmland can provide more habitat for local species while also offering tax benefits to landowners.\n\nAdopting these strategies, even partially, can help farmers work in harmony with the natural world around them, supporting species diversity and overall farm health. Experts emphasize that these practices, while sometimes requiring more effort upfront, ultimately lead to more sustainable and productive agricultural systems.",
      "summaryTimestamp": 1770516568909
    },
    {
      "id": "90145084b32c6f91",
      "title": "The New Superfood With Minimal Environmental Footprint",
      "link": "https://modernfarmer.com/2026/01/superfood-environmental-footprint/",
      "description": "In the future, farmers can diversify the output of their farms with Chlorella vulgaris, a freshwater alga gaining traction as a dietary supplement and superfood with a minimal environmental footprint, most notably in Japan, Taiwan, and Germany. The post The New Superfood With Minimal Environmental Footprint appeared first on Modern Farmer.",
      "date": "Mon, 05 Jan 2026 10:00:48 +0000",
      "timestamp": 1767607248000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Microscopic-Chlorella-vulgaris.webp",
      "summary": "Key Summary:\n\nChlorella vulgaris, a freshwater alga, is emerging as a new superfood with a small environmental footprint. It has applications across farming - as livestock feed, renewable energy, and protein-rich food source, especially in Japan.\n\nHowever, there are challenges in mass-producing this alga. Since the 1990s, scientists have been working to scale up production.\n\nChlorella vulgaris is a microalga that replicates easily in optimal conditions. It is autotrophic, using CO2 and inorganic nitrogen as a source for glucose. This makes it a sustainable solution for food security.\n\nThe alga is a rich source of nutrients and protein. It can also act as a bioremediant, absorbing heavy metals. Recent studies show it's a good candidate for renewable biofuel production.\n\nKey obstacles in scaling up production include lack of proposed cleanup methods, and difficulties in developing small-scale production methods (most current methods are large-scale).\n\nPotential solutions include using geothermal energy from natural hot springs to cultivate the alga at its ideal 77°F temperature. However, this can impact its nutrient content. Trials are also underway to explore other microalgae species with similar benefits.\n\nOverall, with further research and development, Chlorella vulgaris has high potential to become a widely-adopted superfood with minimal environmental impact.",
      "summaryTimestamp": 1770516572220
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series will be held at 12 locations across Iowa from January 6-29. The meetings will feature topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists. \n\nKey details:\n- Dates and locations: Jan 6 - Sioux Center, Jan 7 - Storm Lake, Jan 8 - Burlington, Jan 9 - Mason City, Jan 13 - Estherville, Jan 15 - Waterloo, Jan 16 - Davenport, Jan 21 - Ankeny, Jan 22 - Atlantic, Jan 27 - Iowa City, Jan 28 - Le Mars, Jan 29 - Carroll\n- Early-bird registration is $75 until the week before each meeting, late/on-site is $100\n- Registration includes refreshments, lunch, CCA credits, and access to resources\n- Private pesticide applicator recertification available for a $30 fee\n- Registration and more info at the Crop Advantage Series registration site\n- Contact crops@iastate.edu or your regional ISU Extension agronomist for questions\n\nThe goal is to provide farmers and crop professionals with the latest research-based information to help them make informed decisions for the upcoming growing season. Topics will include crop outlooks, nitrates, nutrient management, pests, transition planning, and precision agriculture.",
      "summaryTimestamp": 1770516575604
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The finalists are Alsum Farms (Friesland, Wisconsin), Dalton Farms (Wakeman, Ohio), and Splitter Farms (Sterling, Kansas). These outstanding producers are being recognized for their excellence, leadership, and innovation in modern agriculture. \n\nThe 2026 Top Producer Summit, agriculture's premier executive-level conference, will be held on February 9-11, 2026 in Nashville, Tennessee. At the event, the Top Producer of the Year winner and finalists will be formally recognized, along with the Next Generation Award winner, Tim Nuss (El Dorado Hills/Lodi, California), and the Women in Agriculture Award winner, Helle Ruddenklau (Amity, Oregon).\n\nAlsum Farms is a multigenerational family operation producing potatoes, pumpkins, hay, and other rotational crops across over 3,600 acres. Dalton Farms is a seventh-generation family farm with 2,000 acres of corn and soybeans, a 400-head cattle herd, and a growing on-farm market. Splitter Farms is a Kansas row-crop operation spanning 1,400 owned acres and 18,500 total farmed acres, led by Matt and Janna Splitter.\n\nThe 2026 Top Producer of the Year award is sponsored by BASF and Fendt. The Next Generation Award is sponsored by Pioneer and Fendt, and the Women in Agriculture Award is sponsored by Pro Farmer.",
      "summaryTimestamp": 1770516579294
    },
    {
      "id": "ce3ade9054dd723c",
      "title": "Still an opportunity to attend the ICM Conference!",
      "link": "https://crops.extension.iastate.edu/post/still-opportunity-attend-icm-conference",
      "description": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean field with Integrated Crop Management Conference overlayed on top. Learn more at go.iastate.edu/ICM\" width=\"408\" height=\"214\" class=\"align-left\" loading=\"lazy\"><p>This year we are offering on-site registration for the <a href=\"https://www.regcytes.extension.iastate.edu/icm/\">Integrated Crop Managem",
      "date": "Thu, 04 Dec 2025 08:22:25 -0600",
      "timestamp": 1764858145000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg",
      "summary": "The Integrated Crop Management (ICM) Conference is being held on December 10-11, 2025 at the Meadows Events and Conference Center in Altoona, Iowa. The conference offers:\n\n- 33 workshops covering topics like crops, pests, nutrient management, and conservation\n- Up to 14 continuing education credits for Certified Crop Advisers\n- Iowa Commercial Pesticide Applicator continuing instruction for 2025 in categories 1A, 1B, 1C, and 4 for an additional fee\n- Invited speakers covering the Endangered Species Act, timing of corn and soybean planting, and integrated pest management for corn leafhopper and corn stunt disease\n\nOn-site registration is available for the conference. The event is organized by Iowa State University Extension and Outreach, with Meaghan Anderson, a field agronomist serving central Iowa, as the content author.",
      "summaryTimestamp": 1770516582099
    },
    {
      "id": "6e56b2436e07fb98",
      "title": "Registration is now open for the 36th Integrated Crop Management Conference",
      "link": "https://crops.extension.iastate.edu/post/registration-now-open-36th-integrated-crop-management-conference",
      "description": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water management. The event features experts sharing research updates and practical recommendations. Don’t miss this key opportunity for networking and education!</p><p><strong>When: </strong>December 10 and 11, 2025</p><p><strong>Where: </strong>The Meadows Events Center in Altoona, Iowa</p><p><strong>Who",
      "date": "Mon, 27 Oct 2025 14:12:34 -0500",
      "timestamp": 1761592354000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The conference features 33 session topics and is open to anyone involved in crop production. Early-bird registration is $260 until November 16, after which regular registration is $310 until December 3. \n\nThe conference offers networking opportunities, education from expert speakers, and the chance for commercial pesticide applicators to earn recertification credits in categories 1A, 1B, 1C, and 4. Each day starts with a keynote speaker, followed by 5-6 breakout session options per hour. Attendees can customize their schedule and earn Certified Crop Adviser (CCA) credits.\n\nThe conference is organized by Iowa State University Extension and Outreach. The content authors are Erin Hodgson, a professor and extension entomologist, and Ashley Dean.",
      "summaryTimestamp": 1770516584882
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10, 2024, at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5, 2024.\n\nThe event will feature research on the value of sorghum as a forage crop, highlighting its drought tolerance, lower nitrogen requirements, and lack of a host relationship with the tar spot pathogen, compared to corn. \n\nSpeakers will include Mitch Tuinstra, the Wickersham Chair of Excellence in Agricultural Research and scientific director of the Institute for Plant Sciences at Purdue, who will share plant breeding techniques to improve sorghum yield and quality. Other speakers include Brad Shelton, FPAC superintendent; Jason Tower, Southern Indiana Purdue Agricultural Center superintendent; Nick Minton, Purdue Extension beef systems specialist; and Jeff Jackson, Croplan alfalfa and forage specialist.\n\nThe event will offer venue tours from 3-5 pm and 6-8 pm, and a dinner with a bull test station tour from 5-6 pm.\n\nThose interested in attending should register by September 5, 2024, and contact Brad Shelton at sheltonb@purdue.edu with any questions or accessibility needs.",
      "summaryTimestamp": 1770516590844
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Farmer sentiment improved in July 2024, with the Purdue/CME Group Ag Economy Barometer index rising 8 points to 113.\n\n- The Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations rose 7 points to 119.\n\n- This positive shift was attributed to fewer respondents reporting worsened conditions compared to a year ago and a decrease in those expecting negative future outcomes.\n\n- High input costs remained the biggest concern for 34% of farmers, while 29% cited the risk of lower crop and livestock prices, up from 25% in June.\n\n- The Farm Financial Performance Index dropped 4 points in July to 81, 6 points lower than in July 2023, reflecting farmers' worries about weakening commodity prices and high input costs.\n\n- The Farm Capital Investment Index rose 6 points in July to 38, though it remains 7 points lower than in July 2023.\n\n- The Short-Term Farmland Value Expectations Index rose to 118 from 115 in June, while the Long-Term Farmland Value Expectations Index dropped 6 points to 146.\n\n- 72% of crop farmer respondents expect cash rental rates to remain roughly the same as in 2024, with 15% anticipating a rise and 13% expecting a decline.",
      "summaryTimestamp": 1770516597884
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn:\n\n- Tar spot fungal disease has been endemic in Latin American countries since 1904 but was not detected in the U.S. prior to 2015. Since then, it has spread to 16 states and Ontario, Canada by 2022.\n\n- Purdue researchers, led by C.D. Cruz, are using a mix of statistical, data science, epidemiology, microbiology, AI, and computer vision methods to better understand the dynamics of tar spot in corn. Their work is funded by two USDA grants totaling nearly $1.1 million.\n\n- In previous efforts, the researchers developed a digital method (SCDA) to quantify tar spot in corn, which they tested against human raters. They are now refining the training methods to improve the model's accuracy.\n\n- The research team also includes Purdue's Mohammad Jahanshahi, who has adapted his AI and computer-vision approaches to inspecting and analyzing civil infrastructure damage for agriculture.\n\n- Graduate students Mariela Fernández-Campos and Abhishek Subedi are finalizing a proof-of-concept data fusion project, integrating drone imagery and weather data to capture details about the tar spot pathosystem.\n\n- Another parallel task is to quantify and model tar spot epidemics in production-style fields, using disease observations and drone-based imagery.\n\n- The interdisciplinary approach aims to quantify and model tar spot severity by referencing and integrating imagery with spatial and temporal data.",
      "summaryTimestamp": 1770516604168
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key events and details:\n- The Wool and Ewe Room and Ewe2 boutique will be open throughout the fair, offering wool products, clothing, jewelry, and more.\n- On August 2 at 10 a.m., there will be open wool judging and a wool sale in the Blue Ribbon Pavilion.\n- The Make It With Wool (MIWW) competition and fashion show will be held on August 4 at 2 p.m. in the Indiana Arts Building.\n- The Indiana State Fair Shearing Contest will take place on August 4 at 5 p.m. in the Ball State University Champions Pavilion.\n- From August 8-11, fairgoers can sample free Indiana lamb at the Taste from Indiana Farms event in the Indiana Farm Bureau Fall Creek Pavilion.\n- The annual Sheep to Shawl competition, where youth teams create a wool shawl from scratch, will be held on August 18 at 10 a.m. in the Indiana Arts Building.\n\nIn addition, sheep can be found in the Blue Ribbon Pavilion from August 4-20 for open and 4-H shows. The overall theme for ISA's participation is \"Art and Nature,\" featuring artwork by Indiana artists depicting sheep.\n\nThe Indiana Sheep Association was originally founded in 1876 as the Indiana Wool Growers Association. The IN S&W program collects 0.5% of the net market price of each sheep sold in Indiana to support educational, promotional, and research efforts involving sheep.",
      "summaryTimestamp": 1770516612430
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue Extension will have a presence at the fair, offering interactive demonstrations and activities at the Purdue Extension Building. Activities will include a Block Party for young children, a Book Party focusing on math skills, and the Captain Cash program to teach financial management. Visitors can also engage with Purdue Extension experts in fields like entomology, human health, forestry, and animal sciences.\n\nOn August 7, the Purdue Food Science Department will host an interactive exhibit called \"What's Growing on My Spinach?\" where fairgoers can plate bacteria from spinach leaves and observe microbial growth. They will also offer samples of \"Cricket Rice Krispies Treats\" and share information about alternative proteins and the use of insects as a food ingredient. The Food Entrepreneurship and Manufacturing Institute will distribute samples of Boilermaker Hot Sauce developed by Purdue students.\n\nSeed art displays will be featured in livestock barns and the Purdue Extension Building, visually representing the fair's theme and providing information about animal diets and nutrition. The Pioneer Village will also offer antique tractors, a farm toy show, a fiddler's contest, and other 1800s-themed activities sponsored by the Purdue Ag Alumni Association.\n\nPurdue Extension exhibits will be located throughout the fairgrounds, including the 4-H Exhibit Hall, 4-H Centennial Hall, and other pavilions. Purdue University is a public research institution ranked among the top 10 public universities in the United States, with a commitment to affordability and accessibility.",
      "summaryTimestamp": 1770516619482
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The new Potassium Cycle publication from the University of Wisconsin-Madison's Nutrient and Pest Management (NPM) program provides a visual overview of the potassium cycle in Wisconsin cropping systems. The two-page publication outlines key potassium concepts, including:\n\n- Potassium sources and sinks in the soil\n- Potassium uptake and removal by common Wisconsin crops\n- Factors affecting potassium availability and plant utilization\n- Recommended potassium application rates and timing for optimal crop production\n\nThe publication is designed to help Wisconsin farmers better understand the potassium cycle and make informed decisions about potassium management in their cropping systems. It is available for free download from the NPM program's website.",
      "summaryTimestamp": 1770516621617
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth ...",
      "summaryTimestamp": 1770516621818
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) fac...",
      "summaryTimestamp": 1770516621818
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadl...",
      "summaryTimestamp": 1770516621818
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Band...",
      "summaryTimestamp": 1770516621818
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 9,
  "updated": "2026-02-08T16:26:12.017Z"
}