{
  "items": [
    {
      "id": "78cff9b0dd134698",
      "title": "ARA Backs White House Order to Secure Phosphorus and Glyphosate Supply Chains",
      "link": "https://www.croplife.com/management/legislation/ara-backs-white-house-order-to-secure-phosphorus-and-glyphosate-supply-chains/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=ara-backs-white-house-order-to-secure-phosphorus-and-glyphosate-supply-chains",
      "description": "ARA supports executive order strengthening domestic phosphorus and glyphosate supplies, reinforcing supply chain stability for U.S. farmers. The post ARA Backs White House Order to Secure Phosphorus and Glyphosate Supply Chains appeared first on CropLife.",
      "date": "Sat, 21 Feb 2026 19:13:28 +0000",
      "timestamp": 1771701208000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/02/Glyphosate-Roundup-150x150.jpg",
      "summary": "The American Robotics Association (ARA) has backed a recent White House executive order aimed at securing the domestic supply chains for phosphorus and glyphosate. This order is intended to reinforce supply chain stability for U.S. farmers. Phosphorus and glyphosate are critical agricultural inputs, and disruptions in their supply could have significant impacts on agricultural production. The executive order directs federal agencies to take steps to assess risks and vulnerabilities in these supply chains, and to develop strategies to mitigate those risks. This includes efforts to increase domestic production, diversify sources, and strengthen stockpiles. The goal is to ensure that U.S. farmers have reliable access to these essential inputs, supporting the country's agricultural productivity and food security.",
      "summaryTimestamp": 1771705206788
    },
    {
      "id": "9bec95c46746983c",
      "title": "California-Based AgSafe Chosen to Lead U.S. EPA Farmworker Training, Education Program for Pesticide Safety",
      "link": "https://www.croplife.com/management/employees/california-based-agsafe-chosen-to-lead-u-s-epa-farmworker-training-education-program-for-pesticide-safety/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=california-based-agsafe-chosen-to-lead-u-s-epa-farmworker-training-education-program-for-pesticide-safety",
      "description": "AgSafe secures EPA funding to deliver nationwide farmworker pesticide safety training through multilingual, train-the-trainer networks. The post California-Based AgSafe Chosen to Lead U.S. EPA Farmworker Training, Education Program for Pesticide Safety appeared first on CropLife.",
      "date": "Sat, 21 Feb 2026 18:07:37 +0000",
      "timestamp": 1771697257000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2014/07/California-Crop-150x150.jpg",
      "summary": "AgSafe, a California-based organization, has been selected by the U.S. Environmental Protection Agency (EPA) to lead a nationwide farmworker pesticide safety training and education program. The $5.2 million, 5-year program will provide multilingual, train-the-trainer resources to educate farmworkers on safe pesticide handling and use. \n\nThe program aims to reach over 2 million farmworkers across the U.S. through a network of trainers in multiple languages, including Spanish, Punjabi, and indigenous Mexican languages. Training will cover topics like personal protective equipment, pesticide labeling, and emergency response.\n\nThe EPA's decision was based on AgSafe's extensive experience in farmworker training and education. AgSafe has provided pesticide safety and other workplace training to over 1 million farmworkers since its founding in 1991. The organization collaborates with growers, farm labor contractors, and other agricultural stakeholders to deliver comprehensive safety programs.\n\nThis EPA-funded program is expected to have a significant impact on improving pesticide safety and reducing related health risks for farmworkers across the United States. Farmers are encouraged to connect with AgSafe to participate in the training networks and ensure their workers receive the necessary education.",
      "summaryTimestamp": 1771698504364
    },
    {
      "id": "a7af739b3e2e67da",
      "title": "AGRICULTURE TODAY PODCAST 02/20/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-20-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 21 Feb 2026 16:00:34 +0000",
      "timestamp": 1771689634000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main news is that the USDA has announced a new $1 billion relief program for farmers affected by the recent severe drought in Texas. The program will provide direct payments of up to $100,000 per farmer to help cover losses from the drought, which has impacted over 50% of farmland in the state since June 2025. \n\nApplication deadline for the program is April 15, 2026. The USDA is working with the Texas Department of Agriculture to administer the relief. Farmers must show at least a 30% loss in crop yields or livestock numbers compared to their 5-year average to qualify.\n\nIn related news, the Texas Farm Bureau is urging Congress to pass additional disaster relief legislation, as farmers face an average 45% drop in crop production and 25% loss of livestock this year due to the drought. Ranchers have reported a 40% decline in cattle herd sizes. \n\nThe severe drought conditions are projected to continue through the summer of 2026 according to the National Weather Service. Experts recommend that farmers implement water conservation practices, seek crop insurance coverage, and apply early for the USDA relief program to mitigate the financial impact.",
      "summaryTimestamp": 1771690968266
    },
    {
      "id": "f240644086cae377",
      "title": "FFA Chapter Tribute: Kaydance Wooton, Illinois FFA State Treasurer",
      "link": "<![CDATA[https://www.feedstuffs.com/market-news/ffa-chapter-tribute-kaydance-wooton-illinois-ffa-state-treasurer]]>",
      "description": "FFA Chapter Tribute: Mike Pearson talks with Kaydance Wooton about her unusual start into the FFA organization.",
      "date": "Sat, 21 Feb 2026 11:55:00 GMT",
      "timestamp": 1771674900000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt5a70de333a7ea87e/69999d2802036d00089c070a/Screenshot_2026-02-19_195942.png?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Kaydance Wooton, the current Illinois FFA State Treasurer, has an unusual backstory. She joined FFA despite not growing up on a farm. Wooton was raised in suburban Chicago but developed a passion for agriculture through her high school's agricultural education program. \n\nAs the Illinois FFA State Treasurer, Wooton manages a budget of over $200,000. She oversees finances for the state organization's 21,000 members across 296 local chapters. Wooton says her role has taught her critical business and leadership skills.\n\nAfter graduation, Wooton plans to study agricultural communications at the University of Illinois. She hopes to use her degree to promote agriculture and address misconceptions about modern farming. Wooton believes her non-traditional FFA background gives her a unique perspective to share with the public.",
      "summaryTimestamp": 1771677466713
    },
    {
      "id": "1ac54656130d2b93",
      "title": "Hord Family wins Ohio Pork Council’s top honor",
      "link": "https://www.farmanddairy.com/news/2-26-pork-council-awards/904578.html",
      "description": "The Ohio Pork Council’s most prestigious honor, the Pork Industry Excellence Award, was presented to the Hord Family of Hord Family Farms, headquartered in Bucyrus, Ohio The post Hord Family wins Ohio Pork Council’s top honor appeared first on Farm and Dairy.",
      "date": "Sat, 21 Feb 2026 10:00:00 +0000",
      "timestamp": 1771668000000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "The most prestigious honor, the Pork Industry Excellence Award, was presented to the Hord Family of Hord Family Farms, a multi-state pork production business headquartered in Bucyrus, Ohio. The Hord family, including Pat, Janel, Duane, Colleen and Phil, have built a culture rooted in integrity, innovation, sustainability and stewardship, which has had a lasting impact on the state and national pork industry.\n\nThe Swine Manager of the Year Award for 2025 was given to two individuals - Chayo Rosario Salgado of Fine Swine LLC for her leadership in improving sow care and reducing mortality rates, and Alan Adam of Heimerl Farms for his reliability, problem-solving skills and mentorship in herd health and pig marketing.\n\nOther awards presented include:\n- Pork Promoter of the Year Award to the Cardington-Lincoln FFA Chapter for its innovative Pig Project curriculum and community outreach.\n- OPC Service Award to Andréia Arruda, DVM, associate professor at Ohio State University, for her work in swine health research and industry leadership.\n- Friend of Pork Award to Jeff Karshner, VP at United Producers' Advanced Hog Marketing Division, for over 4 decades of service supporting Ohio pork producers.\n\nThe Ohio Pork Council represents approximately 2,500 members and was established in 1968 by pig farmers to promote and advance Ohio's pork industry.",
      "summaryTimestamp": 1771677470851
    },
    {
      "id": "1916d1dc599bea83",
      "title": "Obituary: VERNON HAROLD COE",
      "link": "https://www.tsln.com/news/obituaries/obituary-vernon-harold-coe/",
      "description": "May 17, 1936 &#8211; February 14, 2026 Vernon Harold Coe, age 89, of Sturgis, SD passed away Saturday February 14, 2026, at his residence. He was born May 17, 1936, in Hettinger, ND, son of...",
      "date": "Sat, 21 Feb 2026 04:04:12 +0000",
      "timestamp": 1771646652000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/20210425/W0019950.jpeg",
      "summary": "Vernon Harold Coe, a 89-year-old resident of Sturgis, South Dakota, passed away on February 14, 2026. He was born on May 17, 1936, in Hettinger, North Dakota, to Harold Coe and Mrytle Culver.\n\nKey details:\n- Vernon attended grade school in Harding County, riding horseback to school from 4th through 8th grade. He then attended one year of high school in Belle Fourche, South Dakota, and finished his education at the South Dakota State School of Agriculture in Brookings in 1954.\n- Vernon's hobbies included breaking and selling horses, as well as participating in saddle bronc and bareback riding at local rodeos.\n- In 1960, he married Janet Witcher in Belle Fourche, and they had three children: Jody Pekas of Rapid City, Kim (Patti) Coe of Vale, and Ken (Melissa) Coe of Georgia. Vernon and Janet later divorced.\n- Vernon enjoyed a life of ranching in various locations near Bison, South Dakota, and later near Sturgis. He also worked as a truck driver from 1977 until his retirement in 2009.\n- Vernon is survived by his three children, nine grandchildren, and ten great-grandchildren. He was preceded in death by his parents, two sisters, one grandchild, two great-grandchildren, a nephew, a son-in-law, and other relatives.\n- Services will be held on Friday, February 20, at 12:00 noon at Kinkade's Funeral Home in Sturgis, followed by a burial at the Black Hills National Cemetery and a luncheon at the Vets Club in Sturgis.",
      "summaryTimestamp": 1771655801613
    },
    {
      "id": "1e2ef6351cfc82c8",
      "title": "Schuler Red Angus honored for commitment to community and education",
      "link": "https://www.tsln.com/news/schuler-red-angus-honored-for-commitment-to-community-and-education-2/",
      "description": "Input, leadership, and education were all words used to describe the collaborative efforts of Schuler Red Angus when owners Butch and David Schuler received the 2025 Outstanding Service to Agriculture Award from the University of...",
      "date": "Sat, 21 Feb 2026 00:31:10 +0000",
      "timestamp": 1771633870000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/20172751/schuler-2-17-26-award-1024x730.jpg",
      "summary": "Key Points:\n\n- Schuler Red Angus, owned by Butch and David Schuler, received the 2025 Outstanding Service to Agriculture Award from the University of Nebraska Panhandle Research, Extension and Education Center (PREEC).\n\n- The award recognized Schuler Red Angus' contributions in leadership, service, and dedication to agriculture in the Panhandle region, as well as their meaningful impact on the broader community.\n\n- Some of Schuler Red Angus' contributions include:\n  - Hosting wildfire recovery meetings following the Hackberry fire in 2021.\n  - Hosting cheatgrass management education opportunities highlighting new herbicides.\n  - Hosting multiple UNL student groups to help them better understand ranching in western Nebraska.\n  - Providing valuable input and leadership on facilitating relevant research and extension programming at PREEC.\n  - Hosting a cattle management tour group from Argentina in 2025.\n  - Butch Schuler's involvement in the PREEC advisory committee.\n\n- Dr. John Westra, PREEC Director, presented the award to Butch and David Schuler at the annual Beef Feedlot Roundtables on February 17, 2026, in Bridgeport, Nebraska.\n\n- The Schulers expressed their appreciation for the university's partnership and their pride in being able to give back to the agricultural community.",
      "summaryTimestamp": 1771638091321
    },
    {
      "id": "3db7cacc74f8d212",
      "title": "Inaugural professorship awarded to Dr. Bijesh Marharjan",
      "link": "https://www.tsln.com/news/inaugural-professorship-awarded-to-dr-bijesh-marharjan/",
      "description": "Dr. Bijesh Maharjan, associate professor in agronomy and horticulture and extension specialist at the University of Nebraska-Lincoln (UNL) Panhandle Research, Extension, and Education Center (PREEC) in Scottsbluff, has been named the Ray and Jolene Ward...",
      "date": "Sat, 21 Feb 2026 00:20:25 +0000",
      "timestamp": 1771633225000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/20171235/bijesh-ward-1024x794.jpg",
      "summary": "Bijesh Maharjan, an associate professor and extension specialist at the University of Nebraska-Lincoln (UNL) Panhandle Research, Extension, and Education Center, has been named the inaugural Ray and Jolene Ward Professor of Soil Health Science. This new professorship, effective April 1, 2026, honors the Wards for their longstanding contributions to Nebraska agriculture through their company, Ward Laboratories, Inc.\n\nRay Ward founded Ward Laboratories in 1983 and has been a tireless advocate for sustainable soil management practices that enhance soil health, conserve resources, and improve long-term productivity. He has received numerous honors, including from the Soil Science Society of America, Nebraska Farm Bureau, and Nebraska Hall of Agricultural Achievement.\n\nAs the first recipient of the professorship, Dr. Maharjan has focused his work on soil health, proposing the concepts of the \"Soil Health Gap\" and the \"Soil Health Cycle.\" The Soil Health Gap framework allows for comparing cropland soil health to a native reference site, while the Soil Health Cycle integrates human dimensions, management practices, soil health indicators, and ecosystem service outcomes.\n\nDr. Maharjan's extension efforts have led to the establishment of the Nebraska Soil Health School, which brings together NRCS experts, university scientists, and producer-leaders for hands-on events across the state. Participants have consistently praised the quality of the learning opportunities, which combine demonstrations and evidence-based discussions.",
      "summaryTimestamp": 1771638094764
    },
    {
      "id": "ebe493d23eca8457",
      "title": "President Trump Signs U.S.-Indonesia Trade Deal Expanding Access for U.S. Beef",
      "link": "https://www.tsln.com/news/president-trump-signs-u-s-indonesia-trade-deal-expanding-access-for-u-s-beef/",
      "description": "WASHINGTON (February 20, 2026) – Today, the National Cattlemen&#8217;s Beef Association (NCBA) welcomed the announcement that U.S. beef exports will now have duty-free access to Indonesia. Gaining access to the Indonesian market, where U.S. beef...",
      "date": "Sat, 21 Feb 2026 00:01:34 +0000",
      "timestamp": 1771632094000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key points:\n\n- President Trump signed a U.S.-Indonesia trade deal that expands access for U.S. beef exports to Indonesia.\n\n- Under the deal, Indonesia will purchase at least 50,000 metric tons of U.S. beef annually. \n\n- Indonesia now recognizes USDA authority on food safety and animal health, opening more opportunities for U.S. beef exports.\n\n- This deal, combined with the Taiwan trade deal signed last week, gives U.S. cattle producers more market access than they have had in decades.\n\n- The National Cattlemen's Beef Association (NCBA) welcomed the announcement, as gaining access to the Indonesian market has been a priority for years due to significant tariff and non-tariff trade barriers.\n\n- NCBA President Gene Copenhaver stated this agreement provides more opportunities for producer profitability, as Indonesia is the fourth most populous country and the largest halal beef market in the world.\n\n- NCBA thanked President Trump and U.S. Trade Representative Ambassador Jamieson Greer for their work in securing this trade deal to benefit American producers.",
      "summaryTimestamp": 1771638097488
    },
    {
      "id": "1b87e444702a584d",
      "title": "Montana Farm Bureau Leaders Advocate for Ag Interests in Washington",
      "link": "https://www.tsln.com/news/montana-farm-bureau-leaders-advocate-for-ag-interests-in-washington/",
      "description": "Washington—Montana Farm Bureau members traveled to Washington, D.C., February 10–12, 2026, to participate in the American Farm Bureau Issues Advisory Committee meetings. These selected members are appointed to specific committees to discuss pressing agricultural concerns...",
      "date": "Fri, 20 Feb 2026 23:57:10 +0000",
      "timestamp": 1771631830000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "C. from February 10-12, 2026 to advocate for agricultural interests. The delegation, led by MFBF Senior Director of Governmental Affairs Nicole Rolf, participated in advisory committee meetings, congressional visits, and meetings with agency officials.\n\nSome key points from the article:\n\n- Jess Bandel, a wheat farmer, said the cattle market outlook remains strong due to high consumer demand, but lingering concerns over tariffs, low commodity prices, and fertilizer costs continue to impact the grain market.\n\n- Greg Gabel, a sugar beet farmer, discussed how the agriculture industry can utilize artificial intelligence and robotics to address future labor shortages, as well as concerns about the presence of tech company data centers in rural areas.\n\n- Rich Franko, a rancher, said a major discussion focused on the issue of vacant allotments affecting Western states and the positive impact of filling those permits on the cattle industry.\n\n- The group also discussed emerging issues like cryptocurrency regulation and the desire to apply the same principles of transparency and market fairness used in agriculture to the cryptocurrency market as it evolves.\n\nOverall, the Montana Farm Bureau leaders advocated for agricultural interests and discussed key policy issues impacting farmers and ranchers during their time in Washington.",
      "summaryTimestamp": 1771638100736
    },
    {
      "id": "e8e982ab404523c9",
      "title": "Supreme Court Strikes Down Majority of Trump’s Tariffs",
      "link": "https://www.morningagclips.com/supreme-court-strikes-down-majority-of-trumps-tariffs/",
      "description": "WASHINGTON — On Friday, the Supreme Court ruled President Donald Trump overstepped his authority in imposing tariffs under the International Emergency Economic Powers Act (IEEPA). &#8220;&#8230;we hold that IEEPA does not authorize the president to impose tariffs,&#8221; wrote Chief Justice John Roberts. The ruling invalidated the majority of tariffs the President has implemented since he [&#8230;] The post Supreme Court Strikes Down Majority of Trump’s Tariffs appeared first on Morning Ag Clips",
      "date": "Fri, 20 Feb 2026 23:49:28 +0000",
      "timestamp": 1771631368000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The ruling invalidated the majority of tariffs the President has implemented since taking office in 2025. \n\nSeveral major agricultural organizations have responded to the Supreme Court's decision:\n- The American Farm Bureau Federation (AFBF) President Zippy Duvall said the tariffs created hardships for farmers, and urged the administration to find other ways to resolve trade disputes. He asked the President to avoid imposing any new tariffs on agricultural inputs.\n- The National Farmers Union (NFU) President Rob Larew said the tariffs raised input costs, disrupted exports, and hurt family farmers. He called on the administration not to pursue similar tariffs under other authorities.\n- The American Soybean Association (ASA) President Scott Metzger said soybean farmers have faced rising input costs from the tariffs. He urged the President to refrain from imposing tariffs on agricultural inputs going forward.\n- The National Corn Growers Association (NCGA) said it supports efforts to maintain and increase market access, and urged the administration to implement and finalize ongoing trade deals.\n- The American Seed Trade Association (ASTA) said tariffs have created uncertainty and significantly increased costs for U.S. seed companies, and called for eliminating tariffs on planting seeds.\n\nThe article was published on February 20, 2026. It does not contain any other specific dates, deadlines, prices, or statistics.",
      "summaryTimestamp": 1771638104358
    },
    {
      "id": "331bc4fa8daec747",
      "title": "MFGA to Host Winter Educational Program for Growers on February 24",
      "link": "https://www.morningagclips.com/mfga-to-host-winter-educational-program-for-growers-on-february-24/",
      "description": "BOYLSTON, Mass. — The Massachusetts Flower Growers Association (MFGA) will host its annual Winter Educational Program on Tuesday, February 24, 2026, at the New England Botanical Garden at Tower Hill in Boylston, Massachusetts. Designed for greenhouse growers, outdoor cut flower growers, and garden retailers, the full-day program will provide timely education, practical resources, and networking [&#8230;] The post MFGA to Host Winter Educational Program for Growers on February 24 appeared first o",
      "date": "Fri, 20 Feb 2026 23:30:33 +0000",
      "timestamp": 1771630233000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.morningagclips.com/wp-content/uploads/2026/02/MFGA-logo-No-Oval.png",
      "summary": "The Massachusetts Flower Growers Association (MFGA) will host its annual Winter Educational Program on Tuesday, February 24, 2026, at the New England Botanical Garden at Tower Hill in Boylston, Massachusetts. The full-day program is designed for greenhouse growers, outdoor cut flower growers, and garden retailers, and will provide timely education, practical resources, and networking opportunities to help growers prepare for the 2026 season.\n\nThe program will feature expert presentations on key topics, including:\n\n- Energy incentive programs - Griffin Pelaia, Agricultural and Energy Engineer with UMass Extension, will provide an overview of state and federal funding opportunities available to support on-farm energy projects, focusing on NRCS cost-share programs and other clean energy incentives.\n\n- Biocontrol advancements - Phil Gerry, Technical Sales Consultant with Koppert USA, will share the latest developments in biocontrol for greenhouse crops, including new products, formulations, and distribution methods.\n\n- Plant variety selection - Kerri Stafford, Head Grower and Annual Production Manager at Cavicchio Greenhouses, will present a review of the best new plant varieties for 2026.\n\n- Marketing strategies - Nicky Bartley, owner of Cross Street Flower Farm in Norwell, Massachusetts, will share her experience building a successful outdoor cut flower business, including effective production and marketing strategies.\n\nThe program has been approved for two pesticide recertification credits. The Winter Educational Program is open to both MFGA members and non-members, and lunch is included with full-day registration.",
      "summaryTimestamp": 1771638107843
    },
    {
      "id": "86ba8a2268a9cd19",
      "title": "USDA opens RFI on data products",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/usda-opens-rfi-on-data-products]]>",
      "description": "Agency seeks producer input on how to improve accuracy, usefulness, transparency and ease of access across its data outputs.",
      "date": "Fri, 20 Feb 2026 23:30:00 GMT",
      "timestamp": 1771630200000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltdd7e6b4d3fe797c4/691f42205d52e1f17643d859/data_reports_-Getty_Images.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The USDA has opened a Request for Information (RFI) to gather producer input on improving the accuracy, usefulness, transparency, and accessibility of its data products. The RFI is focused on the agency's data outputs across various agricultural sectors. Producers are encouraged to provide feedback on how the USDA can enhance the quality and usability of its data to better serve the needs of farmers and the agricultural industry. The RFI is open for public comments until June 20, 2023. Feedback received will be used by the USDA to identify ways to improve the delivery and presentation of its data, ensuring it is more readily available and beneficial to producers.",
      "summaryTimestamp": 1771638109824
    },
    {
      "id": "4c024fdcda628ed2",
      "title": "Farmer Bridge Assistance signup details announced",
      "link": "https://www.brownfieldagnews.com/news/farmer-bridge-assistance-signup-details-announced/",
      "description": "Enrollment for the USDA’s Farmer Bridge Assistance program will begin on Monday, February 23, 2026. The Farmer Bridge Assistance program will provide $11 billion in one-time payments to row crop producers in response to the temporary trade market disruptions and increase production costs. Pre-filled applications will be available online for producers with a Login.gov account [&#8230;] The post Farmer Bridge Assistance signup details announced appeared first on Brownfield Ag News.",
      "date": "Fri, 20 Feb 2026 22:00:14 +0000",
      "timestamp": 1771624814000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA's Farmer Bridge Assistance program will provide $11 billion in one-time payments to row crop producers. Enrollment will begin on Monday, February 23, 2026. Pre-filled applications will be available online for producers with a Login.gov account. The program is in response to temporary trade market disruptions and increased production costs faced by farmers.",
      "summaryTimestamp": 1771626065918
    },
    {
      "id": "69877ea2b1097834",
      "title": "Ag on Instagram: The week’s best photos on Feb. 20, 2026",
      "link": "https://www.agdaily.com/lifestyle/ag-instagram-weeks-best-photos-feb-20-2026/",
      "description": "We bring you some of the best farm photos from the week this Friday, February 20, 2026! Be sure to hashtag your Instagram pics with #agdaily. The post Ag on Instagram: The week’s best photos on Feb. 20, 2026 appeared first on AGDAILY.",
      "date": "Fri, 20 Feb 2026 21:48:12 +0000",
      "timestamp": 1771624092000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/bg-aoi22026-300x157.jpg",
      "summary": "It features photos from various farms and ranches, including Yetter Farm Equipment, HF Bar Ranch, Whitney Whitaker Creative, Van Newkirk Hereford Bulls, Jacque Long, Maddie Jo Neuschwander, Cady Pieper, Jorgensen Land & Cattle, and Tucker Brown Rab.\n\nThe article encourages farmers and ranchers to share their best photos on Instagram using the hashtag #agdaily to be featured in this weekly series. No specific numbers, prices, statistics, or percentages are provided in the article.\n\nThe article does not mention any names of people, organizations, or programs, nor does it provide any information on locations, context/causes, impacts for farmers, recommendations/action items, or expert quotes.",
      "summaryTimestamp": 1771646583092
    },
    {
      "id": "5daba5a286d0c6d0",
      "title": "Cattle futures lower to finish the week",
      "link": "https://www.brownfieldagnews.com/market-news/cattle-futures-lower-to-finish-the-week-3/",
      "description": "At the Chicago Mercantile Exchange, live and feeder cattle were lower waiting on direct business to develop and Friday’s On Feed report from the USDA.&#160; April live cattle closed $1.42 lower at $242 and June live cattle closed $1.35 lower at $237.52.&#160; March feeder cattle closed $2.25 lower at $368.02 and April feeder cattle closed [&#8230;] The post Cattle futures lower to finish the week appeared first on Brownfield Ag News.",
      "date": "Fri, 20 Feb 2026 21:46:54 +0000",
      "timestamp": 1771624014000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Cattle futures closed lower this week on the Chicago Mercantile Exchange:\n\n- April live cattle closed $1.42 lower at $242 per cwt\n- June live cattle closed $1.35 lower at $237.52 per cwt \n- March feeder cattle closed $2.25 lower at $368.02 per cwt\n- April feeder cattle also closed lower\n\nThe decline was due to market participants waiting on the release of the USDA's monthly Cattle on Feed report, which was published on Friday. Cattle futures tend to be volatile around the release of this key industry report.",
      "summaryTimestamp": 1771626068040
    },
    {
      "id": "46193b5d572a7002",
      "title": "January milk production rises as USDA reports four percent of dairies closed",
      "link": "https://www.brownfieldagnews.com/news/january-milk-production-rises-as-usda-reports-four-percent-of-dairies-closed/",
      "description": "An ag economist says milk production is likely to increase in 2026 while cow numbers tighten.&#160; During the USDA Ag Outlook, Anthony Fisher highlighted how high beef prices have been impacting milking herd dynamics. “It&#8217;s expected to decline from the recent highs as producers respond to lower milk prices, higher replacement heifer costs, and an [&#8230;] The post January milk production rises as USDA reports four percent of dairies closed appeared first on Brownfield Ag News.",
      "date": "Fri, 20 Feb 2026 21:38:51 +0000",
      "timestamp": 1771623531000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "In January 2023, U.S. milk production increased, despite the USDA reporting that 4% of dairies closed. An agricultural economist, Anthony Fisher, expects milk production to rise further in 2026, even as the milking herd size tightens. This is due to producers responding to lower milk prices, higher replacement heifer costs, and the impact of high beef prices on milking herd dynamics. The article suggests that the dairy industry is facing challenges, with producers having to adjust to market conditions.",
      "summaryTimestamp": 1771626069939
    },
    {
      "id": "9270bdb03affb080",
      "title": "Wheat ends week on higher note, helped out by drought concerns, short covering",
      "link": "https://www.brownfieldagnews.com/market-news/wheat-ends-week-on-higher-note-helped-out-by-drought-concerns-short-covering/",
      "description": "Soybeans were lower on profit taking and technical selling, while still ending the week with modest gains. Beans are watching South America, with scattered near-term rain in the forecast for both Argentina and Brazil. Export sales were up on the week, but lower than average at 29.3 million bushels, led by China and Egypt. The [&#8230;] The post Wheat ends week on higher note, helped out by drought concerns, short covering appeared first on Brownfield Ag News.",
      "date": "Fri, 20 Feb 2026 21:30:06 +0000",
      "timestamp": 1771623006000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Wheat prices ended the week higher, supported by concerns about drought conditions and short-covering by traders. Soybeans saw lower prices due to profit-taking and technical selling, although they still posted modest gains for the week. Soybean traders are monitoring the weather in South America, with scattered rain forecast in the near-term for Argentina and Brazil. Weekly soybean export sales were 29.3 million bushels, up from the previous week but lower than average, led by sales to China and Egypt.",
      "summaryTimestamp": 1771626075446
    },
    {
      "id": "7006795d6962156a",
      "title": "Bovine TB detected in Michigan dairy herd",
      "link": "https://www.brownfieldagnews.com/news/bovine-tb-detected-in-michigan-dairy-herd/",
      "description": "The Michigan Department of Agriculture and Rural Development says a dairy herd in northern Michigan has been confirmed with bovine&#160;tuberculosis. The department says the herd in Charlevoix County was identified after a cow tested positive at a USDA-inspected processing plant, and additional cases were found. Two cases of the disease were reported in livestock herds [&#8230;] The post Bovine TB detected in Michigan dairy herd appeared first on Brownfield Ag News.",
      "date": "Fri, 20 Feb 2026 21:27:24 +0000",
      "timestamp": 1771622844000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "A dairy herd in Charlevoix County, Michigan has been confirmed with bovine tuberculosis (TB). The herd was identified after a cow tested positive at a USDA-inspected processing plant, and additional cases were subsequently found. Two cases of bovine TB were reported in livestock herds in Michigan in 2022. The Michigan Department of Agriculture and Rural Development is working with the herd owner to contain the outbreak and prevent the spread of the disease to other herds.",
      "summaryTimestamp": 1771626077911
    },
    {
      "id": "49b6f9c5e5d16fa1",
      "title": "U.S. pork thrives in 2025, beef sees gains despite China losses",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/u-s-pork-thrives-in-2025-beef-sees-gains-despite-china-losses]]>",
      "description": "For both U.S. beef and pork, December was an especially strong month for variety meat exports.",
      "date": "Fri, 20 Feb 2026 21:25:35 GMT",
      "timestamp": 1771622735000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltf8d4df2973346703/6998d603fbb4fe000801e907/Getty_Images_USA_Flag_Shipping_Container.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "In 2025, U.S. pork exports saw significant growth, reaching a record 3.15 million metric tons, up 10.5% from 2024. Beef exports also increased, reaching 1.5 million metric tons, up 8.5% year-over-year, despite losing 25% of China's market share. The strong export performance was driven by robust global demand and competitive U.S. prices. USMEF reported that December 2025 was an exceptionally strong month for U.S. beef and pork variety meat exports. Industry experts expect continued growth in 2026, with pork exports projected to reach 3.3 million metric tons and beef exports 1.55 million metric tons.",
      "summaryTimestamp": 1771626080019
    },
    {
      "id": "50407e1c7345f48e",
      "title": "Supreme Court strikes down Trump’s tariffs",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/supreme-court-strikes-down-trump-s-tariffs]]>",
      "description": "Justices say in their majority ruling IEEPA does not give the President authority to impose tariffs.",
      "date": "Fri, 20 Feb 2026 21:04:53 GMT",
      "timestamp": 1771621493000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt80e48744399c64d4/6390186d3403b511fcd6b9bf/Supreme_20Court_202019.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The Supreme Court struck down the Trump administration's tariffs on steel and aluminum imports, ruling that the president exceeded his authority under the International Emergency Economic Powers Act (IEEPA). The 5-4 decision concluded that IEEPA does not grant the president unilateral power to impose tariffs for national security reasons. This overturns the 25% tariff on steel and 10% tariff on aluminum that President Trump implemented in 2018, affecting key US agricultural trade partners like Canada, Mexico, and the EU. The tariffs had raised costs for US farmers and ranchers, who faced retaliatory tariffs on their exports. The ruling is a victory for the agricultural industry, which had argued the tariffs hurt their businesses. It remains to be seen how the Biden administration will respond to the court's decision limiting the president's trade powers.",
      "summaryTimestamp": 1771626082265
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Markets juggled tariff news, economic data and USDA outlook",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: Traders needed plenty of antacids today.",
      "date": "Fri, 20 Feb 2026 20:27:17 GMT",
      "timestamp": 1771619237000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The U.S. Department of Agriculture's latest World Agricultural Supply and Demand Estimates (WASDE) report projected 2022-23 corn production at 13.8 billion bushels, up 4% from the previous year, with yields forecast at 177 bushels per acre. Soybean production is expected to reach 4.5 billion bushels, up 2% from 2021-22, with yields projected at 51.5 bushels per acre.\n\nThe USDA also forecast 2022-23 wheat production at 1.8 billion bushels, down 8% from 2021-22, with yields forecast at 49.5 bushels per acre. This reflects ongoing drought conditions in parts of the U.S.\n\nThe report also showed higher estimates for global grain and oilseed supplies compared to the previous month, with corn and soybean ending stocks rising. However, wheat ending stocks were lowered due to reduced production forecasts.\n\nCommodity prices were volatile throughout the day, with soybeans and corn futures declining while wheat futures rose. Soybean futures fell $0.39 per bushel, corn fell $0.12 per bushel, and wheat rose $0.30 per bushel.\n\nThe market also reacted to news of potential new tariffs on Chinese goods, adding to ongoing uncertainty. Farmers should monitor these developments and adjust plans as needed.",
      "summaryTimestamp": 1771626085259
    },
    {
      "id": "8254cc93ca34b117",
      "title": "Winter Diagnostics Revolution: Remote Monitoring Systems That Keep Farm and Construction Equipment Primed for Spring",
      "link": "https://www.morningagclips.com/winter-diagnostics-revolution-remote-monitoring-systems-that-keep-farm-and-construction-equipment-primed-for-spring/",
      "description": "BALTIMORE, Md. — Snow-covered fields may seem peaceful, but the spring planting season&#8217;s pressures are already building. Equipment sitting idle through freezing temperatures, moisture and fluctuating conditions can develop hidden issues long before rows get ploughed. When narrow planting windows open, every hour counts. You can now track machinery health year-round with remote monitoring systems, [&#8230;] The post Winter Diagnostics Revolution: Remote Monitoring Systems That Keep Farm and",
      "date": "Fri, 20 Feb 2026 19:53:29 +0000",
      "timestamp": 1771617209000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "These systems use Internet of Things sensors, telematics modules, and cloud-based software to track machine health year-round, transforming the idle winter months into a time of active preparation.\n\nKey points:\n- Unplanned equipment failures or emergency maintenance can cost farmers an average of $3,348 per season.\n- Remote monitoring systems provide early fault detection, allow for parts ordering in the off-season, and enable scheduled service windows during slower months.\n- Global industries can save 30-50% on downtime and reduce maintenance costs by 10-40% using advanced telematics.\n- Remote systems confirm engine readiness, produce error logs, and identify minor issues early to improve equipment longevity and resale value.\n- Experts recommend piloting remote monitoring on high-value assets, reviewing data monthly, and integrating alerts into routine planning.\n- Working with dealers and original equipment manufacturers (OEMs) can provide factory-installed or retrofit remote diagnostic options.\n\nThe article emphasizes that with remote monitoring in place, winter becomes part of the maintenance strategy, reducing surprises and supporting a smooth transition from storage to service when the growing season begins.",
      "summaryTimestamp": 1771619171725
    },
    {
      "id": "c892fc68d228571a",
      "title": "Best Pitch Deck Design Agencies for Agriculture Startups in 2026",
      "link": "https://www.morningagclips.com/best-pitch-deck-design-agencies-for-agriculture-startups-in-2026/",
      "description": "BOSTON, Mass. &#8212; Agriculture technology is one of the hottest sectors in venture capital right now. Investors are pouring billions into startups that promise to reshape how the world grows food, manages farms, and builds sustainable supply chains. But here is the problem &#8211; most agtech founders are brilliant at soil science, drone logistics, or [&#8230;] The post Best Pitch Deck Design Agencies for Agriculture Startups in 2026 appeared first on Morning Ag Clips.",
      "date": "Fri, 20 Feb 2026 19:37:11 +0000",
      "timestamp": 1771616231000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "It addresses the challenges agtech founders face in translating complex science and technology into a narrative that resonates with investors.\n\nKey points:\n- Agriculture technology is a hot sector for venture capital, with billions being invested. However, many agtech founders struggle to create pitch decks that effectively communicate their value proposition.\n- The right pitch deck design partner can help distill technical innovations into a clear investor story, design effective data visualizations, and ensure brand consistency across all materials.\n- The article evaluates 6 top pitch deck design agencies based on criteria like track record in technical sectors, proven fundraising outcomes, strategic services, and turnaround time.\n\nSpecific details:\n- Whitepage: Consulting-led design agency that has helped clients raise over $1.7 billion. Specializes in high-complexity sectors like agtech and greentech.\n- Slidebean: AI-powered deck building platform plus full-service agency team. Has helped startups raise over $500 million.\n- Superside: Subscription-based creative services with a 700-person global design team. Best for ongoing creative needs.\n- Pitch Deck Fire: Boutique agency focused exclusively on startup pitch decks, with packages from $1,650 to $5,999.\n- Halo Lab: Specializes in high-fidelity, UX-driven pitch decks using advanced tools like Figma.\n- SketchDeck: On-demand, platform-based design for fast and scalable pitch deck creation.\n\nThe article aims to help agriculture startups find the right pitch deck design partner to effectively communicate their vision and secure crucial funding.",
      "summaryTimestamp": 1771619181614
    },
    {
      "id": "e21bc32b82618386",
      "title": "Texas A&#038;M animal science faculty and graduate student earn national honors",
      "link": "https://agrilifetoday.tamu.edu/2026/02/20/texas-am-animal-science-faculty-and-graduate-student-earn-national-honors/",
      "description": "Smith and Soffa recognized at American Society of Animal Science meeting The post Texas A&#038;M animal science faculty and graduate student earn national honors appeared first on AgriLife Today.",
      "date": "Fri, 20 Feb 2026 19:21:53 +0000",
      "timestamp": 1771615313000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Jason Smith, Ph.D., Texas A&M AgriLife Extension Service beef cattle specialist, won the American Society of Animal Science (ASAS) Extension Award for his outstanding achievements in outreach and extension programs in animal science.\n\n- Dallas Soffa, a doctoral candidate in physiology of reproduction at Texas A&M, received the ASAS Emerging Scholar Award for her exceptional dissertation research and mentorship within graduate education.\n\n- Smith develops and delivers educational programs for beef cattle producers and industry stakeholders, conducts applied research, and leads initiatives like the Texas Beef Quality Assurance program and Texas Beef Cattle Efficiency Initiative.\n\n- Soffa's research examines how internal and external factors influence reproductive microbiota and immune signaling in cattle fertility, aiming to improve fertility outcomes and reduce risks for producers.\n\n- Soffa has authored 13 abstracts, a popular press article, and one peer-reviewed manuscript, and has earned a USDA NIFA Predoctoral Fellowship.\n\n- The awards were presented at the ASAS Southern Section meeting in Rogers, Arkansas, in February 2026.\n\n- The recognition of Smith and Soffa reflects the Department of Animal Science's commitment to excellence in research, teaching, and extension.",
      "summaryTimestamp": 1771619188558
    },
    {
      "id": "d64606b376f9c231",
      "title": "How Statistics Improve Agricultural Decision-Making",
      "link": "https://www.morningagclips.com/how-statistics-improve-agricultural-decision-making/",
      "description": "BOISE, Idaho. &#8212; Agriculture is both art and science. Farmers plant seeds, yes. But they also manage risk, time, money, and uncertainty. Statistics help turn guesswork into informed choices. It makes things measurable. It makes outcomes more predictable. In short: statistics improve agricultural decisions by giving numbers to intuition. Why numbers matter Decisions based on [&#8230;] The post How Statistics Improve Agricultural Decision-Making appeared first on Morning Ag Clips.",
      "date": "Fri, 20 Feb 2026 19:12:26 +0000",
      "timestamp": 1771614746000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key points:\n\n- Statistics turn agricultural decisions from guesswork into an evidence-based, structured process. They make outcomes more measurable and predictable.\n\n- Common statistical tools useful for farmers include descriptive statistics, regression models, time series analysis, experimental design, and probability/decision trees. AI math solver apps can automate many of these calculations.\n\n- Concrete examples show how statistics can optimize fertilizer use (12% reduction in nitrogen while maintaining yields), inform planting date decisions (7% yield increase), and guide precise pest management (reduced sprays).\n\n- Adopting data-driven practices can provide 10-20% cost savings on inputs, 15-40% water savings in irrigation, and 30-60% reductions in chemical use, while improving sustainability.\n\n- Potential pitfalls to avoid include small sample sizes, confounding factors, overfitting models, and confirmation bias. Integrating statistics with modern ag tech like satellites and drones can enhance the impact.\n\n- To measure success, track key performance indicators like yield, input costs, water use, and spray frequency. Sharing data and findings within the farming community amplifies the benefits.\n\nThe article emphasizes that statistical thinking transforms agricultural decision-making, turning it into an evidence-based process that delivers real economic and environmental advantages for farmers.",
      "summaryTimestamp": 1771619194349
    },
    {
      "id": "94092abcd17083a3",
      "title": "Rice Prices Fall Despite Tighter Domestic Stocks Outlook",
      "link": "https://www.allagnews.com/rice-prices-fall-despite-tighter-domestic-stocks-outlook/",
      "description": "NASHVILLE, TN &#8211; U.S. rice producers are heading into 2026 facing lower prices even as [...]",
      "date": "Fri, 20 Feb 2026 19:00:02 +0000",
      "timestamp": 1771614002000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key Points:\n\n- U.S. rice acreage totaled about 2.8 million acres in 2025, with 2.7 million harvested due to spring flooding.\n- Long-grain ending stocks are projected near 34.6 million bushels, similar to last year.\n- The average farm price is forecast to drop to about $10.50 per hundredweight, down from $14.00 the previous year.\n- Global rice production is expected near record levels while demand lags, resulting in a third straight surplus.\n- Large exportable supplies from Asia, especially India, are pressuring prices across major exporters.\n- U.S. long-grain exports during the first half of the marketing year fell 31% from the previous year.\n- The global surplus outweighs tighter U.S. supplies, putting downward pressure on prices.",
      "summaryTimestamp": 1771638115953
    },
    {
      "id": "b6081d4938284d81",
      "title": "Large Farms Control Growing Share Of U.S. Farmland",
      "link": "https://www.allagnews.com/large-farms-control-growing-share-of-u-s-farmland/",
      "description": "(NOTE: This is the third in a four-part series from USDA&#8217;s Farms and Land in [...]",
      "date": "Fri, 20 Feb 2026 18:45:55 +0000",
      "timestamp": 1771613155000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "In the United States, large farms with over $1 million in annual sales now control a growing share of the country's farmland. According to USDA data:\n\n- Large farms (over $1 million in annual sales) make up about 6% of all farms, but operate around 36% of the total farmland.\n- Smaller operations dominate farm counts but manage far fewer acres.\n- Economies of scale allow larger farms to spread equipment, technology, and input costs across more acres while maintaining tighter margins. This advantage allows them to expand during downturns when smaller competitors struggle financially.\n- The growing concentration of farmland under larger operations is changing how agribusiness firms structure services and risk management offerings, as grain merchandising, input purchasing, and contract negotiations increasingly involve fewer but larger producers.\n- While productivity gains often follow scale, the concentration raises ongoing debate about market access and competition across rural regions.\n\nThe key takeaway for farmers is that scale is becoming increasingly important for competitiveness in modern crop production.",
      "summaryTimestamp": 1771638118657
    },
    {
      "id": "c7f7332963b98709",
      "title": "Ethanol Demand Strengthens Despite Mixed Production Signals Nationwide",
      "link": "https://www.allagnews.com/ethanol-demand-strengthens-despite-mixed-production-signals-nationwide/",
      "description": "NASHVILLE, TN &#8211; Ethanol markets showed stronger fuel demand this week, providing support for corn [...]",
      "date": "Fri, 20 Feb 2026 18:45:01 +0000",
      "timestamp": 1771613101000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key Points:\n\n- U.S. ethanol production rose 0.7% to 1.12 million barrels per day (about 46.96 million gallons daily) in the latest week.\n- Output was 3.1% above last year and nearly 5% above the 3-year average.\n- However, the 4-week average slipped to 1.07 million barrels per day (16.51 billion gallons annually), indicating plants are not accelerating run rates aggressively yet.\n- Gasoline demand jumped 5.4% to 8.75 million barrels per day, a key indicator of blending demand.\n- Refiner and blender ethanol use increased 3%, and exports surged 29% to 177,000 barrels per day, pointing to improving domestic and foreign fuel consumption.\n- Ethanol inventories climbed 1.4% to 25.6 million barrels, though stocks remain below year-ago levels.\n- The stronger fuel demand supports corn usage despite a steady production pace.",
      "summaryTimestamp": 1771638121381
    },
    {
      "id": "7e6f67b46626f58c",
      "title": "Small Farms Persist But Operate Limited Agricultural Land",
      "link": "https://www.allagnews.com/small-farms-persist-but-operate-limited-agricultural-land/",
      "description": "(NOTE: This is the final of a four-part series from USDA&#8217;s Farms and Land in [...]",
      "date": "Fri, 20 Feb 2026 18:30:00 +0000",
      "timestamp": 1771612200000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "S. despite their limited control of agricultural land. Nearly half (50%) of U.S. farms report less than $10,000 in annual sales, yet these small operations account for only about 8% of total farmland nationwide. \n\nMany of these small farms rely on off-farm income, retirement holdings, or part-time management rather than full commercial production. This trend keeps farm numbers high even as working production concentrates into fewer, larger operations.\n\nThe divide between small lifestyle/land ownership farms and larger commercial producers creates two distinct agricultural economies. Economists say this complicates farm policy debates, as programs affect these very different types of operations in varying ways.\n\nThe key takeaway for farmers is that farm numbers alone do not reflect production capacity - the concentration of land ownership and acreage is also a critical factor.\n\nThe data and analysis is from the USDA's \"Farms and Land in Farms 2025 Summary\" report. The article was published on February 20, 2026.",
      "summaryTimestamp": 1771638124174
    },
    {
      "id": "a3e677c355fd279b",
      "title": "Suspect in Texas cattle-fraud case shares his side of the story",
      "link": "https://www.agdaily.com/livestock/suspect-in-texas-cattle-fraud-case-shares-his-side-of-story/",
      "description": "Joshua Link, identified as Agridime’s executive director and listed by federal authorities as a fugitive, denies wrongdoing in the Agridime case and promised to give AGDAILY an interview. The post Suspect in Texas cattle-fraud case shares his side of the story appeared first on AGDAILY.",
      "date": "Fri, 20 Feb 2026 18:27:54 +0000",
      "timestamp": 1771612074000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2022/09/shutterstock_763618966-300x200.jpg",
      "summary": "The one suspect not in custody, Joshua Link, disputed the government's allegations, claiming he and others acted in good faith. \n\nLink, Agridime's executive director, said the company's Fort Worth office handled all audits with the USDA and assured him and co-owner Tia Link that audits were passed fully. He alleges federal authorities froze assets, terminated legal representation, and prevented meaningful defense before taking control of the company's operations.\n\nLink argues the standard $2,000 contract amount was not intended to be spent entirely on the initial purchase of cattle, but also on raising, feeding, processing, and marketing the animals. He contends 40-50% of contract funds being used for cattle purchases, with the remainder for operating expenses, is consistent with the business model. \n\nLink raised concerns about the investigation and asset seizure, claiming no badge numbers were provided and identification was not properly verified. The U.S. Attorney's Office states the indictment is the result of an FBI investigation with USDA assistance, alleging the defendants fraudulently collected over $220 million from more than 2,200 victims.\n\nJoshua Link remains listed as a fugitive, with the FBI requesting public assistance in locating him. AGDAILY continues to reach out to Link for a formal interview.",
      "summaryTimestamp": 1771638127685
    },
    {
      "id": "31934d5eede367d4",
      "title": "CropLife Retail Week: Farm Bill 2.0, Dicamba EPA labels and USMCA renewal",
      "link": "https://www.croplife.com/management/croplife-retail-week-farm-bill-2-0-dicamba-epa-labels-and-usmca-renewal/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=croplife-retail-week-farm-bill-2-0-dicamba-epa-labels-and-usmca-renewal",
      "description": "Eric Sfiligoj and Amy Asmus unpack Farm Bill 2.0, new dicamba EPA labels, and why USMCA renewal tops July’s trade agenda. The post CropLife Retail Week: Farm Bill 2.0, Dicamba EPA labels and USMCA renewal appeared first on CropLife.",
      "date": "Fri, 20 Feb 2026 18:10:23 +0000",
      "timestamp": 1771611023000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/2026-02-05-609-feature-150x150.jpg",
      "summary": "Farm Bill 2.0: Congress is drafting a new version of the Farm Bill, which provides subsidies and other support for U.S. farmers. The previous Farm Bill expired in 2018, and a new version is expected to be passed in 2023.\n\n2. New dicamba EPA labels: The Environmental Protection Agency (EPA) has released updated labels for the herbicide dicamba, which is used on genetically modified crops. The new labels aim to address concerns about dicamba drifting and damaging nearby crops.\n\n3. USMCA renewal: Renewing the United States-Mexico-Canada Agreement (USMCA), a trade deal that replaced NAFTA, is a top priority for July. The USMCA is important for American farmers as it maintains agricultural trade with Canada and Mexico.\n\nThe article does not provide any specific numbers, prices, statistics, or percentages. It also does not mention any names of people, organizations, or programs, nor any locations. The context, causes, and impacts for farmers are not detailed. No expert quotes are included.",
      "summaryTimestamp": 1771612809707
    },
    {
      "id": "ec5494b2667399dc",
      "title": "U.S. Supreme Court Rules Trump’s IEEPA Tariffs &#8216;Not Legitimate Use of Power&#8217;",
      "link": "https://www.croplife.com/management/legislation/u-s-supreme-court-rules-trumps-ieepa-tariffs-not-legitimate-use-of-power/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=u-s-supreme-court-rules-trumps-ieepa-tariffs-not-legitimate-use-of-power",
      "description": "In a 6–3 ruling, the Supreme Court rejects Trump’s IEEPA tariffs; expert Jim DeLisi breaks down impacts and next steps. The post U.S. Supreme Court Rules Trump’s IEEPA Tariffs &#8216;Not Legitimate Use of Power&#8217; appeared first on CropLife.",
      "date": "Fri, 20 Feb 2026 17:13:18 +0000",
      "timestamp": 1771607598000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/11/US-China-Trade-Tariffs-150x150.jpg",
      "summary": "The U.S. Supreme Court ruled 6-3 that President Trump's use of the International Emergency Economic Powers Act (IEEPA) to impose tariffs was not a legitimate use of that power. This overturns the tariffs Trump placed on various imports, including agricultural goods, under the guise of national security concerns.\n\nAccording to trade expert Jim DeLisi, the ruling means the tariffs were unlawful and farmers can now seek refunds on tariffs paid. DeLisi estimates farmers paid over $20 billion in tariffs since 2018. The decision also prevents the government from using IEEPA to unilaterally impose such tariffs in the future without congressional approval.\n\nThe Supreme Court's ruling stated the President cannot use IEEPA to address general economic conditions, which was the primary justification used by the Trump administration. This sets an important precedent limiting the President's ability to bypass Congress on trade policy decisions in the future.\n\nOverall, the ruling is a major win for farmers who were negatively impacted by the retaliatory tariffs imposed by trading partners like China in response to Trump's IEEPA tariffs. Experts recommend farmers seek refunds on tariffs paid and monitor for any future attempts to reinstate similar tariffs.",
      "summaryTimestamp": 1771612831122
    },
    {
      "id": "e481b55a4e4dc5ed",
      "title": "Report: High-tech precision ag is a key to cutting farm costs",
      "link": "https://www.agdaily.com/insights/report-high-tech-precision-ag-cut-farm-costs/",
      "description": "A new American Commitment report argues that U.S.-made precision agriculture technologies are already helping farmers reduce costly inputs. The post Report: High-tech precision ag is a key to cutting farm costs appeared first on AGDAILY.",
      "date": "Fri, 20 Feb 2026 14:51:14 +0000",
      "timestamp": 1771599074000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2016/09/bg-growing_money-001-Adobe-300x187.jpg",
      "summary": "Key Points:\n\n- High-tech precision agriculture is crucial for cutting farm costs and boosting efficiency amidst high inflation.\n\n- The report found that current adoption of precision technologies has driven a 5% boost in annual crop production, with potential for 6% more if adoption increases.\n\n- Precision agriculture has helped avoid cultivation of 11.4 million acres, roughly 5 times the size of Yellowstone National Park.\n\n- Specific cost savings include: 8% improvement in fertilizer optimization can save $20,000 per 1,000 acres, 7% reduction in fuel use saves $4,000 per 1,000 acres, and 5% reduction in water usage can save $16,000 per 1,000 acres.\n\n- Herbicide volumes could decline by 50-90% as precision ag adoption expands.\n\n- John Deere's ExactShot fertilizer system can cut fertilizer use by up to 60% while maintaining yields. Its See & Spray technology reduced herbicide use by 50%.\n\n- AGCO's AI-powered SymphonyVision system can reduce herbicide use by up to 70%, save over $30/acre, and increase grain harvesting efficiency by 33%.\n\n- The report encourages policymakers to support the regulatory and IP ecosystem that enables agricultural innovation.",
      "summaryTimestamp": 1771619205324
    },
    {
      "id": "3532255d53907060",
      "title": "Perspective: Why is it always Florida? Even in the food and ag sectors.",
      "link": "https://www.agdaily.com/lifestyle/perspective-why-always-florida-even-food-ag-sectors/",
      "description": "The real food danger for Americans isn’t parts per billion of glyphosate, but rather it's elevating a fringe group into mainstream politics. The post Perspective: Why is it always Florida? Even in the food and ag sectors. appeared first on AGDAILY.",
      "date": "Fri, 20 Feb 2026 13:20:14 +0000",
      "timestamp": 1771593614000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/florida-governor-ron-desantis-300x219.jpg",
      "summary": "The Florida Department of Health reported that six out of eight national bread brands had detectable glyphosate residues, which state officials presented as a looming health crisis.\n\nHowever, the article argues that the amounts of glyphosate found are minuscule, measured in parts per billion (ppb), and well within the safety limits set by federal agencies like the EPA and FDA. According to toxicology experts, you would need to consume nearly 20,000 slices of bread per day at the highest levels found in Florida to reach concerning levels. The article states that the federal government already conducts comprehensive pesticide monitoring on American food, and more than 97% of domestic food samples were below EPA tolerance levels.\n\nThe article suggests that the Healthy Florida First initiative is a political stunt by Governor DeSantis to boost his national profile and appeal to the \"Make America Healthy Again\" (MAHA) movement, which has gained traction in mainstream Republican politics. The author warns that this fear-based food policing, driven by misinformation and anti-science rhetoric, is now becoming embedded in the political discourse, posing a greater danger than the trace amounts of glyphosate detected.",
      "summaryTimestamp": 1771605223513
    },
    {
      "id": "cb440ee72e96a9e9",
      "title": "Ag producers can benefit from 'decommoditizing' their products",
      "link": "https://www.agweek.com/farm-finances/ag-producers-can-benefit-from-decommoditizing-their-products",
      "description": "By finding different markets, farmers and ranchers can give themselves more control over their profit margins at a time when incomes are down, farm bankruptcies are up and policy creates uncertainty.",
      "date": "Fri, 20 Feb 2026 11:30:00 GMT",
      "timestamp": 1771587000000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/d4d326a/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F8d%2F79%2F7f3555cf4c2ab57e7aa8bac8ff89%2Fdakota-angus.png",
      "summary": "Some key points:\n\n- Bruner Angus Ranch in North Dakota has shifted from being \"cattle producers\" to \"beef producers\" by forming a direct-to-consumer meat company called Dakota Angus LLC. This has allowed them to focus more on traits like taste and tenderness.\n\n- AGT Foods USA has helped pulse crop farmers in North Dakota decommoditize their supply chain. In 2000, the state grew 60,000 acres of pulse crops, but that has now grown to over 2.5 million acres as AGT has set up processing facilities within the region.\n\n- Challenges of decommoditizing include needing to work more closely with end buyers on specifications, as well as additional cleaning/quality control requirements. But this can lead to higher premiums.\n\n- In the livestock sector, high cattle prices make it difficult for ranchers to find the right profit margin for direct-to-consumer sales. Consumers need to be willing to pay more than store prices.\n\n- Bruner says the most rewarding but challenging part is marketing their products and telling their story to consumers to build an appreciation for their farm.\n\nThe article provides advice for other producers considering similar moves: \"Tell your story from your heart.\"",
      "summaryTimestamp": 1771605227390
    },
    {
      "id": "a2ad517bc2fd0b57",
      "title": "Year of the Fire Horse brings speed, momentum and volatility in grain markets",
      "link": "https://www.agweek.com/business/markets/year-of-the-fire-horse-brings-speed-momentum-and-volatility-in-grain-markets",
      "description": "As China enters the the Year of the Fire Horse, we are in a market that reacts quickly, Allison Thompson says. She provides some strategies for making sure your operation's position is protected.",
      "date": "Fri, 20 Feb 2026 11:30:00 GMT",
      "timestamp": 1771587000000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/02bf2c0/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fagweek%2Fbinary%2F01178.MTS.Still001_binary_6869726.jpg",
      "summary": "The Fire Horse represents intense energy, rapid change, and bold movement, which is reflected in the current volatility of grain markets.\n\nEven small news, like rumors of China purchasing soybeans, can move markets quickly. Prices can swing 20-40 cents in a short time based on headlines, technical levels, and fund positioning. However, these sharp rallies often fade when the underlying fundamentals (such as export demand or supply changes) fail to materialize.\n\nThe article cautions that this volatility, while feeling bullish, does not necessarily equate to sustained improvement in the underlying math that farmers need to manage their operations. Input costs remain elevated, and farmers need to focus on incremental revenue gains (e.g. a 25-cent rally in corn on 200-bushel production equals $50 per acre) rather than chasing every market move.\n\nChina's buying patterns around the Lunar New Year holiday can also exacerbate short-term price swings. Traders position ahead of expected Chinese demand, but this can lead to misleading signals if the physical buying was already covered before the holiday.\n\nThe article recommends that farmers embrace the \"endurance\" aspect of the horse, rather than just the speed and boldness. Strategies like incremental sales into strength, defined downside protection, and maintaining flexibility are advised over trying to perfectly time the market. The goal should be improving the risk profile, not perfection.\n\nIn summary, the Year of the Fire Horse is bringing volatility and momentum to grain markets, but farmers need to manage this environment with discipline and preparation, not just reactivity, to strengthen their balance sheets.",
      "summaryTimestamp": 1771605238782
    },
    {
      "id": "6dd23e1fc0f21810",
      "title": "Farm and Dairy Weekly Rundown: Episode 44 (2-19-26)",
      "link": "https://www.farmanddairy.com/news/farm-and-dairy-weekly-rundown-episode-44-2-19-26/905168.html",
      "description": "Reporters Liz Partsch and Paul Rowley give readers a rundown of the top stories in the Farm and Dairy the week of Feb. 19, 2026. The post Farm and Dairy Weekly Rundown: Episode 44 (2-19-26) appeared first on Farm and Dairy.",
      "date": "Fri, 20 Feb 2026 00:45:11 +0000",
      "timestamp": 1771548311000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Pennsylvania is conducting the state's first-ever comprehensive firefly inventory to better understand and protect these declining insect populations.\n\n- \"Forever chemicals\" like PFAS may be contaminating groundwater and soil in Pennsylvania, posing a hidden threat to farmers and the environment. The state plans to investigate the extent of the problem.\n\n- No other specific numbers, dates, or expert quotes were provided in the article summary.",
      "summaryTimestamp": 1771551978135
    },
    {
      "id": "98d14debf4c4bc75",
      "title": "Bloom for Good launches ag advocacy savings app",
      "link": "https://www.agdaily.com/ffa/bloom-for-good-launches-ag-advocacy-savings-app/",
      "description": "Bloom for Good launched a savings app that supports 4-H, FFA and Ag in the Classroom through digital membership purchases. The post Bloom for Good launches ag advocacy savings app appeared first on AGDAILY.",
      "date": "Thu, 19 Feb 2026 22:48:13 +0000",
      "timestamp": 1771541293000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/10/bg-national-ffa-convention-2-300x195.jpg",
      "summary": "Bloom for Good, a mission-driven company, has launched a new Advocating for Agriculture savings app to create ongoing financial support for 4-H, FFA, and Ag in the Classroom programs nationwide. \n\nKey details:\n- The app offers a one-year digital savings membership with discounts at businesses, with a portion of purchases going back to agricultural education organizations.\n- The introductory membership price is $15 (regularly $25).\n- Proceeds from membership purchases will support state and national efforts tied to 4-H, FFA, and Ag in the Classroom, helping fund curriculum, leadership development, classroom resources, and hands-on learning opportunities.\n- The program aims to address challenges facing agriculture, including workforce shortages and declining agricultural literacy, by giving supporters a simple way to contribute.\n- Missy Rosenbusch, Vice President of Agriculture Advocacy & Impact at Bloom for Good, said \"This campaign is about more than savings - it's about advocating with an impact. Every time someone purchases this membership, they are actively standing up for agriculture, education, and youth leadership across America.\"\n\nThe app is intended to be a renewable, year-round campaign that makes it easy for individuals, families, and corporate partners to support the future of agriculture.",
      "summaryTimestamp": 1771560721773
    },
    {
      "id": "c3b5295eddbaeafd",
      "title": "Wildfire preparedness encouraged as conditions remain warm and dry across Texas",
      "link": "https://agrilifetoday.tamu.edu/2026/02/19/wildfire-preparedness-encouraged-as-conditions-remain-warm-and-dry-across-texas/",
      "description": "Texas A&#038;M Forest Service offers preparation and preventive tips The post Wildfire preparedness encouraged as conditions remain warm and dry across Texas appeared first on AgriLife Today.",
      "date": "Thu, 19 Feb 2026 20:36:29 +0000",
      "timestamp": 1771533389000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Warm and dry conditions across Texas are increasing the risk of wildfires in early 2026.\n\n- Texas A&M Forest Service urges all Texans to prepare emergency go-kits and create defensible space around homes.\n\n- Since January 1, Texas A&M Forest Service has responded to 249 wildfires that burned 5,528 acres statewide.\n\n- Wildfire danger is predicted to continue due to warm, dry weather and drought conditions most of Texas is experiencing.\n\n- Texans are advised to be mindful of any outdoor activities that could spark a wildfire, follow local burn bans, and monitor weather/fire conditions.\n\n- Preparedness steps include assembling a 5 Ps emergency kit, creating defensible space around homes, and removing dead vegetation.\n\n- Quotes from Laura Stevens, Texas A&M Forest Service fire information and education program coordinator, emphasize the importance of personal responsibility in disaster preparedness.",
      "summaryTimestamp": 1771540061561
    },
    {
      "id": "46acf5d4bbdf6b40",
      "title": "The Certainty of Uncertainty: Ag Leaders Confront Volatile Markets and Rising Expenses",
      "link": "https://www.croplife.com/management/legislation/the-certainty-of-uncertainty-ag-leaders-confront-volatile-markets-and-rising-expenses/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=the-certainty-of-uncertainty-ag-leaders-confront-volatile-markets-and-rising-expenses",
      "description": "Economist Dr. Joe Glauber discusses the uncertainty facing U.S. agriculture amid rising expenses, trade turbulence, and shifting global markets. The post The Certainty of Uncertainty: Ag Leaders Confront Volatile Markets and Rising Expenses appeared first on CropLife.",
      "date": "Thu, 19 Feb 2026 18:11:07 +0000",
      "timestamp": 1771524667000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/China-US-Trade-Tariff-150x150.jpg",
      "summary": "S. agriculture, including rising expenses, trade uncertainties, and shifting global markets. Economist Dr. Joe Glauber notes that while commodity prices have been volatile, input costs for farmers have been steadily increasing. Fertilizer prices have risen over 30% in the past year, and fuel and energy costs are also up significantly. \n\nTrade disruptions, such as the ongoing U.S.-China trade dispute, have created further uncertainty for farmers. Global market shifts, including changes in demand and supply, have also impacted agricultural commodity prices. \n\nDr. Glauber states that the combination of rising costs and market volatility has put significant financial pressure on farmers. He recommends that farmers closely monitor their budgets, explore cost-saving measures, and consider risk management tools like crop insurance to help mitigate the impact of these challenges.\n\nThe article highlights the need for agricultural leaders and policymakers to address the complex issues facing the industry, in order to provide stability and support for farmers navigating these volatile times.",
      "summaryTimestamp": 1771705209515
    },
    {
      "id": "274bb300a20231b4",
      "title": "North Dakota man taken into custody on charges relating to cattle theft",
      "link": "https://www.agweek.com/livestock/cattle/north-dakota-man-taken-into-custody-on-charges-relating-to-cattle-theft",
      "description": "A Colfax man is in custody in the Richland County Jail after being charged with two Class A felonies and two Class A misdemeanors relating to the theft and transfer of cattle.",
      "date": "Thu, 19 Feb 2026 18:05:49 GMT",
      "timestamp": 1771524349000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/e300388/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Ffccnn%2Fbinary%2F1owlw5z8fwr7-rliwgt4kjbyuzjxoul_binary_807117.jpg",
      "summary": "A Colfax, North Dakota man, Daniel Wayne Dockter, has been taken into custody and charged with two Class A felonies and two Class A misdemeanors related to the theft and transfer of cattle.\n\nThe charges are based on claims from two complainants:\n- One complainant reported 93 missing cows and 3 missing bulls, with an estimated market value of $241,500, and unpaid balances for the calf crop in 2024 and 2025 totaling 73 head of calves, worth approximately $219,000.\n- The other complainant reported 40 missing cows, valued at $100,000, and unpaid balances for the calf crop in 2024 and 2025 totaling 30 head of calves, worth approximately $90,000.\n\nThe cattle were believed to be under Dockter's care at his property in Colfax. One complainant had transported cattle to Dockter's property in November 2019, while the other hired a trucking company in 2021 to transport cattle from York, North Dakota to Colfax.\n\nDockter allegedly failed to make payments to the complainants and provided false information about the cattle's location, claiming they were at a non-existent feedlot in South Dakota. He also did not obtain the necessary brand inspections for legally transporting the cattle out of North Dakota.\n\nA search warrant executed on Dockter's property on January 8, 2026 did not find any of the complainants' branded cattle. It is believed the cattle were transported from Colfax to South Dakota between January 1, 2024, and January 8, 2026.\n\nThe total estimated value of the unaccounted-for cattle is $460,500 for one complainant and $190,000 for the other.",
      "summaryTimestamp": 1771605246705
    },
    {
      "id": "513031e1acbfba96",
      "title": "Trump Directs USDA to Boost Production of Glyphosate",
      "link": "https://civileats.com/2026/02/19/trump-directs-usda-to-boost-production-of-glyphosate/",
      "description": "February 19, 2026 – President Donald Trump issued an executive order late Wednesday directing the Secretary of Agriculture to boost the domestic supply of glyphosate, the active ingredient in the herbicide Roundup, in the name of national security. The order emphasizes increasing domestic production of elemental phosphorus, which is created by mining phosphate, to make [&#8230;] The post Trump Directs USDA to Boost Production of Glyphosate appeared first on Civil Eats.",
      "date": "Thu, 19 Feb 2026 18:01:31 +0000",
      "timestamp": 1771524091000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The Trump administration has issued an executive order directing the U.S. Department of Agriculture (USDA) to increase domestic production of glyphosate, the active ingredient in the widely used herbicide Roundup. The order, issued on February 19, 2026, cites national security concerns and emphasizes the need to boost domestic production of elemental phosphorus, a key component in glyphosate manufacturing. \n\nThe order aims to reduce the U.S. reliance on imported glyphosate and phosphorus. Currently, the U.S. imports 80% of its phosphorus supply, primarily from China and Morocco. The executive order calls for the USDA to work with the Department of the Interior to expand phosphate mining operations in the U.S. and streamline the permitting process. \n\nThis move is expected to have significant impacts on farmers and the agricultural industry. Increased glyphosate production could lead to lower prices and greater availability of the herbicide, but also raises concerns about potential environmental and health effects. Experts warn that over-reliance on glyphosate-based weed control could contribute to the development of herbicide-resistant weeds, diminishing the effectiveness of this widely used tool.\n\nThe order does not provide specific timelines or production targets, but directs the USDA to work with relevant federal agencies to develop a plan to boost domestic glyphosate and phosphorus supplies within 6 months.",
      "summaryTimestamp": 1771712347215
    },
    {
      "id": "ed21bdadec3acb58",
      "title": "Texas A&#038;M AgriLife Research projects to enhance rice yields, health benefits",
      "link": "https://agrilifetoday.tamu.edu/2026/02/19/texas-am-agrilife-research-projects-to-enhance-rice-yields-health-benefits/",
      "description": "Studies explore new rice breeding technology to improve quality and advance purple rice The post Texas A&M AgriLife Research projects to enhance rice yields, health benefits appeared first on AgriLife Today.",
      "date": "Thu, 19 Feb 2026 16:39:48 +0000",
      "timestamp": 1771519188000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n1. Texas A&M AgriLife Research is conducting two new projects to improve rice yields, quality, and health benefits:\n   - Project 1 (USDA-funded): Aims to modernize the rice breeding pipeline and enhance yield and quality in main and ratoon rice crops. It will use technologies like unmanned aerial systems (UAS), genomic selection, and artificial intelligence.\n   - Project 2 (USDA-ARS funded): Focuses on increasing nutrient profiles and yields in new purple rice varieties using traditional breeding and multi-omics techniques.\n\n2. The projects are led by Shyamal Talukder, Ph.D., AgriLife Research rice breeder, geneticist, and assistant professor at Texas A&M. \n\n3. Project 1 (over $1.1 million in funding) seeks to:\n   - Establish a UAS-based precision phenotyping system for rice breeding\n   - Develop molecular markers for desirable rice traits\n   - Develop a cost-effective marker panel for genomic selection and machine learning\n\n4. Project 2 aims to overcome yield challenges that have limited commercial adoption of nutrient-dense purple rice.\n\n5. The goals are to support U.S. rice producers, maintain the competitive edge of the U.S. rice industry, and provide consumers with healthier rice products.",
      "summaryTimestamp": 1771698507775
    },
    {
      "id": "a368844f3426b926",
      "title": "Ag commissioner glad to see ICE operations wind down, but concerns remain",
      "link": "https://www.agweek.com/news/policy/ag-commissioner-glad-to-see-ice-operations-wind-down-in-minnesota",
      "description": "First in the House and then later at the Senate, DFL members from the Twin Cities metro area wanted to hear more of ICE activity on agriculture in Minnesota.",
      "date": "Thu, 19 Feb 2026 14:52:46 GMT",
      "timestamp": 1771512766000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/87ee851/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F85%2F99%2F3daa3947475aae758a29a482d2f3%2Fthompetersen.png",
      "summary": "Key Points:\n\n- Minnesota Agriculture Commissioner Thom Petersen provided an update to state senators on the impact of recent ICE operations in the state on the agriculture industry.\n\n- Farmers have reported labor shortages, with about half the workers they had planned for this spring. This is due to immigration enforcement activity scaring off migrant workers that many farms rely on.\n\n- The surge of ICE officers caused slowdowns and shutdowns at meat processing plants, which disrupted the \"just-in-time\" delivery system for hogs and turkeys that many farms depend on.\n\n- While the commissioner is relieved that the surge in enforcement is winding down, concerns remain about ongoing labor shortages, especially during the critical spring planting and fall harvest seasons.\n\n- Many farms now rely on the H-2A temporary agricultural worker program, with workers returning year after year. Farmers fear the recent enforcement will discourage these workers from coming back.\n\n- The commissioner noted that labor issues in agriculture were a problem even before the ICE operations, but the timing of the surge could have been devastating had it occurred during the busiest seasons.",
      "summaryTimestamp": 1771605250623
    },
    {
      "id": "b120244d606621ab",
      "title": "USDA Ag Outlook Forum Acreage Figures",
      "link": "https://farmdoc.illinois.edu/field-crop-production/usda-ag-outlook-forum-acreage-figures.html",
      "description": "USDA this morning released its Agricultural Outlook Forum acreage, yield and production numbers. These are widely anticipated by the trade and will be incorporated into the May WASDE (World Agriculture Supply and Demand Estimates) for corn and soybeans. The May WASDE includes the first official set of supply and demand tables for the new crop year. USDA expects a slight decline in total acreage across wheat, corn, and soybean to 224 million (down ~1%). This number assumes a normal level of preve",
      "date": "Thu, 19 Feb 2026 13:48:22 +0000",
      "timestamp": 1771508902000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- USDA released its Agricultural Outlook Forum acreage, yield, and production numbers for 2026/27:\n  - Total acreage across wheat, corn, and soybeans is expected to decline slightly to 224 million acres (down ~1%).\n  - Wheat: 45 million acres, 50.8 bushels/acre, 1.86 billion bushels production, $5.00/bushel price.\n  - Corn: 94 million acres, 183.0 bushels/acre, 15.76 billion bushels production, $4.20/bushel price.\n  - Soybeans: 85 million acres, 53.0 bushels/acre, 4.45 billion bushels production, $10.30/bushel price.\n\n- These numbers will be discussed during the upcoming WILLAg.org Closing Market Report (2 pm on Feb 19) and Commodity Week programs (after 6 pm on Feb 19).\n\n- The annual All Day Ag Outlook Conference is scheduled for March 3, 2026 at the Beef House Restaurant in Covington, Indiana. \n  - Registration is $40 per person if purchased by February 27, and $60 thereafter. \n  - Experts will cover topics like weather, grain market fundamentals, South American competition, farmland outlook, production and budgeting, and more.",
      "summaryTimestamp": 1771705213728
    },
    {
      "id": "e61fa32edd39638c",
      "title": "USDA announces 2026 CRP enrollment periods",
      "link": "https://www.agweek.com/opinion/usda-announces-2026-crp-enrollment-periods",
      "description": "The sign-up period for landowners to enroll eligible farmland in the Continuous CRP program is Feb. 12 through March 20, 2026.",
      "date": "Thu, 19 Feb 2026 11:30:00 GMT",
      "timestamp": 1771500600000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/23abca5/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Ffccnn%2Fbinary%2Fcopy%2F2f%2Fa8%2Fd8ed760cecf08bd4c795e3cbd6c6%2F3633340-0b0xk13k3h3bnzulzsu1unmxkota-binary-796377.jpg",
      "summary": "Key Highlights:\n\n- USDA has announced the enrollment periods for the Conservation Reserve Program (CRP) in 2026:\n  - Continuous CRP sign-up: February 12 to March 20, 2026\n  - General CRP sign-up: March 9 to April 17, 2026\n  - Grassland CRP sign-up to be announced later\n\n- The CRP program has been part of every Farm Bill since it was established in 1985 as part of the 1985 Farm Bill. It aims to promote conservation practices and farmland stewardship.\n\n- There are three main CRP programs:\n  1. General CRP: 10-15 year contracts, with rental payments to farmers for enrolling land.\n  2. Continuous CRP: Shorter contracts for specific environmental benefits, with higher payment rates.\n  3. Grassland CRP: Protects grasslands while allowing grazing, now over 37% of total CRP acres.\n\n- As of July 2025, there were 25.8 million acres enrolled in CRP, just below the 27 million acre maximum.\n\n- Upcoming CRP contract expirations: 1.5 million acres on Sept 30, 2026, and 1.3 million acres in 2027.\n\n- Total CRP program budget in 2024 was $1.9 billion, with $1.79 billion in rental payments to farmers.\n\n- Average CRP rental rates in 2024 were $72/acre, varying widely by CRP program type.",
      "summaryTimestamp": 1771605254763
    },
    {
      "id": "3750acfb07b4142a",
      "title": "Honoring Black Farmers: Our Biggest Stories From the Past 6&#160;Years",
      "link": "https://civileats.com/2026/02/19/honoring-black-farmers-our-biggest-stories-from-the-past-6-years/",
      "description": "The stories below trace some of the key policy decisions of our recent past and the impact of those decisions on Black farmers. They also explore the new and viable solutions that farmers and farmer advocates have created in the fight for justice. Below are our most important stories about Black farmers from the past [&#8230;] The post Honoring Black Farmers: Our Biggest Stories From the Past 6 Years appeared first on Civil Eats.",
      "date": "Thu, 19 Feb 2026 09:00:45 +0000",
      "timestamp": 1771491645000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2019/05/190523-reparations-black-farmers-us-presidential-candidates-land-access-justice-2-goat.jpg",
      "summary": "2 billion in compensation but many farmers did not receive the full payments owed.\n- In 2020, the COVID-19 pandemic disproportionately impacted Black farmers, with 39% reporting financial losses compared to 29% of white farmers.\n- The American Rescue Plan Act of 2021 included $4 billion in debt relief for socially disadvantaged farmers, but implementation was delayed by lawsuits.\n- Black farmers have seen their farmland ownership decline from 14% in 1910 to just 1.7% today, due to systemic discrimination and USDA policies.\n- Organizations like the Federation of Southern Cooperatives and the National Black Farmers Association are working to support and empower Black farmers.\n- Experts emphasize the need for sustained policy changes and investment to address the legacy of discrimination and help Black farmers access land, credit, and markets.",
      "summaryTimestamp": 1771677473941
    },
    {
      "id": "15c96d4d9dde7137",
      "title": "Groundhog Day for the Farm Bill: Why GOP promises keep falling short",
      "link": "https://www.farmanddairy.com/columns/farm-bill-delay-gop-crop-safety-net-analysis/904564.html",
      "description": "Farm Bill debate is starting to feel like a repeat episode. Alan Guebert dives into why the \"modernization\" talk doesn't match the math on crop safety nets. The post Groundhog Day for the Farm Bill: Why GOP promises keep falling short appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 09:00:00 +0000",
      "timestamp": 1771491600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The House Agriculture Committee chairman, Republican Glenn \"GT\" Thompson, has repeatedly promised a new Farm Bill every year since the previous one expired in 2023, but has yet to deliver.\n\n- The GOP-led Congress recently made changes to the farm safety net, increasing spending on farm programs by $65 billion while cutting $186 billion from domestic food assistance programs.\n\n- Economists found that the current farm safety net has more than eliminated crop sector losses since the 2000s, when it was only meant to cover about 1.7% of losses annually.\n\n- The excessive farm subsidies have removed the incentive for efficiency in the market economy, which is a critical failure of the current farm policy.\n\n- Experts recommend debating when and how to curtail or eliminate crop safety net payments when market returns are positive, including crop insurance subsidies.\n\n- Given the political divisions in Congress, it is unlikely the House will be able to pass a new Farm Bill before the 2026 elections.",
      "summaryTimestamp": 1771712350037
    },
    {
      "id": "4edeee61269b151d",
      "title": "The &#8216;Wimpy&#8217; Problem: How to properly value sweat equity on the farm",
      "link": "https://www.farmanddairy.com/columns/how-to-properly-value-sweat-equity-on-the-farm/904568.html",
      "description": "Don't wait until \"Tuesday\" to pay for today’s labor. OSU's Dave Marrison talk about how to document farm sweat equity, calculate opportunity costs, and ensure a fair family transition. The post The &#8216;Wimpy&#8217; Problem: How to properly value sweat equity on the farm appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 07:00:00 +0000",
      "timestamp": 1771484400000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Sweat equity is a common issue for farm families, where the successor generation is underpaid compared to their market value, with a promise to \"make it up later\" that often doesn't materialize.\n\n- Example: Johnny Holstein could earn $65,000 as an assistant herdsman, but is paid $50,000 on his parents' 55-cow dairy, a $15,000 annual opportunity cost that totals $225,000 over 15 years.\n\n- To address this, families should document sweat equity contributions in the transition plan, and consider distributing the first $225,000 of the estate to Johnny before dividing the rest.\n\n- Compensation should be tracked transparently, including wages, benefits, housing, food, vehicles, etc. for each family member.\n\n- Sweat equity can also arise from the heir's contribution to farm growth; families should discuss how to attribute that value.\n\n- Non-business contributions like caregiving should also be factored into sweat equity.\n\n- OSU Extension offers \"Planning for the Future of Your Farm\" workshops to help families navigate these complex transition issues.",
      "summaryTimestamp": 1771712353404
    },
    {
      "id": "e3becc8a39e5830f",
      "title": "Sunburns and short Sleeves: Surviving the Northern Plains&#8217; false spring",
      "link": "https://www.farmanddairy.com/columns/sunburns-short-sleeves-northern-plains-false-spring/904571.html",
      "description": "Eliza Blue reflects on the sensory magic and \"false hope\" of a South Dakota January thaw, from spotting early robins to the sting of a surprise winter sunburn. The post Sunburns and short Sleeves: Surviving the Northern Plains&#8217; false spring appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 06:00:00 +0000",
      "timestamp": 1771480800000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "This year's false spring has been particularly long-lasting, starting in January and continuing into February.\n\nThe author, Eliza Blue, a shepherd and writer in western South Dakota, describes the physical sensations and visual cues that make it feel like spring, such as robins and geese returning, and her daughter wanting to wear summer clothes. However, Blue cautions that this is not true spring, and the warm weather can lead to issues like sunburns.\n\nThe article provides the following key details:\n\n- This year's false spring started in January and continued into February, with people wearing t-shirts on Valentine's Day.\n- Blue heard a flock of robins and saw a flock of geese, signs that typically indicate the arrival of spring.\n- Blue's daughter was excited to pull out next summer's clothes, but Blue made her come back inside to avoid sunburn.\n- Blue herself got a sunburn on her chin from the unexpected warmth.\n- The false spring is expected to end soon, with the author only having a fading tan and peeling chin as evidence of the brief warm period.\n\nThe article highlights the disconnect between the physical sensations of warmth and the reality that true spring has not yet arrived. It serves as a cautionary tale for farmers and residents of the Northern Plains about the risks of false spring, such as sunburns and being caught off-guard by the return of winter weather.",
      "summaryTimestamp": 1771712356966
    },
    {
      "id": "e4630a53eefd7955",
      "title": "Texas dairy producers offset lower milk prices with higher calf prices",
      "link": "https://agrilifetoday.tamu.edu/2026/02/18/texas-dairy-producers-offset-lower-milk-prices-with-higher-calf-prices/",
      "description": "Texas Crop and Weather Report - Feb. 18, 2026 The post Texas dairy producers offset lower milk prices with higher calf prices appeared first on AgriLife Today.",
      "date": "Wed, 18 Feb 2026 22:50:16 +0000",
      "timestamp": 1771455016000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Beef-on-dairy calves have increased from $600 per calf in 2024 to as high as $1,500 per calf currently. The number of beef-on-dairy animals sold grew from 50,000 head 10 years ago to 3.22 million in 2024, helping fill supply gaps in the beef industry.\n\nTexas milk production increased from 17 billion pounds in 2024 to 18.2 billion pounds in 2025, due to more dairy cows and improved practices. However, milk prices decreased from $20.55 per hundredweight in December 2024 to $16.93 per hundredweight in December 2025. Cheese and butter prices also declined over this period.\n\nTexas dairy consolidation continues, with 20 dairies lost from 2024 to 2025, but cow numbers increasing from 675,000 to 705,000 head. Texas milk production is expected to continue growing in 2026, but at a slower rate compared to the past 10 years, due to expansion in other states and water challenges in the Texas Panhandle.\n\nAcross the state, weather conditions have been mixed, with some areas receiving beneficial rainfall while others remain very dry. This has impacted winter crops, pastures, and livestock conditions. Farmers are preparing equipment and land for spring planting season.",
      "summaryTimestamp": 1771646587163
    },
    {
      "id": "a27e06f9b006d36e",
      "title": "Proposed USDA Rules Would Increase Line Speeds at Meatpacking&#160;Plants",
      "link": "https://civileats.com/2026/02/18/proposed-usda-rules-would-increase-line-speeds-at-meatpacking-plants/",
      "description": "February 18, 2026 – The U.S. Department of Agriculture (USDA) announced proposed rules Tuesday that would speed up line speeds at poultry and pork production facilities. Under the proposals, maximum chicken slaughter line speeds could increase from 140 birds per minute (bpm) to 175. It would also allow turkey processing lines to increase from 55 [&#8230;] The post Proposed USDA Rules Would Increase Line Speeds at Meatpacking Plants appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 21:06:15 +0000",
      "timestamp": 1771448775000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has proposed new rules that would increase maximum slaughter line speeds at poultry and pork production facilities. The key details are:\n\n- Maximum chicken slaughter line speeds could increase from 140 birds per minute (bpm) to 175 bpm.\n- Turkey processing lines could increase from 55 bpm to an unspecified higher speed.\n- Pork processing line speeds could also be increased, but the proposed new maximum was not provided.\n- These rule changes are aimed at increasing production at meatpacking plants.\n- The proposals were announced on February 18, 2026 by the USDA.\n- Critics argue the higher line speeds will compromise worker safety and animal welfare. \n- Farmers and industry groups have not yet publicly responded to the proposed changes.\n- The USDA is seeking public comments on the proposals before finalizing any new rules.",
      "summaryTimestamp": 1771638133332
    },
    {
      "id": "f3b7e6e98739dcd3",
      "title": "Sensory science researcher unlocks what drives perceived flavors",
      "link": "https://agrilifetoday.tamu.edu/2026/02/18/sensory-science-researcher-unlocks-what-drives-perceived-flavors/",
      "description": "Pellegrino joins the Department of Animal Science to study flavor, behavior and consumer decision-making The post Sensory science researcher unlocks what drives perceived flavors appeared first on AgriLife Today.",
      "date": "Wed, 18 Feb 2026 20:36:12 +0000",
      "timestamp": 1771446972000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Robert Pellegrino, Ph.D., has joined the Texas A&M College of Agriculture and Life Sciences Department of Animal Science as an assistant professor of sensory science.\n\n- Pellegrino's research focuses on understanding the chemical, structural, and temporal features of sensory stimuli that contribute to perceived flavor. This includes how odor, taste, and texture interact to shape eating experiences and influence consumer decision-making.\n\n- Pellegrino has created models to predict odor intensity and quality from the shape of the molecule, leading to the development of a universal odor scale and a process to digitally recreate odors. These tools allow researchers to better compare sensory experiences and predict consumer responses.\n\n- Pellegrino has also contributed to projects focused on improving eating experiences for individuals who have lost their sense of smell, including developing a cookbook and exploring how other cues can enhance food enjoyment.\n\n- Pellegrino will teach ANSC 487: Sensory Evaluation of Foods starting in spring 2027, introducing students to sensory evaluation methods and their applications in research, product development, and consumer studies.\n\n- Beyond Texas A&M, Pellegrino remains active in the global sensory science community, serving in leadership roles with the Global Consortium for Chemosensory Research and the International Society of Neurogastronomy.",
      "summaryTimestamp": 1771638136590
    },
    {
      "id": "ee0f60ca10335417",
      "title": "FDA Finalizes Controversial Guidelines for Livestock Antibiotics",
      "link": "https://civileats.com/2026/02/18/fda-finalizes-controversial-guidelines-for-livestock-antibiotics/",
      "description": "February 17, 2026 – Officials at the Food and Drug Administration (FDA) published a final guidance document on Friday that advises drug companies to set “duration limits” for livestock antibiotics in animal feed, without legally obligating them to do so. The duration limit—the maximum length of time a drug should be given—covers medically important antibiotics, [&#8230;] The post FDA Finalizes Controversial Guidelines for Livestock Antibiotics appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 18:32:05 +0000",
      "timestamp": 1771439525000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The FDA has finalized guidelines for the use of livestock antibiotics, advising drug companies to set \"duration limits\" on the length of time medically important antibiotics can be used in animal feed. However, these limits are not legally binding. The guidelines aim to curb the overuse of antibiotics in livestock, which contributes to the rise of antibiotic-resistant bacteria. While some experts applaud the effort, others argue the guidelines do not go far enough to address the issue. The guidelines do not provide specific duration limits, leaving it up to drug companies to determine appropriate timeframes. Farmers and consumer advocates are concerned that without enforceable restrictions, the overuse of antibiotics in livestock will continue. The guidelines come amidst growing public health concerns over the threat of antibiotic resistance, which the CDC estimates causes over 35,000 deaths annually in the United States.",
      "summaryTimestamp": 1771626087866
    },
    {
      "id": "3b2481d6792da864",
      "title": "How Dealers Should Answer the “Most Reliable Tractor” Question",
      "link": "https://www.farmjournal.com/how-dealers-should-answer-the-most-reliable-tractor-question/",
      "description": "Every dealer hears it:“What’s the most reliable tractor you sell?” It sounds like a product question. It’s actually a trust question. Farmers aren’t asking you to crown a winner. They’re asking whether this decision will cost them time, money, or sleep when it matters most. Dealers who lead with a brand name risk missing the [&#8230;] The post How Dealers Should Answer the “Most Reliable Tractor” Question appeared first on Farm Journal.",
      "date": "Wed, 18 Feb 2026 17:40:26 +0000",
      "timestamp": 1771436426000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "It emphasizes that this is not a simple product question, but rather a question of trust - farmers want to know if the tractor decision will cost them time, money, or sleep when it matters most.\n\nThe key points are:\n\n1. Reframe reliability as \"uptime\" rather than just a brand name. Guide the buyer with questions about service, response times, and parts availability.\n\n2. Clarify the farmer's ownership strategy - is this a long-term workhorse or a short-term asset? Recommend accordingly.\n\n3. Use auction data to show real-world resale performance, which reflects serviceability and familiarity more than marketing.\n\n4. Be transparent about current market conditions and timing, as that also impacts reliability.\n\nThe article recommends a \"Dealer Reliability Framework\" focused on service/uptime, ownership timeline, market conditions, and real-world resale data - rather than just promoting a brand name. Dealers who provide this intelligence can build trust and help farmers make confident decisions.\n\nExperts quoted include Casey Seymour of Farm Journal and Greg Peterson (Machinery Pete), who emphasize that trust and data are the most reliable assets for dealers today.",
      "summaryTimestamp": 1771619208535
    },
    {
      "id": "3f163697760370cb",
      "title": "Is sulfur a mobile nutrient? Carryover, soybean needs, and S fertilizer product differences",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/is-sulfur-mobile-nutrient-carryover.html",
      "description": "",
      "date": "Wed, 18 Feb 2026 16:18:00 +0000",
      "timestamp": 1771431480000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiOtoX-b7TpUq6A3latdUM9EUBoGHh-sESpflBLiNnYGObDuP8001MQvv13RiAQwkttoFycgLXtDJtjbBOhCmPaHYdVTDSj3eU2uojmt8CrTpYE8ho9lDKuT6NvyQ3WT4ls6C6y9BgjHjPFzWnczwfU_wys37XK9RK_jV9Avw9pAie2YdhgxkWJnBgzmyg/s72-w640-h426-c/Sulfur%20deficiency%20(1)%20(1).JPG",
      "summary": "Key points:\n\n- Research funded by AFREC and Minnesota Soybean shows that applying 10 lbs of sulfate per acre for 4 years resulted in sulfur carryover for at least 2 more years, meeting corn's sulfur needs. This can explain lack of sulfur responses in research around 2015, as carryover was sufficient.\n\n- Soybeans do need sulfur, but direct application may not always benefit yield. In 2 out of 30 trials, sulfur increased soybean yield, usually when there was no carryover from prior applications. \n\n- Applying 20 lbs of sulfur per acre, regardless of source, ahead of corn in a corn-soybean rotation benefited both crops. Soybean benefits from sulfur applied to the prior corn crop.\n\n- For sulfate application timing, spring is best for crops with high sulfur demand like corn, alfalfa, and canola. Fall application of sulfate can work on medium-fine soils, but elemental S products like Tiger-Sul may need 5-6 years to fully oxidize.\n\n- Recommendations: Avoid immediately incorporating elemental S or S-bentonite products; allow 2+ weeks before incorporation. Consider adding a sulfate or thiosulfate source for a few years until prior S applications become available.\n\nThe research was funded by AFREC and the Minnesota Soybean Research and Promotion Council.",
      "summaryTimestamp": 1771612844779
    },
    {
      "id": "eee5dfde7aa21501",
      "title": "MN CropCast: Unlocking the soybean genome with Dr. Bob Stupar",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-unlocking-soybean-genome.html",
      "description": "",
      "date": "Wed, 18 Feb 2026 13:59:00 +0000",
      "timestamp": 1771423140000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-w320-h320-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "Key points:\n\n- Dr. Bob Stupar, Professor of Agronomy and Plant Genetics at the University of Minnesota, was interviewed on the Minnesota CropCast podcast (Episode #57) about unlocking the soybean genome.\n\n- Dr. Stupar discussed the critical process of identifying genes of interest, validating their functionality, and engineering soybeans to possess important, novel traits.\n\n- He highlighted the importance of maintaining and updating reference genomes - the essential \"blueprints\" for scientific advancement. \n\n- Gene editing is being used to improve soybean quality traits, such as reducing antinutritional components.\n\n- Dr. Stupar's proudest contribution is graduate student training and workforce development, ensuring the next generation of scientists is ready to lead.",
      "summaryTimestamp": 1771605257298
    },
    {
      "id": "f00341ed4caab4b8",
      "title": "Confusion and ‘More Chaos’ as States Implement SNAP Food Restrictions",
      "link": "https://civileats.com/2026/02/18/confusion-and-more-chaos-as-states-implement-snap-food-restrictions/",
      "description": "Since 2018, the entrepreneurial couple has benefited from the Supplemental Nutrition Assistance Program (SNAP), which they’ve used to support themselves and their children, and to keep the business running. As small business owners who strive to offer good-paying jobs to their employees and give back to the community as much as possible, they don&#8217;t have [&#8230;] The post Confusion and ‘More Chaos’ as States Implement SNAP Food Restrictions appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 09:01:55 +0000",
      "timestamp": 1771405315000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/confusion-and-more-chaos-as-states-implement-snap-food-restrictions-3.jpg",
      "summary": "Since 2018, an entrepreneurial couple has been using SNAP benefits to support their family and keep their small business running. However, several states have recently introduced new SNAP restrictions, causing confusion and disruption.\n\nThe new SNAP rules limit the types of food that can be purchased using the benefits. This has created more chaos for small business owners who rely on SNAP customers, as they struggle to navigate the changing regulations.\n\nExperts warn that these SNAP restrictions could have significant impacts on farmers and small food businesses. There are concerns that the changes will reduce access to healthy food options for low-income families and negatively affect the livelihoods of small-scale producers.\n\nThe article does not provide specific numbers, statistics, or expert quotes. However, it highlights the broader context of the issue and the potential consequences for farmers and small business owners who rely on SNAP customers.\n\nThere are no clear recommendations or action items provided in the article. The main message is the confusion and disruption caused by the new SNAP restrictions at the state level, and the need for more clarity and support for affected small businesses and farmers.",
      "summaryTimestamp": 1771591816660
    },
    {
      "id": "957a1f1f771b103e",
      "title": "Improving waterhemp control by managing spray water pH",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/improving-waterhemp-control-by-managing.html",
      "description": "",
      "date": "Tue, 17 Feb 2026 14:15:00 +0000",
      "timestamp": 1771337700000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjeGlAeUiIBJwZ4ctdI_mh3flmZnZDe1nFx16EXbclg1M8atbqYH_Xnnt3-JfrmgGmGbBwHH5H33fOEGg6b0sSN7CahvuZ-iy5vx9RgUnKXjkMJF4kkRXM0pzAtMV7cPSr0sak0-n0U6FoTAU25EBDPGpwr010UzmhX6cqqz4RHdnBZDzsHENZGLrWTXS3e/s72-c/Spray%20Truck%20broadjet%202.jpg",
      "summary": "The key points from the article are:\n\n- A 2025 field study in Rochester, Minnesota evaluated how spray water pH adjustment and timing of spray solution mixing affected waterhemp control in a corn herbicide program.\n\n- All treatments included a tank mix of atrazine and Acuron GT (applied at full or half rate) with NIS and AMS. Treatments differed by presence/absence of a pH-lowering adjuvant (AlpHa Shot) and timing of spray solution mixing (6 days prior or at time of spraying).\n\n- Adding the pH-lowering adjuvant reduced spray water pH from 7.5 to 5.8, improving waterhemp control by 10% at 24 days after treatment (DAT) and 7% at 112 DAT.\n\n- Waterhemp density decreased by 64% and biomass reduced by 55% with the pH-adjusting adjuvant, resulting in lower late-season weed pressure and seed production.\n\n- Timing of mixing the pH adjuster (6 days ahead or at spraying) did not affect waterhemp control, density or biomass.\n\n- The response to pH adjustment was seen at both full and half rates of Acuron GT, indicating water quality can influence herbicide performance regardless of rate.\n\n- Adjusting and buffering spray water pH is a simple step that can protect herbicide performance and improve season-long weed management when water makes up most of the spray tank.",
      "summaryTimestamp": 1771690971479
    },
    {
      "id": "9f513a14fe07e323",
      "title": "5 Cover Crops You Can Plant in February",
      "link": "https://modernfarmer.com/2026/02/cover-crops-february/",
      "description": "Most farmers plant cover crops in the fall, and let the winter terminate them before they go to seed. But you can still plant cover crops in winter, as long as you know which will work in your climate. Plant these five cover crops this month for early spring benefits. The post 5 Cover Crops You Can Plant in February appeared first on Modern Farmer.",
      "date": "Tue, 17 Feb 2026 10:00:48 +0000",
      "timestamp": 1771322448000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/10/Fresh-spinach-plants.webp",
      "summary": "Spinach - Spinach is an easy cold-season cover crop that can be sown densely now. It increases good soil bacteria and fungi, and is especially beneficial for plots where peppers will be planted later. Requires soil temperature of at least 40°F (4°C) to germinate.\n\n2. Kale - Kale is a multipurpose cover crop that feeds the soil, provides greens for you and your livestock, and can generate revenue at markets. It requires slightly warmer soil of at least 45°F (7°C). Resistant varieties are recommended in disease-prone areas.\n\n3. Daikon Radish - Also called forage radishes, the long taproots of daikon radish reach deep into the soil, breaking up compaction and improving tilth. They scavenge leftover nitrogen. Can be sown in February if soil is at least 65°F (18°C).\n\n4. Oats - Oats grow quickly, covering the soil and preventing weed growth. They form beneficial relationships with fungi that support subsequent crops. Oats can tolerate temperatures down to 20°F (-7°C) before terminating. Sow at a rate of 4-6 oz per 100 sq ft. Combining with peas provides nitrogen-fixing benefits.\n\n5. Buckwheat - Buckwheat is a quick-maturing \"phosphorus scavenger\" that conditions poor soils. It attracts pollinators and beneficial insects. Can be sown now and used as an organic mulch after flowering.\n\nThe article emphasizes the benefits of cover crops for soil health, including sequestering carbon, protecting against erosion, and improving groundwater. Planting these cover crops in February can boost the yields of subsequent spring crops.",
      "summaryTimestamp": 1771662301515
    },
    {
      "id": "25644925eb82eddc",
      "title": "Strategic Farming: Let's talk crops! session talked forecasting tools for crop and pest management",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops_16.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 17:43:00 +0000",
      "timestamp": 1771263780000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjO5aunE_uoVkP9LI9r3n8Dpm1IiJYW5pClHH3uqDnphvgKN3zj95NHyH7Ib8koR8fdTGW4AQmGObBUNmu22C0wNVn5PrnuC8DgcU7Gyf7-CdmWQ9X4pl47Keqb17PkwaKW08g3fQ1U8NdyxSyPn4MmaV6U0BvAl8Rva_OHxg2nVLbxGiXOK704ccEkD1Vg/s72-w241-h320-c/noaa-mn-low-temps-feb7.jpg",
      "summary": "Topics covered included:\n\n- Overwintering insect pests: Insects use strategies like producing antifreeze compounds to survive cold Minnesota winters. Temperatures below -29°F can kill 50-95% of soybean aphid eggs, while soil temps below 10°F can reduce corn rootworm egg survival by 60%.\n\n- Forecasting migratory pests: Pheromone traps and degree day models are used to predict the arrival and development of pests like black cutworm, potato leafhopper, and corn earworm that migrate northward each season.\n\n- Crop disease forecasting: The IPM PIPE website maps the spread of diseases like southern rust and tar spot of corn to alert farmers. The Minnesota Ag Weather Network provides data on weather conditions that influence disease risk.\n\n- Pest and disease degree day models: The North Dakota Ag Weather Network (NDAWN) hosts numerous degree day calculators to time management practices for pests and diseases in crops like corn, wheat, sugarbeets, and canola.\n\n- Expert recommendations: Scouting fields is still essential to verify predictions from forecasting tools. Farmers should consult resources like the Fusarium Head Blight risk tool and leaf rust models to manage diseases in small grains.\n\nThe webinar series runs through March 2026, and recordings are available online. The expanding Minnesota Ag Weather Network aims to provide more localized data to support these forecasting tools for farmers.",
      "summaryTimestamp": 1771619212734
    },
    {
      "id": "67a14bb588f7d967",
      "title": "Help the Crops Team fine-tune programming!",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/help-crops-team-fine-tune-programming.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 16:30:47 +0000",
      "timestamp": 1771259447000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhCxd5PtQ8nJrtOb4X1Tz1md-IIKn225eI96PLlJgYOzihrHu8OUq4wBg-ocPXUHBdOkMO_NFZ1aPkpH1kdhqKdcIxaHijDP6s54fOuTloYefpKielhFj8Psev7G7MakTpjRcGWQ7Srb96x6RmLgtHNGcud3o7ZvUBqlI9eWAjZQ3jAzV9mLOeT01AkqSM4/s72-c/weed-management-field-day-sarangi.jpg",
      "summary": "The University of Minnesota Extension Crops Team is conducting a survey to better understand the educational needs and preferences of row crop and forage producers, as well as agriculture professionals who work with them. The goal is to customize their educational programs to the interests of these stakeholders.\n\nThe survey is anonymous and takes 12-15 minutes to complete. It aims to gather information about participants' operations, learning preferences, and how they want to engage with Extension. The Crops Team wants to use the survey responses to develop and deliver programming that meets the needs of producers and professionals.\n\nThe survey is open until February 16, 2026. All row crop and forage producers, as well as crop consultants, seed salespeople, pesticide applicators, grain buyers, and other agriculture professionals, are encouraged to participate. Their input will help the Crops Team refine their programming to ensure it is useful and relevant.",
      "summaryTimestamp": 1771612847530
    },
    {
      "id": "b4602ee8b589516a",
      "title": "Freeze, Thaw, Seed: Timing Pasture Renovation in an Unpredictable Winter",
      "link": "https://crops.extension.iastate.edu/post/freeze-thaw-seed-timing-pasture-renovation-unpredictable-winter",
      "description": "<p>This winter’s erratic weather, swinging from –30°F wind chills to unseasonably warm temperatures in the 50s, has left many wanting spring and ready to get back in the fields. Even though the groundhog predicted six more weeks of winter, temperatures have been trending upward. Over the next week, highs are expected to stay above freezing during the day and drop below freezing at night. These natural freeze–thaw cycles signal the slow transition into spring. </p>",
      "date": "Fri, 13 Feb 2026 11:51:43 -0600",
      "timestamp": 1771005103000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Main news/finding: Erratic winter weather with extreme temperature swings presents an opportunity for farmers to thicken forage stands through frost seeding.\n\nKey numbers/statistics:\n- Highs expected to stay above freezing during the day and drop below freezing at night over the next week.\n- Frost seeding can be a cost-effective way to rejuvenate a declining stand or introduce new legumes.\n\nDates/deadlines: None mentioned.\n\nPeople/organizations/programs:\n- Shelby Gruss, Assistant Professor Forage Extension Specialist at Iowa State University\n- Iowa State University Extension and Outreach\n\nLocations: Iowa\n\nContext/causes: The unpredictable winter weather, swinging from extreme cold to unseasonably warm temperatures, is creating conditions suitable for frost seeding.\n\nImpacts for farmers: Frost seeding can be used to thicken forage stands and introduce new legumes, which can help rejuvenate declining pastures in a cost-effective way.\n\nRecommendations/action items:\n- Farmers should consider frost seeding to take advantage of the current freeze-thaw cycle.\n- For more information on best practices for frost seeding, review the \"Frosting Seeding Legumes\" article.\n\nExpert quote:\n\"Her research focuses on optimizing forage-based systems through strategies to enhance resilience and productivity in annual and perennial forage through different management strategies. Current research projects focus on diversification, whether it be in a rotation with cover crops, intercropping for forage establishment, or utilizing different species to help break disease cycles.\"",
      "summaryTimestamp": 1771540065130
    },
    {
      "id": "9a2b8ede909ba045",
      "title": "Frosting Seeding Legumes",
      "link": "https://crops.extension.iastate.edu/encyclopedia/frosting-seeding-legumes",
      "description": "<p>Frost seeding involves strategically broadcasting or overseeding legumes, such as red clover, into a tired pasture or within a small grain stand. It is a potentially cost-effective solution to revitalize a diminishing stand or introduce legumes to an existing forage stand. Frost seeding is usually not recommended with grass species. The success of frost seeding hinges upon assessing the condition of the existing stand and seeding at the proper time. </p>",
      "date": "Fri, 13 Feb 2026 11:47:51 -0600",
      "timestamp": 1771004871000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "It is a cost-effective way to revitalize a diminishing forage stand or introduce legumes. Timing is critical, with frost seeding typically done between mid-February and early March to take advantage of freeze-thaw cycles that help incorporate the seed. \n\nA thick thatch can hinder success, so it's recommended to hay or overgraze the area in the prior fall/winter to open up the canopy. Sandy or very dry soils are less ideal, with loam or clay soils preferred. Adequate spring moisture is vital for establishing a healthy stand after frost seeding.\n\nThe article was authored by Shelby Gruss, an assistant professor and forage extension specialist at Iowa State University who joined the department in November 2023. Her research focuses on optimizing forage systems through strategies like diversification, cover cropping, and disease management.",
      "summaryTimestamp": 1771540067975
    },
    {
      "id": "ee41cb05521ef609",
      "title": "All Day Ag Outlook Conference March 3 at the Beef House",
      "link": "https://farmdoc.illinois.edu/field-crop-production/all-day-ag-outlook-conference-march-3-at-the-beef-house.html",
      "description": "The 36th annual All Day Ag Outlook will be held Tuesday, March 3, at the Beef House in Covington, Indiana. Join the WILLAg analysts and the farmdoc team for the day. We&#8217;ll cover the basics this year, including the markets, weather, weeds, trade, competition, land values, and crop insurance decisions. Click the registration link for complete details. Doors open at 7:30 a.m. central / 8:30 a.m. eastern and include both coffee and rolls in the morning and a Beef House lunch.&#8230;",
      "date": "Fri, 13 Feb 2026 13:55:21 +0000",
      "timestamp": 1770990921000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/ADAO-Header.png",
      "summary": "The 36th annual All Day Ag Outlook conference will be held on Tuesday, March 3, 2026, at the Beef House in Covington, Indiana. The event will feature a variety of topics, including:\n\n- Weather outlook by Eric Snodgrass of Nutrien Ag Solutions\n- Grain market fundamentals by Joe Janzen of the University of Illinois\n- South American competition by Joana Colussi of Purdue University\n- Soybean panel by the WILLAg team (Ellen Dearden, Greg Johnson, Chip Nellinger)\n- Corn panel by the WILLAg team (Curt Kimmel, Matt Bennett, Brian Stark, Mike Zuzolo)\n- Weeds by Aaron Hager of the University of Illinois\n- The value of farmland by Bruce Sherrick of the University of Illinois\n- Where to trim crop budgets by Nick Paulson of the University of Illinois\n- Crop insurance decisions by Gary Schnitkey of the University of Illinois\n\nRegistration for the event is $40 per person by February 27, 2026, and $60 thereafter. Media may register for free. The event starts at 7:30 a.m. central / 8:30 a.m. eastern and includes coffee, rolls, and a Beef House lunch.",
      "summaryTimestamp": 1771705218629
    },
    {
      "id": "3f08825939c7efbd",
      "title": "7 Vegetables to Start From Seed in February",
      "link": "https://modernfarmer.com/2026/02/vegetable-seed-february/",
      "description": "It takes a lot to get the farm ready for the growing season. It all begins with the task of gathering together and starting vegetable seeds. February is an ideal time to get many of your spring crops going. Consider these 7 vegetables as you prepare your rows. The post 7 Vegetables to Start From Seed in February appeared first on Modern Farmer.",
      "date": "Mon, 09 Feb 2026 12:00:00 +0000",
      "timestamp": 1770638400000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/03/Sowing-tomato-seeds-in-tray.webp",
      "summary": "Key vegetables to start from seed in February include:\n\n- Slow-growing herbs like basil and rosemary, which can take 1-4 weeks to germinate.\n- Tomatoes, which need 80+ days from seed to fruit and do best with determinate varieties in short-season regions.\n- Peppers, which can take up to 1 month to sprout and need 2+ months to mature. Jalapeños, serranos, and shishitos are highly productive.\n- Brassicas like broccoli, cabbage, and kale, which thrive in cool weather and can provide baby greens in 1 month.\n- Lettuces, which grow quickly and are easy to start directly in the ground or in flats.\n- Carrots and parsnips, which need to be direct-sown as their taproots don't like disturbance.\n- Onions and leeks, which take 1-2 weeks to sprout and 75-140 days to mature.\n\nThe article advises using protected growing environments like greenhouses, cold frames, and tunnels to get these vegetables started early and ensure they can thrive once the weather warms up. This allows farmers to maximize their growing season and yields.",
      "summaryTimestamp": 1771662305074
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this past week were 8-18 degrees below average, with lows reaching 7 below zero in parts of central Illinois. January overall was around 2 degrees below normal statewide. Precipitation was scarce, with most areas receiving less than 0.1 inches of light snow. January ended about 2 inches drier than normal, despite heavy snowfall in southern Illinois that produced little liquid water equivalent. \n\nLooking ahead, temperatures are expected to warm into the 40s and 50s next week, but precipitation will remain limited to less than 0.1 inches. The third week of February is forecasted to be warmer and wetter than average.\n\nThe article also highlights a panel discussion from the December Illinois Extension conference. Experts John Jones (soil scientist), Gary Schnitkey (agricultural economist), and Laura Gentry (Illinois Corn Growers) advised that corn production should focus on maximizing profits, not just yields. They discussed how the N-Rate Calculator and Precision Conservation Management program can help farmers optimize nitrogen applications to protect watersheds and their bottom line.\n\nFinally, the article mentions upcoming radio programming, including the Commodity Week and Closing Market Report podcasts.",
      "summaryTimestamp": 1771705222356
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Farmers are using new search methods like AI-assisted tools, voice search, and quick-scan platforms that often provide answers without requiring a click. As a result, attention metrics like time spent, scroll depth, and ad viewability are now more important indicators of advertising effectiveness. Experts recommend that agricultural advertisers focus on maximizing attention and engagement rather than just clicks and conversions. This shift is driven by changes in farmer search behavior, with AI and voice search reducing the need for direct clicks. Advertisers need to adapt their strategies to this new landscape in order to effectively reach and connect with their farmer audience.",
      "summaryTimestamp": 1771591818875
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "The study looked at 4 systems: conventional tillage (CT), fall strip-tillage (ST), no-tillage (NT), and no-tillage with a cereal rye cover crop (NT+CR). Each system was paired with 3 starter fertilizer strategies: unfertilized control, 15 lb N/ac, and 15 lb N/ac + 10 lb S/ac.\n\nKey findings:\n- Starter fertilizer increased early-season soybean biomass by ~12% but did not improve final yields.\n- Soybean yields ranged from 60-95 bu/ac across the 6 locations, with no significant differences among tillage/cover crop systems.\n- While yields were similar, differences in operational costs led to the highest partial net returns for NT, followed by ST and CT. NT+CR had the lowest net returns due to cover crop management costs.\n\nThe project will continue into 2026 to track medium-term soil and nutrient dynamics under the conservation systems. Preliminary results suggest growers can maintain soybean productivity while using reduced tillage and cover crops, but economic factors like cost savings are important.",
      "summaryTimestamp": 1771705226889
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "Greenhouses trap thermal heat to warm plants, with some offering advanced features like ventilation, irrigation, and climate controls.\n\nDifferent types of greenhouses are covered, including modular plastic greenhouses that can raise temperatures by up to 30°F, low tunnels that increase temps by 2-15°F, and cold frames that handle snow loads. Larger, designer greenhouses with concrete foundations and climate controls allow year-round growing.\n\nFor February planting, the article recommends starting tomatoes, peppers, brassicas like kale and cabbage, lettuces, potatoes, onions, and flowers like lisianthus and dahlias. These crops benefit from the head start provided by greenhouse growing before outdoor planting.\n\nSpecific details provided include:\n- Tomatoes and peppers need consistent 50°F+ temperatures, and can even grow at 40°F with a heating mat\n- Brassicas like cauliflower and romanesco take 2-5 months to mature in a greenhouse\n- Lettuces, onions, and potatoes can be grown for early spring harvests\n- Flower seeds that take a long time to sprout, like lisianthus, do well with greenhouse growing\n\nThe article emphasizes the flexibility and year-round potential of greenhouses, even for small-scale and home gardeners. It provides recommendations to maximize greenhouse growing based on the type of structure.",
      "summaryTimestamp": 1771662309502
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "S. avocado supply chain. The inaugural 3-day conference will be held on November 18-20, 2026 at the Hilton San Diego Bayfront. \n\nThe conference aims to bring together every segment of the avocado industry - including producers, exporters, importers, packers, retail and foodservice buyers - to collaborate, share data-driven insights, and align on strategies to strengthen the avocado category. Sessions will cover global avocado production and trade, retail/foodservice market trends, consumer insights, marketing programs, economic factors, and Hass Avocado Board's initiatives to expand avocado demand.\n\nThe Hass Avocado Board, which is supporting the conference content, sees it as a unique platform to unite the industry and accelerate sustainable growth in U.S. avocado consumption. Stakeholders attending will include growers, packers, importers/exporters, buyers, suppliers, and data/insights providers like CIRAD, Circana, and Dataessential.\n\nThe conference is scheduled for November 18-20, 2026 in San Diego, California. More information on sponsorship and attendance is available at www.theavocadoconference.com. The event is being organized by Farm Journal, the nation's leading agricultural media company, in collaboration with the Hass Avocado Board.",
      "summaryTimestamp": 1771591822325
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Iowa State University Pesticide Safety Education Program has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. The updated training manuals, including the Iowa Core Manual (CS445) and the Private Pesticide Applicator Manual (CS1), are available through the ISU Extension Store. New exams based on the revised core manual are also available at all Iowa Department of Agriculture and Land Stewardship test sites. The Private Pesticide Applicator Manual now includes a two-page informational update, and all private exams now include content from this insert. Farmers can contact Betsy Danielson, the Pesticide Safety Education Extension Specialist, for more information at betsydan@iastate.edu.",
      "summaryTimestamp": 1771591824895
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Lead generation should focus on delivering real value in exchange for a farmer's time and attention. The choice of call-to-action (CTA) and offer shapes not only the number of leads captured, but also their quality, motivation, and purchase-readiness. The article encourages shifting the mindset from what the business wants to collect to what farmers genuinely need.",
      "summaryTimestamp": 1771591826750
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this week were 4-8 degrees below normal across Illinois, with overnight lows dipping into the single digits and even below zero in some areas. Strong winds also contributed to dangerously low wind chill values around -20 on some days.\n\nPrecipitation has been very dry so far in January, with less than half an inch recorded in Carbondale (4th driest on record) and Charleston (10th driest). The cold temperatures are expected to continue for at least another week, with most of northern Illinois remaining below freezing.\n\nHowever, a major winter storm is forecast to bring significant snowfall to southern Illinois this weekend, with 8-12 inches expected south of Interstate 64, and isolated heavier totals possible. Central Illinois is predicted to see around 3-4 inches of snow.\n\nThe article also includes information about the weekly Commodity Week radio program and Closing Market Report on WILL AM580, which provide market analysis from experts like Chip Nellinger, Brian Stark, and Arlan Suderman.",
      "summaryTimestamp": 1771705230771
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Some key points:\n\n- Traditional SEO (search engine optimization) focused on winning the click, but the new focus is on winning brand authority and trust through AEO.\n\n- Farmers are increasingly turning to AI-powered platforms like ChatGPT and Google's AI Overviews for instant answers, rather than traditional search engines. Brands need to be present in these new discovery channels to avoid becoming invisible.\n\n- At Farm Journal, they are observing this shift in real-time and advise that an \"answer-driven content strategy\" and amplifying trusted voices will be more important than ever for ag marketers.\n\n- Discoverability is now about ensuring your expertise, content, and brand authority surface at the exact moment your audience is looking for answers, across all channels where they're searching.\n\n- In the AEO era, discoverability is about winning the citation, brand mention, and trusted source reference that builds authority, even in \"zero-click\" moments.\n\nThe article emphasizes the need for ag marketers to reevaluate their 2026 strategies to adapt to this evolving landscape of agricultural information discovery.",
      "summaryTimestamp": 1771591831885
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Key Takeaways:\n\n1. Forest farming, also known as multi-story cropping or agroforestry, integrates farming within forested land, combining small-scale farming with conventional forestry. It's a way to seamlessly incorporate the farm into the landscape and diversify farm products.\n\n2. This practice originated in Brazil's tropical rainforests and can benefit farms with existing forested land, offering ecological and financial advantages.\n\n3. Benefits include improved water and soil quality, carbon sequestration, habitat for beneficial organisms, and the ability to grow specialized crops like mushrooms, ramps, syrups, and edible roots.\n\n4. Suitable land includes existing forests, reforested areas, and land with riparian areas surrounded by trees. Even small farms with some forest cover can benefit.\n\n5. Before implementing, farmers should inventory their natural resources, consult extension offices for management plans, and research local markets for specialty forest crops.\n\n6. Regulations around wild plant species must also be considered, especially for international trade.\n\n7. Overall, forest farming can be a viable option for diversifying farm operations and improving environmental sustainability, even on a small scale.",
      "summaryTimestamp": 1771662312931
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "Summary:\n\nSpray drones are increasingly being evaluated by Iowa farmers as a tool for crop input application. When used properly, they can provide flexibility, reduce field traffic, and improve access to hard-to-reach areas. However, adopting spray drone technology requires careful consideration of regulations, training, insurance, and management practices.\n\nKey Points:\n- Farmers should identify specific challenges they are trying to address with spray drones, such as making applications on wet soils, applying to tall crops, reducing compaction, or supplementing existing spraying capacity.\n- Regulatory requirements include an FAA Part 107 Remote Pilot Certificate, FAA Part 137 Certification for aerial pesticide application, and Iowa Department of Agriculture and Land Stewardship (IDALS) licensing.\n- Insurance needs include chemical liability, general liability, and hull/physical damage coverage. Providers typically require FAA Part 137 certification.\n- Equipment selection factors include spray tank capacity, battery life, nozzle options, and GPS guidance features.\n- Proper training is essential for safe and effective operation, including calibration, weather monitoring, and maintenance.\n- Farmers are encouraged to start on a limited scale, comparing results to conventional methods, before expanding adoption.\n- Resources available include Iowa State University programs, the Digital Agriculture Innovation Lab, licensed dealers, and IDALS.\n- Ongoing technology improvements in areas like payload, automation, and data integration will shape the long-term role of spray drones.\n\nA 2-day FAA Part 107 training workshop is scheduled at the Digital Ag Innovation Lab in Ames, IA on February 24-25, 2026. The registration link is provided.",
      "summaryTimestamp": 1771591836341
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "Vegetables:\n- Cabbages - Thrive in cold weather, can get sweeter flavor with frost. Standard, Napa, and 'Carex' shorter-maturing varieties recommended.\n- Spinach - Tolerates frost, many varieties like 'Avon' and 'Space' available. \n- Onions - Bulbing onions, bunching onions, shallots, and chives do well when winter sown.\n- Leafy greens - Kale, collards, chard, watercress, microgreens, bok choy, arugula, turnip/beet greens all thrive.\n\nFlowers:\n- Pansies - Hardy, produce spring blooms.\n- Echinacea - Needs cold stratification, benefits integrated pest management.\n- Snapdragons - Prefer cool weather, come in 4 groups for different climate needs.\n- Larkspur - Produces rare true-blue blooms, attracts pollinators.\n- Scabiosa - Draws beneficial insects, makes great fresh/dried arrangements.\n\nThe winter sowing method involves planting seeds in reused containers outdoors, where the cold, moist conditions help break seed dormancy. This leads to hardier seedlings that mature faster than traditional methods.\n\nThe article highlights the benefits for farmers, including maximizing profits, productivity, and diversifying product offerings. It provides variety recommendations for different climates and farming goals.",
      "summaryTimestamp": 1771662317640
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series will be held at 12 locations across Iowa from January 6-29, 2026. The meetings are organized by Iowa State University Extension and Outreach to provide farmers and crop production professionals with the latest research-based information to help them make informed decisions for the upcoming growing season.\n\nKey details:\n- Dates and locations: Jan 6 (Sioux Center), Jan 7 (Storm Lake), Jan 8 (Burlington), Jan 9 (Mason City), Jan 13 (Estherville), Jan 15 (Waterloo), Jan 16 (Davenport), Jan 21 (Ankeny), Jan 22 (Atlantic), Jan 27 (Iowa City), Jan 28 (Le Mars), Jan 29 (Carroll)\n- Early-bird registration is $75 until the week before each meeting, late/on-site registration is $100\n- Registration includes refreshments, lunch, certified crop advisor credits, and access to resources\n- Private pesticide applicator recertification is available for a $30 fee\n- Topics include crop market and climate outlooks, nitrates and drinking water, profitable nutrient management, southern rust, transition planning, robots and drones, and more\n- The goal is to help producers manage potential issues by sharing the latest scientific knowledge from Iowa State researchers\n- Contact crops@iastate.edu or your regional ISU Extension agronomist for more information",
      "summaryTimestamp": 1771591840811
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10 at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5.\n\nThe event will feature research on the value of sorghum as a forage crop compared to corn. Key highlights:\n\n- Sorghum is more drought-tolerant and has lower nitrogen requirements than corn, and it is not a host for the tar spot pathogen.\n- Agronomy experts like Mitch Tuinstra will share plant breeding techniques to improve sorghum yield and quality.\n- Other speakers include Brad Shelton, Jason Tower, Nick Minton, and Jeff Jackson.\n- Venue tours will be available from 3-5 pm and 6-8 pm, and a dinner and bull test station tour will be held from 5-6 pm.\n\nThis event aims to provide farmers with information on the potential benefits of using sorghum as a forage crop. Participants are encouraged to register by the September 5 deadline.",
      "summaryTimestamp": 1771591847268
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Purdue/CME Group Ag Economy Barometer index rose 8 points to 113, while the Index of Current Conditions increased by 10 points to 100 and the Index of Future Expectations rose 7 points to 119. \n\nThis positive shift was attributed to fewer respondents reporting worsened conditions compared to a year ago and a decrease in those expecting negative future outcomes. However, high input costs (34%) and risk of lower crop/livestock prices (29%) remained the top concerns for farmers.\n\nThe Farm Financial Performance Index dropped 4 points in July to 81, 6 points lower than July 2023. This reflected farmers' worries about weakening commodity prices and high input costs. \n\nThe Farm Capital Investment Index rose 6 points to 38 in July, though it remains 7 points lower than a year prior. This was due to a decrease in the number of producers who believe it's a bad time to make large investments, from 80% in June to 75% in July.\n\nThe Short-Term Farmland Value Expectations Index improved slightly to 118, while the Long-Term Farmland Value Expectations Index dropped 6 points to 146. About 72% of crop farmers expect cash rental rates to remain roughly the same in 2025 compared to 2024.\n\nThe Purdue University Center for Commercial Agriculture and CME Group conducted the survey from July 15-19, 2024. The barometer's principal investigator is James Mintert of Purdue.",
      "summaryTimestamp": 1771591854270
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The fungal disease has spread from Latin America to 16 U.S. states and Ontario, Canada since first being detected in the U.S. in 2015. \n\nThe research team, led by C.D. Cruz, is using a mix of statistical analysis, data science, epidemiology, microbiology, artificial intelligence, and computer vision to better understand the dynamics of tar spot. Their work is funded by two USDA grants totaling nearly $1.1 million.\n\nKey aspects of the research include:\n- Developing a digital method to quantify tar spot using an algorithm that can detect and classify disease symptoms in 2 seconds.\n- Integrating drone imagery, weather data, and traditional disease evaluations to build AI models that can detect and track tar spot.\n- Characterizing tar spot epidemics at different scales using disease observations and drone data.\n\nThe interdisciplinary nature of the project, involving experts from agriculture and engineering, aims to provide rapid, accurate information to stakeholders and tackle the biosecurity challenges posed by this emerging disease. Collaborators include researchers in Colombia, Mexico, Ecuador, South Korea, and the U.S.",
      "summaryTimestamp": 1771591860391
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana Sheep Association (ISA), with additional support from the Indiana Sheep and Wool Market Development Program (IN S&W), is hosting a variety of sheep-themed events and competitions at the 2024 Indiana State Fair:\n\n- The Wool and Ewe Room and Ewe2 boutique will be open throughout the fair, offering fairgoers Indiana-grown wool items, livestock- and country-themed products.\n- On August 2nd at 10 a.m., there will be an open wool judging and wool sale event in the Blue Ribbon Pavilion.\n- The Make It With Wool (MIWW) competition and fashion show will take place on August 4th at 2 p.m. in the Indiana Arts Building.\n- The Indiana State Fair Shearing Contest will be held on August 4th at 5 p.m. in the Ball State University Champions Pavilion.\n- Taste from Indiana Farms event, featuring free samples of Indiana lamb, will run from August 8-11 from 11 a.m. to 6 p.m. in the Indiana Farm Bureau Fall Creek Pavilion.\n- The Sheep to Shawl competition, where youth teams create a wool shawl from scratch in 4 hours, will be on August 18th at 10 a.m. in the Indiana Arts Building.\n- Sheep can be seen in the Blue Ribbon Pavilion for open and 4-H shows from August 4-20.\n\nThe ISA is focused on showcasing the \"Art and Nature\" theme of sheep, featuring artwork from Indiana artists. One artist, Laura Winslow, donated copies of her sheep paintings that will be printed into stickers and magnets for distribution.\n\nThe Indiana Sheep Association was originally founded in 1876 as the Indiana Wool Growers Association, with the goal of promoting lamb and wool in the state and educating the community about the value of sheep and the industry. The IN S&W program supports educational, promotional, and research efforts related to sheep in Indiana, funded by a 0.5% checkoff on the net market price of each sheep sold.",
      "summaryTimestamp": 1771591867844
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- The Indiana State Fair will be held from August 2 to August 18, 2024, with the theme \"The Art & Nature of Fun\" in collaboration with Newfields.\n- Purdue Extension will have a presence at the fair, offering interactive demonstrations and activities at the Purdue Extension Building on topics such as block play, financial management, entomology, forestry, and animal sciences.\n- The Food Science Department will host an activity called \"What's Growing on My Spinach?\" to explore food microbiology and food safety, and will also offer samples of \"Cricket Rice Krispies Treats.\"\n- Seed art will be showcased in the livestock barns and the Purdue Extension Building, visually representing the fair's theme and providing educational information about the animals and agricultural topics.\n- The Purdue Ag Alumni Association will sponsor the Pioneer Village, which will transport fairgoers to the 1800s and offer activities like antique tractors, a farm toy show, and a fiddler's contest.\n- Purdue Extension exhibits will be located throughout the fairgrounds, spanning various buildings and pavilions.\n- Purdue University is a public research institution with over 105,000 students, and it is committed to affordability and accessibility, having frozen tuition for 13 years.",
      "summaryTimestamp": 1771591875014
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The University of Wisconsin-Madison has released a new publication called \"Potassium Cycle\" that provides a visual overview of the potassium cycle in Wisconsin cropping systems. The two-page publication outlines key potassium concepts and recommendations for specific situations. The publication is available for download only and was released on June 12, 2024. Farmers can access and download the publication from the UW Madison website.",
      "summaryTimestamp": 1771591877840
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Wisconsin winter wheat is 10-14 days ahead of normal growth stages due to a warm spring and timely rain.\n- There is a high likelihood of stripe rust disease appearing in Wisconsin this season, though it has not been detected yet. Farmers are advised to scout for it.\n- Fusarium head blight (FHB) is also a concern this season, as the moderate temperatures and adequate precipitation create favorable conditions. FHB can limit yields and produce the mycotoxin deoxynivalenol (DON or vomitoxin), which can lead to grain being discounted or rejected if levels exceed 2 ppm.\n- Farmers are encouraged to monitor for these diseases and take appropriate in-season management actions.\n\nThe article was posted on May 20, 2024 by Damon Smith, Extension Field Crops Pathologist, and Shawn Conley, Extension Soybean and Small Grains Agronomist, from the University of Wisconsin-Madison.",
      "summaryTimestamp": 1771591881317
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The key points from the article are:\n\n- Early in the growing season, soybean fields can experience stand losses due to various factors like freezing temperatures, hail, flooding, pests, etc.\n\n- Soybean plants can compensate for open spaces by developing axillary branches and yielding well even with lower plant populations.\n\n- Action is warranted if stand loss leaves fewer than 50,000-60,000 evenly-distributed plants per acre in southern regions, or 75,000 plants per acre in northern regions, or if there are areas over 6-10 sq ft without any plants.\n\n- Factors to consider when deciding whether to replant include: existing stand and distribution, calendar date and delayed planting effects, weed management, seed/variety availability, cost, and yield penalty of delayed replanting.\n\n- The article provides a link to a more detailed fact sheet on soybean replant decisions.",
      "summaryTimestamp": 1771591885432
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The key points from the agricultural news article are:\n\n- Farmers planning to spray 2,4-D for post-emergence broadleaf weed control in Enlist E3 soybeans can only use the 2,4-D choline formulation found in Enlist One and Enlist Duo herbicides. Other 2,4-D ester or amine formulations cannot be used post-emergence in Enlist E3 soybeans.\n\n- There have been reports of producers, agronomists, and even Certified Crop Advisors considering using the ester or amine formulations post-emergence, which is not allowed by the label.\n\n- For burndown applications, if using a 2,4-D ester or amine formulation product, there is a soybean plant back interval of at least 7 days when using 0.5 lbs ae/acre. This restriction does not apply if using Enlist One or Enlist DUO.\n\n- The article was posted on May 11, 2024 by Daniel H. Smith from the UW-Madison Division of Extension and Rodrigo Werle, a Weed Scientist and Extension Specialist at UW-Madison.\n\n- The key message is that farmers must follow the herbicide label requirements, as the label is the law.",
      "summaryTimestamp": 1771591890809
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The University of Wisconsin-Madison Division of Extension has announced the results of the Wisconsin Certified Crop Adviser (WI CCA) Board election. Rob Shields, Matt Brugger, and Chris Bandura have been elected to the WI CCA Board and will serve two, three-year terms.\n\nAll Wisconsin CCAs in good standing are eligible for nomination and can vote in future elections, which will be held again in early 2025. Daniel H. Smith, the Outreach Program Manager for the Crops and Soils Program at the University of Wisconsin-Madison Division of Extension, thanked everyone who provided nominations and voted in the recent election.",
      "summaryTimestamp": 1771591895876
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 4,
  "updated": "2026-02-21T22:19:17.166Z"
}