{
  "items": [
    {
      "id": "33bef4fbffac8ace",
      "title": "NPPC: USDA Line Speeds Program Another Step Closer to Widespread Adoption",
      "link": "https://www.morningagclips.com/nppc-usda-line-speeds-program-another-step-closer-to-widespread-adoption/",
      "description": "WASHINGTON — The National Pork Producers Council applauds the U.S. Department of Agriculture’s proposed rule to update the New Swine Inspection System’s line speed regulations to increase efficiency at pork processing plants. The proposal aims to remove maximum line speed limits for establishments operating under NSIS. Participating establishments will be allowed to set their own [&#8230;] The post NPPC: USDA Line Speeds Program Another Step Closer to Widespread Adoption appeared first on Mornin",
      "date": "Wed, 18 Feb 2026 14:31:22 +0000",
      "timestamp": 1771425082000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Since 2019, NPPC has advocated for increased line speeds. The proposal will allow participating establishments to set their own line speeds based on their ability to maintain process controls and food safety. \n\nThis change is expected to provide financial security and stability for pork producers, as the NSIS program could have saved them nearly $10 per head without the increased line speeds. In 2021-2025, FSIS conducted trials and studies that found line speeds were not the leading factor in worker injury risk.\n\nNPPC will continue working with FSIS to ensure greater efficiency and food safety in pork processing. The organization represents over 60,000 U.S. pork producers who follow ethical principles in animal care, environmental protection, and food safety.",
      "summaryTimestamp": 1771425668047
    },
    {
      "id": "52756d2d29c60c40",
      "title": "NCC Praises USDA Announcement Updating Outdated Chicken Processing Regulations",
      "link": "https://www.morningagclips.com/ncc-praises-usda-announcement-updating-outdated-chicken-processing-regulations/",
      "description": "WASHINGTON — U.S. Secretary of Agriculture Brooke Rollins today announced new actions to reduce burdens on U.S. chicken processing facilities, allowing for greater efficiency while maintaining food safety standards. The proposed rule would eliminate outdated administrative requirements that have slowed production and added unnecessary costs for American producers. “I want to thank Secretary Rollins and [&#8230;] The post NCC Praises USDA Announcement Updating Outdated Chicken Processing Regulati",
      "date": "Wed, 18 Feb 2026 14:21:43 +0000",
      "timestamp": 1771424503000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The U.S. Department of Agriculture (USDA) announced new actions to reduce burdens on U.S. chicken processing facilities, allowing for greater efficiency while maintaining food safety standards. The proposed rule would eliminate outdated administrative requirements that have slowed production and added unnecessary costs for American producers.\n\nKey points:\n- The current patchwork approach has created significant uncertainty for companies and put U.S. chicken producers at a disadvantage globally, where other countries operate at faster speeds.\n- A pilot program initiated under the Clinton administration allowed line speeds of up to 175 birds per minute (bpm), up from 140bpm. Research has confirmed that higher evisceration line speeds do not lead to increased food safety risks.\n- While the industry has been safely increasing line speeds over the past 30 years, the poultry industry's injury and illness rate has fallen 90 percent.\n- Chicken processing plants in Canada, Belgium, Germany, Brazil and Argentina all operate at line speeds of 200+ bpm, putting the U.S. at a competitive disadvantage.\n- The National Chicken Council, which represents over 95% of the chicken sold in the U.S., praised the USDA's announcement and the administration's pro-business approach.",
      "summaryTimestamp": 1771425673421
    },
    {
      "id": "a94bc61d0a32ef4b",
      "title": "Kansas Soybean Honors Dr. William Schapaugh for 47 Years of Service",
      "link": "https://www.morningagclips.com/kansas-soybean-honors-dr-william-schapaugh-for-47-years-of-service/",
      "description": "TOPEKA, Kan. &#8212; Nearly 50 years ago, Dr. William Schapaugh accepted a job as Kansas State University’s first soybean breeder. He has long partnered with the Kansas Soybean Commission, carrying out decades of checkoff-funded research to drive progress in soybean genetics. At the annual Kansas Soybean Celebration, KSC presented Schapaugh with the Pinnacle Award, the organization’s highest honor, given in [&#8230;] The post Kansas Soybean Honors Dr. William Schapaugh for 47 Years of Service ap",
      "date": "Wed, 18 Feb 2026 14:14:58 +0000",
      "timestamp": 1771424098000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "William Schapaugh, Kansas State University's first soybean breeder, is being recognized by the Kansas Soybean Commission for 47 years of service. The Pinnacle Award, the organization's highest honor, was presented to Schapaugh at the annual Kansas Soybean Celebration on February 18, 2026.\n\nSchapaugh began his career at KSU in 1979 when soybean farming in Kansas was growing exponentially. Over his decades of work, he has partnered with the Kansas Soybean Commission, conducting checkoff-funded research to drive progress in soybean genetics. He is proud of the scientific advancements, improved public soybean varieties, and the students, faculty, and collaborators he has worked with.\n\nSome key facts:\n- Schapaugh analyzed data on desktop calculators and mainframe computers early in his career, compared to the advanced equipment and data collection used today.\n- His team has focused on developing soybean varieties and germplasm that perform well in production or are useful for breeding and research.\n- Public soybean breeding programs play an important role in addressing regional adaptation, long-term needs, and traits that may not be immediately profitable.\n- Schapaugh expects future soybean breeding to become more predictive and integrate environmental data to address specific stress patterns.\n\nThe Kansas Soybean Association and Kansas Soybean Commission oversee farmer-focused advocacy, research, and outreach efforts to improve profit opportunities for Kansas's 16,000 soybean farms.",
      "summaryTimestamp": 1771425677251
    },
    {
      "id": "7820e37efaa71c03",
      "title": "Scientists Prove Shellfish Can Be Farmed Far From Shore",
      "link": "https://www.morningagclips.com/scientists-prove-shellfish-can-be-farmed-far-from-shore/",
      "description": "NEW BRUNSWICK, N.J. — Rutgers researchers have made a discovery that could change the future of seafood farming in New Jersey. A study led by marine scientist Daphne Munroe has shown that Atlantic surfclams can be successfully farmed in the open ocean. Her research, published in the North American Journal of Aquaculture, proves that offshore aquaculture is not only possible [&#8230;] The post Scientists Prove Shellfish Can Be Farmed Far From Shore appeared first on Morning Ag Clips.",
      "date": "Wed, 18 Feb 2026 14:13:50 +0000",
      "timestamp": 1771424030000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Findings:\n- Rutgers researchers have successfully farmed Atlantic surfclams in the open ocean, proving that offshore aquaculture is possible and promising.\n- The study, led by marine scientist Daphne Munroe, was funded by a grant from NOAA and done in partnership with commercial fishing companies.\n- Researchers placed over 300,000 young surfclams in specially designed cages in ocean waters off the New Jersey coast and tested their growth and survival in both spring and fall seasons.\n- Clams placed out in spring grew faster and had higher survival than those placed out in fall, likely due to calmer conditions.\n- Clams in less crowded cages were healthier and grew better, showing that space is important for farming shellfish.\n- The results showed the clams were not only surviving, but thriving, with excellent meat quality and very little grit.\n\nStatistics/Numbers:\n- Over 300,000 young surfclams were used in the study.\n- The study was funded by a grant from the National Oceanic and Atmospheric Administration (NOAA).\n\nDates/Deadlines:\n- The research was published in the North American Journal of Aquaculture.\n- The study was conducted in 2026.\n\nPeople/Organizations:\n- Daphne Munroe, marine scientist at Rutgers University\n- Laura Steeves, former postdoctoral researcher at Rutgers Haskin Shellfish Research Laboratory\n- Sarah Borsetti, fisheries researcher at Rutgers Haskin Shellfish Research Laboratory\n- Rachel Davitt, doctoral student at Rutgers University\n- Commercial fishing companies partnered in the study\n\nLocations:\n- Research was conducted in ocean waters off the coast of New Jersey.\n\nContext/Causes:\n- Aquaculture is being explored as a way to meet the increasing demand for seafood while protecting wild clam populations.\n- Offshore aquaculture can avoid challenges faced by nearshore aquaculture, such as crowding and poor water quality.\n\nImpacts for Farmers:\n- This research could open up new business opportunities for New Jersey's farming and fishing industries.\n- Offshore aquaculture could be a \"win-win\" by growing more seafood in a sustainable way and supporting local jobs.\n\nRecommendations/Action Items:\n- The researchers still need to address hurdles such as ensuring gear lasts in challenging weather and properly navigating regulations.",
      "summaryTimestamp": 1771425682136
    },
    {
      "id": "fa84b2701fcc3d91",
      "title": "12 Fertilizer Spreaders That Will Power the 2026 Application Season",
      "link": "https://www.croplife.com/iron/spreaders/12-fertilizer-spreaders-that-will-power-the-2026-application-season/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=12-fertilizer-spreaders-that-will-power-the-2026-application-season",
      "description": "From stainless steel workhorses to high-tech precision machines, see the fertilizer spreaders ag retailers will rely on in 2026. The post 12 Fertilizer Spreaders That Will Power the 2026 Application Season appeared first on CropLife.",
      "date": "Wed, 18 Feb 2026 14:08:15 +0000",
      "timestamp": 1771423695000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/12/JD-featured-150x150.jpg",
      "summary": "Key details include:\n\n- The spreaders range from stainless steel durable models to high-tech precision machines.\n- Models featured include Salford, Unverferth, Kuhn, and more from major manufacturers.\n- Key features cited include larger hopper capacities (up to 1,200 gallons), variable-rate technology, GPS-guided application, and improved precision.\n- Prices for the featured spreaders range from $30,000 to $150,000.\n- The spreaders are designed to help farmers and ag retailers meet increasing demand and tighter application requirements in the coming years.\n- Experts note the advances in technology and functionality will be critical for optimizing fertilizer use, reducing environmental impacts, and maintaining profitability for farmers.",
      "summaryTimestamp": 1771425684643
    },
    {
      "id": "08364b4876a22c38",
      "title": "Pests Keep Coming, But So Do Solutions: Growth and Innovation in U.S. Insecticides",
      "link": "https://www.croplife.com/crop-inputs/insecticides/pests-keep-coming-but-so-do-solutions-growth-and-innovation-in-u-s-insecticides/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=pests-keep-coming-but-so-do-solutions-growth-and-innovation-in-u-s-insecticides",
      "description": "From invasive species to smarter application technologies, discover how innovation and science are helping U.S. growers stay ahead of pests. The post Pests Keep Coming, But So Do Solutions: Growth and Innovation in U.S. Insecticides appeared first on CropLife.",
      "date": "Wed, 18 Feb 2026 14:03:50 +0000",
      "timestamp": 1771423430000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/12/Corn-Closeup-Photo-Rovensa-Next-Troy-Jaeger-150x150.jpg",
      "summary": "The U.S. insecticide market is growing, reaching $4.2 billion in 2022, a 5% increase from 2021. New innovations in insecticide technologies are helping farmers tackle invasive pests like the spotted lanternfly and improve application efficiency.\n\nKey findings:\n- The U.S. insecticide market grew 5% in 2022 to $4.2 billion.\n- Innovations include smart sprayers that automatically adjust application rates based on plant size and density, reducing chemical use by up to 30%.\n- Bioinsecticides, which use natural organisms to control pests, are a fast-growing segment, projected to reach $1 billion by 2027.\n- Researchers are developing insecticides targeting invasive species like the spotted lanternfly, which has caused $US 350 million in crop damage in Pennsylvania since 2014.\n\nThe increasing prevalence of invasive pests and the need for more sustainable application methods are driving innovation and growth in the U.S. insecticide market. Farmers can leverage new technologies to improve pest control and reduce environmental impact.",
      "summaryTimestamp": 1771425687636
    },
    {
      "id": "5dd0de83efebc0c5",
      "title": "Forever chemicals, once a hidden threat, may lurk in groundwater, soil",
      "link": "https://www.farmanddairy.com/news/forever-chemicals-once-a-hidden-threat-may-lurk-in-groundwater-soil/904551.html",
      "description": "PFAS “forever chemicals” are contaminating drinking water and soil in Ohio, leaving those caught in its grip dealing with health risks and costly cleanup. The post Forever chemicals, once a hidden threat, may lurk in groundwater, soil appeared first on Farm and Dairy.",
      "date": "Wed, 18 Feb 2026 14:00:03 +0000",
      "timestamp": 1771423203000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "PFAS are linked to health issues like cancer but are extremely persistent in the environment.\n\nKey details:\n- PFAS have been detected in Loveland's water supply at 15 parts per trillion (ppt), above the new federal limit of 4 ppt set for 2029.\n- Manufacturers like 3M, Dupont, BASF, and Tyco have been identified as the source of PFAS pollution in the Ohio River basin over decades. Dupont settled with Ohio for $110 million in 2023.\n- Loveland is designing a $1.3 million water treatment system to remove PFAS, but needs more funding to actually build it.\n- Experts say the full extent of PFAS contamination in the environment and food chain is still unknown, as testing methods only cover a small fraction of the thousands of PFAS compounds.\n- Biosolids used as fertilizer have also spread PFAS onto farmland, putting farmers in a difficult position.\n- The high cost of PFAS remediation and uncertainty around exposure levels have left communities and regulators struggling to address this emerging crisis.\n\nThe article highlights the significant financial and technical challenges facing local governments and farmers as they work to tackle this invisible, persistent pollution problem that they did not create.",
      "summaryTimestamp": 1771425691489
    },
    {
      "id": "eee5dfde7aa21501",
      "title": "MN CropCast: Unlocking the soybean genome with Dr. Bob Stupar",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-unlocking-soybean-genome.html",
      "description": "",
      "date": "Wed, 18 Feb 2026 13:59:00 +0000",
      "timestamp": 1771423140000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-w320-h320-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "In this episode of the Minnesota CropCast podcast, hosts Dave Nicolai and Seth Naeve interviewed Dr. Bob Stupar, a Professor of Agronomy and Plant Genetics and Legume Geneticist at the University of Minnesota.\n\nKey points:\n- Dr. Stupar discussed his path from suburban Milwaukee to leading legume genetics and genomics research at the University of Minnesota.\n- He explained the critical process of identifying genes of interest, validating their functionality, and engineering soybeans to possess important, novel traits.\n- Maintaining and updating reference genomes, the essential \"blueprints\" for scientific advancement, is crucial and can have a significant impact, as illustrated through historical examples.\n- Gene editing is being used to improve soybean quality traits, such as reducing antinutritional components.\n- Dr. Stupar's proudest contribution is graduate student training and workforce development, ensuring the next generation of scientists is ready to lead.\n\nThe Minnesota CropCast podcast, hosted by David Nicolai and Seth Naeve, discusses the progress and challenges of Minnesota's agronomic crops, featuring specialists from various crops and agronomic disciplines.",
      "summaryTimestamp": 1771425694781
    },
    {
      "id": "52ff8ab739a7ef10",
      "title": "Organic Farmers Travel to Washington D.C. to Advocate for Policy Changes",
      "link": "https://www.morningagclips.com/organic-farmers-travel-to-washington-d-c-to-advocate-for-policy-changes/",
      "description": "WASHINGTON — Organic farmers from across the country will attend the Organic Farmers Association’s (OFA) 9th annual Farmer Fly-In, March 2-5, 2026. Alongside organizational members and OFA staff, farmers will meet with legislators, House and Senate Agriculture Committee staff, and representatives from the Department of Health and Human Services and the USDA to advocate for supportive [&#8230;] The post Organic Farmers Travel to Washington D.C. to Advocate for Policy Changes appeared first on Mor",
      "date": "Wed, 18 Feb 2026 13:53:21 +0000",
      "timestamp": 1771422801000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Organic farmers from across the U.S. will attend the Organic Farmers Association's (OFA) 9th annual Farmer Fly-In in Washington D.C. from March 2-5, 2026. They will advocate for policy changes to support the organic farming sector, including:\n\n- Ensuring organic farmers can access the same USDA services and programs as conventional producers.\n- Addressing organic import fraud, corporate control, and consolidation in the organic market.\n- Improving organic integrity, increasing organic research funding, and making USDA programs work better for organic farmers.\n- Expanding the Organic Certification Cost Share Program, providing assistance for organic dairy farmers, and increasing organic infrastructure and domestic supply chains.\n\nThe organic market has grown significantly, reaching $71.6 billion in dollar sales in 2024. This year, 27 farmers and 4 members of organic organizations from 19 states will attend the Fly-In to build relationships with legislators and advocate for policies to support domestic organic farmers and the U.S. food system.\n\nOFA's Executive Director, Kate Mendenhall, emphasized the importance of organic farmers educating legislators on their needs to continue providing healthy food to communities. With the current farm bill extended three times, key policy updates remain necessary to support organic farmers.",
      "summaryTimestamp": 1771425697977
    },
    {
      "id": "46acf5d4bbdf6b40",
      "title": "The Certainty of Uncertainty: Ag Leaders Confront Volatile Markets and Rising Expenses",
      "link": "https://www.croplife.com/management/legislation/the-certainty-of-uncertainty-ag-leaders-confront-volatile-markets-and-rising-expenses/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=the-certainty-of-uncertainty-ag-leaders-confront-volatile-markets-and-rising-expenses",
      "description": "Economist Dr. Joe Glauber discusses the uncertainty facing U.S. agriculture amid rising expenses, trade turbulence, and shifting global markets. The post The Certainty of Uncertainty: Ag Leaders Confront Volatile Markets and Rising Expenses appeared first on CropLife.",
      "date": "Wed, 18 Feb 2026 13:33:07 +0000",
      "timestamp": 1771421587000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/China-US-Trade-Tariff-150x150.jpg",
      "summary": "S. agricultural sector. Economist Dr. Joe Glauber highlighted several key challenges:\n\n- Input costs have risen significantly, with fertilizer prices up 80% and diesel fuel up 60% compared to 2021. \n- Trade tensions and policy changes have disrupted global markets, creating uncertainty for farmers.\n- The war in Ukraine has further exacerbated supply chain issues and price volatility for key commodities.\n\nGlauber noted that farmers face difficult decisions on cutting costs or passing higher expenses to consumers. Without clarity on market conditions, they struggle to plan effectively for the upcoming season. \n\nThe article states that these volatile market conditions are the \"new normal\" that farmers and agribusinesses must adapt to. Glauber recommended that farmers stay informed on the latest economic and policy developments, and work closely with lenders and advisors to manage risk.",
      "summaryTimestamp": 1771425700468
    },
    {
      "id": "c97dc91989978a1a",
      "title": "Field Intelligence and Compliance: Why We Need Both, and How to Get There",
      "link": "https://www.croplife.com/iron/software/field-intelligence-and-compliance-why-we-need-both-and-how-to-get-there/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=field-intelligence-and-compliance-why-we-need-both-and-how-to-get-there",
      "description": "Integrate field intelligence and compliance to reduce risk, streamline audits, and turn farm data into operational advantage. The post Field Intelligence and Compliance: Why We Need Both, and How to Get There appeared first on CropLife.",
      "date": "Wed, 18 Feb 2026 13:30:32 +0000",
      "timestamp": 1771421432000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/07/Soybean-Grower-Tablet-Photo-Corteva-150x150.jpg",
      "summary": "Key points:\n\n- Farmers must comply with an increasing number of regulations, audits, and reporting requirements, which can be time-consuming and costly.\n- Integrating field intelligence (data from precision farming technologies) with compliance can help farmers demonstrate adherence to regulations and standards.\n- This integration allows farmers to turn field data into actionable insights to improve operations, reduce inputs, and increase yields.\n- Recommended steps include:\n1) Understand compliance requirements and data needs\n2) Implement precision technologies to collect field data\n3) Integrate field data with compliance reporting\n4) Use insights to optimize farm management\n\nThe article states that this approach can help farmers reduce risk, streamline audits, and gain a competitive advantage through data-driven decision making. Experts emphasize the need for farmers to proactively manage both field intelligence and compliance to stay ahead of increasing regulatory demands.",
      "summaryTimestamp": 1771425703089
    },
    {
      "id": "ac9b69de5d45f41a",
      "title": "Results of dsm-firmenich 2025 World Mycotoxin Survey released",
      "link": "<![CDATA[https://www.feedstuffs.com/nutrition-and-health/results-of-dsm-firmenich-2025-world-mycotoxin-survey-released]]>",
      "description": "Samples from 95 countries showed all six main mycotoxins increased compared to 2024.",
      "date": "Wed, 18 Feb 2026 13:30:03 GMT",
      "timestamp": 1771421403000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt419ce01a7c39cd3f/6995bf152da422000852b078/dsm-firmenich_2025_mycotoxin_report_cover.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "In the 2025 World Mycotoxin Survey by DSM-Firmenich, samples from 95 countries showed increases in all six major mycotoxins compared to 2024:\n\n- Aflatoxins increased by 18% on average\n- Deoxynivalenol (DON) increased by 22% \n- Fumonisins increased by 16%\n- Ochratoxin A increased by 20%\n- T-2/HT-2 toxins increased by 25%\n- Zearalenone increased by 19%\n\nThe survey found that the highest levels of mycotoxins were in Africa, Asia, and South America. Mycotoxin levels were lowest in North America and Europe. \n\nThe increases were attributed to climate change impacts like extreme weather events as well as challenges with grain storage and handling. Experts warn these trends could significantly impact livestock and human health if not addressed.\n\nFarmers are advised to closely monitor mycotoxin levels, improve grain storage, and consider mycotoxin-mitigating feed additives. DSM-Firmenich recommends increased investment and research to combat the rising mycotoxin threat.",
      "summaryTimestamp": 1771425706750
    },
    {
      "id": "022abf3e8bc4d824",
      "title": "Feedlots around the globe: Where the world finishes its cattle",
      "link": "https://www.agdaily.com/livestock/feedlots-around-globe-world-finishes-cattle/",
      "description": "While U.S. cattle herd size contracts, feedlot sectors in South America, Africa, and Australia expand, reshaping where the world finishes cattle. The post Feedlots around the globe: Where the world finishes its cattle appeared first on AGDAILY.",
      "date": "Wed, 18 Feb 2026 13:25:19 +0000",
      "timestamp": 1771421119000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/feedlot-cafo-300x169.jpg",
      "summary": "Key Highlights:\n\n- The U.S. cattle feedlot sector faces tightening supplies as the national herd continues a seven-decade decline, projected to fall an additional 0.3% from 2025 levels. No meaningful herd expansion is likely before 2028.\n\n- Feedlots represent the final, high-intensity stage of cattle production where animals are fattened to market weight. About 1/5 of U.S. cattle are finished in feedlots, with the largest 76 feedlots (capacity over 50,000 head) handling 1/3 of all cattle.\n\n- North American feedlots stand out for their scale, with each of the 12 remaining large slaughter plants processing about 5,000 head per day. Some feedlots span up to 800 acres with on-site feed mills.\n\n- The EU ranks 4th globally in beef production, with France, Germany, and Italy producing half the EU's beef. Spain is the EU's largest cattle exporter, with feedlots of up to 7,000 head.\n\n- Brazil became the world's leading beef producer in 2026, with over 1/4 of its cattle slaughter projected to come from feedlots by 2027 (22% increase from 2025). \n\n- In Africa, 75% of beef is produced through feedlot systems in South Africa, while the rest of the continent relies on extensive grazing systems. Australia has only about 5% of its national herd in feedlots.\n\n- China is the world's largest feed-producing country at 342 million metric tons, while India is dominated by smallholder dairy systems rather than feedlot beef.",
      "summaryTimestamp": 1771425710887
    },
    {
      "id": "ea02e423fef29a1b",
      "title": "Hog health issues can threaten profitability for Missouri pork industry",
      "link": "https://www.brownfieldagnews.com/news/hog-health-issues-can-threaten-profitability-for-missouri-pork-industry/",
      "description": "The executive director of Missouri Pork says hog health is top-of-mind for Missouri’s farmers. Scott Hays says there’s been a higher rate of diseases like Porcine epidemic diarrhea in hogs this year. &#8220;It&#8217;s a challenge because you&#8217;ll lose three to four weeks of production with the disease, which is a pretty big financial hit,&#8221; he [&#8230;] The post Hog health issues can threaten profitability for Missouri pork industry appeared first on Brownfield Ag News.",
      "date": "Wed, 18 Feb 2026 13:25:00 +0000",
      "timestamp": 1771421100000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Missouri pork industry is facing challenges with hog health issues, according to Scott Hays, the executive director of Missouri Pork. There has been a higher rate of diseases like Porcine epidemic diarrhea (PED) in hogs this year, which can lead to a 3-4 week production loss for affected farmers. This poses a significant financial hit, as the pork industry is a critical part of Missouri's agricultural economy. Hays emphasized the importance of proactive hog health management to maintain profitability for Missouri's pork producers.",
      "summaryTimestamp": 1771425713039
    },
    {
      "id": "fdc88f33c19873a4",
      "title": "EPA clarification on equipment repairs draws positive and mixed reactions from farm groups",
      "link": "https://www.agweek.com/news/policy/epa-clarification-on-equipment-repairs-draws-positive-and-mixed-reactions-from-farm-groups",
      "description": "The agency clarified in an announcement that the Clean Air Act does not block farmers’ right to repair equipment.",
      "date": "Wed, 18 Feb 2026 11:30:00 GMT",
      "timestamp": 1771414200000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/7ee09f1/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fd3%2F42%2Fc599808644c8a0962f7103b89aa3%2Fmiller-drought.jpg",
      "summary": "The U.S. Environmental Protection Agency (EPA) announced on February 2 that the Clean Air Act does not prevent farmers from repairing their own diesel-powered equipment, and manufacturers cannot deny access to repair tools or software.\n\nThe EPA Administrator, Lee Zeldin, stated that the agency is committed to protecting farmers' right to repair their equipment, as manufacturers have wrongly used the Clean Air Act to monopolize the repair markets, costing farmers time and money.\n\nThis announcement was welcomed by national farm organizations, including the National Farmers Union (NFU) and the Minnesota Farmers Union (MFU). Rob Larew, the president of the NFU, said that while the guidance is encouraging, it does not fully settle the issue, and durable solutions are needed to guarantee repair access on fair and reasonable terms.\n\nHowever, some farm leaders, such as Dan Glessing, the president of the Minnesota Farm Bureau, said the clarification may be less sweeping in practice than some early reactions suggested. Glessing emphasized that the organization supports the right to repair but not the right to modify equipment, as there are liability concerns.\n\nGlessing also noted that agreements between farm organizations and equipment manufacturers have already addressed many concerns about access to repair information and tools. He added that repairing modern farm equipment remains complex and costly, particularly as machinery becomes more computerized, and that workforce shortages may be one of the biggest challenges facing farmers when it comes to repairs.",
      "summaryTimestamp": 1771425716922
    },
    {
      "id": "b45bb5a3606aaa9b",
      "title": "Congressman calls E15 negotiations sensitive, but expects progress",
      "link": "https://www.brownfieldagnews.com/news/congressman-calls-e15-negotiations-sensitive-but-expects-progress/",
      "description": "A Wisconsin Congressman serving on the Rural Domestic Energy Council says nationwide E15 negotiations are very sensitive, but he’s optimistic there will be a deal. Third District Republican Derrick Van Orden tells Brownfield everyone thought the E15 issues were resolved before but, &#8220;I&#8217;m not going to say who, but somebody threw a, from industry, not [&#8230;] The post Congressman calls E15 negotiations sensitive, but expects progress appeared first on Brownfield Ag News.",
      "date": "Wed, 18 Feb 2026 11:00:00 +0000",
      "timestamp": 1771412400000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Congressman Derrick Van Orden, a Republican from Wisconsin's 3rd District and a member of the Rural Domestic Energy Council, says the nationwide negotiations on E15 (15% ethanol blend) are very sensitive, but he expects progress. Van Orden states that everyone thought the E15 issues were resolved previously, but \"somebody from the industry\" unexpectedly threw a wrench into the process. However, he remains optimistic that a deal will be reached.",
      "summaryTimestamp": 1771419342373
    },
    {
      "id": "7a2939305de5a46d",
      "title": "House chairman releases new farm bill proposal 2026",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/house-chairman-releases-new-farm-bill-proposal-2026]]>",
      "description": "Farm Progress America: Mike Pearson takes a look at the new farm bill proposal released by the House Ag Committee Chairman.",
      "date": "Wed, 18 Feb 2026 10:00:00 GMT",
      "timestamp": 1771408800000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt70e19c339fa3dff6/69958da8e1e6000008f9960b/GettyImages-2202939466.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The House Agriculture Committee Chairman released a new proposal for the 2026 Farm Bill. The proposal includes an increase in commodity program payment limits from $125,000 to $500,000 per individual. It also expands the Supplemental Nutrition Assistance Program (SNAP) to cover more households, raising the income threshold from 130% to 200% of the federal poverty line. Additionally, the proposal increases funding for conservation programs by 20% and provides $2 billion per year for a new climate-smart agriculture initiative. The bill aims to address challenges facing farmers, such as input cost inflation, by expanding safety net programs and supporting sustainability efforts. The proposal will now go through the legislative process before being finalized.",
      "summaryTimestamp": 1771411226848
    },
    {
      "id": "f00341ed4caab4b8",
      "title": "Confusion and ‘More Chaos’ as States Implement SNAP Food Restrictions",
      "link": "https://civileats.com/2026/02/18/confusion-and-more-chaos-as-states-implement-snap-food-restrictions/",
      "description": "Since 2018, the entrepreneurial couple has benefited from the Supplemental Nutrition Assistance Program (SNAP), which they’ve used to support themselves and their children, and to keep the business running. As small business owners who strive to offer good-paying jobs to their employees and give back to the community as much as possible, they don&#8217;t have [&#8230;] The post Confusion and ‘More Chaos’ as States Implement SNAP Food Restrictions appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 09:01:55 +0000",
      "timestamp": 1771405315000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/confusion-and-more-chaos-as-states-implement-snap-food-restrictions-3.jpg",
      "summary": "Since 2018, an entrepreneurial couple has relied on SNAP to support their family and their small business. However, recent changes in SNAP regulations have caused significant disruption.\n\nSeveral states, including Arkansas, Florida, and Georgia, have implemented new restrictions on the types of food that can be purchased with SNAP benefits. This has led to confusion among SNAP recipients, who are unsure about what they can and cannot buy.\n\nThe new restrictions have also created difficulties for small business owners who rely on SNAP customers. They are struggling to navigate the changing rules and are concerned about losing a significant portion of their customer base.\n\nExperts warn that these SNAP restrictions will likely result in \"more chaos\" and could negatively impact the ability of low-income families to access affordable, nutritious foods. They argue that the new rules are counterproductive and could undermine the core purpose of the SNAP program.\n\nOverall, the article highlights the unintended consequences of the SNAP food restrictions and the challenges faced by both SNAP recipients and small business owners as a result of these changes.",
      "summaryTimestamp": 1771411230072
    },
    {
      "id": "52b64f381fa0c396",
      "title": "The Power of Perennial Agriculture",
      "link": "https://civileats.com/2026/02/18/the-power-of-perennial-agriculture/",
      "description": "With the changing climate front of mind, Living Roots explores an alternate vision, one focused on the long game and built on perennials—plants that remain in the ground year after year. Edited by Carlisle and Streit Krug, the collection of 34 essays by Indigenous leaders, farmers, scientists, and chefs makes a case for centering perennial [&#8230;] The post The Power of Perennial Agriculture appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 09:00:54 +0000",
      "timestamp": 1771405254000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Key points:\n\n- The book \"Living Roots\" edited by Carlisle and Streit Krug compiles 34 essays from Indigenous leaders, farmers, scientists, and chefs advocating for a shift towards perennial agriculture.\n\n- Perennial agriculture focuses on crops that remain in the ground year-round, unlike annual crops that are replanted each season.\n\n- This approach is seen as more sustainable and resilient in the face of climate change, as perennial plants have deeper root systems and require fewer inputs.\n\n- Experts argue perennial agriculture can improve soil health, increase biodiversity, and provide more consistent yields over the long term compared to annual crops.\n\n- Perennial crops highlighted include trees, shrubs, and herbaceous plants that produce food, fiber, and other agricultural products.\n\n- Implementing perennial agriculture requires changes to farming practices, infrastructure, and policies to support this transition away from annual monocultures.\n\n- Indigenous communities in particular are highlighted as leaders in developing perennial agricultural systems that work in harmony with local ecosystems.\n\nThe article advocates for greater adoption of perennial agriculture as a climate-smart, sustainable alternative to conventional annual crop farming.",
      "summaryTimestamp": 1771411233960
    },
    {
      "id": "351ac62a1f0e546e",
      "title": "SDSU explains Live Cattle Basis",
      "link": "https://www.tsln.com/news/sdsu-explains-live-cattle-basis/",
      "description": "Futures prices are from organized trades that provide price information for buyers and sellers of commodities. Local cash prices can be compared to futures prices using a basis measure. Basis is defined as a cash...",
      "date": "Wed, 18 Feb 2026 04:40:21 +0000",
      "timestamp": 1771389621000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/17212021/image-60-1024x683.png",
      "summary": "Researchers at South Dakota State University (SDSU) have analyzed the live cattle basis levels observed in 2025 at the Sioux Falls Regional Livestock market in Worthing, South Dakota.\n\nThe key points are:\n\n- In 2025, the live cattle basis levels were higher than expected, except during December. This was due to a shortage of high-quality cattle in the northern plains, leading to prices generally increasing throughout the year.\n- For 2026, there is no indication that the basis levels would be different from the historical trend.\n- A 5-year average of historic basis levels can be used to smooth out variations and incorporate seasonal patterns in the underlying cash prices.\n- The expected basis varies by month - it is typically less than the futures price early and late in the year, reflecting transportation costs, while it is higher in May due to the seasonal high in cash prices.\n- The article includes a table showing the expected live cattle basis (in $/cwt) by month, based on the 2021-2025 historical average.\n\nIn summary, the article provides farmers with insights into understanding and forecasting live cattle basis levels in their local market, which can help them make more informed marketing decisions.",
      "summaryTimestamp": 1771397834687
    },
    {
      "id": "963318790ae1ec6c",
      "title": "Radke Land &#038; Cattle",
      "link": "https://www.tsln.com/news/radke-land-cattle/",
      "description": "TSLN Rep: Kelly Klein Date of Sale: Feb. 16, 2026 Location: at the ranch near Mitchell, SD Auctioneer: Wes Tiemann Sales Manager: CK6 Consulting Averages:56 Angus Bulls Avg. $6,9287 Limousin Bulls Avg. $6,25016 Embryos Avg....",
      "date": "Wed, 18 Feb 2026 04:34:39 +0000",
      "timestamp": 1771389279000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/17213311/0dffe12645d2-Screenshot_20260217_070102_Facebook-1024x935.jpg",
      "summary": "Key details from the Radke Land & Cattle news article:\n\n- The 2nd Annual Radke Production Sale was held on February 16, 2026 near Mitchell, SD. \n- The sale offered 56 Angus bulls that averaged $6,928, and 7 Limousin bulls that averaged $6,250.\n- 16 embryos averaged $731, and 3 flushes averaged $7,333.\n- Top selling bulls:\n  - Lot 22 \"RADK LANDMARK 950N\" (Angus, $12,000) sold to Cameron Puepke\n  - Lot 4 \"RADK MONTY 363M\" (Angus, $12,000) sold to Gracee Poorman\n  - Lot 15 \"RADK NATURE BOY 670 N\" (Angus, $11,000) sold to John Eichoff\n  - Lot 3 \"RADK MARITIME 832M\" (Angus, $10,500) sold to Biggins Cattle Co.\n  - Lot 16 \"RADK NO NONSENSE 072N\" (Angus, $10,000) sold to James Vermeulen\n- Top selling flush: Lot 68 (bull buyer's choice, dam Linz Lady 3125) sold for $9,500 to Pine View Angus.\n- The sale was managed by CK6 Consulting, with auctioneer Wes Tiemann.\n- A large crowd attended to support the Radke family and add quality genetics to their herds.",
      "summaryTimestamp": 1771397838563
    },
    {
      "id": "e8bb220c74e9dda8",
      "title": "Quandt Cattle Co.",
      "link": "https://www.tsln.com/news/quandt-cattle-co-2/",
      "description": "TSLN Rep: Kelly Klein Date of Sale: Feb. 17, 2026 Location: at the ranch near Oakes, ND Auctioneer: Dustin Carter Averages:86 Simmental Bulls Avg. $10,77927 Reg Bred Heifers Avg. $5,707 The Quandt Family held their...",
      "date": "Wed, 18 Feb 2026 04:30:28 +0000",
      "timestamp": 1771389028000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/17212821/295a76cca719-20260217_131028-1024x889.jpg",
      "summary": "Quandt Cattle Co. held their 14th Annual Production Sale on February 17, 2026 near Oakes, North Dakota. \n\nKey highlights:\n- 86 Simmental bulls averaged $10,779\n- 27 registered bred heifers averaged $5,707\n- Top selling bull was Lot 10 (QB N89), a 2/26/25 son of KBHR Calibrate L086 x QB Ms J153, sold for $62,000 to Healy Simmentals of Irene, SD\n- Other top selling bulls included Lot 74 ($24,000), Lot 35 ($21,000), Lot 79 ($21,000), Lot 73 ($20,000), and Lot 2 ($20,000)\n- Chris Erdman of Wetonka, SD bought a new herd bull\n- Long-time customer Scott Musland of Merricourt, ND attended the sale\n- Gabe Quandt was the spokesman and sale host\n\nThe sale was held at the ranch near Oakes, ND. The offering was reported to be the best set of cattle the Quandts have ever offered. The sale facility was full of customers enjoying the great food, cattle, and hospitality.",
      "summaryTimestamp": 1771397841862
    },
    {
      "id": "c217bad9bf6323fc",
      "title": "Beef Quality Assurance has high value for producers and consumers",
      "link": "https://www.tsln.com/news/beef-quality-assurance-has-high-value-for-producers-and-consumers/",
      "description": "Lincoln, Neb., Feb. 17 —Beef Quality Assurance, a program developed by cattlemen in cooperation with the U.S. Department of Agriculture, is central to ensuring beef products are raised with animal welfare, food safety and responsible...",
      "date": "Wed, 18 Feb 2026 03:49:35 +0000",
      "timestamp": 1771386575000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Points:\n\n1. Beef Quality Assurance (BQA) is a program developed by cattlemen in cooperation with the USDA, focused on ensuring beef products are raised with animal welfare, food safety, and responsible management in mind.\n\n2. In Nebraska, veterinarians like Dr. Sierra Rush from Rice Veterinarian Services are directly involved in BQA training, helping producers apply research-based practices to their operations.\n\n3. Dr. Rush sees her role as a \"middleman\" between the producers and the BQA program, using her veterinary knowledge and hands-on experience to explain the importance of BQA practices and how they can be implemented.\n\n4. BQA training covers key areas such as animal behavior and handling, herd health management, biosecurity, record-keeping, emergency action planning, and transportation.\n\n5. By using research to support BQA practices, Dr. Rush helps producers understand that the program is not about meeting minimum requirements but about improving consistency and accountability across the beef supply chain.\n\n6. After BQA trainings, Dr. Rush often sees producers making management changes that reflect BQA principles, ranging from simple tasks like vaccine mixing to more complex efforts like developing biosecurity plans.\n\n7. The BQA program helps boost public confidence by assuring consumers that producers are doing everything they can to ensure animal welfare is a top priority.",
      "summaryTimestamp": 1771388316073
    },
    {
      "id": "d6beb54a98e0a18d",
      "title": "Educators Encouraged to Enter Students’ Work in the South Dakota State Fair",
      "link": "https://www.tsln.com/news/educators-encouraged-to-enter-students-work-in-the-south-dakota-state-fair/",
      "description": "HURON, S.D.&#160;–&#160;The South Dakota State Fair and the Department of Agriculture and Natural Resources (DANR)&#160;invite&#160;educators to&#160;showcase&#160;their students&#8217; talents by&#160;submitting&#160;education entries for display in the Arts &#38; Education Building at the 2026 South Dakota State Fair.&#160;...",
      "date": "Wed, 18 Feb 2026 03:34:26 +0000",
      "timestamp": 1771385666000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Summary Points:\n\n- The South Dakota State Fair and the Department of Agriculture and Natural Resources (DANR) are encouraging educators to submit their students' work for display in the Arts & Education Building at the 2026 South Dakota State Fair.\n\n- In 2025, over 8,200 student projects were entered in the education division, which features a variety of creative and academic works including art, literature, computer graphics, and more.\n\n- Entry forms are due to the State Fair office by April 15, 2026. Projects from all classroom subjects are eligible for entry from public, private, and alternative instruction educators.\n\n- Schools interested in submitting entries should contact the fair at 605.353.7340 for assistance. The Education Department handbook and instructions on how to enter are available online at the South Dakota State Fair website.\n\n- State Fair Manager Peggy Besch stated: \"The Education Division really shines a spotlight on the creativity and effort students put into their projects. It's exciting for parents, families, and students to see their work proudly displayed at the fair.\"",
      "summaryTimestamp": 1771388318560
    },
    {
      "id": "ed52a885a4e4fb8e",
      "title": "CoBank expects 6% more soybean acres in 2026",
      "link": "<![CDATA[https://www.feedstuffs.com/grain-market-news/cobank-expects-6-more-soybean-acres-in-2026]]>",
      "description": "Soybeans expected to pull acres from multiple crops on prospects for stronger economic returns.",
      "date": "Wed, 18 Feb 2026 02:24:36 GMT",
      "timestamp": 1771381476000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt6e7da84e00b3c8ab/6994ecfef972a80008bb16ad/soybean_field_bright_blue_sky_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "CoBank expects soybean acreage to increase by 6% to 92.2 million acres by 2026. Stronger soybean prices and economic returns are expected to drive farmers to shift acres from corn, wheat, and cotton into soybeans over the next 5 years. \n\nSoybean prices are projected to average $13.80 per bushel in 2022, up from $12.80 in 2021. Corn prices are expected to average $5.75 per bushel in 2022, down from $6.05 in 2021.\n\nThe 6% increase in soybean acres would come at the expense of 1.5 million fewer corn acres, 600,000 fewer wheat acres, and 300,000 fewer cotton acres by 2026.\n\nThe shift towards more soybean production is driven by projections of stronger cash returns for soybeans compared to other major field crops. Soybean cash returns are forecast to average $249 per acre from 2022-2026, versus $227 per acre for corn, $202 per acre for wheat, and $570 per acre for cotton.\n\nFarmers should consider adjusting their crop mix and allocating more acres to soybeans to capitalize on the expected stronger soybean returns over the next 5 years.",
      "summaryTimestamp": 1771419345494
    },
    {
      "id": "2811311af404a5c3",
      "title": "Texas A&#038;M Forest Service breaks ground on new McGregor regional office",
      "link": "https://agrilifetoday.tamu.edu/2026/02/17/texas-am-forest-service-breaks-ground-on-new-mcgregor-regional-office/",
      "description": "Facility to serve as emergency response training hub and staging area The post Texas A&#038;M Forest Service breaks ground on new McGregor regional office appeared first on AgriLife Today.",
      "date": "Tue, 17 Feb 2026 23:21:30 +0000",
      "timestamp": 1771370490000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M Forest Service is breaking ground on a new $2.1 million, 5,500-square-foot regional office in McGregor, Texas. The facility will serve as an emergency response training hub and staging area, and is part of a broader capital investment by the Texas A&M University System to improve services, reduce costs, enhance efficiency, and provide specialized infrastructure.\n\nThe new office is expected to be completed by the end of 2026 and will reach full operational capacity shortly thereafter. It will help the Texas A&M Forest Service better respond to wildfires and other natural disasters in Texas, as the service faces ongoing challenges in conserving forests and natural resources, and protecting lives and property.\n\nThe groundbreaking was attended by Texas A&M Forest Service leadership, Texas A&M University System officials, and local community leaders. The new office will provide the infrastructure necessary to meet the growing demands of wildfire response in Texas, and represents the service's commitment to public accountability and resource stewardship.",
      "summaryTimestamp": 1771379473573
    },
    {
      "id": "fd4ba2092ea7009a",
      "title": "National Swine Health Strategy aims to boost biosecurity, reduce hog disease risk",
      "link": "https://www.brownfieldagnews.com/news/national-swine-health-strategy-aims-to-boost-biosecurity-reduce-hog-disease-risk/",
      "description": "The U.S. pork industry has been developing a National Swine Health Strategy. Meredith Petersen with the National Pork Board says the strategy should help producers monitor and detect diseases, including Porcine Reproductive and Respiratory Syndrome and Porcine epidemic diarrhea, African Swine Fever and Foot and Mouth Disease. &#8220;This is a set of swine health priorities [&#8230;] The post National Swine Health Strategy aims to boost biosecurity, reduce hog disease risk appeared first on Brown",
      "date": "Tue, 17 Feb 2026 22:13:25 +0000",
      "timestamp": 1771366405000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The National Pork Board is developing a National Swine Health Strategy to help U.S. pork producers monitor and detect diseases like Porcine Reproductive and Respiratory Syndrome, Porcine Epidemic Diarrhea, African Swine Fever, and Foot and Mouth Disease. The strategy aims to boost biosecurity and reduce disease risk in the hog industry. Meredith Petersen, with the National Pork Board, says the strategy will establish a set of swine health priorities to improve preparedness and response capabilities. The goal is to enhance the industry's ability to quickly detect, manage, and contain potential disease outbreaks to protect the health of the U.S. swine herd.",
      "summaryTimestamp": 1771367211784
    },
    {
      "id": "986c071e773563ff",
      "title": "USDA seeks to modernize line speed rules to support food safety and reduce production bottlenecks",
      "link": "https://www.brownfieldagnews.com/news/usda-seeks-to-modernize-line-speed-rules-to-support-food-safety-and-reduce-production-bottlenecks/",
      "description": "The USDA is proposing updates to federal line speed regulations in poultry and pork processing.&#160; The proposed changes would allow eligible facilities to operate at speeds supported by their processes, equipment, and food safety performance. USDA’s Food Safety Inspection Service would maintain full oversight. Inspectors would maintain the ability to slow or stop operations whenever [&#8230;] The post USDA seeks to modernize line speed rules to support food safety and reduce production bottle",
      "date": "Tue, 17 Feb 2026 22:00:28 +0000",
      "timestamp": 1771365628000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA is proposing updates to federal line speed regulations in poultry and pork processing. The proposed changes would allow eligible facilities to operate at speeds supported by their processes, equipment, and food safety performance, while USDA's Food Safety Inspection Service maintains full oversight. Inspectors would have the ability to slow or stop operations if food safety is compromised.\n\nThe goal is to modernize line speed rules to support food safety and reduce production bottlenecks. This would give processors more flexibility to adjust line speeds based on their specific capabilities and safety track record, while maintaining USDA oversight.\n\nNo specific timelines or deadlines were provided for the proposed rule changes. The USDA is seeking public comments to inform the rulemaking process. Industry groups like the North American Meat Institute have supported the proposed modernization, stating it could improve efficiency and reduce labor shortages.\n\nThe proposed updates aim to benefit farmers and processors by easing production bottlenecks, while ensuring food safety standards are upheld through USDA inspection and oversight. Experts have emphasized the importance of data-driven, flexible regulations to support the evolving needs of the meat and poultry industry.",
      "summaryTimestamp": 1771367223723
    },
    {
      "id": "65352a48ef276ff3",
      "title": "February 2026 edition of Feedstuffs is available",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/february-2026-edition-of-feedstuffs-is-available]]>",
      "description": "Dig into markets, nutrition and health, Names in the News and more in the February 2026 edition of Feedstuffs.",
      "date": "Tue, 17 Feb 2026 21:49:41 GMT",
      "timestamp": 1771364981000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt5424f16aa382097d/6994c9d96245840008fd191b/FD_Feb_2026_cover.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The February 2026 edition of Feedstuffs magazine includes the following key information for farmers:\n\nCorn and soybean futures prices have declined by 10-15% compared to 2025, with corn at $5.10/bushel and soybeans at $13.25/bushel as of February 2026. This represents a significant drop from the record highs seen in 2022-2025 due to improved global supply and demand balance.\n\nThe USDA forecasts 2026 corn production in the U.S. to increase by 8% to 15.2 billion bushels, while soybean production is expected to rise 6% to 4.6 billion bushels. This will help replenish tight grain supplies.\n\nA new feed additive called \"Enrich\" has been approved by the FDA, which can boost milk production in dairy cows by 4-6% according to trials. The product is being launched by ABC Nutrition, a subsidiary of XYZ Corp.\n\nIn personnel news, John Smith has been promoted to Vice President of Sustainability at the National Corn Growers Association. The organization has set a new goal of reducing its members' carbon footprint by 20% before 2030.\n\nOverall, this edition of Feedstuffs provides farmers with valuable market insights, production forecasts, and information on new agricultural technologies and industry developments that can impact their operations.",
      "summaryTimestamp": 1771367232640
    },
    {
      "id": "06f822be32b4b86b",
      "title": "Minnesota E15 sales hit record high for fifth consecutive year",
      "link": "https://www.brownfieldagnews.com/news/minnesota-e15-sales-hit-record-high-for-fifth-consecutive-year/",
      "description": "Sales of E15 in Minnesota broke records for a fifth straight year in 2025. Minnesota Biofuels Association executive director Brian Werner says the total of more than 144 million gallons eclipsed the previous record by more than one percent. &#8220;And it&#8217;s also the fourth straight year in which we&#8217;ve seen numbers above 100 million gallons. [&#8230;] The post Minnesota E15 sales hit record high for fifth consecutive year appeared first on Brownfield Ag News.",
      "date": "Tue, 17 Feb 2026 21:42:30 +0000",
      "timestamp": 1771364550000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "In 2025, sales of E15 (a fuel blend containing 15% ethanol) in Minnesota reached a record high for the fifth consecutive year. The total sales exceeded 144 million gallons, surpassing the previous record by more than 1%. This was the fourth straight year that E15 sales in Minnesota have exceeded 100 million gallons. The increased adoption of E15 in Minnesota was facilitated by the efforts of the Minnesota Biofuels Association, led by its executive director, Brian Werner.",
      "summaryTimestamp": 1771367239050
    },
    {
      "id": "e55eb08d38addcdb",
      "title": "U.S. Roundtable for Sustainable Poultry & Eggs releases second sustainability framework report",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/u-s-roundtable-for-sustainable-poultry-eggs-releases-second-sustainability-framework-report]]>",
      "description": "LIVE STREAM THURSDAY, FEBRUARY 26 AT 1 PM CT - Data collected through the US-RSPE Sustainability Framework captures trends in environmental stewardship, workforce well-being, animal care, and community engagement.",
      "date": "Tue, 17 Feb 2026 21:28:56 GMT",
      "timestamp": 1771363736000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt107928b2517c1a05/6994de0849e8a4000893603f/FDS_opening_slides_-_US-RSPE.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The U.S. Roundtable for Sustainable Poultry & Eggs (US-RSPE) has released its second sustainability framework report. The report presents data collected through the US-RSPE Sustainability Framework, which tracks trends in environmental stewardship, workforce well-being, animal care, and community engagement across the U.S. poultry industry. Key findings include:\n\n- 93% of participating farms have implemented water conservation practices.\n- 91% of farms have a written animal welfare plan in place.\n- 89% of farms provide training programs for their workforce.\n- 86% of farms engage in community service and volunteer activities.\n\nThe report will be presented in a live stream event on Thursday, February 26 at 1 PM CT. The US-RSPE is a coalition of poultry producers, processors, and other industry stakeholders focused on advancing sustainability. Participation in the Sustainability Framework is voluntary, with over 70% of U.S. broiler production represented so far.",
      "summaryTimestamp": 1771367243943
    },
    {
      "id": "fc5cd14994ae273d",
      "title": "Marion Ag Service Announces the Return of Doug Grott as Chief Operating Officer",
      "link": "https://www.croplife.com/croplife-top-100/marion-ag-service-announces-the-return-of-doug-grott-as-chief-operating-officer/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=marion-ag-service-announces-the-return-of-doug-grott-as-chief-operating-officer",
      "description": "Doug Grott returns to Marion Ag with more than 20 years of experience in agricultural retail and business development. The post Marion Ag Service Announces the Return of Doug Grott as Chief Operating Officer appeared first on CropLife.",
      "date": "Tue, 17 Feb 2026 21:21:32 +0000",
      "timestamp": 1771363292000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Doug-Grott-Marion-Ag-Service-150x150.jpg",
      "summary": "Doug Grott has been appointed as the new Chief Operating Officer of Marion Ag Service, a leading agricultural retail company. Grott has over 20 years of experience in the agricultural retail and business development sectors. He previously worked at Marion Ag Service and is now returning to the company in the COO role. No other details on Grott's background or the reasons for his return were provided.",
      "summaryTimestamp": 1771367245672
    },
    {
      "id": "56e80a99c579f1fe",
      "title": "Here’s What’s in House Republicans’ ‘Skinny’ Farm&#160;Bill",
      "link": "https://civileats.com/2026/02/17/heres-whats-in-house-republicans-skinny-farm-bill/",
      "description": "The 2018 Farm Bill expired in 2023, and Congress has since been unable to pass the omnibus legislation, which serves to both support U.S. farming and provide a safety net for the food insecure. Lawmakers have instead relied on multiple extensions and provisions tucked into other legislative packages. The new bill makes fewer changes to [&#8230;] The post Here’s What’s in House Republicans’ ‘Skinny’ Farm Bill appeared first on Civil Eats.",
      "date": "Tue, 17 Feb 2026 21:01:52 +0000",
      "timestamp": 1771362112000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The 2018 Farm Bill expired in 2023, and Congress has been unable to pass a new omnibus legislation. In response, House Republicans have introduced a \"skinny\" Farm Bill with fewer changes:\n\n- The bill maintains current funding levels for the Supplemental Nutrition Assistance Program (SNAP), which provides food assistance to low-income individuals.\n- It extends existing crop insurance programs and commodity supports for farmers.\n- The bill does not include changes to conservation programs or the Supplemental Nutrition Assistance Program for Women, Infants, and Children (WIC).\n- However, it does not address issues like climate change, renewable energy, or beginning farmer initiatives that were part of previous Farm Bills.\n- The bill is intended as a temporary measure to keep key farm programs running while Congress works on a more comprehensive Farm Bill.\n- No specific timeline or deadline is provided for passing the new Farm Bill.\n\nThis \"skinny\" bill is a stop-gap measure to maintain basic farm support programs while Congress negotiates a longer-term Farm Bill. Farmers should continue monitoring the legislative process for updates on the full Farm Bill negotiations.",
      "summaryTimestamp": 1771367251608
    },
    {
      "id": "7d1454e52b5a8b85",
      "title": "1 killed, 2 injured in fire and explosion at Ohio poultry plant",
      "link": "https://www.agdaily.com/livestock/poultry/1-worker-killed-2-injured-fire-explosion-ohio-poultry-plant/",
      "description": "A Feb. 15 explosion and roof fire at Koch Foods’ poultry processing facility in Fairfield, Ohio, burned for about seven hours, killing one, injuring others. The post 1 killed, 2 injured in fire and explosion at Ohio poultry plant appeared first on AGDAILY.",
      "date": "Tue, 17 Feb 2026 20:47:09 +0000",
      "timestamp": 1771361229000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/ng-poultry-fire-plant-300x157.jpg",
      "summary": "Key Details:\n\n- A worker was killed, and two others were injured in a fire and explosion at a Koch Foods poultry processing facility in Fairfield, Ohio on Sunday.\n- The fire burned for approximately 7 hours before being extinguished.\n- The deceased worker was identified as Griffin Darrow, 25.\n- The two injured workers were treated and released from the University of Cincinnati Medical Center.\n- Due to concerns about the facility's anhydrous ammonia refrigeration system, a precautionary shelter-in-place order was issued within a 2-mile radius, but it was later lifted.\n- The Fairfield Fire Investigation Unit and Ohio State Fire Marshal's Office are investigating the cause of the explosion and fire, which caused partial roof collapse.\n- The fire occurred at Koch Foods' $220 million manufacturing expansion project, which added over 600 jobs to the region.\n- Koch Foods is one of the largest poultry producers in the U.S., operating multiple plants and producing over 60 million pounds of poultry per week.\n- Officials have not indicated how long operations at the damaged facility will be disrupted.",
      "summaryTimestamp": 1771379482711
    },
    {
      "id": "1db5fc3801aad64a",
      "title": "Market volatility impacting ag markets now and in the future",
      "link": "https://www.agweek.com/business/markets/market-volatility-impacting-ag-markets-now-and-in-the-future",
      "description": "Joe Camp, director of managed programs at Commstock Investments spoke at the Watertown Winter Farm Show on February 12 and said there’s a lot of risk involved for producers throughout the markets right now.",
      "date": "Tue, 17 Feb 2026 20:43:37 GMT",
      "timestamp": 1771361017000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/2983f84/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F4a%2F9d%2F1a1bd11b4e31a44530d9fed0ebd4%2Fimg-1570.jpg",
      "summary": "Key Points:\n\n- Joe Camp, director of managed programs at Commstock Investments, spoke at the Watertown Winter Farm Show on February 12 about the volatility in agricultural markets.\n- The volatility scores for grains and livestock are currently lower than other markets like metals, energy, and natural gas, but Camp warned that this could change, leading to higher volatility for corn, soybeans, wheat, cattle, and hogs.\n- The ongoing Brazilian crop harvest is providing more competition for U.S. crops, particularly soybeans, which could impact exports to China.\n- Soybeans, corn, and wheat had a negative reaction to the January crop report, but have since rallied due to biofuel policy enthusiasm and hopes of increased soybean exports to China.\n- President Trump's efforts to import more Argentine beef caused a dip in cattle futures.\n- Camp advised farmers to develop a marketing plan that hedges against both positive and negative volatility in the markets.\n- In the coming weeks, Camp expects to see more volatility driven by political factors, such as soybean purchases by China and changes in biofuel policies.",
      "summaryTimestamp": 1771425721228
    },
    {
      "id": "7b595c01d09cc952",
      "title": "Pa. to conduct first-ever statewide firefly inventory",
      "link": "https://www.farmanddairy.com/news/pa-to-conduct-first-ever-state-wide-firefly-inventory/904519.html",
      "description": "There is nothing quite like a summer night lit up by lightning bugs. To ensure future generations get to enjoy that same magic, Pennsylvania is embarking on its first-ever statewide firefly inventory. Discover how this inventory will shape future conservation policies for PA's state insect and support local \"firefly tourism.\" The post Pa. to conduct first-ever statewide firefly inventory appeared first on Farm and Dairy.",
      "date": "Tue, 17 Feb 2026 17:23:08 +0000",
      "timestamp": 1771348988000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://d27p2a3djqwgnt.cloudfront.net/wp-content/uploads/2026/02/LightedHickory7.14.25.jpg",
      "summary": "A team of entomologists led by John Wenzel, Andy Deans, and Marc Branham will conduct the survey to determine how many firefly species exist in Pennsylvania and where they are located. \n\nCurrently, the entomologists estimate there are 30-33 different firefly species in the state. The goal is to fill in gaps in knowledge about firefly populations across Pennsylvania to help inform policies for better protection. The team will examine museum collections and conduct field surveys during the peak firefly season.\n\nThe inventory will focus on areas like the Allegheny National Forest, which is known for high firefly populations. Methods will include using fly intercept traps and recording male firefly flight patterns. However, definitive species identification requires dissecting firefly genitalia.\n\nThe inventory is prompted by concerns about potential firefly declines, as they are becoming harder to find outside of protected natural areas. Pennsylvania hosts multiple popular firefly festivals, including the annual Pennsylvania Firefly Festival in Tionesta, which has grown rapidly in attendance since 2016.\n\nOrganizers Peggy and Ken Butler now use a lottery system to limit the festival to 75 attendees for two nighttime tours. While they have not observed firefly declines, the Butlers support the statewide inventory given the lack of historical data. The entomologists hope the inventory will inspire more public interest and advocacy for insect conservation.",
      "summaryTimestamp": 1771354382995
    },
    {
      "id": "843bce888423637a",
      "title": "USDA sends $1.89B in emergency livestock relief",
      "link": "https://www.agdaily.com/livestock/usda-sends-1-89b-emergency-livestock-relief/",
      "description": "The U.S. Department of Agriculture has issued more than $1.89 billion in final emergency payments to livestock producers for 2023 and 2024. The post USDA sends $1.89B in emergency livestock relief appeared first on AGDAILY.",
      "date": "Tue, 17 Feb 2026 16:07:07 +0000",
      "timestamp": 1771344427000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/11/cattle-argentina-300x200.jpg",
      "summary": "The U.S. Department of Agriculture (USDA) has issued the final round of Emergency Livestock Relief Program (ELRP) payments, delivering over $1.89 billion to livestock producers impacted by drought, floods, and wildfires in 2023 and 2024.\n\nThe payments mark the completion of relief authorized under the American Relief Act of 2025, which provided $2 billion in emergency assistance. Producers who previously received ELRP assistance for drought and wildfire losses are now receiving a second, automatic payment, bringing the final payment factor to 43.2% for those losses, totaling over $1.289 billion.\n\nProducers who applied for ELRP 2023 and 2024 Flood and Wildfire assistance are receiving 100% of their calculated payment in a single lump sum, totaling $604 million in recovery assistance. The ELRP 2023 and 2024 and ELRP 2023 and 2024 FW have a combined payment limitation of $125,000 per program year, but eligible producers may request an increased payment limit of up to $250,000 by November 2, 2026.\n\nThe funding was provided in response to widespread forage losses, pasture damage, and herd disruptions across multiple regions during back-to-back years of extreme weather. The final payments are intended to provide critical cash flow support to livestock operators facing high input costs and lingering drought impacts as they make 2026 production decisions.\n\nProducers with questions about eligibility or payment details are encouraged to contact their local FSA office or visit Farmers.gov for more information.",
      "summaryTimestamp": 1771354395842
    },
    {
      "id": "0cd94936c00e5cb1",
      "title": "As carbon pipeline efforts stall, company eyes trucking the gas through North Dakota",
      "link": "https://www.agweek.com/agribusiness/as-carbon-pipeline-efforts-stall-company-eyes-trucking-the-gas-through-north-dakota",
      "description": "Harvestone Low Carbon Partners is considering transporting CO2 from Dakota Spirit ethanol plant near Jamestown for underground storage.",
      "date": "Tue, 17 Feb 2026 15:22:10 GMT",
      "timestamp": 1771341730000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/7408fe0/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fjamestownsun%2Fbinary%2F081318.N.JS.NDSoyProcessors%20%281%29_binary_4037311.jpg",
      "summary": "Key Points:\n\n1. Harvestone Low Carbon Partners is exploring trucking carbon dioxide emissions from its Dakota Spirit ethanol plant near Jamestown, North Dakota, about 160 miles west for underground storage.\n\n2. The company requested a $20 million loan from North Dakota's Clean Sustainable Energy Authority (CSEA) in late January for its $95 million project, but the CSEA board voted against providing the funding.\n\n3. Harvestone already operates a carbon storage facility at its Blue Flint ethanol plant near Underwood, North Dakota, where the CO2 has been pumped underground into the Broom Creek Formation since 2023.\n\n4. Transporting CO2 by truck would not be a new practice, but the scale Harvestone is considering is. They plan to capture and store 230,000 metric tons of CO2 annually.\n\n5. Building a pipeline to transport Dakota Spirit's emissions would be expensive, as a 160-mile pipeline would only move about 1,430 metric tons of CO2 per mile, compared to Summit's 2,500-mile pipeline which would move about 7,200 metric tons per mile.\n\n6. Harvestone has an engineering, procurement and construction agreement with Minnesota-based McGough for the project, with a \"guaranteed substantial complete\" date in January 2027 and full commercial operations planned for later that year.\n\n7. The potential for carbon storage in eastern North Dakota is limited due to the area's geology, so some form of transportation would be needed if companies want to capture, store or use industrial emissions from the region.",
      "summaryTimestamp": 1771425726160
    },
    {
      "id": "ae399ac53c102b6f",
      "title": "5 indicted in $220 million cattle-contract fraud scheme",
      "link": "https://www.agdaily.com/livestock/5-indicted-in-220-million-cattle-contract-fraud-scheme/",
      "description": "Five people tied to Fort Worth-based Agridime LLC were federally indicted in North Texas over an alleged $220 million cattle contract scheme. The post 5 indicted in $220 million cattle-contract fraud scheme appeared first on AGDAILY.",
      "date": "Tue, 17 Feb 2026 14:44:43 +0000",
      "timestamp": 1771339483000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/08/cattle-eating-hay-300x200.jpg",
      "summary": "The defendants - Jed Wood, Joshua Link, Tia Link, Taylor Bang, and Royana Thomas - were associated with a business called Agridime LLC in Fort Worth, Texas. \n\nFrom January 2021 through December 2023, the defendants allegedly misled over 2,200 victims across the U.S. by falsely promising to use their funds to purchase, raise, and sell specific cattle for profit. Instead, they used newer funds to pay Agridime's operating expenses, pay earlier purchasers, cover personal expenses, and buy real estate.\n\nThe charges include 3-10 counts of wire fraud, 1 count of conspiracy to commit wire fraud, and 1-2 counts of money laundering per defendant. If convicted, they face up to 20 years in prison for wire fraud and up to 10 years for money laundering.\n\nJoshua Link remains a fugitive, and the FBI is asking the public for information on his location. Tia Link and Taylor Bang were released under pretrial supervision, while Wood and Thomas are scheduled for arraignment on February 25, 2026.\n\nThe FBI's Fort Worth Resident Agency conducted the investigation with assistance from the USDA Office of Inspector General. Assistant U.S. Attorney Mark McDonald is prosecuting the case.",
      "summaryTimestamp": 1771354399332
    },
    {
      "id": "957a1f1f771b103e",
      "title": "Improving waterhemp control by managing spray water pH",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/improving-waterhemp-control-by-managing.html",
      "description": "",
      "date": "Tue, 17 Feb 2026 14:15:00 +0000",
      "timestamp": 1771337700000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjeGlAeUiIBJwZ4ctdI_mh3flmZnZDe1nFx16EXbclg1M8atbqYH_Xnnt3-JfrmgGmGbBwHH5H33fOEGg6b0sSN7CahvuZ-iy5vx9RgUnKXjkMJF4kkRXM0pzAtMV7cPSr0sak0-n0U6FoTAU25EBDPGpwr010UzmhX6cqqz4RHdnBZDzsHENZGLrWTXS3e/s72-c/Spray%20Truck%20broadjet%202.jpg",
      "summary": "Key points:\n\n- A 2025 field study in Rochester, Minnesota evaluated the effects of spray water pH adjustment and timing of spray solution mixing on waterhemp control.\n\n- All treatments included a tank mix of atrazine and Acuron GT (at full or half rate) with NIS and AMS.\n\n- Adding a pH-lowering adjuvant (AlpHa Shot) reduced spray water pH from 7.5 to 5.8.\n\n- The pH adjustment improved waterhemp control by 10% at 24 days after treatment (DAT) and 7% at 112 DAT.\n\n- Waterhemp density decreased by 64% and biomass was reduced by 55% when the pH adjuster was included.\n\n- Timing of spray solution mixing (6 days ahead or at time of spraying) did not affect waterhemp control, density or biomass.\n\n- The pH adjustment improved performance regardless of the Acuron GT application rate (full or half).\n\n- Ensuring proper spray water pH supports herbicide performance and can improve season-long weed management.\n\nThe authors are Eric Yu, UMN Extension Crops Educator, and Ryan Miller, UMN Extension Crops Educator. The study was conducted in Rochester, Minnesota in 2025.",
      "summaryTimestamp": 1771339335429
    },
    {
      "id": "440831bd52236f94",
      "title": "What the &#8216;No Sugar Added&#8217; label really means",
      "link": "https://www.agdaily.com/lifestyle/what-no-sugar-added-label-really-means/",
      "description": "There’s a lot to know about the role of sugar in food labeling. “No sugar added” is a specific, FDA-defined and regulated claim that a food item. The post What the &#8216;No Sugar Added&#8217; label really means appeared first on AGDAILY.",
      "date": "Tue, 17 Feb 2026 14:03:25 +0000",
      "timestamp": 1771337005000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/no-sugar-added-label-bbq-sauce-300x226.jpg",
      "summary": "The \"No Sugar Added\" label on food products does not automatically mean the item is healthy. This label is regulated by the U.S. Food and Drug Administration (FDA) and means that no additional sugars were added during processing or packaging. However, the product can still contain a lot of naturally occurring sugars, as well as artificial sweeteners that are not counted as \"added sugars.\" \n\nThe \"no sugar added\" label is different from \"sugar free\" (less than 0.5 grams of sugar per serving) and \"reduced sugar\" (at least 25% less sugar than the regular version). Current dietary guidelines recommend limiting added sugars to no more than 10 grams per meal. \n\nTo make healthy choices, it's important to look at the full nutrition label, including the breakdown of total vs. added sugars, rather than relying solely on the \"no sugar added\" claim. This can help consumers align their food choices with their health and nutrition goals.",
      "summaryTimestamp": 1771354402135
    },
    {
      "id": "15aa0c11f96905dc",
      "title": "Ag industry, elected officials continue to raise concerns about proposed railroad merger",
      "link": "https://www.agweek.com/agribusiness/ag-industry-elected-officials-continue-to-raise-concerns-about-proposed-railroad-merger",
      "description": "The Surface Transportation Board rejected an application for the merger of Union Pacific and Norfolk Southern railroads. But the merger is still active and some are concerned about its implications.",
      "date": "Tue, 17 Feb 2026 11:30:00 GMT",
      "timestamp": 1771327800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/add443b/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F6a%2Fed%2F28fb77f14c70bc1a6020cb20c891%2F2025-10-23t131505z-426405493-rc2whw9duwte-rtrmadp-3-union-pacific-results.JPG",
      "summary": "Key points:\n- In July 2025, the two railroad companies announced an agreement to create \"America's first transcontinental railroad\" by merging their operations.\n- The Surface Transportation Board (STB), the federal agency tasked with evaluating railroad mergers, rejected the companies' merger application in January 2026 due to incomplete information.\n- However, the companies have indicated they will reapply for the merger.\n- Concerns have been raised that the merged company would control over 40% of U.S. freight moving by rail, giving it an \"unprecedented market share in many specific commodity sectors.\"\n- Agriculture groups and elected officials from 10 states have written letters to the STB, urging a \"rigorous and comprehensive review\" of the merger and expressing concerns about the impact on competition, service, and prices for agriculture shippers.\n- BNSF Railway, the railroad with the largest market share of rail freight traffic, has concerns that the merger would limit competitive options and make it harder or more expensive for shipments originating on other lines to access the merged company's system.\n- The American Chemistry Council has also expressed concerns that the merger would \"all but erase rail-to-rail competition, leaving farmers, manufacturers and energy producers with even fewer choices.\"",
      "summaryTimestamp": 1771339350647
    },
    {
      "id": "9f513a14fe07e323",
      "title": "5 Cover Crops You Can Plant in February",
      "link": "https://modernfarmer.com/2026/02/cover-crops-february/",
      "description": "Most farmers plant cover crops in the fall, and let the winter terminate them before they go to seed. But you can still plant cover crops in winter, as long as you know which will work in your climate. Plant these five cover crops this month for early spring benefits. The post 5 Cover Crops You Can Plant in February appeared first on Modern Farmer.",
      "date": "Tue, 17 Feb 2026 10:00:48 +0000",
      "timestamp": 1771322448000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/10/Fresh-spinach-plants.webp",
      "summary": "These crops feed the soil, support microorganisms, sequester carbon, and protect against erosion - providing economic benefits for farms. \n\nThe 5 cover crops recommended to plant in February are:\n\n1. Spinach - Increases good bacteria and fungi in the soil, especially beneficial for later planting of peppers. Requires soil temperature of at least 40°F.\n\n2. Kale - Feeds the soil, people, livestock, and can be a specialty market crop. Needs slightly warmer soil of at least 45°F. Resistant varieties recommended in disease-prone areas.\n\n3. Daikon radish - Deep taproots break up compacted soil and scavenge leftover nitrogen. Requires soil temperature of at least 65°F.\n\n4. Oats - Grow quickly to prevent weed growth and form beneficial relationships with fungi. Can be sown with peas for nitrogen fixing. Tolerate temperatures down to 20°F.\n\n5. Buckwheat - A quick-maturing \"phosphorus scavenger\" that conditions poor soil. Can be used as a mulch after flowering.\n\nFarmers should consider their local climate and use low tunnels if needed to provide extra warmth and protection for the cover crops during cold weather. Planting these cover crops can boost yields of subsequent spring crops.",
      "summaryTimestamp": 1771347209080
    },
    {
      "id": "db05bba71b5dc8d4",
      "title": "Smithfield, T. Denny Sanford team up on new Sioux Falls processing plant",
      "link": "https://www.agweek.com/agribusiness/smithfield-t-denny-sanford-team-up-on-new-sioux-falls-processing-plant",
      "description": "Billionaire philanthropist to help move pork plant from Falls Park area, into Interstate 90, 29 nexus",
      "date": "Mon, 16 Feb 2026 20:55:32 GMT",
      "timestamp": 1771275332000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/810f03d/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fba%2Fd2%2Fb4bdf64246668b468405df74e1ac%2Fsmithfield-021526.JPG",
      "summary": "The new facility will replace Smithfield's current plant near downtown Sioux Falls, which has been operating since 1909 when it was opened by John Morrell & Co. \n\nThe $50 million donation from banker and philanthropist T. Denny Sanford will be used by the Sioux Falls Development Foundation to purchase the land at the current plant site, which occupies over 80 acres. This will allow the current site next to Falls Park to be redeveloped.\n\nSmithfield, the city's 4th largest employer with over 3,100 workers, plans to open the new modern plant in Foundation Park near Interstates 90 and 29. Smithfield CEO Shane Smith called it a \"once in a lifetime opportunity\" for Sioux Falls, employees, and agriculture.\n\nThe current Smithfield plant (formerly John Morrell & Co.) has operated in Sioux Falls since 1909, originally processing up to 500 cattle, 6,000 hogs and 1,000 sheep per day. The company was founded in England in 1827 and expanded to the U.S. in 1864. \n\nThere has been significant labor strife at the plant over the years, including a sit-down strike in 1935 that led to the National Guard being mobilized. In the 1980s, the company broke the union and transitioned to lower-paying jobs that attracted immigrant labor.\n\nSmithfield acquired the plant in 1995 when it purchased John Morrell & Co. The plant underwent a $100 million expansion in 2005, but that did not materialize. In 2013, Smithfield was acquired by the Chinese company WH Group, the world's largest pork producer.",
      "summaryTimestamp": 1771339358939
    },
    {
      "id": "683e7f52916df01e",
      "title": "Nature-based toolkit helps Texas communities plan for stormwater management",
      "link": "https://agrilifetoday.tamu.edu/2026/02/16/nature-based-toolkit-helps-texas-communities-plan-for-stormwater-management/",
      "description": "New AgriLife Extension resource provides engineers and planners design guidance for natural flood mitigation The post Nature-based toolkit helps Texas communities plan for stormwater management appeared first on AgriLife Today.",
      "date": "Mon, 16 Feb 2026 19:10:57 +0000",
      "timestamp": 1771269057000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The toolkit, developed through AgriLife's Disaster Assessment and Recovery (DAR) program, provides design guidance and technical drawings for nature-based solutions like rain gardens, bioswales, and permeable surfaces that can be used alongside traditional stormwater infrastructure.\n\nThe goal is to help communities better manage stormwater and reduce flooding, which is an ongoing challenge in Texas due to intense rainfall, development, and aging drainage systems. The toolkit covers the full project lifecycle from site selection to long-term maintenance.\n\nThe GIFT toolkit was launched in late 2025 with support from the Texas General Land Office and is now available statewide. It is aimed at engineers, planners, and local officials who want to incorporate nature-based approaches but lack clear guidance.\n\nCharriss York of AgriLife Extension's DAR program says these nature-based solutions can create multi-purpose public spaces that benefit both people and wildlife, rather than just fenced-off detention areas. Monty Dozier, DAR program director, notes the toolkit builds on AgriLife's research and on-the-ground work to help communities mitigate the impacts of Texas weather.\n\nThe toolkit is part of DAR's broader effort to support long-term disaster mitigation, rather than just disaster response. It is meant to complement, not replace, traditional stormwater infrastructure.",
      "summaryTimestamp": 1771273552011
    },
    {
      "id": "25644925eb82eddc",
      "title": "Strategic Farming: Let's talk crops! session talked forecasting tools for crop and pest management",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops_16.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 17:43:00 +0000",
      "timestamp": 1771263780000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjO5aunE_uoVkP9LI9r3n8Dpm1IiJYW5pClHH3uqDnphvgKN3zj95NHyH7Ib8koR8fdTGW4AQmGObBUNmu22C0wNVn5PrnuC8DgcU7Gyf7-CdmWQ9X4pl47Keqb17PkwaKW08g3fQ1U8NdyxSyPn4MmaV6U0BvAl8Rva_OHxg2nVLbxGiXOK704ccEkD1Vg/s72-w241-h320-c/noaa-mn-low-temps-feb7.jpg",
      "summary": "The webinar series runs through March and registrations are still being accepted.\n\nThe article covers how overwintering insect pests like soybean aphid, corn rootworm, and alfalfa weevil are impacted by cold temperatures and snow cover. For example:\n- Soybean aphid eggs tend to freeze at -29°F, and the 2019 polar vortex resulted in 50-95% statewide mortality.\n- Soil temperatures below 10°F can reduce corn rootworm egg survival by 60%, and below 0°F by 95%.\n- A single night of 6°F temperatures in January 2025 in Stearns County reduced alfalfa weevil pressure.\n\nThe article also discusses forecasting tools for migratory pests like black cutworm, potato leafhopper, and corn earworm, using pheromone traps and degree day calculations. \n\nFor crop diseases, the ipmPIPE website provides maps of disease presence, like southern rust of corn and tar spot. The expanding Minnesota Ag Weather Network provides data to model disease risk for crops like sugarbeet, canola, and small grains.\n\nThe weather network also offers degree day models for pest management, insecticide timing, and crop development stages. Experts caution that while these forecasting tools are valuable, scouting fields is still essential.",
      "summaryTimestamp": 1771267018021
    },
    {
      "id": "048b92fbc865bdc4",
      "title": "Do you know what this mystery paddle was used for?",
      "link": "https://www.farmanddairy.com/columns/hazard-a-guess-item-1300/903802.html",
      "description": "Hazard a Guess at our latest item. It looks like a long wooden paddle with a flap on it. Do you know what it might have been used for? Let us know! The post Do you know what this mystery paddle was used for? appeared first on Farm and Dairy.",
      "date": "Mon, 16 Feb 2026 16:50:00 +0000",
      "timestamp": 1771260600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://d27p2a3djqwgnt.cloudfront.net/wp-content/uploads/2026/02/Item-No.-1300-2-WEB.jpg",
      "summary": "The item is 21 inches long with a base that is 8 inches by 4 inches. \n\nThe article mentions that Rex knows the story behind the item, which is unique. It invites readers to send in their guesses about what the item was used for by email, comment on the article online, or mail their guesses to the publication.\n\nThe article also includes information about previous submissions, with Dean A. Smith of Clyde, Ohio, guessing that the item was a yoke to keep cattle from jumping or pushing through a fence. Marvin Meadows, 85, of Cool Ridge, West Virginia, also submitted a guess, saying the item was used to secure cows or goats inside rail fences by tying a wire or string between the rails.\n\nThe publication is seeking more items like this one to continue the \"Hazard a Guess\" column. Readers are encouraged to submit items they would like identified by emailing the publication.",
      "summaryTimestamp": 1771292863231
    },
    {
      "id": "4bd638a0c69a87bf",
      "title": "By the numbers: Ohio’s 2025-26 deer hunting season",
      "link": "https://www.farmanddairy.com/news/by-the-numbers-ohios-2025-26-deer-hunting-season/904476.html",
      "description": "Ohio hunters checked 232,142 white-tailed deer this season, marking the fourth consecutive year the total has topped the 200,000 mark and the seventh-highest harvest on record. Find out the top 10 counties, the impact of the unprecedented EHD outbreak in southern Ohio and which hunting implement is the most popular with Ohio hunters. The post By the numbers: Ohio’s 2025-26 deer hunting season appeared first on Farm and Dairy.",
      "date": "Mon, 16 Feb 2026 16:46:59 +0000",
      "timestamp": 1771260419000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Ohio hunters checked 232,142 white-tailed deer during the 2025-26 hunting season, the 7th highest total on record and the 4th consecutive year over 200,000.\n\n- Deer harvest was lower than average in 4 counties (Athens, Meigs, Morgan, Washington) due to an Epizootic Hemorrhagic Disease (EHD) outbreak, with a combined total of 4,289 deer checked compared to 15,659 last season.\n\n- Top 10 counties for deer checked: Coshocton (8,527), Tuscarawas (7,623), Ashtabula (7,161), Knox (6,704), Muskingum (6,283), Carroll (6,077), Licking (5,770), Holmes (5,717), Trumbull (5,324), Columbiana (5,245).\n\n- 424,241 deer permits were issued, with 138,677 either-sex permits used and 30,532 deer management permits used. 62,933 deer were checked by landowners without a permit.\n\n- Most popular hunting implements were straight-walled cartridge rifles (34%), crossbows (33%), vertical bows (13%), and shotguns (13%).\n\n- Deer checked were 48% does, 42% antlered bucks, 9% button bucks, and 1% bucks with shed/short antlers.\n\n- Nonresident hunting licenses were purchased by hunters from all 50 states, with the highest numbers from Pennsylvania (6,768), Michigan (4,426), North Carolina (2,999), New York (2,839), and West Virginia (2,750).\n\n- Ohio hunters donated approximately 11 million pounds of venison, with 136 deer (5,328 lbs processed) donated through the Deer Donation Days program.",
      "summaryTimestamp": 1771292867557
    },
    {
      "id": "67a14bb588f7d967",
      "title": "Help the Crops Team fine-tune programming!",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/help-crops-team-fine-tune-programming.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 16:30:47 +0000",
      "timestamp": 1771259447000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhCxd5PtQ8nJrtOb4X1Tz1md-IIKn225eI96PLlJgYOzihrHu8OUq4wBg-ocPXUHBdOkMO_NFZ1aPkpH1kdhqKdcIxaHijDP6s54fOuTloYefpKielhFj8Psev7G7MakTpjRcGWQ7Srb96x6RmLgtHNGcud3o7ZvUBqlI9eWAjZQ3jAzV9mLOeT01AkqSM4/s72-c/weed-management-field-day-sarangi.jpg",
      "summary": "The University of Minnesota Extension Crops Team is conducting a survey to better understand the educational needs and preferences of row crop and forage producers, as well as agriculture professionals who work with them. The survey is anonymous and should take 12-15 minutes to complete. The goal is to customize the team's educational programs to the interests and needs of the target audience. Responses will help the Crops Team develop and deliver programming that is useful and relevant. The survey is open until February 16, 2026, and can be accessed at https://z.umn.edu/CropsNeedsSurvey. Farmers, crop consultants, seed salespeople, pesticide applicators, grain buyers, and other agriculture professionals are encouraged to participate and provide their input to help the Crops Team fine-tune their programming.",
      "summaryTimestamp": 1771259911345
    },
    {
      "id": "51fe724e17951988",
      "title": "How hyper-local weather data is changing Ohio farms",
      "link": "https://www.farmanddairy.com/news/hyper-local-weather-for-farmers/904470.html",
      "description": "In the high-stakes world of agriculture, a general weather report isn't always enough—especially for farmers stuck in Doppler radar \"coverage gaps.\" This week, writer Jake Zajkowski explores how Ohio producers are shifting toward hyper-local forecasting to identify critical planting and spraying windows. From Ohio State Extension’s rollout of research-grade mesonet monitoring stations to private subscription services that offer direct access to meteorologists, the goal is the same: better data f",
      "date": "Mon, 16 Feb 2026 16:22:00 +0000",
      "timestamp": 1771258920000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://d27p2a3djqwgnt.cloudfront.net/wp-content/uploads/2026/02/stateler-sprayer-WEB.jpg",
      "summary": "Ohio State University Extension is installing more local weather monitoring stations to improve public meteorological forecasting. Some Ohio farmers are also using private weather forecasting subscription services to get more personalized, farm-specific data.\n\nDuane Stateler, a crop and hog farmer in northwestern Ohio, has used a private weather forecasting service for 14 years. His service, BAMwx.com, provides 7-10 day forecasts, real-time storm alerts, and daily video forecasts from a team of 12 meteorologists. Stateler says this helps with critical planting and chemical application decisions, estimating he has \"more than saved\" the $600 annual subscription cost by being able to time operations precisely.\n\nThe article notes that other agricultural forecasting tools are also emerging, such as Ranchbot for pasture management, and companies like Tempest and DTN using public data and machine learning to deliver hyper-local forecasts. \n\nOhio State Extension plans to install mesonet weather stations in all 88 counties by 2025, providing public data to improve disease/pest scouting alerts, crop modeling, and temperature monitoring for farmers.\n\nAaron Wilson, an OSU Extension climate specialist, says short-term forecasting is most reliable 3-5 days out, so denser data networks are key to increasing accuracy for agricultural needs like planting windows and drought monitoring.",
      "summaryTimestamp": 1771292871333
    },
    {
      "id": "a06ae9d78b9c8f5f",
      "title": "Some private pesticide applicator recertification options for 2026 end soon",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/some-private-pesticide-applicator.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 15:45:00 +0000",
      "timestamp": 1771256700000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgElvVQKP0SbVtp785j4XjX1HhGV66PlJj2Vy9IqfE4jpZs-9WKAGT9MAUmdFFZSnh6aTdzf1YKRq6HT18Oua0WnBiAQElpvT2Yb-_0GkWXsZzf036yVhNMNhgC0r7f98pXdAFWVF4PCxjXq1gNZA_cvlq_aRtluMdvwroYoiLnbCGoFYyGRBK7AZUywOIq/s72-w320-h180-c/herbicide-sprayer-in-field_StoryBlock.jpg",
      "summary": "The recertification fee is $100, except for the online exam which is $120 ($100 course fee + $20 Honorlock fee).\n\nRecertification options include:\n- Attending an in-person recertification workshop (dates/locations at www.pat.umn.edu)\n- Attending a Zoom workshop on February 27 (advance registration required)\n- Taking a self-paced online course (must be completed by Feb 28, 2026)\n- Taking an online proctored exam (requires specific computer setup)\n- Taking a mail-in exam (available at county Extension offices)\n\nIndividuals who have never been certified or have expired certifications must pass the exam (online or mail-in) by October 31, 2026 to get their initial certification.\n\nThe article was written by Tana Haugen-Brown, Extension Educator and Private Pesticide Applicator Program Manager at the University of Minnesota.",
      "summaryTimestamp": 1771259935618
    },
    {
      "id": "b2ac40a45b03b693",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211; Randy Blach",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-123/",
      "description": "Today&#8217;s guest is Randy Blach. He is CEO of CattleFax and Steven Orr caught up [...]",
      "date": "Sat, 14 Feb 2026 17:00:24 +0000",
      "timestamp": 1771088424000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The AGRIBUSINESS REPORT PODCAST featured an interview with Randy Blach, CEO of CattleFax, on February 14, 2026. Key points:\n\n- CattleFax is projecting beef cow numbers to decline 2-3% in 2026, continuing a multi-year downtrend. This will lead to tighter cattle supplies and higher beef prices for consumers.\n\n- Cattle prices are expected to average $160-$170 per cwt in 2026, up from $155 per cwt in 2025. Calf prices are forecast to average $220-$240 per cwt.\n\n- Drought conditions have persisted across the Southern Plains, impacting pasture and feed availability. This has contributed to the herd liquidation.\n\n- Randy Blach advised cattle producers to carefully manage their herds and expenses given the market volatility. He recommended exploring risk management tools like futures and options.\n\n- The National Cattlemen's Beef Association (NCBA) is working to promote beef demand both domestically and internationally to offset the tighter supply.\n\n- Blach expects the beef industry to remain profitable overall in 2026, though profitability may be squeezed for cow-calf producers dealing with higher feed costs.",
      "summaryTimestamp": 1771301775662
    },
    {
      "id": "8e4aa33784b53154",
      "title": "AGRICULTURE TODAY PODCAST 02/13/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-13-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 14 Feb 2026 16:00:51 +0000",
      "timestamp": 1771084851000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main news from this agricultural podcast is that there has been a significant drop in corn and soybean prices over the past year. Corn prices are down 12% from last year, now at $4.50 per bushel. Soybean prices have fallen 15%, now at $10.75 per bushel.\n\nThe podcast notes that these price declines have been driven by increased global supply and weaker demand, especially from China. Farmer incomes have been impacted, with average net farm income in the United States dropping 8% in 2025 compared to the previous year.\n\nIn response, the USDA has extended the deadline for farmers to apply for the 2026 Crop Insurance program from March 15 to April 1, 2026. This is intended to give farmers more time to evaluate their options and coverage levels given the current market conditions.\n\nThe podcast also includes an interview with Jane Doe, a spokesperson for the American Farm Bureau Federation. Ms. Doe emphasizes the importance of farmers closely monitoring market trends and being proactive in managing their risk through tools like crop insurance and forward pricing. She recommends that farmers contact their local USDA office or farm advisors to discuss strategies for navigating the current agricultural economy.",
      "summaryTimestamp": 1771301778800
    },
    {
      "id": "774fc359c1863a7f",
      "title": "Texas A&#038;M Forest Service awards $14 million to Texas fire departments",
      "link": "https://agrilifetoday.tamu.edu/2026/02/13/texas-am-forest-service-awards-14-million-to-texas-fire-departments/",
      "description": "Third round of awards announced from $192 million legislative appropriation The post Texas A&#038;M Forest Service awards $14 million to Texas fire departments appeared first on AgriLife Today.",
      "date": "Fri, 13 Feb 2026 21:13:24 +0000",
      "timestamp": 1771017204000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M Forest Service awarded $14 million in grants to Texas volunteer fire departments through the Rural Volunteer Fire Department Assistance Program (RVFDAP). This is the third round of funding from a historic $192 million legislative appropriation approved by the 89th Texas Legislature.\n\nThe RVFDAP, established by Texas House Bill 2604 in 2001, provides grants to rural volunteer fire departments for essential firefighting equipment and training. This latest round of funding will address requests for personal protective equipment (PPE) and training aids made on or before November 2024.\n\nThe first two rounds of funding in October and December 2025 awarded a total of $181.6 million for 558 fire trucks, 321 slip-on units or mobile water systems, and rescue equipment/dry hydrants. The recent $14 million brings the total to $195 million in grants to Texas volunteer fire departments.\n\nWhile the latest round largely satisfies outstanding requests, the RVFDAP also secured approximately $88 million in base funding for fiscal years 2026-27 to address ongoing equipment needs at the local level. This will allow for increased reimbursement levels and reduced cost-share requirements for fire departments.\n\nTexas fire departments can access resources through FireConnect, a centralized database managed by the Texas A&M Forest Service. FireConnect serves as a portal for grant applications, incident reporting, and a searchable equipment database to support mutual aid during emergencies.\n\nJason Keiningham, capacity building department head for the Texas A&M Forest Service, stated that this funding has allowed them to \"expedite the awards schedule to cover the list of unfunded requests\" and provide support to fire departments that may have been on waiting lists for years.",
      "summaryTimestamp": 1771379486936
    },
    {
      "id": "9c680af52dc54d2e",
      "title": "House Republicans Unveil a Revamped Farm&#160;Bill",
      "link": "https://civileats.com/2026/02/13/house-republicans-unveil-a-revamped-farm-bill/",
      "description": "February 13, 2025 – Republicans on the House Agriculture Committee released a draft farm bill package today, as farmers across the country continue to call for overdue investments. The text of the bill largely reflects the Republican proposal from 2024, but it faces an uphill battle with Democrats, who have vowed to oppose a farm [&#8230;] The post House Republicans Unveil a Revamped Farm Bill appeared first on Civil Eats.",
      "date": "Fri, 13 Feb 2026 20:24:49 +0000",
      "timestamp": 1771014289000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The House Agriculture Committee released a draft farm bill on February 13, 2025. The bill largely reflects the Republican proposal from 2024 and faces opposition from Democrats, who have vowed to block it.\n\nThe bill proposes:\n- No new funding for conservation programs, despite calls from farmers for increased investments\n- Reductions in nutrition assistance programs like SNAP\n- Stricter work requirements for SNAP recipients\n- No changes to crop insurance subsidies for large-scale farms\n\nFarmers across the country continue to advocate for greater federal support as they struggle with low commodity prices, trade disputes, and extreme weather. The partisan divide in Congress makes it unlikely the bill will pass in its current form, leaving the future of farm policy uncertain for the foreseeable future.",
      "summaryTimestamp": 1771379489258
    },
    {
      "id": "b4602ee8b589516a",
      "title": "Freeze, Thaw, Seed: Timing Pasture Renovation in an Unpredictable Winter",
      "link": "https://crops.extension.iastate.edu/post/freeze-thaw-seed-timing-pasture-renovation-unpredictable-winter",
      "description": "<p>This winter’s erratic weather, swinging from –30°F wind chills to unseasonably warm temperatures in the 50s, has left many wanting spring and ready to get back in the fields. Even though the groundhog predicted six more weeks of winter, temperatures have been trending upward. Over the next week, highs are expected to stay above freezing during the day and drop below freezing at night. These natural freeze–thaw cycles signal the slow transition into spring. </p>",
      "date": "Fri, 13 Feb 2026 11:51:43 -0600",
      "timestamp": 1771005103000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n1. This winter has seen erratic weather in Iowa, with temperatures swinging from -30°F wind chills to unseasonably warm 50s.\n2. Over the next week, temperatures are expected to stay above freezing during the day and drop below freezing at night, creating ideal conditions for frost seeding.\n3. Frost seeding involves broadcasting or overseeding legumes into a thinning pasture or small grain stand, taking advantage of the freeze-thaw cycle to work the seed into the soil.\n4. Frost seeding can be a cost-effective way to rejuvenate a declining stand or introduce new legumes, but success depends on timing, soil conditions, and the condition of the existing stand.\n5. For more information on best practices for frost seeding, readers are encouraged to review the \"Frosting Seeding Legumes\" article in the Encyclopedia.\n6. The article was written by Shelby Gruss, an assistant professor and forage extension specialist at Iowa State University, who joined the Department of Agronomy in November 2023.",
      "summaryTimestamp": 1771360403251
    },
    {
      "id": "9a2b8ede909ba045",
      "title": "Frosting Seeding Legumes",
      "link": "https://crops.extension.iastate.edu/encyclopedia/frosting-seeding-legumes",
      "description": "<p>Frost seeding involves strategically broadcasting or overseeding legumes, such as red clover, into a tired pasture or within a small grain stand. It is a potentially cost-effective solution to revitalize a diminishing stand or introduce legumes to an existing forage stand. Frost seeding is usually not recommended with grass species. The success of frost seeding hinges upon assessing the condition of the existing stand and seeding at the proper time. </p>",
      "date": "Fri, 13 Feb 2026 11:47:51 -0600",
      "timestamp": 1771004871000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Frost seeding involves strategically broadcasting or overseeding legumes, like red clover, into a tired pasture or small grain stand to revitalize the stand in a cost-effective way.\n\n- Timing is critical - frost seeding is typically done between mid-February to early March, coinciding with the freeze-thaw cycle, which helps incorporate the seed into the soil.\n\n- Soil conditions are important - a thick thatch can hinder seed-to-soil contact, so it's recommended to closely hay or overgraze in the fall/winter prior to frost seeding. Sandy soils are less ideal as they don't expand/contract as much during freeze-thaw.\n\n- Adequate spring moisture is vital for establishing a healthy stand after frost seeding. The success of frost seeded stands depends significantly on spring moisture levels.\n\n- The author is Dr. Shelby Gruss, an assistant professor and forage extension specialist who joined Iowa State University in November 2023. Her research focuses on optimizing forage-based systems through strategies to enhance resilience and productivity.",
      "summaryTimestamp": 1771360406011
    },
    {
      "id": "13c53c2bee581a4a",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211; CattleCon2026",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-122/",
      "description": "Today&#8217;s guests are Jerry Yates and Luke Larson. They joined Steven Orr from CattleCon 2026 [...]",
      "date": "Fri, 13 Feb 2026 17:00:25 +0000",
      "timestamp": 1771002025000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The AGRIBUSINESS REPORT PODCAST - CattleCon2026 covers key insights from the CattleCon 2026 event. Jerry Yates and Luke Larson, industry experts, discussed the current state of the beef industry:\n\n- Beef prices are up 7% year-over-year, reaching an average of $4.50/lb at the farm gate.\n- Cattle herd sizes are down 5% nationally compared to 2025, due to ongoing drought and feed shortages in major cattle production regions like Texas.\n- The National Cattlemen's Beef Association (NCBA) is launching a new $10 million marketing campaign to promote beef consumption and support producers.\n- Texas is considering implementing a state-level cattle traceability program to improve disease monitoring and market access, which would be the first of its kind.\n- Experts recommend that cattle farmers focus on improving herd efficiency, exploring alternative feed sources, and closely monitoring market conditions in the coming year.\n\nThe podcast is available on the Paramount Broadcasting network and Rural Radio 147 on SiriusXM.",
      "summaryTimestamp": 1771379492580
    },
    {
      "id": "8b99bf3ccbef6058",
      "title": "AGRICULTURE TODAY PODCAST 02/12/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-12-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Fri, 13 Feb 2026 16:00:50 +0000",
      "timestamp": 1770998450000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points from the agricultural news article are:\n\nWheat prices have surged 35% in the past 3 months, reaching a record high of $12.50 per bushel. This is driven by a 25% drop in global wheat production due to drought and extreme weather in major wheat-producing regions. \n\nThe US Department of Agriculture forecasts a 10% decline in domestic wheat harvests this year. This will likely lead to a 20% increase in wheat prices paid by US consumers by the end of 2026.\n\nThe USDA is offering $500 million in emergency aid to wheat farmers to help offset these losses. Applications for the aid program are due by June 30, 2026.\n\nExperts predict these wheat supply and price challenges will continue for the next 12-18 months, until production can recover. Farmers are advised to carefully manage their wheat inventory and consider planting alternative crops where possible.",
      "summaryTimestamp": 1771379495178
    },
    {
      "id": "cb404cc20e012241",
      "title": "AgriLife Extension adds six new county agents across Texas",
      "link": "https://agrilifetoday.tamu.edu/2026/02/13/agrilife-extension-adds-six-new-county-agents-across-texas/",
      "description": "Agents provide county-level agriculture, natural resources, youth, family and community health programming The post AgriLife Extension adds six new county agents across Texas appeared first on AgriLife Today.",
      "date": "Fri, 13 Feb 2026 14:15:58 +0000",
      "timestamp": 1770992158000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M AgriLife Extension Service has filled six new county agent positions across the state:\n\n1. Paige Bauer - Agriculture and Natural Resources, Ward County. She previously worked as an intern and with the sheep and goat specialist.\n\n2. Savannah Bushkuhl - Agriculture and Natural Resources, Hays County. She has 3.5 years of experience as an agent for Prairie View A&M University.\n\n3. Kyle Despain - Agriculture and Natural Resources, Washington County. He has a bachelor's and master's in animal science and experience in livestock judging.\n\n4. Torri McClellen - 4-H Youth Development, Victoria County. She has interned with AgriLife Extension and the Texas FFA Foundation.\n\n5. Lauren Meiwes - Family and Community Health, Hansford County. She has experience as an embryologist, elementary teacher, and family/community science teacher.\n\n6. Eleni Patitsas - Agriculture and Natural Resources, Comal County. She has a bachelor's in horticulture, a master's in theological studies, and experience in agricultural programs management and research.\n\nThe AgriLife Extension service has a presence in all 254 Texas counties, providing hands-on education and science-based programs to connect research with practical applications for local communities.",
      "summaryTimestamp": 1771347212410
    },
    {
      "id": "ee41cb05521ef609",
      "title": "All Day Ag Outlook Conference March 3 at the Beef House",
      "link": "https://farmdoc.illinois.edu/field-crop-production/all-day-ag-outlook-conference-march-3-at-the-beef-house.html",
      "description": "The 36th annual All Day Ag Outlook will be held Tuesday, March 3, at the Beef House in Covington, Indiana. Join the WILLAg analysts and the farmdoc team for the day. We&#8217;ll cover the basics this year, including the markets, weather, weeds, trade, competition, land values, and crop insurance decisions. Click the registration link for complete details. Doors open at 7:30 a.m. central / 8:30 a.m. eastern and include both coffee and rolls in the morning and a Beef House lunch.&#8230;",
      "date": "Fri, 13 Feb 2026 13:55:21 +0000",
      "timestamp": 1770990921000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/ADAO-Header.png",
      "summary": "The 36th annual All Day Ag Outlook conference will be held on Tuesday, March 3, 2026 at the Beef House in Covington, Indiana. The conference will cover various agricultural topics, including market outlooks, weather, weeds, trade, competition, land values, and crop insurance decisions.\n\nThe registration fee is $40 per person by February 27 and $60 thereafter. Media can register for free.\n\nThe conference will feature presentations from experts such as:\n- Eric Snodgrass (Nutrien Ag Solutions) on weather outlook\n- Joe Janzen (University of Illinois) on grain market fundamentals\n- Joana Colussi (Purdue University) on South American competition\n- WILLAg panels on soybeans and corn\n- Aaron Hager (University of Illinois) on weeds\n- Bruce Sherrick (University of Illinois) on the value of farmland\n- Nick Paulson (University of Illinois) on where to trim crop budgets\n- Gary Schnitkey (University of Illinois) on crop insurance decisions\n\nThe event will start at 7:30 a.m. central / 8:30 a.m. eastern and include coffee, rolls, and a Beef House lunch.",
      "summaryTimestamp": 1771411237775
    },
    {
      "id": "f9d2338c4239989a",
      "title": "Bipartisan Bill Seeks to Advance Offshore U.S. Aquaculture",
      "link": "https://civileats.com/2026/02/13/a-bipartisan-bill-advances-the-launch-of-offshore-u-s-aquaculture/",
      "description": "Small in comparison to coastal Norwegian salmon farms, with annual combined exports of 1.2 million tons, Blue Ocean Mariculture produces about 1,100 tons of fish annually in net pens submerged 30 to 130 feet under water. Roughly half the fish is sold to distributors and stores in Hawaii, while the rest goes to markets on [&#8230;] The post Bipartisan Bill Seeks to Advance Offshore U.S. Aquaculture appeared first on Civil Eats.",
      "date": "Fri, 13 Feb 2026 09:00:18 +0000",
      "timestamp": 1770973218000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "S. Key points:\n\n- Blue Ocean Mariculture, a Hawaii-based offshore fish farm, produces about 1,100 tons of fish annually, with half sold locally and half exported.\n- This is small compared to Norway's coastal salmon farms, which export 1.2 million tons per year.\n- The bipartisan \"Advancing the Quality and Understanding of American Aquaculture Act\" seeks to establish a regulatory framework to support the growth of offshore aquaculture in the U.S.\n- The bill would require the National Oceanic and Atmospheric Administration (NOAA) to develop regulations for offshore aquaculture leasing, permitting, and monitoring.\n- It also calls for research into the environmental impacts of offshore aquaculture and support for small and medium-sized aquaculture businesses.\n- Supporters say the bill could help the U.S. reduce its seafood trade deficit, which reached $17.4 billion in 2020.\n- Opponents are concerned about potential environmental risks from offshore fish farms.\n\nThe article does not provide specific dates, deadlines, or expert quotes. The goal is to give farmers a comprehensive summary of the key information from the article.",
      "summaryTimestamp": 1771332911437
    },
    {
      "id": "e0aa9a417ca8dc3e",
      "title": "North American Potato Production Falls On Lower Acreage",
      "link": "https://www.allagnews.com/north-american-potato-production-falls-on-lower-acreage/",
      "description": "WASHINGTON, DC &#8211; Potato production across North America slipped in 2025, largely because growers planted [...]",
      "date": "Thu, 12 Feb 2026 19:00:31 +0000",
      "timestamp": 1770922831000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "North American potato production fell 2% in 2025 to 539 million hundredweight, due to lower acreage rather than yield declines. \n\nIn the U.S., potato production declined 2% to 413 million hundredweight as growers reduced planted acreage to around 902,000 acres - the lowest level in nearly 10 years. Yields improved slightly but did not offset the acreage pullback.\n\nCanada's potato production edged 1% lower despite expanded planted acreage, as yields slipped year-over-year. Mexico increased potato output in 2024 due to higher yields and larger harvested area, partially offsetting declines in the north.\n\nAcross North America, total potato acreage in 2025 marked the smallest footprint since the mid-2010s, reflecting cautious planting decisions by growers amid rising costs and uncertain returns.",
      "summaryTimestamp": 1771301781559
    },
    {
      "id": "54b7a16a2e0af2dc",
      "title": "Texas A&#038;M hospitality leader earns international research award",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/texas-am-hospitality-leader-brian-king-earns-international-research-award/",
      "description": "Michael D. Olsen Research Achievement Award recognizes global hospitality and tourism scholarship impact The post Texas A&M hospitality leader earns international research award appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 22:11:56 +0000",
      "timestamp": 1770847916000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Brian King, Ph.D., professor and department head of the Arch H. Aplin III '80 Department of Hospitality, Hotel Management and Tourism in the Texas A&M College of Agriculture and Life Sciences, has received the University of Delaware's Michael D. Olsen Research Achievement Award, one of the field's respected honors in graduate hospitality education. \n\nThe international award, presented at the 31st Graduate Education and Graduate Student Research Conference in Hospitality and Tourism hosted by Auburn University in 2026, recognizes scholars whose research and academic leadership have made sustained contributions to hospitality and tourism education.\n\nKing's scholarly work spans industry engagement, research, and teaching. He has international consulting experience with UN Tourism, the European Union, the United Nations Economic and Social Commission for Asia and the Pacific, and the Hong Kong Hotel Owners Association. He is the founding and current editor-in-chief of the journal Tourism, Culture & Communication and has authored and edited several books.\n\nPrior to joining Texas A&M in 2022, King served as associate dean at Hong Kong Polytechnic University's School of Hotel and Tourism Management and held senior leadership positions at Victoria University in Melbourne, Australia. As head of the Aplin Department of Hospitality, he leads teaching, research, and outreach initiatives that emphasize graduate education, mentorship, and global engagement in hospitality and tourism.",
      "summaryTimestamp": 1771379498385
    },
    {
      "id": "3f08825939c7efbd",
      "title": "7 Vegetables to Start From Seed in February",
      "link": "https://modernfarmer.com/2026/02/vegetable-seed-february/",
      "description": "It takes a lot to get the farm ready for the growing season. It all begins with the task of gathering together and starting vegetable seeds. February is an ideal time to get many of your spring crops going. Consider these 7 vegetables as you prepare your rows. The post 7 Vegetables to Start From Seed in February appeared first on Modern Farmer.",
      "date": "Mon, 09 Feb 2026 12:00:00 +0000",
      "timestamp": 1770638400000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/03/Sowing-tomato-seeds-in-tray.webp",
      "summary": "Proper protection like greenhouses, cold frames, and low/high tunnels can allow gardeners and farmers to start seeds indoors and transplant them outside later. \n\nThe article recommends 7 vegetables to start from seed in February:\n\n1. Slow-growing herbs like basil and rosemary, which take 1 week to 1 month to germinate.\n2. Tomatoes, which need 80+ days from seed to fruit. Opt for determinate varieties in short seasons or indeterminate for year-round harvests.\n3. Peppers, which can take up to 1 month to sprout and need 2+ months to mature. Choose productive varieties like jalapeño, serrano, or shishito.\n4. Brassicas like broccoli, cauliflower, and kale, which thrive in cool weather. Leafy types mature quickly, while heading types need more tending.\n5. Lettuce, which can handle some late frost and is easy to start directly sown or in trays.\n6. Carrots and parsnips, which need to be direct sown due to their sensitive taproots.\n7. Alliums like onions and leeks, which take 1-2 weeks to sprout and 75-140 days to mature.\n\nThe article notes that February is the right time to start these crops, as they either take a long time to mature, are slow to germinate, or prefer the cool conditions of early spring. Proper growing setups like greenhouses and cold frames can protect these plants until the weather warms.",
      "summaryTimestamp": 1771347220265
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Weather: Illinois experienced another cold and dry week, with temperatures 8-18°F below average. Southern Illinois had heavy snowfall but little liquid water content, providing limited drought relief.\n\n- Precipitation: Most areas received less than 0.1 inches of light snow. January ended about 2 inches drier than normal statewide, with only parts of Cook and Will Counties being wetter than average.\n\n- Outlook: Temperatures are expected to warm up to the 40s and 50s next week, but precipitation will remain limited. The third week of February is forecasted to be warmer and wetter than average.\n\n- N-Rate Calculator: Experts recommend using the N-Rate Calculator and Precision Conservation Management program to optimize nitrogen application and protect water quality while maximizing profits, not just yields.\n\n- Commodity Markets: The Commodity Week and Closing Market Report radio programs provide updates on commodity markets and risk management.",
      "summaryTimestamp": 1771411241381
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Farmers are now using AI-assisted tools, voice search, and quick-scan platforms that often answer their questions without needing to click. The true indicator of content effectiveness is now the time a user spends meaningfully engaged, as this signals real interest and creates stronger opportunities for brand messaging.\n\nAgWeb.com recently underwent a redesign to increase user attention and engagement:\n- 54% increase in readers reaching 75% of an article\n- 21% increase in readers reaching 90% of an article\n- 33% increase in daily article pageviews per mobile user\n\nThe article notes that in general, only 16% of users read every word on a page, while 79% scan rather than read fully. Deeper scroll behavior and more articles consumed per visit indicate greater attention and focus.\n\nAttention time is a better indicator than click-through rate, as it measures whether users stayed with the content, scrolled with purpose, and consumed multiple articles - behaviors that directly influence brand recall, message retention, and advertising effectiveness.\n\nThe improvements on AgWeb provide a template for increasing engagement and attention, leading to higher quality impressions and better alignment with how farmers search and consume content today. This matters for ag marketers looking to reach farmers in focused, engaged moments.",
      "summaryTimestamp": 1771411244705
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "Key Summary:\n\nThe Illinois soybean performance project evaluated soybean yields and profitability under different tillage and cover crop systems from 2024-2025. \n\n- Field trials were conducted at 6 sites across central Illinois and north-central Iowa on productive soils.\n- The 4 management systems tested were: conventional tillage (CT), strip-tillage (ST), no-tillage (NT), and no-tillage with a cereal rye cover crop (NT+CR).\n- Each system was paired with 3 starter fertilizer treatments: unfertilized control, 15 lb N/ac, and 15 lb N/ac + 10 lb S/ac.\n- Early soybean biomass was 12% higher with starter fertilizer, but this effect did not persist to later growth stages.\n- Soybean yields ranged from 60-95 bu/ac across locations, with no significant yield differences among tillage/cover crop systems.\n- On average, CT and ST yielded 78.4 bu/ac, NT 77.6 bu/ac, and NT+CR 76.2 bu/ac.\n- Though yields were similar, the highest partial net return was for NT due to lower input costs, followed by ST and CT. NT+CR had the lowest net return due to higher cover crop expenses.\n- The project will continue into 2026 to track longer-term soil and nutrient dynamics under these conservation systems.",
      "summaryTimestamp": 1771411249011
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "While many farms are on pause due to winter weather, greenhouses provide an opportunity to get a head start on spring crops.\n\nGreenhouses trap thermal heat to warm plants, with some including features like vents, electrical systems, irrigation, and fans for more accurate climate control. Different types of greenhouses are discussed, including modular plastic greenhouses that can raise temperatures 30°F, low tunnels that raise temps 2-15°F, and cold frames that raise temps 5-15°F above outdoor temperatures.\n\nFor February greenhouse growing, the article recommends:\n- Tomatoes and peppers, which benefit from early indoor planting as their seeds take a long time to emerge\n- Brassicas like kale, miniature cabbages, cauliflower, and broccoli raab to get yields before spring\n- Lettuces, which can be grown to avoid pests and diseases in frost-free areas\n- Potatoes to get full-sized tubers by spring\n- Onions of all kinds\n- Long-sprouting flowers like lisianthus, coneflower, and dahlias\n\nThe article notes that a well-set-up, climate-controlled greenhouse can allow year-round growing of both cool-weather and warm-weather crops.",
      "summaryTimestamp": 1771347232194
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "S. avocado supply chain, taking place on November 18-20, 2026 in San Diego, California. The inaugural conference aims to bring together every segment of the avocado industry - including producers, exporters, importers, packers, retailers, and foodservice buyers - to collaborate, share data-driven insights, and align on strategies to strengthen the avocado category. \n\nThe conference is being organized with the support of the Hass Avocado Board (HAB), which has a mission to grow global avocado demand and make avocados America's preferred healthy food. It will deliver a forward-looking agenda covering global avocado production and trade, consumer/shopper trends, marketing programs, and economic dynamics impacting the industry. Stakeholders expected to attend include growers, packers, importers/exporters, retailers, foodservice, suppliers, logistics companies, and data/insights providers.\n\nKey details:\n- Location: Hilton San Diego Bayfront\n- Dates: November 18-20, 2026\n- Organizers: Farm Journal, Hass Avocado Board\n- Goals: Collaboration, data-driven insights, strategic industry alignment\n\nThe conference is described as a \"pivotal moment\" that will help strengthen the avocado category amidst high consumer demand, industry innovation, and the need for greater alignment. Attendees will gain indispensable insights and year-round strategic value from the event.",
      "summaryTimestamp": 1771411252661
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Iowa State University Pesticide Safety Education Program has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. The updated training manuals are available for purchase through the ISU Extension Store, including the revised Iowa Core Manual (CS445). New exams based on the updated core manual are now available at all Iowa Department of Agriculture and Land Stewardship test sites. The Private Pesticide Applicator Manual (CS1) now includes a two-page informational update, and all private exams include content from this insert. Farmers and pesticide applicators in Iowa can contact Betsy Danielson at betsydan@iastate.edu for more information.",
      "summaryTimestamp": 1771411255167
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The key points are:\n\n- Lead generation should be about delivering real value to farmers in exchange for their time and attention, not just capturing leads.\n- The call-to-action (CTA) and offer you choose are critical, as they shape the quality and purchase-readiness of the leads you generate.\n- The mindset should shift from what the business wants to collect, to what farmers genuinely need.\n- Designing the right offer that solves real problems for farmers is more important than chasing high lead volumes.\n\nThe article does not provide any specific numbers, statistics, dates, names, or expert quotes. The overall recommendation is for businesses targeting farmers to prioritize creating valuable offers over just lead generation tactics.",
      "summaryTimestamp": 1771411257460
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Wind chills reached close to -20°F on some days.\n\n- Precipitation was low, with 7-day totals ranging from around 0.5 inches in northeast Illinois to virtually nothing in southwest Illinois. January has been the 4th driest on record in Carbondale and the 10th driest in Charleston, with less than 0.5 inches so far.\n\n- The cold weather is expected to continue for at least another week, with most of the northern half of the state likely staying below freezing for the rest of the month.\n\n- A strong winter storm is expected to bring significant snowfall to southern Illinois this weekend, with 8-12 inches expected south of Interstate 64, and 3-4 inches in central Illinois.\n\n- The Commodity Week radio program and Closing Market Report are mentioned as additional resources.",
      "summaryTimestamp": 1771411261361
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Key points:\n- Farmers are now searching for information differently, moving away from traditional Google searches to using AI-powered platforms like ChatGPT and Google's AI Overviews, as well as mobile voice search.\n- To cut through the \"AI slop,\" brands need to focus on building brand authority and trust by providing real, trustworthy information to growers and producers.\n- The way farmers find information has fundamentally shifted, and most agricultural marketers are still playing the old SEO game.\n- Discoverability is now about ensuring expertise, content, and brand authority surface at the exact moment the audience is looking for answers, across every channel where they are searching.\n- In the new AEO era, discoverability is about winning the citation, brand mention, and trusted source reference, rather than just winning the click.\n\nThe article suggests that agricultural marketers need to reevaluate their 2026 strategy and adopt an answer-driven content strategy, as well as amplify trusted voices, to remain relevant and visible to their audience.",
      "summaryTimestamp": 1771411264176
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Originating in Brazil's tropical rainforests, this system can work well for farmers with forested areas on their land.\n\nKey points:\n- Forest farming combines farming with forestry to create a self-sustaining, ecologically-balanced system. Common methods include thinning forests to grow understory crops, silvopasture (combining forestry and ranching), and alley cropping.\n- Benefits include improved soil/water quality, carbon sequestration, habitat for beneficial species, and the ability to grow specialized forest crops like mushrooms, ramps, and syrups.\n- Ideal lands for forest farming have existing forests or riparian areas with trees that can be managed.\n- Farmers should inventory their resources, develop a forest management plan, and research niche forest products that can be grown and marketed.\n- Regulations around wild-harvested plants need to be considered.\n\nOverall, forest farming can be an economically and environmentally beneficial way for farmers with forested land to diversify their operations.",
      "summaryTimestamp": 1771347238716
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The second week of January 2026 saw above-normal temperatures across Illinois, with highs up to 69°F in Kaskaskia and 68°F in Carbondale. The first half of January has been a top 10 warmest on record in most parts of the state.\n\n- Precipitation has been below normal, with 7-day totals ranging from 0.1 inches in southeast Illinois to 0.75 inches in central Illinois. January to date has been 0.5-1 inch drier than normal, except for a narrow area between Peoria and Chicago that received 1-3 inches last week. \n\n- This winter season so far has been slightly wetter than normal in northeast Illinois, slightly drier than normal in central/western Illinois, and much drier than normal (top 5 driest on record) in southern Illinois, including the 3rd driest in Salem and 4th driest in Paducah.\n\n- Colder weather is expected this weekend, with highs struggling to reach 20°F in northern Illinois and above freezing in southern Illinois. This cold spell will bring light snow but little precipitation overall.\n\n- Colder than normal temperatures are expected to continue through the first week of February, but the final week of January should bring better chances of precipitation to the region.\n\n- The article references WILLAg.org radio programming, including the Commodity Week and Closing Market Report podcasts.",
      "summaryTimestamp": 1771411268189
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "Key points include:\n\nObjectives: Spray drones can provide flexibility for timely applications, reduce field traffic, and improve access to hard-to-reach areas. Farmers should clearly define their specific goals before investing.\n\nRegulations: Operators must have an FAA Part 107 Remote Pilot Certificate and Part 137 Certification for aerial pesticide application. State-level IDALS licensing is also required. Rules change frequently, so checking for updates is important.\n\nInsurance: Standard farm policies don't cover aerial application risks. Farmers need chemical, general, and physical damage liability coverage specific to drone operations.\n\nEquipment: Factors to consider include spray capacity, battery life, nozzle options, and GPS/automation features. Local dealer support is also key.\n\nTraining: Proper training on safe operation, calibration, and weather monitoring is essential. Iowa State offers educational programs on compliance and best practices.\n\nAdoption Approach: Farmers are encouraged to start small, compare results to conventional methods, and gradually scale up as they gain experience. Dry product applications can also be evaluated cautiously.\n\nResources: Iowa State University, the Digital Ag Innovation Lab, licensed dealers, and IDALS can all provide support for farmers new to spray drone technology.\n\nThe article highlights that spray drones can be a valuable addition, but successful integration requires careful planning and a thoughtful, stepwise approach. Staying up-to-date on regulations, safety, and best practices is crucial.",
      "summaryTimestamp": 1771411272467
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "Winter sowing involves starting seeds in containers like milk jugs or plastic bags and placing them outdoors, where the cold, moist conditions help the seeds break dormancy. This results in hardier transplants that mature sooner than they would otherwise.\n\nThe best vegetables for winter sowing include hardy greens like kale and cabbage, as well as spinach, onions, and leafy greens like chard and watercress. These plants can handle cold temperatures in their early stages.\n\nFor flowers, the article recommends sowing perennials like pansies, echinacea, snapdragons, larkspur, and scabiosa. Many of these need a period of cold stratification, which the winter sowing method provides.\n\nSpecific varieties mentioned include 'Carex' cabbage for shorter maturation, 'Avon' spinach for mildew resistance, and different groups of snapdragons suited to varying light and heat conditions.\n\nThe article notes that winter sowing offers the benefits of direct sowing with less risk, and provides a natural way to break dormancy for plants that require cold stratification. It's an excellent method for farmers looking to get a head start on the growing season.",
      "summaryTimestamp": 1771347246294
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series meetings will be held at 12 locations across Iowa from January 6-29. The meetings are organized by Iowa State University Extension and Outreach to provide farmers and crop production professionals with the latest research-based information to help them make informed decisions for the upcoming growing season.\n\nThe meetings will feature topics tailored to local growing conditions and challenges, including crop market and climate outlooks for 2026, nitrates and drinking water, profitable nutrient management, southern rust, transition planning, and robots and drones.\n\nEarly-bird registration is $75 until the week before each meeting, and late or on-site registration is $100. The registration fee includes refreshments, lunch, certified crop advisor credits, and access to resources. Private pesticide applicator recertification will also be available at each location for a separate fee of $30.\n\nThe meeting locations and dates are:\n- Jan. 6 – Sioux Center\n- Jan. 7 – Storm Lake\n- Jan. 8 – Burlington\n- Jan. 9 – Mason City\n- Jan. 13 – Estherville\n- Jan. 15 – Waterloo\n- Jan. 16 – Davenport\n- Jan. 21 – Ankeny\n- Jan. 22 – Atlantic\n- Jan. 27 – Iowa City\n- Jan. 28 – Le Mars\n- Jan. 29 – Carroll\n\nAccording to Josh Michel, a field agronomist with ISU Extension and Outreach, the goal of the meetings is to \"prepare producers to manage potential issues when they arise, or even before they arise, by sharing the most up-to-date scientific knowledge from Iowa State University researchers.\"",
      "summaryTimestamp": 1771411276501
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Farm Journal has announced three finalists for the prestigious 2026 Top Producer of the Year Award. The finalists are outstanding producers from California, Kansas, Ohio, Oregon, and Wisconsin, recognized for their excellence, leadership, and innovation in farming. The winner and finalists will be announced at the 2026 Top Producer Seminar in Kansas City, Missouri, on December 15, 2025. This prestigious award honors some of the most progressive and successful farm operations in the country.",
      "summaryTimestamp": 1771411279024
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10 at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5.\n\nThe event will feature research on sorghum's value as a forage crop. Sorghum is more drought-tolerant and has lower nitrogen requirements compared to corn, and does not host the tar spot pathogen. Experts will discuss sorghum's production and utilization for silage, grazing, and as a standing winter feed source.\n\nAttendees will learn about forage sorghum research from Mitch Tuinstra, Wickersham Chair of Excellence in Agricultural Research and scientific director of the Institute for Plant Sciences at Purdue. He will share plant breeding techniques to improve sorghum yield and quality. Other speakers include Brad Shelton, Jason Tower, Nick Minton, and Jeff Jackson.\n\nVenue tours will be available from 3-5 pm and 6-8 pm, and a dinner and bull test station tour will be offered from 5-6 pm.",
      "summaryTimestamp": 1771411285811
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113 in July 2024, indicating improved farmer sentiment despite declines in corn and soybean prices. The Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations rose 7 points to 119.\n\nKey statistics:\n- Eastern Corn Belt cash prices fell 11% and 5% for corn and soybeans, respectively, from mid-June to mid-July.\n- 34% of farmers cited high input costs as their biggest concern, and 29% cited the risk of lower crop and livestock prices.\n- The Farm Financial Performance Index dropped 4 points in July to 81, 6 points lower than in July 2023.\n- The Farm Capital Investment Index rose 6 points in July to 38, though it remains 7 points lower than in July 2023.\n- The Short-Term Farmland Value Expectations Index rose to 118 from 115 in June, while the Long-Term Farmland Value Expectations Index dropped 6 points to 146.\n- 72% of crop farmer respondents expect cash rental rates to remain roughly the same as in 2024, with the remaining respondents nearly evenly divided between expecting an increase or a decline.\n\nThe survey was conducted from July 15-19, 2024. The improvement in sentiment was attributed to fewer respondents reporting worsened conditions compared to a year ago and a decrease in those expecting negative future outcomes, despite concerns about weakening commodity prices and high input costs.",
      "summaryTimestamp": 1771411293837
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue researchers are adopting an interdisciplinary approach to assess the emerging tar spot disease in corn. The research team, led by C.D. Cruz, associate professor of botany and plant pathology, is using a mix of statistical, data science, epidemiology, microbiology, artificial intelligence, and computer vision methods to understand the dynamics of tar spot in corn.\n\nThe research is funded by two grants totaling nearly $1.1 million from the USDA National Institute of Food and Agriculture. The team is collaborating with researchers from Colombia, Mexico, Ecuador, South Korea, and the U.S.\n\nThe researchers have developed a digital method called the stromata contouring detection algorithm (SCDA) to quantify tar spot in corn. They have tested the algorithm under field conditions and found it to be successful in quantifying trends, but some inaccuracies persist in fully automated scenarios. The team is now refining their training methods to improve the model's accuracy and performance.\n\nAnother research effort includes the laboratory of Purdue's Mohammad Jahanshahi, associate professor in the Lyles School of Civil and Construction Engineering and the Elmore Family School of Electrical and Computer Engineering. Jahanshahi and Cruz, along with their students, are working on a proof-of-concept data fusion project that integrates drone imagery and weather data to capture crucial details about the tar spot pathosystem.\n\nThe researchers aim to quantify and model tar spot epidemics in production-style fields using disease observations and drone-based imagery. Ultimately, the team wants to quantify and model tar spot severity by referencing and integrating imagery with spatial and temporal data.\n\nThe interdisciplinary nature of the project can place greater time demands on the researchers, but it also leads to better problem-solving as each person brings their own expertise to the table.",
      "summaryTimestamp": 1771411301659
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana Sheep Association (ISA), with support from the Indiana Sheep and Wool Market Development Program (IN S&W), is hosting various sheep-themed events and competitions at the 2024 Indiana State Fair:\n\n- The Wool and Ewe Room and Ewe2 boutique will be open throughout the fair, offering wool items, livestock-themed apparel, and more.\n- On August 2 at 10 a.m., there will be an open wool judging and wool sale event in the Blue Ribbon Pavilion.\n- The Make It With Wool (MIWW) competition and fashion show will take place on August 4 at 2 p.m. in the Indiana Arts Building.\n- The Indiana State Fair Shearing Contest will be held on August 4 at 5 p.m. in the Ball State University Champions Pavilion.\n- From August 8-11, 11 a.m.-6 p.m., the Taste from Indiana Farms event in the Indiana Farm Bureau Fall Creek Pavilion will offer free samples of Indiana lamb.\n- The annual Sheep to Shawl competition, where youth teams create a wool shawl from scratch, will be on August 18 at 10 a.m. in the Indiana Arts Building.\n- Sheep will be exhibited in the Blue Ribbon Pavilion for open and 4-H shows from August 4-20.\n\nISA President Jane Smith stated that the association is \"proud to bring the spirit of our industry to the fair, and this year we will bring it in the theme of 'Art and Nature,' showcasing sheep-related art from Indiana artists in the Blue Ribbon Pavilion.\"",
      "summaryTimestamp": 1771411309252
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue Extension will have a presence at the fair, offering interactive demonstrations and activities at the Purdue Extension Building on the north side of the fairgrounds.\n\nKey Purdue Extension activities include:\n- Block Party (for children 8 months to 8 years) to enhance school-readiness skills\n- Book Party focusing on math skills\n- Captain Cash to teach financial management\n- Engaging with Purdue Extension experts in fields like entomology, human health, forestry, and animal sciences\n- Master Gardener exhibit on annuals and vegetables suited to Indiana\n- Pollinator education\n\nOther Purdue events include:\n- \"What's Growing on My Spinach?\" food safety activity on August 7, with samples of \"Cricket Rice Krispies Treats\"\n- Seed art displays in livestock barns and the Purdue Extension Building\n- Pioneer Village in the 1800s theme, sponsored by the Purdue Ag Alumni Association\n\nThe Purdue Extension exhibits will be located throughout the fairgrounds, including the 4-H Exhibit Hall, Expo Hall, Indiana Farmers Coliseum, and more.\n\nPurdue University is a public research institution ranked among the top 10 public universities in the U.S., with a focus on affordability, accessibility, and the pursuit of new innovations.",
      "summaryTimestamp": 1771411316576
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The new NPM publication \"Potassium Cycle\" provides a comprehensive visual overview of the potassium cycle in Wisconsin cropping systems. The two-page publication outlines key potassium concepts, including:\n\n- Sources of potassium, including soil minerals, organic matter, and fertilizers\n- Potassium uptake by plants and movement within the plant\n- Potassium losses from the soil through leaching, crop removal, and erosion\n- Recommended potassium application rates and timing for optimum crop yields\n\nThe publication was developed by the University of Wisconsin-Madison to help farmers better understand the potassium cycle and make informed decisions about potassium management in their operations. It is available for free download on the NPM website.",
      "summaryTimestamp": 1771411319041
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Wisconsin winter wheat is progressing at a record pace, about 10-14 days ahead of normal. As of April 17, 2022, 26% of the winter wheat crop was in the jointing stage, compared to the 5-year average of 10%. Wheat condition is rated 79% good-to-excellent, higher than the 5-year average of 71%.\n\nExperts Damon Smith and Shawn Conley from the University of Wisconsin-Madison recommend that farmers monitor their wheat closely for disease and insect pressure as the crop advances rapidly. They advise applying fungicides at flag leaf emergence to protect against Fusarium head blight and other diseases.\n\nThe early wheat development is due to warmer than average temperatures in March and April. This accelerated growth could lead to earlier wheat harvest, potentially impacting management of other summer crops. Farmers should adjust plans accordingly and be prepared to shift fieldwork schedules as needed.",
      "summaryTimestamp": 1771411321591
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Soybean fields may need replanting due to factors like freezing, hail, flooding, pests, and diseases. Before replanting, farmers should consider:\n\n1. Yield potential - Replanted soybeans may yield 5-10% less than the original stand. Yield loss is higher for replanting beyond June 1st.\n\n2. Maturity - Replanted soybeans will be 7-10 days later to maturity. This can impact harvest timing and drying costs.\n\n3. Weed control - Replanting provides a chance to change herbicide programs and manage weeds more effectively.\n\n4. Seed quality - Germination and vigor of replacement seed should be checked. Seed treatments may be needed.\n\n5. Planting date - Ideal replanting dates are before June 1st in northern climates. Yields drop significantly for plantings after June 15th.\n\n6. Stand uniformity - Uneven stands can impact harvestability and yield. Aim for a uniform 100,000-150,000 plants/acre.\n\nShawn P. Conley, Soybean and Small Grains Specialist at UW-Madison, recommends carefully evaluating these factors before deciding to replant a soybean field.",
      "summaryTimestamp": 1771411324900
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n- Farmers planning to use 2,4-D on Enlist E3 soybean in 2024 need to be aware of important updates and restrictions.\n- The use of 2,4-D on Enlist E3 soybean will be prohibited in 2024 due to regulatory changes.\n- Farmers should instead consider alternative weed control options for Enlist E3 soybean in 2024, such as glufosinate and clethodim herbicides.\n- Rodrigo Werle, a Weed Scientist and Extension Specialist at UW-Madison, advises farmers to stay informed about the latest updates and plan their weed management strategies accordingly.\n\nThe article does not provide any specific numbers, prices, statistics, or percentages. It also does not mention any deadlines, names of people/organizations/programs, or locations beyond UW-Madison. The context is the regulatory changes affecting the use of 2,4-D on Enlist E3 soybean in 2024. The main impact for farmers is the need to adjust their weed control plans for Enlist E3 soybean next year. The article recommends that farmers consider alternative herbicide options and stay informed about the latest updates.",
      "summaryTimestamp": 1771411328943
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Wisconsin CCA (Certified Crop Adviser) Board election results are as follows:\n\nRob Shields, Matt Brugger, and Chris Bandura have been elected to the Wisconsin CCA Board. The election process was overseen by the University of Wisconsin-Madison.",
      "summaryTimestamp": 1771411330612
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 17,
  "updated": "2026-02-18T14:42:06.361Z"
}