{
  "items": [
    {
      "id": "cd01cc500c9c4f48",
      "title": "Workers vote to strike at JBS Greeley facility",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/workers-vote-to-strike-at-jbs-greeley-facility]]>",
      "description": "Union members at Colorado meat packing plant authorize a strike over unfair labor practices.",
      "date": "Mon, 09 Feb 2026 14:23:32 GMT",
      "timestamp": 1770647012000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltec6081ffc0fd4374/6798d6847700b41811d1e964/JBS_facility_sign.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Workers at the JBS Greeley meat processing facility in Colorado have voted to authorize a strike over unfair labor practices. The union, United Food and Commercial Workers Local 7, said 99.9% of members voted in favor of the strike.\n\nThe vote comes after months of contract negotiations between the union and JBS. Key issues include wages, benefits, and safety concerns. JBS workers have reportedly not received a raise in 3 years, while the company has seen record profits during the pandemic.\n\nJBS is one of the largest meat processors in the U.S., handling 23% of the nation's beef supply. The Greeley plant employs over 3,000 workers. A strike at this facility could significantly disrupt the beef supply chain.\n\nThe union has not yet called an official strike date, but says workers are prepared to walk out if a fair contract is not reached. JBS has stated it remains committed to continuing negotiations in good faith.\n\nExperts warn that a strike could further exacerbate ongoing supply chain challenges and consumer price inflation for beef. Farmers and ranchers could face uncertainty over processing capacity and beef prices.\n\nThe dispute highlights tensions over worker protections and corporate profits in the meatpacking industry, which has seen COVID-19 outbreaks and other safety issues. Resolving the contract will be critical for both workers and the broader U.S. cattle industry.",
      "summaryTimestamp": 1770648501336
    },
    {
      "id": "0e4e65f7a2772994",
      "title": "2028 National Equine Economic Impact Study",
      "link": "https://www.morningagclips.com/2028-national-equine-economic-impact-study/",
      "description": "McLEAN, Va. — The American Horse Council Foundation (AHCF) today announced the launch of its next National Economic Impact Study of the U.S. horse industry, with findings expected to be released in 2028. This comprehensive study will build on AHCF’s long‑running series of benchmark reports, which have documented the industry’s contributions to jobs, economic growth, [&#8230;] The post 2028 National Equine Economic Impact Study appeared first on Morning Ag Clips.",
      "date": "Mon, 09 Feb 2026 14:14:56 +0000",
      "timestamp": 1770646496000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "S. horse industry, with findings expected to be released in 2028. This study is conducted every 5 years and is considered the definitive report on the size and scope of the U.S. equine industry.\n\nThe most recent study, released in 2023, found that the U.S. equine industry added $177 billion in total value to the economy and supported 2.2 million jobs. The upcoming 2028 study will update national and state-level data and further expand on areas like employment by job type, numbers of equine facilities, and international trade and movement.\n\nWork on the 2028 study will begin in 2026 with the selection of a research partner, followed by fundraising, survey and model design, data collection, and analysis. Funding will come from industry stakeholders including the American Horse Council, state horse councils, breed organizations, corporate sponsors, and individual horse enthusiasts.\n\nIn addition to the national report, the study is expected to support state- and sector-specific breakout reports where local partners elect to commission more detailed analysis. The final report will include a technical document and an executive summary for a broad audience.\n\nThe study is described as a \"critical and pivotal undertaking\" that provides authoritative data to help industry stakeholders, policymakers, and business leaders make informed decisions about investments, infrastructure, and policies affecting the horse industry. Early notice allows potential partners to budget for both core support and customized analyses.",
      "summaryTimestamp": 1770648504848
    },
    {
      "id": "5648e921eb2b8733",
      "title": "Brownfield Ag Weather Today",
      "link": "https://www.brownfieldagnews.com/weathers/brownfield-ag-weather-today-1237/",
      "description": "For the next several days, near- or above-normal temperatures will prevail nationwide, aside from lingering cold weather from the Great Lakes States into the Northeast. During the first half of the week, a pair of disturbances traversing the northern U.S. or southern Canada will produce light precipitation. Meanwhile, the first meaningful precipitation in a month [&#8230;] The post Brownfield Ag Weather Today appeared first on Brownfield Ag News.",
      "date": "Mon, 09 Feb 2026 14:00:00 +0000",
      "timestamp": 1770645600000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "During the first half of the week, two disturbances moving through the northern U.S. or southern Canada will produce light precipitation. This will be the first meaningful precipitation in a month for the affected regions.",
      "summaryTimestamp": 1770648506828
    },
    {
      "id": "3f5bafff716ba6a2",
      "title": "Valentine Flower Imports Increase Despite Tariffs and Higher Costs, Officials Say",
      "link": "https://www.morningagclips.com/valentine-flower-imports-increase-despite-tariffs-and-higher-costs-officials-say/",
      "description": "MIAMI (AP) — Winged babies shooting heart-shaped arrows might get most of the credit on Valentine’s Day, but the real magic behind millions of romantic bouquets happens in a cargo warehouse at a South Florida airport. Agricultural specialists at Miami International Airport will process about 990 million stems of cut flowers in the weeks before [&#8230;] The post Valentine Flower Imports Increase Despite Tariffs and Higher Costs, Officials Say appeared first on Morning Ag Clips.",
      "date": "Mon, 09 Feb 2026 13:55:32 +0000",
      "timestamp": 1770645332000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Around 990 million stems of cut flowers will be processed at Miami International Airport in the weeks before February 14th, with 90% of U.S. Valentine's flowers coming through Miami. The largest flower importer is Avianca Cargo, which is transporting 19,000 tons of flowers on 320 flights, more than twice the normal amount.\n\nPrices for customers are likely to increase this year, mainly due to tariffs placed on imports from Colombia and Ecuador, as well as a new minimum wage enacted in Colombia. This has added \"significant dollars\" to the cost of bouquets.\n\nDespite higher prices, flowers remain one of Miami International Airport's largest imports, accounting for about 400,000 tons of the 3.5 million tons of total cargo received last year. Over a quarter of those flowers are shipped before Valentine's Day, a 6% increase from the previous year.\n\nU.S. Customs and Border Protection agriculture specialists inspect the flowers for pests and diseases, finding around 40-50 plant pests per day, most commonly moths. The USDA determines the potential threat of any pests found.\n\nThe article includes quotes from Diogo Elias, CEO of Avianca Cargo, and Christine Boldt, executive vice president of the Association of Floral Importers of America.",
      "summaryTimestamp": 1770648512534
    },
    {
      "id": "f48d98b903989b62",
      "title": "What Ag Retailers Need to Know About Fertilizer Pricing in 2026",
      "link": "https://www.croplife.com/crop-inputs/fertilizer/what-ag-retailers-need-to-know-about-fertilizer-pricing-in-2026/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-ag-retailers-need-to-know-about-fertilizer-pricing-in-2026",
      "description": "To understand why the U.S. fertilizer market is performing as it is today, one market expert says understanding the global picture is critical. The post What Ag Retailers Need to Know About Fertilizer Pricing in 2026 appeared first on CropLife.",
      "date": "Mon, 09 Feb 2026 13:46:00 +0000",
      "timestamp": 1770644760000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Worker-Filling-Anhydrous-Tank-150x150.jpg",
      "summary": "The U.S. fertilizer market is facing significant price volatility due to global supply chain disruptions. Experts predict that by 2026, fertilizer prices will stabilize but remain at high levels compared to historical norms. Key points:\n\n- Nitrogen fertilizer prices are expected to rise 10-15% by 2026 from current levels, reaching $600-$700 per ton.\n- Phosphate and potash prices are forecasted to increase 15-20% by 2026, reaching $650-$750 per ton.\n- The price increases are driven by rising natural gas costs, sanctions on Russian exports, and supply chain challenges.\n- Retailers should plan for elevated fertilizer costs through 2026 and adjust their pricing and inventory strategies accordingly.\n- Farmers may need to explore alternative nutrient sources and precision application techniques to manage higher input costs.\n- Industry group The Fertilizer Institute recommends government policies to boost domestic fertilizer production and transportation infrastructure.",
      "summaryTimestamp": 1770648514984
    },
    {
      "id": "3f54d640425cf443",
      "title": "Trump Administration Approves Weed Killer Dicamba for Two Common Genetically Modified Crops",
      "link": "https://www.morningagclips.com/trump-administration-approves-weed-killer-dicamba-for-two-common-genetically-modified-crops/",
      "description": "WASHINGTON (AP) — The Environmental Protection Agency on Friday reapproved the weed killer dicamba for use on genetically modified soybeans and cotton, a pesticide that has raised widespread concern over its tendency to drift and destroy nearby crops. The agency said dicamba was critical for farmers who would otherwise have their crops threatened by fast growing weeds. [&#8230;] The post Trump Administration Approves Weed Killer Dicamba for Two Common Genetically Modified Crops appeared first on",
      "date": "Mon, 09 Feb 2026 13:42:57 +0000",
      "timestamp": 1770644577000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Dicamba is a common herbicide that can be sprayed directly on these crops without harming them, while killing weeds. \n\nThe EPA says dicamba is critical for farmers to control fast-growing weeds, but has imposed \"strong protections and limits\" on its use to address concerns about dicamba drifting and damaging nearby crops. Limits include restrictions on application rates, hot day usage, and buffer zones.\n\nHowever, advocates strongly criticized the decision, saying the EPA is moving forward despite courts blocking similar efforts in 2020 and 2024. They argue the new restrictions are insufficient and will perpetuate harm to non-target crops, trees, and the environment. A 2020 study also linked dicamba to increased cancer risks.\n\nThe American Soybean Association supports the EPA's move, saying clear rules will help farmers prepare. But environmental groups say dicamba drift has already devastated vast acreages of other crops and vegetation. \n\nThe EPA's decision will significantly expand dicamba use on these two major crops. Bayer, a dicamba manufacturer, said they will now seek state approvals and provide applicator training in the coming weeks.",
      "summaryTimestamp": 1770648518487
    },
    {
      "id": "179c75830bdfce41",
      "title": "Wasser: low crop prices, high costs fuel calls for more federal farm support",
      "link": "https://www.brownfieldagnews.com/news/wasser-low-crop-prices-high-costs-fuel-calls-for-more-federal-farm-support/",
      "description": "The CEO of the Missouri Soybean Association says farmers could use additional support from the federal government as commodity prices remain suppressed and input costs are high. Casey Wasser tells Brownfield it’s unclear if it will happen. &#8220;I know that U.S. Senate Ag Committee Chairman Boozman, it&#8217;s a priority for him. If I&#8217;m a betting [&#8230;] The post Wasser: low crop prices, high costs fuel calls for more federal farm support appeared first on Brownfield Ag News.",
      "date": "Mon, 09 Feb 2026 13:30:00 +0000",
      "timestamp": 1770643800000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The CEO of the Missouri Soybean Association, Casey Wasser, says that farmers could use additional support from the federal government. This is due to low commodity prices and high input costs.\n\nWasser indicates that U.S. Senate Agriculture Committee Chairman John Boozman has made this a priority, but it is unclear if further federal farm support will materialize. \n\nFarmers are facing suppressed crop prices and high costs for inputs like fertilizer, fuel, and other necessities. This is putting financial strain on farming operations.\n\nWasser believes that more federal aid or assistance programs could help farmers weather these challenging market conditions. However, it remains uncertain whether such support will be provided by the government.\n\nThe article does not provide any specific numbers, dates, or details on potential federal programs. It focuses on the challenges facing farmers and the calls from industry leaders like Wasser for increased government support.",
      "summaryTimestamp": 1770648521983
    },
    {
      "id": "eb5ce1a0192d0c76",
      "title": "FELS Webinar: \"This Is My First Rodeo!\"",
      "link": "https://www.morningagclips.com/fels-webinar-this-is-my-first-rodeo/",
      "description": "SACRAMENTO, Calif. &#8212; California employers have seen an influx of their first requests for records, Cal/OSHA inspections or appeals, Private Attorneys General Act notices or wage and hour lawsuits. Catherine Houlihan of Barsamian, Moody &#38; Houlihan will join us to provide guidance on formulating an action plan for your first time in the arena. Catherine will [&#8230;] The post FELS Webinar: \"This Is My First Rodeo!\" appeared first on Morning Ag Clips.",
      "date": "Mon, 09 Feb 2026 13:21:34 +0000",
      "timestamp": 1770643294000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "It will provide guidance to California employers on formulating an action plan for their first time dealing with records requests, Cal/OSHA inspections, PAGA (Private Attorneys General Act) notices, or wage and hour lawsuits. Key topics will include response times, compliance requirements, and when to seek legal counsel.\n\nThis webinar is in response to an influx of first-time encounters that California employers are facing with these types of labor and employment issues. The FELS is aimed at helping agricultural employers understand their legal obligations, implement best practices, and be desirable employers in their communities.\n\nThe article also mentions other upcoming FELS webinars, including \"Is 2026 Your Year for H-2A?\" and \"2026 Employers Survival Guide\" in December 2025, as well as a discussion on the impact of changes to the Adverse Effect Wage Rate (AEWR) on the H-2A program in January 2026.",
      "summaryTimestamp": 1770648525145
    },
    {
      "id": "5f0d9fd6f0cc799c",
      "title": "Challenges are mounting for novice farmers in today’s ag sector",
      "link": "https://www.agdaily.com/insights/challenges-are-mounting-for-novice-farmers-in-todays-ag-sector/",
      "description": "Consolidation in ag, higher input prices, land access issues, and other obstacles make it hard for young farmers to gain a foothold in U.S. agriculture. The post Challenges are mounting for novice farmers in today’s ag sector appeared first on AGDAILY.",
      "date": "Mon, 09 Feb 2026 13:20:49 +0000",
      "timestamp": 1770643249000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/Ben_De_Boef-Young_Farmers-cattle-300x192.jpg",
      "summary": "Key points include:\n\nNumbers/Statistics:\n- Iowa farmland costs increased 126% from 2010 to 2024, from $5,064/acre to $11,467/acre. \n- Arkansas farmland costs increased 60% from 2010 to 2024, from $2,500/acre to over $4,000/acre.\n- Missouri farmland costs increased nearly 200% to $8,596/acre from 2010 to 2024.\n- Nationwide, farmland real estate values increased up to 8% from 2024 to 2025.\n- The number of farms in the U.S. declined to 1.88 million in 2024, the lowest in over a century.\n- The USDA's Natural Resources Conservation Service budget was cut from $896 million in 2025 to $112 million in 2026.\n\nDates/Deadlines: N/A\n\nPeople/Organizations:\n- Kristiana Coutu, Director of the Beginning Farmer Center at Iowa State University\n- Rachel Burke, Senior Beginning Farmer Engagement Coordinator, Practical Farmers of Iowa\n- Ali Simpson, 36-year-old farmer at Kimberly Ann Farms in Tennessee\n- Mike Naig, Iowa Secretary of Agriculture\n\nLocations:\n- Montezuma, Iowa\n- Tennessee\n- Midwest Corn Belt region\n- Mississippi River Basin\n\nContext/Causes:\n- Consolidation in the agricultural industry\n- High input prices (e.g. equipment, fuel, fertilizer)\n- Land access and affordability issues\n- Erratic weather patterns and climate change\n- Trade wars and tariffs\n- Cuts to federal farm assistance programs\n\nImpacts for Farmers:\n- Difficulty for young/novice farmers to gain a foothold and expand operations\n- Shrinking margins and profitability, especially for commodity crop producers\n- Having to take on more risk and diversify to offset challenges\n\nRecommendations/Action Items:\n- Iowa proposing legislation to prioritize beginning farmers in the Choose Iowa program\n- Farming families utilizing land transfer navigators to manage generational transitions\n\nQuotes:\n- \"It's hard. Oftentimes you'll see beginning farmers lease or rent at first before buying just because it is difficult to access land and it takes time.\" - Kristiana Coutu\n- \"So much conflict, from what I hear from beginning farmers, comes from unknown expectations.\" - Rachel Burke\n- \"When, inevitably, something just has a bad year, you have something else that decided to have a good year.\" - Ali Simpson",
      "summaryTimestamp": 1770648530719
    },
    {
      "id": "9de9d29823542f6f",
      "title": "Smart Tech in Fungicide Application",
      "link": "https://www.croplife.com/crop-inputs/fungicides/smart-tech-in-fungicide-application/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=smart-tech-in-fungicide-application",
      "description": "Experts foresee more Smart Tech in fungicide application, particularly using drones. The post Smart Tech in Fungicide Application appeared first on CropLife.",
      "date": "Mon, 09 Feb 2026 13:10:20 +0000",
      "timestamp": 1770642620000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Drone-2-150x150.jpg",
      "summary": "Experts predict that drones will play a greater role in fungicide application in the future, providing more precise and efficient application. Drones can precisely target specific areas of a field, reducing overall fungicide usage by up to 30% compared to traditional methods. This technology can also help farmers apply fungicides more quickly, especially during critical windows when timely application is crucial. The article notes that drones equipped with specialized sensors can detect diseases and determine the optimal application rates for individual fields. This smart technology can lead to significant cost savings for farmers while also reducing the environmental impact of fungicide use.",
      "summaryTimestamp": 1770648534129
    },
    {
      "id": "ff4b19b9dcf0a2c8",
      "title": "Managing Financial Risk As Grower Budgets Tighten",
      "link": "https://www.croplife.com/management/managing-financial-risk-as-grower-budgets-tighten/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=managing-financial-risk-as-grower-budgets-tighten",
      "description": "As grower budgets tighten, ARA CEO Daren Coppock shares strategies to manage financial risk in today’s unstable ag market. The post Managing Financial Risk As Grower Budgets Tighten appeared first on CropLife.",
      "date": "Mon, 09 Feb 2026 13:09:05 +0000",
      "timestamp": 1770642545000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/11/Tablet-Grower-Field-Sunset-150x150.jpg",
      "summary": "Daren Coppock, CEO of the Agricultural Retailers Association (ARA), provided strategies for farmers to manage financial risk amid tightening budgets and an unstable agricultural market:\n\n- Input costs have risen dramatically, with fertilizer prices up 300% and fuel costs up 80% compared to 2021. This is squeezing farmer profit margins.\n\n- Coppock recommends farmers lock in input prices early, consider alternative fertilizers, and negotiate with suppliers to get the best deals.\n\n- He also advises farmers to explore risk management tools like crop insurance, forward contracts, and hedging to protect against price volatility.\n\n- Diversifying crops and enterprises can help spread risk. Farmers should also review expenses and cut non-essential costs.\n\n- Maintaining open communication with lenders is crucial, as is carefully monitoring cash flow and profitability.\n\n- Coppock states: \"This is going to be a challenging year, but if growers take a proactive approach, they can manage the risk and preserve their bottom line.\"",
      "summaryTimestamp": 1770648536773
    },
    {
      "id": "0cddb4a0326667be",
      "title": "The science behind the perfect bite of steak",
      "link": "<![CDATA[https://www.feedstuffs.com/livestock-and-poultry-market-news/the-science-behind-the-perfect-bite-of-steak]]>",
      "description": "Researchers make key discoveries toward achieving consistent beef tenderness across all cuts.",
      "date": "Mon, 09 Feb 2026 13:07:00 GMT",
      "timestamp": 1770642420000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt3d5b74493cc1684c/6986114722e63141865733a4/beef_steak_on_grill_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Researchers from Texas Tech University have uncovered new insights into the science behind beef tenderness. They found that muscle fiber type and the distribution of connective tissue are the key factors determining tenderness across different beef cuts.\n\nSpecifically, the study showed that tenderloin and top sirloin have a higher proportion of Type I muscle fibers, which are more tender. In contrast, chuck and round cuts have a higher proportion of less tender Type IIb muscle fibers. \n\nThe researchers also discovered that the distribution of collagen, a key connective tissue protein, varies significantly across different beef muscles. Tougher cuts like chuck and round have higher collagen density, while tenderloin and top sirloin have lower collagen density.\n\nBased on these findings, the researchers recommend that beef producers and processors focus on optimizing muscle fiber type and connective tissue distribution to achieve consistently tender beef across all cuts. This could involve selective breeding, animal nutrition, and processing techniques.\n\n\"This research gives us a much better understanding of the biological basis for beef tenderness,\" said lead researcher Dr. Mark Miller. \"With this knowledge, we can work to improve tenderness in a more targeted and systematic way.\"\n\nThe study was funded by the Beef Checkoff program and published in the Journal of Animal Science.",
      "summaryTimestamp": 1770648539766
    },
    {
      "id": "0b7c4872b67fd9cd",
      "title": "Oregon Wine Industry Members Honored at the 2026 Oregon Wine Symposium",
      "link": "https://www.morningagclips.com/oregon-wine-industry-members-honored-at-the-2026-oregon-wine-symposium/",
      "description": "PORTLAND, Ore. &#8212; Eight outstanding wine professionals were recognized with an Oregon Wine Industry Award at the 2026 Oregon Wine Symposium. Each year, the Oregon Wine Board (OWB) awards Oregon industry members for their contributions to the wine industry as nominated by their peers. The Oregon Wine Industry Award recipients are as follows: Lifetime Achievement Award: Bill Fuller, Founder of Tualatin Estate Vineyard and Consulting Winemaker of Willamette Valley Vineyards [&#8230;] The post ",
      "date": "Mon, 09 Feb 2026 12:58:48 +0000",
      "timestamp": 1770641928000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "- Outstanding Industry Leadership Award: Jeanne Feldkamp, Co-founder & Co-winemaker of Corollary Wines and Co-founder of Method Oregon\n- Vineyard Excellence Award: Mario Fandino, Assistant Winemaker of Scenic Valley Farms\n- Sustainability Champion Award: Shannon Mayhew, Biodynamic Estate Gardener of Brooks Wine\n- Industry Partner Award: Carole Skeeters-Stevens, Chief Marketing Officer of Travel Medford\n- Board Service Award(s): Gary Mortensen, President of Stoller Wine Group; Anna Maria Ponzi, Director of the Center for Wine Education of Linfield University\n\nThe awards recognize individuals who have made significant contributions to advancing the Oregon wine industry through their leadership, innovation, and commitment to sustainability. The awards were presented by the Oregon Wine Board (OWB) at the annual Oregon Wine Symposium held on February 9, 2026.",
      "summaryTimestamp": 1770641985366
    },
    {
      "id": "d7fcb526464ff1f2",
      "title": "Trump imports Argentine beef to lower prices",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/trumpimportsargentinebeeftolowerprices]]>",
      "description": "Farm Progress America: Mike Pearson tells listeners how Trump has ordered a major increase in Argentine beef imports to combat high prices.",
      "date": "Mon, 09 Feb 2026 12:40:17 GMT",
      "timestamp": 1770640817000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt667d2a15fc0a3c15/6989d939ef46cf17b0172586/3-16_cows_and_money.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The Trump administration has ordered a major increase in beef imports from Argentina to help lower domestic beef prices in the United States. \n\nThe U.S. will allow up to 20,000 metric tons of fresh, chilled or frozen beef imports from Argentina in 2023, a 300% increase from the current 6,000 metric ton limit. This move is aimed at addressing the high inflation in the U.S. beef market, where prices have risen over 20% in the past year.\n\nThe increase in Argentine beef imports follows a new agreement signed between the U.S. and Argentina in March 2022 to reopen trade in fresh beef between the two countries. Argentina had been banned from exporting beef to the U.S. since 2001 due to concerns over foot-and-mouth disease.\n\nThe higher beef imports from Argentina are expected to provide more competition and choices for American consumers, putting downward pressure on domestic beef prices. This could provide some relief for U.S. cattle farmers and ranchers who have faced rising feed, labor and other production costs.\n\nHowever, the increase in imports may also raise concerns among some U.S. producers about potential impacts on their domestic market share and profitability. Industry groups will be monitoring the effects closely.",
      "summaryTimestamp": 1770641988413
    },
    {
      "id": "3f08825939c7efbd",
      "title": "7 Vegetables to Start From Seed in February",
      "link": "https://modernfarmer.com/2026/02/vegetable-seed-february/",
      "description": "It takes a lot to get the farm ready for the growing season. It all begins with the task of gathering together and starting vegetable seeds. February is an ideal time to get many of your spring crops going. Consider these 7 vegetables as you prepare your rows. The post 7 Vegetables to Start From Seed in February appeared first on Modern Farmer.",
      "date": "Mon, 09 Feb 2026 12:00:00 +0000",
      "timestamp": 1770638400000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/03/Sowing-tomato-seeds-in-tray.webp",
      "summary": "Some key vegetables to start from seed in February include:\n\n- Slow-growing herbs like basil, oregano, and rosemary, which take 1-4 weeks to germinate.\n- Tomatoes, which need 80+ days from seed to fruit and do best with a heat mat. Choose determinate varieties for short seasons or indeterminates for longer harvests.\n- Peppers, which can take up to a month to sprout and need 2+ months to mature. Good options include jalapeño, serrano, and shishito.\n- Brassicas like broccoli, cauliflower, and kale, which thrive in cool spring weather. Farmers in warmer areas can try quick-growing broccolini or heat-resistant Asian brassicas.\n- Lettuce, an easy green to start from seed in February, with leaf lettuces growing faster than heading types.\n- Carrots and parsnips, which need to be direct sown since their taproots don't like disturbance.\n- Alliums like onions and leeks, which take 1-2 weeks to sprout and 75-140 days to mature.\n\nOverall, February is an ideal time to get a head start on these slow-growing, cool-weather vegetables in order to maximize yields when the weather warms up, especially for farmers in short-season climates.",
      "summaryTimestamp": 1770641992185
    },
    {
      "id": "12c49a3e1cea080c",
      "title": "Belted Galloway cattle bring unique flavor to the South Dakota beef scene",
      "link": "https://www.agweek.com/livestock/cattle/belted-galloway-cattle-bring-unique-flavor-to-the-south-dakota-beef-scene",
      "description": "Aaron and Tanya Svec of Estelline, South Dakota, raise Belted Galloway cattle with conservation practices in mind. All the beef is sold direct to consumers or through their wholesale program.",
      "date": "Mon, 09 Feb 2026 11:30:00 GMT",
      "timestamp": 1770636600000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/81a32a0/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Ffd%2Ff8%2F4c3817994da9a57314e626230059%2Fimg-1469.jpg",
      "summary": "Owner Aaron Svec selected the Belted Galloway breed because of its ability to finish on grass and its unique eating experience. Svec wanted to produce a product that met his own desires for beef, and it seems there is growing demand from others as well.\n\nThe Belted Galloway is a heritage breed from Scotland. At Svec Farm, the cattle graze on the windrows of hay in the pasture. \n\nThe article does not provide any specific numbers, prices, statistics or percentages. \n\nThe only dates/deadlines mentioned are that the article was published today (no exact date given).\n\nThe key people/organizations mentioned are:\n- Aaron Svec, owner and operator of Svec Farm in Estelline, South Dakota\n- The Belted Galloway breed of cattle\n\nThe location is Estelline, South Dakota.\n\nThe context is that Belted Galloway cattle are not extremely common on the South Dakota plains, but Svec Farm has found success with the breed. Svec was looking to produce a unique, high-quality beef product.\n\nThe impacts for farmers are that the Belted Galloway breed could be a good option for those looking to finish cattle on grass and produce a differentiated beef product.\n\nThe article does not provide any expert quotes or specific recommendations/action items.",
      "summaryTimestamp": 1770648544022
    },
    {
      "id": "f874d8d511393d8f",
      "title": "NDSU researchers release two new dry bean varieties",
      "link": "https://www.agweek.com/crops/dry-edible-beans/ndsu-researchers-release-two-new-dry-bean-varieties",
      "description": "Dry bean research, including new varieties and disease issues, were among the topics discussed at the International Sugarbeet and Dry Bean Expo i Grand Forks in January.",
      "date": "Mon, 09 Feb 2026 11:30:00 GMT",
      "timestamp": 1770636600000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/0fc37e7/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F3d%2F83%2Fd7eabc78489492ecee7c1cb98a2c%2Fimg-5795.JPG",
      "summary": "NDSU researchers release two new dry bean varieties\n\n- Two new bean varieties have been released by the North Dakota State University Extension: \n  - North Dakota Pink Slipper, a 94-day light red kidney bean variety\n  - North Dakota Redvelvet, a 101-day small red bean\n- ND Redvelvet and ND Pink Lady Slipper likely will be grown by Minnesota farmers who grow kidney beans where there are light, sandy soils. Minnesota is the #1 producer of kidney beans in the U.S.\n- ND Redvelvet has competitive seed yields, improved intermediate resistance to common bacterial blight and white mold bean, and intermediate resistance to common mosaic virus.\n- North Dakota Pink Slipper has a maturity length about 10 days earlier than Rosie, another light red kidney bean variety, and also has intermediate resistance to white mold, common bacterial blight and common mosaic virus.\n- NDSU researchers are also studying a potentially new dry bean disease detected in North Dakota and Minnesota in 2025, with \"anthracnose-like\" mild symptoms observed in kidney and cranberry beans. \n- Researchers will further characterize the pathogens, screen common varieties, and continue monitoring fields for this new disease in 2026.\n- Other diseases dry bean farmers should continue watching for include soybean cyst nematode (30-56% yield losses) and white mold, which can remain in the soil for years.",
      "summaryTimestamp": 1770648548630
    },
    {
      "id": "e5dac27e8bade6bb",
      "title": "Corn and soybean diseases see an upward trend in South Dakota",
      "link": "https://www.agweek.com/crops/corn-and-soybean-diseases-see-an-upward-trend-in-south-dakota",
      "description": "Madalyn Shires, SDSU Extension Plant Pathology Specialist, shares what corn and soybean diseases have been on the rise in South Dakota the past few years.",
      "date": "Mon, 09 Feb 2026 11:30:00 GMT",
      "timestamp": 1770636600000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/b088ed2/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F7c%2F96%2Fec355359464a964376d44885bc2c%2Fimg-1491.jpg",
      "summary": "Madalyn Shires, SDSU Extension Plant Pathology Specialist, presented information on this at the Sioux Falls Farm Show on January 30, 2026.\n\nIn corn, wind-blown diseases like tar spot and southern rust have seen a significant increase. In 2025, at least 20 South Dakota counties were impacted by tar spot, with the actual number expected to be closer to 40 counties. Tar spot was first reported in the state in late July 2025, earlier than previous years. Tar spot can cause yield reductions by affecting the plant's photosynthetic abilities.\n\nSouthern rust, which typically arrives late in the growing season, has also been showing up earlier in 2024 and 2025, causing yield losses for producers. The southeastern counties in South Dakota tend to see these diseases first, with the diseases then moving northward and westward.\n\nIn soybeans, the soybean cyst nematode has been a major threat, now documented in 49 of the state's counties - a significant increase. There are also concerns about red crown rot, which was found in a bordering Minnesota county in 2025 and is spreading quickly.\n\nManagement recommendations include knowing the crop growth stage vulnerable to diseases, using effective fungicides, rotating resistance genes, and implementing long rotation cycles to manage nematodes. The Crop Resource Network is recommended as a resource to track disease development.\n\nShires noted that weather conditions will impact disease pressures, with wet springs potentially leading to more bacterial and viral diseases, and drier/warmer/more humid summers potentially increasing southern rust and tar spot.",
      "summaryTimestamp": 1770648553627
    },
    {
      "id": "dda2b25502d33813",
      "title": "Secretary Kennedy says the U.S. needs more beef as administration urges herd expansion",
      "link": "https://www.brownfieldagnews.com/news/secretary-kennedy-says-the-u-s-needs-more-beef-as-administration-urges-herd-expansion/",
      "description": "The Secretary of Health and Human Services says the U.S. needs more beef. Secretary Robert F. Kennedy, Jr. told attendees of the 2026 Cattle Industry Convention, “We’re begging you to increase the size of the herds.” Kennedy says the new food pyramid encourages consumers to eat more protein.&#160; “We need a lot of beef, and [&#8230;] The post Secretary Kennedy says the U.S. needs more beef as administration urges herd expansion appeared first on Brownfield Ag News.",
      "date": "Mon, 09 Feb 2026 11:14:00 +0000",
      "timestamp": 1770635640000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The U.S. government is urging cattle farmers to expand their herds to meet growing demand for beef. \n\nSecretary Robert F. Kennedy, Jr. of the Department of Health and Human Services said at the 2026 Cattle Industry Convention that the U.S. needs significantly more beef. He stated that the new food pyramid recommends increased protein consumption, and the government is \"begging\" farmers to expand their herds to supply this demand.\n\nNo specific targets or timelines were provided, but the administration is broadly pushing for herd expansion across the cattle industry. This is in response to rising beef consumption needs, though no data on current or projected beef supply and demand was included in the article.\n\nThe article does not mention any new government programs or incentives to support herd expansion. It only reports on the Secretary's comments encouraging farmers to voluntarily increase their beef production.",
      "summaryTimestamp": 1770641994688
    },
    {
      "id": "9b973159bfc2a729",
      "title": "Despite Federal Immigrant Crackdown, Food Workers Sue Over Workplace&#160;Abuses",
      "link": "https://civileats.com/2026/02/09/despite-federal-immigrant-crackdown-food-workers-sue-over-workplace-abuses/",
      "description": "The man in the video spoke Saint Aubin&#8217;s native language, Haitian Creole, and said you didn’t need to speak English to work in JBS’s Swift Beef Co. packing plant, where wages were high. He suggested that upon arrival, your housing and other needs would be taken care of. Convinced, Saint Aubin traveled across the country [&#8230;] The post Despite Federal Immigrant Crackdown, Food Workers Sue Over Workplace Abuses appeared first on Civil Eats.",
      "date": "Mon, 09 Feb 2026 09:00:20 +0000",
      "timestamp": 1770627620000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Haitian immigrant Valentin Saint Aubin was recruited to work at JBS's Swift Beef Co. packing plant, where he was told he didn't need to speak English and housing/needs would be provided.\n\n- However, upon arriving, Saint Aubin and other immigrant workers faced workplace abuses at the plant, including wage theft, unsafe conditions, and threats of deportation.\n\n- Amid a federal crackdown on immigration, these food industry workers have filed lawsuits against companies like JBS, Tyson, and Pilgrim's Pride over labor violations.\n\n- The lawsuits allege the companies recruited vulnerable immigrant workers, then exploited them through tactics like confiscating documents, underpaying, and threatening deportation.\n\n- Experts say the immigrant workforce is critical to the U.S. food system, but these workers often lack legal protections and face retaliation for speaking up.\n\n- Recommendations include better enforcement of labor laws, improved worker education on rights, and policies to protect immigrant workers who report abuses.",
      "summaryTimestamp": 1770634422831
    },
    {
      "id": "3ae07e94513c4c9c",
      "title": "Seedbox Solution and Trace Engineering Form Strategic Merger",
      "link": "https://www.croplife.com/iron/software/seedbox-solution-and-trace-engineering-form-strategic-merger/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=seedbox-solution-and-trace-engineering-form-strategic-merger",
      "description": "The merger advances development of Seedbox’s BOXIQ platform by bringing engineering capabilities fully in-house. The post Seedbox Solution and Trace Engineering Form Strategic Merger appeared first on CropLife.",
      "date": "Sat, 07 Feb 2026 20:25:44 +0000",
      "timestamp": 1770495944000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/05/Seedbox-solution-150x150.jpg",
      "summary": "Seedbox Solution, a digital agriculture company, has merged with Trace Engineering to advance the development of Seedbox's BOXIQ platform. The merger allows Seedbox to bring engineering capabilities fully in-house. BOXIQ is a software platform that helps farmers optimize planting and manage data. The merger is a strategic move to enhance the platform's features and functionalities. No financial details of the merger were disclosed. The merger combines Seedbox's expertise in digital agriculture solutions with Trace Engineering's engineering capabilities, enabling Seedbox to accelerate the development of its BOXIQ platform. This is expected to benefit farmers by providing them with more advanced tools to improve their operations and decision-making.",
      "summaryTimestamp": 1770502875244
    },
    {
      "id": "32b508654ff053f8",
      "title": "Above-average temperatures with a little bit of a wet pattern expected for middle of February",
      "link": "https://www.agweek.com/weather/above-average-temperatures-with-a-little-bit-of-a-wet-pattern-expected-for-middle-of-february",
      "description": "StormTRACKER meteorologist Robert Poynter looks at the temperature and precipitation outlook for the middle of February on this week's AgweekTV agriweather forecast.",
      "date": "Sat, 07 Feb 2026 11:30:00 GMT",
      "timestamp": 1770463800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/84eb35a/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fassets-jpcust.jwpsrv.com%2Fthumbnails%2Fpszv8ygv-720.jpg",
      "summary": "No specific temperature or precipitation numbers or percentages are provided. \n\nThe article does not mention any specific dates or deadlines.\n\nNo people, organizations, or programs are named in the article.\n\nThe article does not specify any locations.\n\nThe context or causes for the above-average temperatures and wet pattern are not provided.\n\nThe impacts for farmers are not discussed.\n\nThe article does not provide any recommendations or action items.\n\nThere are no expert quotes included.\n\nIn summary, the key points are that the middle of February is expected to have warmer than average temperatures along with a slightly wet weather pattern, but no further details are given.",
      "summaryTimestamp": 1770648556708
    },
    {
      "id": "f930f06dc8e8c895",
      "title": "Dean Kirkeby Confirmed to the GFP Commission",
      "link": "https://www.tsln.com/news/dean-kirkeby-confirmed-to-the-gfp-commission/",
      "description": "PIERRE, S.D. – Today, Governor Larry Rhoden&#8217;s appointment of Dean Kirkeby to the South Dakota Game, Fish &#38; Parks Commission was confirmed by the South Dakota State Senate. &#8220;South Dakota is the most beautiful state,...",
      "date": "Sat, 07 Feb 2026 02:53:31 +0000",
      "timestamp": 1770432811000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "He was appointed by Governor Larry Rhoden and confirmed by the South Dakota State Senate.\n\nKirkeby is a lifelong South Dakotan and graduate of South Dakota State University. He operates a family farm with his sons and provides public access to deer and pheasant hunters. He has served on the Merton Township board for over 20 years.\n\nKirkeby will be replacing Jon Locken, who completed an 8-year term on the GFP Commission in January 2026. As a commissioner, Kirkeby's primary goal will be keeping the outdoors open and accessible for public enjoyment.\n\nGovernor Rhoden praised Kirkeby as a \"lifelong steward of the land\" with a strong commitment to conservation, habitat protection, and public access - assets that will benefit the state.\n\nThe article does not contain any specific numbers, prices, statistics, or percentages. It also does not mention any deadlines or expert quotes.",
      "summaryTimestamp": 1770611083757
    },
    {
      "id": "791fbf4b61725b76",
      "title": "Funding Available for Local Communities to Enhance Public Outdoor Recreation Opportunities",
      "link": "https://www.tsln.com/news/funding-available-for-local-communities-to-enhance-public-outdoor-recreation-opportunities/",
      "description": "Pierre, S.D. &#8211; South Dakota Game, Fish and Parks (GFP) announced today that the Land and Water Conservation Fund (LWCF) and Recreation Trails Program (RTP) grant applications for 2026 are now open. Recreational Trails Program...",
      "date": "Sat, 07 Feb 2026 02:47:47 +0000",
      "timestamp": 1770432467000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key points:\n\n- The South Dakota Game, Fish and Parks (GFP) announced that the Land and Water Conservation Fund (LWCF) and Recreation Trails Program (RTP) grant applications for 2026 are now open.\n\n- The RTP provides up to 80% reimbursement for recreational trail projects, both motorized and non-motorized. The application deadline is April 10, 2026.\n\n- The LWCF provides up to 50% reimbursement for outdoor recreation projects seeking at least $10,000 in grant assistance. Priorities include unpaved trails, swim beaches, fishing areas, water trails, nature areas, playgrounds, and picnic areas. The application deadline is April 30, 2026.\n\n- Application information and links are available on the GFP website. For more details, contact Grants Coordinator Kerri Richards at 605.773.5490 or Kerri.Richards@state.sd.us.",
      "summaryTimestamp": 1770611086534
    },
    {
      "id": "24831d1d4a23ea3b",
      "title": "SDSU Extension invites public to 2026 SD Grasslands Summit",
      "link": "https://www.tsln.com/news/sdsu-extension-invites-public-to-2026-sd-grasslands-summit/",
      "description": "BROOKINGS, S.D. — South Dakota State University Extension is inviting everyone interested in grasslands to attend the 2026 South Dakota Grasslands Summit on March 3-4 in Mitchell. Building on the momentum of its successful inaugural event,...",
      "date": "Sat, 07 Feb 2026 02:39:14 +0000",
      "timestamp": 1770431954000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "This event is part of the South Dakota Grasslands Initiative, which is hosting its second summit after a successful inaugural event in March 2024 that attracted over 200 participants.\n\nThe 2026 summit's theme is \"Grasslands: South Dakota's Most Valuable Resource\", highlighting the critical role grasslands play in the state's economy, agriculture, natural resources, and communities. Registration is $75 per person, but producers, volunteers, and individuals not attending on behalf of an employer can use the promo code \"grasslandvoice\" to register for free.\n\nThe two-day event will feature a lineup of speakers and sessions exploring the intersection of grasslands with livestock production, tourism, beekeeping, water quality, and cultural connections. Optional activities include a film festival and a session focused on strengthening collaboration between conservation districts and the South Dakota Grasslands Initiative.\n\nOn March 4, the event will include a coffee hour, a session dedicated to grassland restoration for private lands, and inspiring stories from across the state. Participants will also have the opportunity to engage in facilitated conversations about next steps and opportunities for action. The afternoon will feature a Heritage Fund Forum, highlighting funding models from neighboring states and creating a space for collective discussion about conservation funding needs in South Dakota.\n\nThe South Dakota Grassland Coalition, SDSU Extension, and other partners have helped shape the concept of the grassland initiative movement, which aims to promote the importance of grasslands in the state.",
      "summaryTimestamp": 1770611090358
    },
    {
      "id": "338adf8f1286dd04",
      "title": "Virginia Cattleman Takes Helm as NCBA President",
      "link": "https://www.tsln.com/news/virginia-cattleman-takes-helm-as-ncba-president/",
      "description": "NASHVILLE, Tenn. (Feb. 6, 2026) – Since 1850, Gene Copenhaver&#8217;s family has been rooted in the land raising crops and livestock. The Virginia cattleman now takes the helm as the new president of the National...",
      "date": "Sat, 07 Feb 2026 02:30:38 +0000",
      "timestamp": 1770431438000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/06192937/image-19.png",
      "summary": "Key Points:\n\n- Gene Copenhaver, a Virginia cattleman, has been elected as the new president of the National Cattlemen's Beef Association (NCBA). His term began at the end of CattleCon 2026 held in Nashville, Tennessee.\n\n- The 2026 NCBA officer team includes:\n  - Kim Brackett of Idaho as president-elect\n  - Skye Krebs of Oregon as vice president\n  - Kenny Rogers of Colorado as chair of the NCBA Policy Division\n  - Scott Anderson of Oklahoma as policy vice chair\n  - Travis Maddock of North Dakota and Dan Hanrahan of Iowa as chair and vice chair of the NCBA Federation Division, respectively\n  - Brad Hastings of Texas as NCBA treasurer\n\n- Copenhaver's family has been in the cattle business since 1850. He currently manages his family's stocker operation in southwest Virginia with his son, Will.\n\n- Copenhaver's priorities as the new NCBA president include: continuing what works, staying grounded in grassroots input, remaining open-minded, and focusing on profitability for all sectors and scales of operation.\n\n- He wants to push back against regulatory barriers, support policies that allow reinvestment, and build on recent momentum around tax provisions to ensure that \"every good year doesn't get taxed away before we can shore up our infrastructure.\"\n\n- Copenhaver is optimistic about the future due to the steady growth in beef demand over the last four decades and the next generation of smart, relationship-driven, and family-centered young producers who want to build lasting operations.\n\n- His vision of success is simple: \"Build a good operation. Involve your family. Treat people right.\"",
      "summaryTimestamp": 1770611093977
    },
    {
      "id": "a4d44570b9ed6cfe",
      "title": "Sullivan, Maude, Radke address South Dakota ranchers on property rights",
      "link": "https://www.tsln.com/news/sullivan-maude-radke-address-south-dakota-ranchers-on-property-rights/",
      "description": "",
      "date": "Sat, 07 Feb 2026 02:24:04 +0000",
      "timestamp": 1770431044000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/06191249/image-14-768x1024.png",
      "summary": "Key points:\n\n- Shad Sullivan, R-CALF USA's Property Rights Committee Chairman, discussed electronic identification (EID) and efforts to establish a mandatory EID system for all U.S. cattle.\n\n- Property rights advocate Amanda Radke of Mitchell, South Dakota, updated the crowd on property rights bills in the South Dakota legislature.\n\n- The Maude family discussed their ongoing saga of extreme government overreach and criminal charges, which they have resolved by purchasing the small tracts they were accused of \"stealing.\"\n\n- South Dakota Stockgrowers Association president Tom Costello introduced the speakers at the event.\n\n- The event aimed to address property rights concerns for South Dakota ranchers.",
      "summaryTimestamp": 1770611097155
    },
    {
      "id": "55dd070f59e0e9a1",
      "title": "EPA finalizes limited two-season use of OTT dicamba on cotton and soybeans with stricter safeguards",
      "link": "https://www.brownfieldagnews.com/news/epa-finalizes-limited-two-season-use-of-ott-dicamba-on-cotton-and-soybeans-with-stricter-safeguards/",
      "description": "The U.S. EPA has finalized a new dicamba label for over-the-top use in soybeans and cotton for the next two growing seasons. Three products, including Stryax from Bayer, Engenia from BASF and Tavium from Syngenta, can be used with stricter guidance compared to previous seasons. Some prior restrictions from the EPA will continue in order [&#8230;] The post EPA finalizes limited two-season use of OTT dicamba on cotton and soybeans with stricter safeguards appeared first on Brownfield Ag News.",
      "date": "Fri, 06 Feb 2026 22:43:01 +0000",
      "timestamp": 1770417781000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The U.S. EPA has finalized a new dicamba label for over-the-top use in soybeans and cotton for the 2022 and 2023 growing seasons. Three dicamba products - Stryax from Bayer, Engenia from BASF, and Tavium from Syngenta - can be used during this period, but with stricter guidelines compared to previous seasons.\n\nSome prior restrictions from the EPA will continue, including:\n- Applications must be made at least 60 feet from the field's edge \n- Dicamba can only be applied when wind speeds are between 3-10 mph\n- Farmers must maintain records of dicamba applications for two years\n\nThe new label aims to address concerns about off-target movement and damage to neighboring crops. Farmers are advised to follow all label instructions and guidelines to mitigate risks.",
      "summaryTimestamp": 1770601927791
    },
    {
      "id": "cdba82f3bc60ea5f",
      "title": "Akralos to deliver advanced feed and nutrition solutions",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/akralos-to-deliver-advanced-feed-and-nutrition-solutions]]>",
      "description": "Joint venture brings together Alltech and ADM feed businesses to serve the North American market.",
      "date": "Fri, 06 Feb 2026 22:29:08 GMT",
      "timestamp": 1770416948000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt92b4f3a2c67a575a/69866c26510a9c3a403504b5/Feedstuffs_in_focus_-_Mark_lyons-_ippe.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Akralos, a new joint venture between Alltech and ADM, will deliver advanced feed and nutrition solutions for the North American market. The partnership combines Alltech's expertise in feed additives and nutrition with ADM's large-scale feed production capabilities.\n\nAkralos will focus on serving dairy, beef, swine, and poultry producers. It will offer a portfolio of innovative feed ingredients, premixes, and additives to improve animal health, performance, and sustainability. This includes Alltech's flagship Sel-Plex organic selenium and Actigen yeast-based products.\n\nADM will contribute its network of 50+ feed mills across the U.S. and Canada, allowing Akralos to rapidly scale production and distribution. Alltech will provide technical support and product development. \n\nThe joint venture is expected to be operational by the end of 2022. It aims to capture growing demand for advanced feed solutions driven by increasing consumer preference for sustainably-produced meat, milk, and eggs.\n\nFarmers can expect improved access to specialized feed ingredients and formulations tailored to their livestock's nutritional needs. This could lead to gains in productivity, feed efficiency, and profitability.\n\n\"Akralos brings together two industry leaders to provide farmers with innovative, sustainable feed solutions,\" said Dr. Mark Lyons, President and CEO of Alltech. \"We're excited to leverage our combined strengths to support the evolving needs of North American producers.\"",
      "summaryTimestamp": 1770611100151
    },
    {
      "id": "7c8e341de1f84ccf",
      "title": "China's ongoing lockout of U.S. beef top of mind",
      "link": "<![CDATA[https://www.feedstuffs.com/livestock-and-poultry-market-news/china-s-ongoing-lockout-of-u-s-beef-top-of-mind]]>",
      "description": "USMEF leaders speak at CattleCon about the importance of regaining access to China for U.S. beef to add value.",
      "date": "Fri, 06 Feb 2026 22:20:55 GMT",
      "timestamp": 1770416455000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt737b9de26e9e4d84/6986779bd3cf3af41c1a2673/Erin_Borror_CattleCon_2026_presentation-USMEF.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "China has banned U.S. beef imports since May 2022, which has cost the U.S. beef industry an estimated $2 billion in sales. USMEF (U.S. Meat Export Federation) President Dan Halstrom stated that regaining access to the Chinese market is a top priority, as it was the 3rd largest destination for U.S. beef exports in 2021, valued at $1.3 billion.\n\nChina has cited concerns over BSE (bovine spongiform encephalopathy), also known as \"mad cow disease,\" as the reason for the ban. However, the U.S. has been recognized as a negligible risk country for BSE by the World Organization for Animal Health since 2021. USMEF is working closely with the USDA to resolve this issue and restore market access.\n\nHalstrom emphasized that the Chinese market is critical for adding value to U.S. beef, as Chinese consumers are willing to pay higher prices for premium cuts. In 2021, the average value of U.S. beef exports to China was $3.87/lb, compared to the global average of $3.51/lb.\n\nRegaining access to China could increase U.S. beef exports by 15-20% annually, according to Halstrom. This would be a significant boost for American beef producers, who are currently facing high feed costs and other economic challenges.",
      "summaryTimestamp": 1770611103240
    },
    {
      "id": "841a78e148255ffe",
      "title": "Year-round E15 push continues as Renewable Fuels group eyes Congressional deal",
      "link": "https://www.brownfieldagnews.com/news/year-round-e15-push-continues-as-renewable-fuels-group-eyes-congressional-deal/",
      "description": "The senior vice president of government affairs with the Renewable Fuels Association says he’s optimistic lawmakers will find a path forward on legislation for nationwide, year-round E15. &#8220;We&#8217;re keeping our fingers crossed.&#8221; The E15 Rural Domestic Energy Council met recently and Troy Bredenkamp tells Brownfield… We are hopeful this council can come to terms with [&#8230;] The post Year-round E15 push continues as Renewable Fuels group eyes Congressional deal appeared first on B",
      "date": "Fri, 06 Feb 2026 21:57:21 +0000",
      "timestamp": 1770415041000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Renewable Fuels Association (RFA) is pushing for legislation to allow year-round sales of E15 (a fuel blend with 15% ethanol) nationwide. Troy Bredenkamp, the RFA's senior vice president of government affairs, expressed optimism that lawmakers will find a way to pass such legislation. The E15 Rural Domestic Energy Council, a group convened by the RFA, recently met to discuss this issue, and Bredenkamp stated that the council is \"hopeful\" it can reach an agreement on the matter.",
      "summaryTimestamp": 1770589336601
    },
    {
      "id": "b2f6ca694d8d96d6",
      "title": "Ag on Instagram: The week’s best photos on Feb. 6, 2026",
      "link": "https://www.agdaily.com/lifestyle/ag-on-instagram-the-weeks-best-photos-on-feb-6-2026/",
      "description": "We bring you some of the best farm photos from the week this Friday, February, 2026! Be sure to hashtag your Instagram pics with #agdaily. The post Ag on Instagram: The week’s best photos on Feb. 6, 2026 appeared first on AGDAILY.",
      "date": "Fri, 06 Feb 2026 21:24:55 +0000",
      "timestamp": 1770413095000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/bg-aoi02026-300x157.jpg",
      "summary": "Key highlights include:\n\n- Photos were shared by various accounts, including Tanimura & Antle, Silent Shade Planting Company, Sugar Maple Jerseys LLC, Washington Cattlemen's Association, Brayson Burch, Anna Kobza (Feedlot Nutrition), Elkton FFA, Aaron Witt, Fletcher Farms, and Neil Denton Farms.\n\n- The photos depict scenes from farms, livestock, crops, and agricultural education programs.\n\n- To be featured in this weekly article, farmers/producers are encouraged to use the hashtag #agdaily when sharing their photos on Instagram.\n\n- No specific numbers, prices, dates, or expert quotes are provided in the article. The focus is solely on showcasing the visually appealing farm photos from that week.\n\n- The article aims to highlight the vibrant agricultural community on social media platforms like Instagram, allowing farmers to share their daily lives and operations with a wider audience.",
      "summaryTimestamp": 1770589346349
    },
    {
      "id": "66be4e6069869c66",
      "title": "Poultry science complex renamed to commemorate Huffman gift",
      "link": "https://agrilifetoday.tamu.edu/2026/02/06/poultry-science-complex-renamed-to-commemorate-huffman-gift/",
      "description": "Board of Regents approve renaming of Poultry Science Research, Teaching and Extension Center The post Poultry science complex renamed to commemorate Huffman gift appeared first on AgriLife Today.",
      "date": "Fri, 06 Feb 2026 19:14:16 +0000",
      "timestamp": 1770405256000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M University System Board of Regents approved the renaming of the Poultry Science Research, Teaching and Extension Center to the Barbara J. Huffman and William M. \"Bill\" Huffman '53 Poultry Science Farm Complex. This 16-acre complex in College Station, Texas supports all aspects of poultry, meat, and egg production and processing, and includes two classrooms.\n\nThe renaming honors a generous gift from Barbara and Bill Huffman, who are longtime supporters of Texas A&M and the Department of Poultry Science. Bill Huffman earned a bachelor's degree in poultry science from Texas A&M in 1953 and was a member of the award-winning Junior and Senior Poultry Judging Teams. \n\nIn addition to the renamed complex, the Huffmans have established the Barbara J. Huffman and William M. \"Bill\" Huffman '53 Chair in Poultry Science and have supported various other programs at Texas A&M over the decades.\n\nThe renaming reflects the Huffmans' \"deep belief in the power of poultry science to prepare students, advance discovery and serve the industries that feed the world,\" according to Audrey McElroy, Ph.D., professor and head of the Department of Poultry Science. The investment helps ensure Texas A&M students and faculty continue leading the way in poultry science and supporting the industries that depend on it.",
      "summaryTimestamp": 1770495692900
    },
    {
      "id": "a49581bc92e751c9",
      "title": "3 veterinary students awarded National DHIA scholarships",
      "link": "https://www.agdaily.com/livestock/veterinary-students-awarded-national-dhia-scholarships/",
      "description": "The National Dairy Herd Information Association awarded $1,500 2026 veterinary student scholarships to Kristalyn Benson, Emma Sells and Julia Young. The post 3 veterinary students awarded National DHIA scholarships appeared first on AGDAILY.",
      "date": "Fri, 06 Feb 2026 19:13:33 +0000",
      "timestamp": 1770405213000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/05/ear-tags-dairy-cattle-barn-300x228.jpg",
      "summary": "The National Dairy Herd Information Association (DHIA) Scholarship Committee awarded $1,500 scholarships to three veterinary students: Kristalyn Benson from the University of Wisconsin, Emma Sells from Washington State University, and Julia Young from Purdue University. The scholarships were given to third- or fourth-year veterinary students enrolled in AVMA-accredited programs, based on their interest in working in dairy, involvement in dairy medicine, and interest in using dairy software and records to improve animal health.\n\nBenson gained experience with production animals as a student technician and has taken on leadership roles, including being a Student AVMA delegate and chapter vice president. Sells developed a passion for research during an internship at a 30,000-head dairy and has been involved in Ag Animal Club and Theriogenology Club. Young was inspired to pursue veterinary medicine after visiting a family friend's Wisconsin dairy farm and has worked as a student assistant barn manager.\n\nThe National DHIA Scholarship Auction and investments and donations help fund the organization's scholarship program. To donate to the National DHIA Scholarship Fund, contact Leslie Thoman at 608-848-6455 ext. 108 or lthoman@dhia.org.",
      "summaryTimestamp": 1770589349330
    },
    {
      "id": "58de6354526a325e",
      "title": "CropLife Retail Week: Welcoming New Co-Host Amy Asmus",
      "link": "https://www.croplife.com/management/croplife-retail-week-welcoming-new-co-host-amy-asmus/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=croplife-retail-week-welcoming-new-co-host-amy-asmus",
      "description": "Eric Sfiligoj welcomes co-host Amy Asmus to unpack ag retail headlines: Nutrien leadership shifts, dicamba updates, and year-round E15 battles. The post CropLife Retail Week: Welcoming New Co-Host Amy Asmus appeared first on CropLife.",
      "date": "Fri, 06 Feb 2026 18:00:32 +0000",
      "timestamp": 1770400832000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Retail-Week-New.00_07_55_06.Feature-150x150.jpg",
      "summary": "Amy Asmus has joined Eric Sfiligoj as a co-host of the CropLife Retail Week podcast. The podcast discusses key issues in the agricultural retail industry, including:\n\n- Nutrien leadership changes: Nutrien's CEO Chuck Magro is stepping down, with Ken Seitz appointed as the new interim CEO.\n\n- Dicamba updates: The EPA extended the registrations for dicamba products Xtendimax, Engenia, and Tavium for 2 years, with additional label changes.\n\n- Year-round E15 battles: The Biden administration announced plans to allow year-round sales of E15 gasoline, which faces ongoing legal challenges.\n\nThe podcast provides insights and analysis on these important agricultural policy and regulatory developments that impact farmers and the retail industry.",
      "summaryTimestamp": 1770582133808
    },
    {
      "id": "26efa943b319ad5b",
      "title": "FDA Makes It Easier for Food Products To Be Labeled ‘No Artificial&#160;Dyes’",
      "link": "https://civileats.com/2026/02/06/fda-makes-it-easier-for-food-products-to-be-labeled-no-artificial-dyes/",
      "description": "February 6, 2025 – The Food and Drug Administration (FDA) will scale back on enforcing food dye labeling, making it easier for food companies to advertise products as made with no artificial dyes. On Thursday, the FDA sent a letter to food manufacturers clarifying it would exercise “enforcement discretion,” or would not take enforcement action, [&#8230;] The post FDA Makes It Easier for Food Products To Be Labeled ‘No Artificial Dyes’ appeared first on Civil Eats.",
      "date": "Fri, 06 Feb 2026 18:00:14 +0000",
      "timestamp": 1770400814000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The FDA announced on February 6, 2025 that it will scale back on enforcing food dye labeling requirements, making it easier for food companies to label products as \"no artificial dyes\". The FDA sent a letter to manufacturers stating it will exercise \"enforcement discretion\" and not take action against companies that make this claim, even if their products contain small amounts of artificial dyes. This change is intended to give consumers more choices for food products without artificial dyes. However, it may also allow some food companies to mislead consumers about the true ingredients in their products. Farmers should be aware of this labeling change and how it may impact consumer perceptions and demand for their crops and livestock.",
      "summaryTimestamp": 1770589351452
    },
    {
      "id": "0a4aa1d432bfa73e",
      "title": "Enhanced rice could address iron deficiencies around the world",
      "link": "https://www.agdaily.com/crops/enhanced-rice-could-address-iron-deficiencies-around-the-world/",
      "description": "Enhanced rice varieties could help combat global iron deficiency by delivering essential nutrients through one of the world’s widely consumed staple foods. The post Enhanced rice could address iron deficiencies around the world appeared first on AGDAILY.",
      "date": "Fri, 06 Feb 2026 17:33:44 +0000",
      "timestamp": 1770399224000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/bg-rice-deficiencies-300x195.jpg",
      "summary": "Key Points:\n\n- Researchers in Brazil, Italy, Chile, and Germany are working to increase the iron content in rice, one of the most consumed foods in the world.\n\n- In places like Bangladesh, up to 80% of people's calorie intake comes from rice, so increasing the iron in rice could help address iron deficiency, which affects around 2 billion people globally.\n\n- The researchers altered two similar genes in rice plants, which increased the iron content, but also made the plants more susceptible to \"iron toxicity\" where the plant absorbs too much iron, reducing productivity.\n\n- The team plans to modify the same genes in rice crops grown in aerated soil, as well as in other cereal crops like wheat, barley, sorghum, and maize, to create more iron-rich varieties.\n\n- The Canadian Light Source facility was used to analyze the 2D distribution of iron in the modified rice grains.\n\n- The goal is to develop more nutrient-dense crop varieties that can help address iron deficiencies around the world.",
      "summaryTimestamp": 1770589354266
    },
    {
      "id": "96ed6812051823d3",
      "title": "Box tree moth quarantine expands in Ohio, West Virginia",
      "link": "https://www.farmanddairy.com/news/box-tree-moth-quarantine-expands/903723.html",
      "description": "Ohio is expanding its box tree moth quarantine to seven new counties. Learn how to identify this invasive pest, check the new boundaries, and report sightings. The post Box tree moth quarantine expands in Ohio, West Virginia appeared first on Farm and Dairy.",
      "date": "Fri, 06 Feb 2026 16:05:00 +0000",
      "timestamp": 1770393900000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/02/btm_banner.png",
      "summary": "This is due to the detection of the invasive moth in new locations from May to October 2025. \n\nThe entire state of West Virginia was also placed under a federal box tree moth quarantine in December 2025 by the USDA, after the pest was detected in Berkeley and Morgan counties in June and July 2025.\n\nBox tree moths are an invasive pest from East Asia that pose a threat to boxwood plantings, an important ornamental shrub in Ohio's nursery industry. State and federal agencies will be conducting inspections and placing traps to monitor populations. \n\nResidents in the quarantined areas are advised to familiarize themselves with the appearance of the moth and its damage, check their boxwood plants, and report any suspected infestations to the Ohio Department of Agriculture or West Virginia Department of Agriculture. Evidence of damage includes chewed, cut or missing leaves, yellowing/brown leaves, white webbing, and green-black excrement.\n\nThe quarantines aim to restrict the movement of boxwood plants out of the affected areas to prevent further spread of this invasive pest.",
      "summaryTimestamp": 1770575432719
    },
    {
      "id": "c1a74c0ab02c154a",
      "title": "FDA OKs emergency Ivomec use for screwworm prevention",
      "link": "https://www.agdaily.com/livestock/fda-authorizes-emergency-use-ivomec-prevent-new-world-screwworm-cattle/",
      "description": "The Food and Drug Administration authorized emergency over-the-counter use of Ivomec injection to help prevent New World screwworm in certain cattle. The post FDA OKs emergency Ivomec use for screwworm prevention appeared first on AGDAILY.",
      "date": "Fri, 06 Feb 2026 15:48:51 +0000",
      "timestamp": 1770392931000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/11/bg-new-world-screwworms-300x157.jpg",
      "summary": "The U.S. Food and Drug Administration has issued an Emergency Use Authorization allowing the over-the-counter use of Ivomec (ivermectin) injectable solution to help prevent infestations of New World screwworm in certain classes of cattle. \n\nThe authorization, announced on February 5, 2026, permits Ivomec to be used as a preventive treatment against myiasis (infestation of wounds by screwworm larvae) when administered within 24 hours of birth, at the time of castration, or when a wound first appears. \n\nThe authorization is valid only for cattle, excluding female dairy cattle producing milk for human consumption and calves intended for veal production. Key restrictions include a 35-day slaughter withdrawal period, no established milk discard time, and no approval for treating existing New World screwworm infestations.\n\nStudies conducted in Brazil and Argentina in the early 1990s found that calves receiving a single subcutaneous dose of ivermectin (200 mcg/kg body weight) at birth or castration experienced dramatically lower rates of myiasis compared to untreated controls. Prevention rates exceeded 97% in some trials, though more recent research suggests effectiveness may vary.\n\nFDA officials stressed that producers are responsible for following all labeling, withdrawal periods, and conditions outlined in the EUA fact sheet. The agency also cautioned that widespread prophylactic use of antiparasitic products could accelerate resistance, potentially reducing effectiveness against screwworm and other parasites.\n\nThe emergency authorization will remain in effect until it is revoked or until the U.S. Department of Health and Human Services determines that the public health emergency related to New World screwworm no longer exists.",
      "summaryTimestamp": 1770589358143
    },
    {
      "id": "df55450a8ab02dad",
      "title": "What is avian influenza? Fast facts on ‘bird flu’ in the U.S.",
      "link": "https://agrilifetoday.tamu.edu/2026/02/06/what-is-avian-influenza-fast-facts-on-bird-flu-in-the-u-s/",
      "description": "From backyard flocks to grocery prices, experts explain how bird flu spreads, why it matters The post What is avian influenza? Fast facts on ‘bird flu’ in the U.S. appeared first on AgriLife Today.",
      "date": "Fri, 06 Feb 2026 15:08:23 +0000",
      "timestamp": 1770390503000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "S. poultry industry since 2022. The current outbreak has disrupted the poultry industry, leading to increased egg and poultry product prices nationwide.\n\nKey facts:\n- The HPAI outbreak began in the U.S. in early 2022 and is now entering its fourth year.\n- The virus has a mortality rate approaching 100% in chickens, with most infected birds dying within 24-48 hours.\n- Migrating waterfowl like ducks and geese are the primary carriers of the virus, which spreads through respiratory exposure and bird droppings.\n- Since 2022, HPAI outbreaks have diminished during summer but resurged in fall, winter, and spring.\n- As of January 26, 2026, there have been 71 human cases of avian influenza in the U.S., including 2 deaths, though the risk to humans remains low.\n- The Texas Animal Health Commission has confirmed 6 positive HPAI cases in Texas since November 2025, mostly in wild birds and backyard flocks.\n- Over 186 million commercial and backyard poultry have been affected by avian influenza since January 2022.\n- Major HPAI outbreaks in commercial farms can disrupt poultry production and lead to higher grocery prices for eggs and poultry.\n\nExperts recommend that backyard poultry owners implement strict biosecurity measures to limit exposure to migratory waterfowl and prevent the virus from entering their flocks. The Texas A&M Veterinary Medical Diagnostic Laboratory can provide testing services for suspected cases.",
      "summaryTimestamp": 1770495697172
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points from the article:\n\n- Weather in Illinois has been cold and dry, with temperatures 8-18 degrees below average. Southern Illinois had lows of -7F in Taylorville and -4F in Jerseyville.\n\n- January saw 2 inches less precipitation than normal statewide, despite heavy snowfall in some areas like Du Quoin which had nearly 20 inches (over 500% of normal) but only 1 inch of liquid equivalent.\n\n- The dry conditions have left soils and streams very dry, with little drought relief from the snow. Temperatures will warm up next week but rainfall will remain low.\n\n- Experts recommend using the N-Rate Calculator and Precision Conservation Management program to optimize nitrogen application and protect profitability and water quality. Panelists include John Jones (soil scientist), Gary Schnitkey (agricultural economist), and Laura Gentry (Illinois Corn Growers).\n\n- The article also mentions WILLAg.org radio programming covering commodity markets and the closing market report.",
      "summaryTimestamp": 1770567945085
    },
    {
      "id": "263b6f87b768bec8",
      "title": "A roadmap for conservation: Inside Ohio’s 2025 wildlife wins",
      "link": "https://www.farmanddairy.com/news/top-stories/a-roadmap-for-conservation-inside-ohios-2025-wildlife-wins/903145.html",
      "description": "From sturgeon releases to new habitat grants, explore the Ohio Division of Wildlife’s 2025 successes and their ambitious conservation plans for 2026. The post A roadmap for conservation: Inside Ohio’s 2025 wildlife wins appeared first on Farm and Dairy.",
      "date": "Fri, 06 Feb 2026 05:39:29 +0000",
      "timestamp": 1770356369000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2025/07/6-scaled.jpg",
      "summary": "- Over 2,000 human-raised 3-year-old eastern hellbenders were produced through partnerships, with some observed guarding nests.\n- $20,000 in Wildlife Education grants were distributed to over 4,000 educators and students for habitat creation and wildlife education.\n- Over $38,000 in restitution was ordered for an illegal taxidermy business.\n- Habitat improvement projects covered 4,800 acres of timber, 6,000 acres of herbicide spraying, 2,255 acres of grassland maintenance, and 180 acres of brush clearing.\n- The division helped certify 208 adult shooting sports instructors and trained over 240 youth.\n- A bee survey documented over 450 species, with 70 potentially extirpated from the state.\n- Sturgeon restoration stocking occurred in the Cuyahoga (2,000 fish), Sandusky (750 fish), and Maumee (3,000 fish) rivers.\n- H2Ohio projects restored 870 acres of wetlands on private property.\n- Research was conducted on wild turkeys, gray foxes, and eastern harvest mice.\n- A new Deer Donation Program was launched to provide venison to food banks.\n\nIn 2026, the division plans to:\n- Launch a $9 million Wildlife Habitat Initiative to restore grassland and wildlife habitats on private lands.\n- Conclude a wild turkey nesting and survival study.\n- Establish a voluntary outfitter accreditation program.\n- Re-launch the Backyard for Wildlife program.\n- Continue the Ohio Bear Project and launch a Sauger Restoration Plan.\n- Acquire a new aircraft to assist law enforcement and wildlife management.",
      "summaryTimestamp": 1770539283321
    },
    {
      "id": "7d527ae3461b1c8a",
      "title": "Texas A&#038;M center named for Hood Family Foundation",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-am-center-named-for-hood-family-foundation/",
      "description": "Board of Regents approves new name of center focused on sustainable agriculture, forestry solutions The post Texas A&M center named for Hood Family Foundation appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 23:44:42 +0000",
      "timestamp": 1770335082000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M University System Board of Regents has voted to rename a center focused on sustainable solutions for agriculture and forestry industries to the Hood Family Center for Greenhouse Gas Management in Agriculture and Forestry. This comes after the John and Sally Hood Family Foundation provided a $5 million endowment to support the center's work, which was launched in 2023 as a joint center of Texas A&M AgriLife Research and Texas A&M University in College Station.\n\nThe center brings together expertise across Texas A&M to advance the abilities of agriculture and forestry systems to meet modern demands for safe, affordable food and fiber production on thriving working lands. It focuses on converging research, teaching, and extension efforts with ongoing research on the sustainability of emerging practices like carbon capture in Texas soils and crops. These unbiased research efforts aim to improve soil health and function, as well as resilience against increasing environmental and biological stressors.\n\nThe director of the center, Nithya Rajan, Ph.D., stated that the generous support from the Hood family is critical to their mission of turning science into producer-ready solutions that strengthen soil health, reduce input costs, and keep working lands productive for generations. John Hood, who graduated from Texas A&M in 1990, and his wife, Sally, who graduated in 1992, said they were impressed with the center's work and felt it was an opportunity to make a difference for their children and grandchildren.",
      "summaryTimestamp": 1770495700594
    },
    {
      "id": "b82d9dd5f1da9eaf",
      "title": "Texas-grown cabbage meets global tradition in Texas A&#038;M kimchi research",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-grown-cabbage-meets-global-tradition-in-texas-am-kimchi-research/",
      "description": "Researchers test how domestic produce and fermentation science shape food safety, flavor and markets The post Texas-grown cabbage meets global tradition in Texas A&M kimchi research appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 23:16:21 +0000",
      "timestamp": 1770333381000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Researchers at the Texas A&M College of Agriculture and Life Sciences are studying how Texas-grown napa cabbage can be used to make kimchi, a traditional Korean fermented vegetable dish.\n\n- The research aims to support U.S. farmers by increasing the value of crops like napa cabbage through fermentation, which can create foods with longer shelf life and broader market potential.\n\n- Doctoral student Min Ji Jang, who has experience from South Korea's World Institute of Kimchi, is examining how the microbial communities develop during kimchi fermentation using locally grown cabbage.\n\n- Doctoral student Sehyeon Song is analyzing how microbiome mapping and artificial intelligence can help predict fermentation outcomes and quality for kimchi made with regional ingredients.\n\n- The researchers are working with local farmers near College Station and in South Texas to source cabbage for lab-scale kimchi production, and aim to determine whether American-made kimchi could succeed in domestic or export markets.\n\n- The research team has submitted multiple grant proposals to expand the work, including consumer acceptance studies and collaborations with nutrition scientists to evaluate potential health impacts.\n\n- Beyond research, the team is leveraging fermentation as an educational tool, collaborating with the Texas A&M College of Education and Human Development to develop hands-on activities for middle school students.",
      "summaryTimestamp": 1770495703621
    },
    {
      "id": "bb73bc598e5b3a8a",
      "title": "Texas A&#038;M Forest Service increases funding to combat oak wilt spread",
      "link": "https://agrilifetoday.tamu.edu/2026/02/05/texas-am-forest-service-increases-funding-to-combat-oak-wilt-spread/",
      "description": "Cost-share opportunities offer Texas landowners critical resources to mitigate destructive disease The post Texas A&#038;M Forest Service increases funding to combat oak wilt spread appeared first on AgriLife Today.",
      "date": "Thu, 05 Feb 2026 21:04:25 +0000",
      "timestamp": 1770325465000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Oak wilt is one of the most destructive tree diseases in the U.S., killing millions of trees across Central Texas.\n\nThe agency is providing up to $5,000 for installing trenches to contain the disease and up to $2,000 for removing infected red oak trees. This funding is critical as the high-risk spring season begins, when sap-feeding beetles that spread the fungal spores are most active.\n\nThe Texas Oak Wilt Cost Share program is designed to empower landowners to take proactive measures before the disease can further devastate local tree canopies and diminish property values. Landowners must work with Texas A&M Forest Service staff to verify the disease and develop a management plan before accessing the cost-share funds.\n\nThe agency emphasizes that the health of oak trees is vital to the Central Texas landscape and economy, as private landowners own 95% of the state's forests. This funding allows the Forest Service to shift from reactive to more proactive management of the oak wilt outbreak.\n\nLandowners are also reminded to avoid pruning oak trees from February 1 to June 30 to prevent attracting the disease-spreading beetles. If pruning is necessary, all wounds must be painted immediately.\n\nThe Texas A&M Forest Service has regional offices across Central Texas to provide technical assistance to landowners concerned about oak wilt on their property. Interested landowners can use the \"Find My Forester\" tool to connect with their county representative.",
      "summaryTimestamp": 1770495707510
    },
    {
      "id": "5cbf4931a1259cb2",
      "title": "EPA Affirms Farmers’ Right to&#160;Repair",
      "link": "https://civileats.com/2026/02/05/epa-affirms-farmers-right-to-repair/",
      "description": "February 5, 2025 – The Environmental Protection Agency (EPA) issued new guidance this week that makes it clear that manufacturers cannot use the Clean Air Act to prevent farmers from fixing their own equipment. Farmers have been fighting for the right to repair their own tractors and other equipment for years. Some companies have justified [&#8230;] The post EPA Affirms Farmers’ Right to Repair appeared first on Civil Eats.",
      "date": "Thu, 05 Feb 2026 18:24:06 +0000",
      "timestamp": 1770315846000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The EPA issued new guidance on February 5, 2025, affirming farmers' right to repair their own agricultural equipment. Manufacturers have previously used the Clean Air Act to restrict farmers from fixing their tractors and other machinery. The new guidance clarifies that this practice is not allowed, granting farmers the freedom to repair their own equipment. This is a victory for farmers who have long been advocating for the right to repair their own tools and machinery without interference from manufacturers.",
      "summaryTimestamp": 1770502877305
    },
    {
      "id": "fabbae62a516995a",
      "title": "Mark your calendar: Upcoming Nitrogen College events in Hutchinson, Mankato",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendar-upcoming-nitrogen.html",
      "description": "",
      "date": "Thu, 05 Feb 2026 17:53:00 +0000",
      "timestamp": 1770313980000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiYP7a_5ace5l3W6STO0EsMxgLiZUJ7_3n4dOsrBT5LrwJ5Th4TxpkkTSVHw1eevYJvAV5Q2KtCAD3N4C4J8yxb0f2F29f4cYnsGRlISr_Q7XDfY35lEVQJKctwEeumhLUrHSOHHttyoaL-mhb6Sir7ERZzNP4QN1SgES68Gd_rE_qkvZyKb9vvRaAHxps/s72-w640-h346-c/Rochester%20Nitrogen%20Smart%20event%20(1).jpg",
      "summary": "The University of Minnesota Extension is hosting Nitrogen College, a series of free workshops designed to help farmers refine their nitrogen (N) management strategies. The events will be held in Hutchinson on February 23-24 and in Mankato on February 25-26, 2026. There is no cost to attend, and pre-registration is not required.\n\nThe comprehensive curriculum includes five sessions over two days, covering topics such as a deep dive into the 4Rs of nutrient management, adapting N management to climate, reducing nitrate loss to water, emerging biological nitrogen products, and utilizing variable rate technology for N applications. Certified Crop Advisors (CCAs) can earn a total of 5 Nutrient Management and 6 Soil and Water credits by attending all sessions.\n\nThe events are driven by high fertilizer prices, recent low commodity prices, and ongoing environmental concerns, which have created a complex landscape for producers when making fertility decisions. The Nitrogen College workshops aim to help farmers address these challenges and improve their N management strategies.\n\nDetailed schedules and additional information for the Hutchinson and Mankato events are available on the University of Minnesota Extension website. Participants should note that lunch will not be provided, and they should plan accordingly.\n\nFor more information or to ask questions, attendees can contact Brad Carlson, Extension educator, at bcarlson@umn.edu. They can also subscribe to the Nutrient Management Podcast, the Minnesota Crop News email newsletter, and follow the UMN Extension Nutrient Management on social media.",
      "summaryTimestamp": 1770495711219
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Farmers are now using AI-assisted tools, voice search, and quick-scan platforms that often answer their questions without needing to click. The true indicator of content effectiveness is now attention time - how long a user spends meaningfully engaged with the content.\n\nAgWeb.com, a Farm Journal website, recently underwent a redesign to increase user engagement and attention time:\n- 54% increase in readers reaching 75% of an article\n- 21% increase in readers reaching 90% of an article\n- 33% increase in daily article pageviews per mobile user\n\nThe article cites that in general, only 16% of users read every word of online content, while 79% scan pages rather than reading fully. AgWeb's redesign aimed to simplify layouts and guide deeper engagement.\n\nAttention time is a clearer indicator of impact than click-through rate, as it shows if users stayed with the content, scrolled with purpose, consumed multiple articles, and were in an active, focused mindset. High-attention environments deliver stronger results for advertisers, as their brand is present during engaged moments.\n\nThe improvements on AgWeb translate to more value for brands, providing more time with content, increased exposure opportunities, and higher quality impressions. This aligns with how farmers search and consume content today. For ag marketers, AgWeb's optimized content and design offers one of the most effective digital environments, as better attention leads to better outcomes.",
      "summaryTimestamp": 1770516510646
    },
    {
      "id": "a2a9f85a977fd908",
      "title": "Bringing the cows home to Columbus",
      "link": "https://www.farmanddairy.com/columns/2-05-dairy-excel/903128.html",
      "description": "Professor Maurice Eastridge explores the history and future of Ohio State University's dairy program, from its humble beginnings to the new high-tech facility, the Multispecies Animal Learning Complex. Find out what it really means to bring the cows home to Columbus. The post Bringing the cows home to Columbus appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 10:00:00 +0000",
      "timestamp": 1770285600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "The new facility will house a herd of 60 lactating Jersey cows milked by two robotic milking systems, plus 15 dry cows. The $X million project broke ground in January 2024 and the ribbon cutting was held on January 29, 2026.\n\nThe new dairy will feature advanced technologies like a Lely Vector automated feeding system and Lely Discovery manure vacuums. Calves will be raised onsite until 6 months old, then moved to the Agricultural Technical Institute (ATI) dairy until 2 months before calving. The facility will also have space for processing milk into value-added products.\n\nOhio is an important dairy state, ranking 12th nationally in milk production and 1st in Swiss cheese production. The state has about 252,000 dairy cows across 1,400 herds, with 278 robotic milking systems installed so far. Dairy is typically the 3rd or 4th largest agricultural commodity in Ohio.\n\nThe new MALC and dairy farm aim to advance sustainability, showcase dairy technology, and continue Ohio State's mission of educating students, conducting dairy research, and engaging the public. The facility will allow cows access to pasture near the Columbus campus to connect the community with animal agriculture.",
      "summaryTimestamp": 1770642007617
    },
    {
      "id": "ac49781afd961e75",
      "title": "What to know about reseeding right-of-ways",
      "link": "https://www.farmanddairy.com/columns/what-to-know-about-reseeding-right-of-ways/903118.html",
      "description": "Pipeline easements can disrupt your farm. Learn how to manage reseeding, choose the right forage, and mitigate livestock health risks during land restoration. The post What to know about reseeding right-of-ways appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:33:10 +0000",
      "timestamp": 1770283990000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Landowners are often approached to lease their property for these projects, which can significantly impact their pastures and crops. \n\nThe timeline and priorities of the pipeline company (covering ground to prevent erosion) often conflict with the farmer's concerns over crop impacts, weeds, soil compaction, and proper seeding timing. Farmers need to be proactive in communicating their needs and ensuring the company's reseeding efforts align with their operations.\n\nRecommended seeding options vary by planting window:\n- July: Summer annuals like sudangrass, sorghum-sudangrass, pearl millet, teff grass\n- Aug/Sept: Oats, triticale, annual ryegrass\n\nLegumes like alfalfa, clovers, and birdsfoot trefoil provide benefits but also risks like bloat. A balanced grass-legume mix is ideal. \n\nKey prep steps are recommended, including soil testing, weed control, proper inoculation, and equipment calibration. Reaching out to agencies and support networks can help farmers navigate these unscheduled challenges.",
      "summaryTimestamp": 1770642011148
    },
    {
      "id": "875623b3e3e16f51",
      "title": "Cold fronting",
      "link": "https://www.farmanddairy.com/columns/cold-fronting/903129.html",
      "description": "This is no longer winter. This is harassment. Through 28 days, northern Ohio has had the coldest January average out of any location in the country. The post Cold fronting appeared first on Farm and Dairy.",
      "date": "Thu, 05 Feb 2026 09:00:00 +0000",
      "timestamp": 1770282000000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Some key points:\n\n- Northern Ohio had the coldest January average out of any location in the U.S. through the first 28 days of the month.\n\n- Temperatures were so low that Alaska's capital, Juneau, was 15-25 degrees warmer than Ohio on some days.\n\n- The author's small dog refuses to wear boots and the family has been bringing in farm animals like calves, goats, and bunnies to keep them warm.\n\n- School was canceled for a full week due to the extreme cold snap.\n\n- The author's son, BoyWonder, was able to avoid the cold by traveling to Florida for work, where temperatures were still unseasonably cold at 55 degrees.\n\n- Despite the harsh winters, the author loves living in Ohio and appreciates the state's natural beauty, though wonders how their ancestors chose to settle there.\n\n- The author is hopeful the cold weather will kill off stink bugs, though skeptical it will be effective.\n\nThe article provides a vivid, first-hand account of the challenges farmers and residents are facing due to the unprecedented cold front in northern Ohio during this winter season.",
      "summaryTimestamp": 1770642014292
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "The systems tested were: conventional tillage (CT), strip-tillage (ST), no-tillage (NT), and no-tillage with a cereal rye cover crop (NT+CR). Each system was paired with 3 starter fertilizer strategies: unfertilized control, 15 lb N/ac, and 15 lb N/ac + 10 lb S/ac.\n\nEarly soybean growth showed a response to starter fertilizer, with 12% higher biomass at the V4 stage. However, by the R2 stage, leaf tissue N and S levels were sufficient across all treatments, indicating the soybeans could meet their nutrient needs through biological fixation and soil organic matter. \n\nSoybean yields ranged from 60-95 bu/ac across the sites. Starter fertilizer did not significantly increase yields. Yields were similar across tillage systems, with CT/ST averaging 78.4 bu/ac, NT 77.6 bu/ac, and NT+CR 76.2 bu/ac.\n\nWhen factoring in costs, NT had the highest partial net return, followed by ST and CT. NT+CR had the lowest partial net return due to higher cover crop management costs of $55/ac, though this can be offset by conservation program cost-share.\n\nThe trials will continue in 2026 to track medium-term effects on soil, residue, and nutrient dynamics in these conservation systems. This will provide valuable insights to help farmers adopt conservation practices without sacrificing yield.",
      "summaryTimestamp": 1770567958379
    },
    {
      "id": "6582e98228aea1bb",
      "title": "Strategic Farming: Let's talk crops talked crop economics",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops.html",
      "description": "",
      "date": "Wed, 04 Feb 2026 17:34:00 +0000",
      "timestamp": 1770226440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj3KnlsdBHsVzFCDGva5ibztrhOiKVlkrOIv9nugtd7IETzL4p86HXj9uP6Ut7q5nz_XSPjQW1wzEC9tqEeezve-nsmnj-PJWnkMQ2wgyBkQLWveSxBApMQofPbWI6VKWQcoygt2-tOV1leIDL5fulxSovhnz2-1fNNA_3ZFgaN_VP-CZsa4X7rMQ0G_XZI/s72-w320-h240-c/grain-bins_peltier.jpg",
      "summary": "Key points include:\n\n- Minnesota is a major producer of several crops, ranking in the top 5 nationally for corn, soybeans, wheat, sugar beets, oats, canola, sunflowers, and rye. The state saw record corn yields of over 200 bushels per acre in 2025.\n\n- However, cost of production has risen significantly in recent years, with the average Minnesota farmer spending $4.71, $11.02, and $6.26 per bushel to produce corn, soybeans, and spring wheat in 2024 - exceeding current cash prices. \n\n- Median net farm income in Minnesota dropped to $2,400 in 2024, the lowest in 25 years, as profit margins tightened across the state.\n\n- In response, the federal government launched the $11 billion Farmer Bridge Assistance program in 2025 to provide payments to farmers of up to 35% of expected 2025 crop losses.\n\n- The 2026 Farm Bill will see changes, including raising the payment limit to $155,000 per person, increasing ARC revenue guarantees, and adding up to 30 million new base acres nationally.\n\n- At the national level, 2025 saw record corn production of 17 million bushels, with high ending stocks and strong export demand projected to keep corn prices stable going forward.\n\n- Crop analysts predict a reversal in 2026 with decreased corn acreage and increased soybean acreage compared to 2025.",
      "summaryTimestamp": 1770589361822
    },
    {
      "id": "26ee0af4c626bbf1",
      "title": "USDA Takes Over Food for&#160;Peace",
      "link": "https://civileats.com/2026/02/04/usda-takes-over-food-for-peace/",
      "description": "February 4, 2026 – The U.S. Department of Agriculture (USDA) announced Tuesday that it is now operating the foreign food aid program Food for Peace and that it is moving quickly to get the program back on track to deliver “lifesaving food assistance.” The U.S. Agency for International Development (USAID) formerly operated Food for Peace, [&#8230;] The post USDA Takes Over Food for Peace appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 17:11:01 +0000",
      "timestamp": 1770225061000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has taken over the Food for Peace foreign food aid program from USAID. This change happened on February 4, 2026. The USDA says it is moving quickly to get the program back on track to deliver \"lifesaving food assistance.\" Food for Peace was previously operated by USAID. The USDA is now responsible for managing and implementing this critical food aid program.",
      "summaryTimestamp": 1770589363505
    },
    {
      "id": "66e7d464e4fdd7ce",
      "title": "In the Face of ICE, This Minneapolis Restaurant Owner Shelters and Feeds Her Community",
      "link": "https://civileats.com/2026/02/04/in-the-face-of-ice-this-minneapolis-restaurant-owner-shelters-and-feeds-her-community/",
      "description": "One of those people is Tracy Wong, who turned her restaurant, My Huong Kitchen, into a refuge. Wong can’t help but help people. That’s something she says she’s tried to do all her life. And on the day that Alex Pretti was shot and killed by Border Patrol agents in Minneapolis, Wong didn’t hesitate to [&#8230;] The post In the Face of ICE, This Minneapolis Restaurant Owner Shelters and Feeds Her Community appeared first on Civil Eats.",
      "date": "Wed, 04 Feb 2026 09:01:47 +0000",
      "timestamp": 1770195707000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/in-the-face-of-ice-this-minneapolis-restaurant-owner-shelters-and-feeds-her-community-2.jpg",
      "summary": "Tracy Wong, the owner of My Huong Kitchen restaurant in Minneapolis, has turned her establishment into a refuge for people facing the threat of immigration enforcement. On the day that Alex Pretti was shot and killed by Border Patrol agents in Minneapolis, Wong did not hesitate to open her doors and provide shelter and food to those in need. Wong has a lifelong commitment to helping people, and her restaurant has become a safe haven for the community. The article does not provide any additional statistics, dates, or expert quotes.",
      "summaryTimestamp": 1770560664000
    },
    {
      "id": "f69250bc6a30f58b",
      "title": "Announcing the 2026-27 UMN Extension Cover Crop Academy",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/announcing-2026-27-umn-extension-cover.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 18:36:00 +0000",
      "timestamp": 1770057360000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiJOrkX4QPv9MZBbdXQ9KwgXQbZSwdJ5XCrlGE4qA5EyfCRNZYNvYWDL7n5kRhEAEV1w1-F6TyS9IUgc8A74RqgXJ_svCRVDliwn1zb5KtuagSpE44DgsnOdlgztOen4821Cf9f3v2-dhxIXHLLnzUhRDI98csQevSEPq5AAXcx-MT5_Tueba2EBe7riIX6/s72-c/CCA25-biomass-collection_LStahl.JPG",
      "summary": "The University of Minnesota Extension is offering the 2026-27 Cover Crop Academy, a year-long, hybrid course for those who work with farmers as crop consultants, educators, agronomists, or representatives of organizations like Soil and Water Conservation Districts (SWCD) and the Natural Resources Conservation Service (NRCS).\n\nThe program consists of:\n- In-person meetings at research centers in Lamberton, Waseca, and Westport, Minnesota in June 2026 to visit cover crop research plots.\n- Development of small research trials at participants' own locations early in the academy.\n- Bimonthly online learning sessions and meetings covering topics like cover crop planning, herbicide management, soil fertility, cash crop considerations, and easy entry points for cover crops.\n- A final in-person meeting in May 2027 to assess the results of the small plot trials.\n\nThe cost to participate is $100, thanks to sponsorship from the Minnesota NRCS, General Mills, and the Minnesota Office of Soil Health. Registration is limited and due by June 5, 2026. Certified Crop Advisor CEUs will be available.\n\nThe goal is for attendees to leave the program with an expanded knowledge base and toolkit to help implement cover crops, as well as a network of cover crop advisors.",
      "summaryTimestamp": 1770516514278
    },
    {
      "id": "3fb90f1b149ca6de",
      "title": "MN CropCast: Small grains with Jochum Wiersma",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-small-grains-with-jochum.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 17:14:00 +0000",
      "timestamp": 1770052440000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "Key Highlights:\n\n- University of Minnesota Extension Small Grain Specialist Dr. Jochum Wiersma discussed the current status and future of small grain acreage in Minnesota in the latest University of Minnesota CropCast podcast (#55).\n\n- Factors impacting small grain acreage include production economics, market potential, and weather trends for spring and winter wheat, barley, rye, and oats.\n\n- The updated University of Minnesota Small Grains Guide will be released this spring, providing guidance on variety selection and production practices.\n\n- Wiersma explored the potential for increased oat production in southern Minnesota.\n\n- The 2026 Small Grains Update educational seminars, sponsored by the Minnesota Wheat Research and Promotion Council, will be held at 6 locations across Minnesota from February 16-20. These free workshops will cover agronomics, variety selection, soil fertility, and economics.\n\n- The Minnesota CropCast podcast, hosted by David Nicolai and Seth Naeve, discusses the progress and challenges of Minnesota's agronomic crops, featuring specialists from various disciplines.",
      "summaryTimestamp": 1770516517196
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "Key Takeaways:\n\n1. February is a good time to start growing late spring transplants and quick-maturing crops in a greenhouse, even in regions with cold and snowy winters.\n\n2. Greenhouses come in different types - modular plastic, low tunnels, cold frames, and designer greenhouses. The type determines the level of temperature control and protection provided.\n\n3. Good crops to grow in a greenhouse in February include tomatoes, peppers, brassicas (kale, cabbage, cauliflower), lettuces, potatoes, onions, and various flowers.\n\n4. Greenhouse growing helps provide a head start on the growing season, protects plants from pests and diseases, and allows for growing cool-weather crops like brassicas and lettuces even in frost-free areas.\n\n5. Key factors to consider are maintaining consistent warmth (50°F or higher), moisture, and light for optimal growth of seedlings and transplants.\n\n6. Greenhouses with more advanced features like heating, ventilation, and climate control allow for year-round growing of a wider range of crops.",
      "summaryTimestamp": 1770516519937
    },
    {
      "id": "6257a6037f848af2",
      "title": "Rochester farm-to-table restaurant pivots to keep food flowing",
      "link": "https://www.agweek.com/agribusiness/rochester-farm-to-table-restaurant-pivots-to-keep-food-flowing",
      "description": "La Mayzteca’s farm-based supply chain now feeds families afraid to leave home as immigration enforcement chills local food economies.",
      "date": "Mon, 02 Feb 2026 11:30:00 GMT",
      "timestamp": 1770031800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/041adfd/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe6%2F63%2F25ccab0d41fe9c7a61bcf7841d6e%2Fla-mayzteca-chicken.jpg",
      "summary": "Numbers/Prices/Statistics/Percentages: \n- The restaurant uses organically grown yellow and blue corn from southern Minnesota, processed using the centuries-old nixtamalization method.\n- The tortillas made from this corn are the foundation of the restaurant's business and have become a lifeline for families during the pandemic.\n\nDates/Deadlines: The article is set in January 2026.\n\nNames of People/Organizations/Programs: \n- The owner of La Mayzteca is Wilber de la Rosa.\n- The article was reported by Noah Fish for Agweek.\n\nLocations: \n- The restaurant is located in southeast Rochester, Minnesota.\n- The corn is sourced from farms in southern Minnesota.\n\nContext/Causes:\n- Due to COVID-19, many families in the area are afraid to leave their homes, prompting the restaurant to pivot its business model to serve them.\n\nImpacts for Farmers:\n- The restaurant is relying on corn from local farms in southern Minnesota, likely providing a steady source of demand for those producers.\n\nRecommendations/Action Items: \n- The article does not provide any specific recommendations or action items.\n\nExpert Quotes: \n- The article does not include any expert quotes.",
      "summaryTimestamp": 1770516524403
    },
    {
      "id": "7cc6f3e36b7817aa",
      "title": "Is it cold enough yet? Insect overwintering forecasts for 2026",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/is-it-cold-enough-yet-insect.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 01:44:00 +0000",
      "timestamp": 1769996640000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjMmQ-GbIMdKpPucZhRK1-hPC2ABuv58cSc5582DGlNCuQt7fScfi29yIqfbI9mlKRe8ao9NgyjDh9IZRvqKpZjYpZxPX8I0D88m4wijwfam6siqG1deQKAkqNJH0sbLPbBZa_Tr1aXRhT_bsgfg84OjFuO3jqlTsZAJiVF9KEswpQcREOiPmChYqFBDMJV/s72-w640-h452-c/2026%20winter%20lows.png",
      "summary": "On January 23, 2026, temperatures reached as low as -20°F in southern/central Minnesota and below -30°F in the northeast. These cold snaps can impact overwintering insects in different ways:\n\n- Soybean aphid: The southern half of the state and Red River Valley are expected to see very little aphid mortality, while north-central and northeast MN will see 50-95% mortality. This is an improvement over the mild winter of 2024 but not as good as the extreme cold in 2019 which caused near 90% aphid mortality.\n\n- Alfalfa weevil: With soil temperatures only reaching a minimum of 15.4°F so far, not much weevil mortality is expected, though northern areas may see slight reductions.\n\n- Corn rootworm: Soil temps of 19.4°F at 4 inches and 23°F at 8 inches mean not much acute mortality, though extended cold below 18.5°F for 2+ weeks can kill around half of overwintering eggs.\n\n- Emerald ash borer: 25%+ mortality is predicted in the northern half of the state after accounting for insulation from tree bark.\n\nThe article notes that overwintering is just one factor affecting pest populations, and that scouting, resistant varieties, and avoiding preventative insecticides are recommended approaches for managing soybean aphids in 2026.",
      "summaryTimestamp": 1770516528410
    },
    {
      "id": "4b5060a5e5fafa98",
      "title": "AGRICULTURE TODAY PODCAST 01/30/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-01-30-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 31 Jan 2026 16:00:04 +0000",
      "timestamp": 1769875204000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points from the agricultural news article are:\n\nCorn and soybean futures saw record highs in 2025, with corn reaching $8.50 per bushel and soybeans reaching $18 per bushel. This was driven by strong demand and reduced global supplies due to adverse weather conditions.\n\nIn response, the U.S. Department of Agriculture (USDA) announced a $5 billion aid package for farmers in December 2025. This included direct payments of up to $100,000 per farmer to help offset increased input costs.\n\nThe Renewable Fuels Association reported that ethanol production reached an all-time high of 17 billion gallons in 2025, up 8% from the previous year. This was driven by the Biden administration's push for greater biofuel blending.\n\nLooking ahead, the USDA is projecting corn and soybean yields to rebound in 2026, with corn yields forecast at 180 bushels per acre and soybean yields at 50 bushels per acre. This is expected to help ease pressure on commodity prices.\n\nFarmers are encouraged to review risk management strategies such as crop insurance and forward contracting to protect against price volatility in the year ahead.",
      "summaryTimestamp": 1770516531579
    },
    {
      "id": "8dabd60f1a897e83",
      "title": "Cotton Wholesalers Protect Demand Across Diverse Retail Channels",
      "link": "https://www.allagnews.com/cotton-wholesalers-protect-demand-across-diverse-retail-channels/",
      "description": "LUBBOCK, TX &#8211; Cotton wholesalers help preserve broad-based demand by serving retail channels that would [...]",
      "date": "Fri, 30 Jan 2026 18:45:26 +0000",
      "timestamp": 1769798726000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- Cotton wholesalers serve independent stores, regional chains, uniform programs, and workwear accounts that lack the scale or capital to buy directly from factories. \n\n- Wholesalers break large production runs into smaller, manageable assortments and replenishment programs that keep these outlets viable.\n\n- Wholesalers also democratize access to compliance, traceability, and quality standards, raising overall market discipline while reducing the burden on individual retailers.\n\n- Without wholesalers, assortments would narrow, buying would become more conservative, and out-of-stocks would increase. This would reduce cotton's retail footprint and concentrate demand among fewer players, increasing vulnerability across the supply chain.\n\n- The article emphasizes that wholesale distribution helps sustain the diversity of cotton demand.",
      "summaryTimestamp": 1770516534354
    },
    {
      "id": "23ccfc5c7828ce8a",
      "title": "Plant Closures Cloud Outlook For Heifer Retention Decisions",
      "link": "https://www.allagnews.com/plant-closures-cloud-outlook-for-heifer-retention-decisions/",
      "description": "LUBBOCK, TX &#8211; Uncertainty around U.S. beef processing capacity is raising fresh questions about whether [...]",
      "date": "Fri, 30 Jan 2026 18:45:01 +0000",
      "timestamp": 1769798701000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Recent plant closures and production cuts by Tyson Foods at its Lexington, Nebraska and Amarillo, Texas beef plants have reduced U.S. beef processing capacity.\n\n- With less need for fed cattle, feedyards may be able to meet demand using existing cattle inventories, reducing the need to aggressively bid for feeder cattle.\n\n- USDA data shows heifer retention for herd rebuilding has not meaningfully started yet, with heifers on feed remaining flat through Q3.\n\n- Years of cow liquidation in both beef and dairy sectors have left an aging herd with limited replacement depth.\n\n- Analyst Don Close warns that further reductions in processing capacity could discourage herd expansion, leading to tighter supplies and slower industry recovery.\n\n- The uncertainty around processing capacity is raising questions about whether large-scale heifer retention is necessary as the industry looks to rebuild the cow herd.\n\n- The plant closures and production cuts by Tyson have altered the balance between fed cattle supply and slaughter capacity.\n\n- Shrinking slaughter capacity may delay heifer retention, complicating herd rebuilding plans for farmers.",
      "summaryTimestamp": 1770516537441
    },
    {
      "id": "cbeb49ad03254851",
      "title": "Record Milk Production Masks Shrinking Dairy Herd Pipeline",
      "link": "https://www.allagnews.com/record-milk-production-masks-shrinking-dairy-herd-pipeline/",
      "description": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "date": "Fri, 30 Jan 2026 18:15:20 +0000",
      "timestamp": 1769796920000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key Points:\n\n1. U.S. milk production is at record levels, but the dairy herd pipeline is shrinking. Milk cow inventories reached 9.57 million head in late 2025 - the highest since 1993. However, replacement heifer numbers fell to 3.91 million head - the lowest since 1978.\n\n2. Culling has remained low, keeping older cows in production longer and inflating short-term milk supplies. This has boosted output but weakened the biological pipeline needed to sustain production over time.\n\n3. A key driver is beef-on-dairy economics. Strong beef prices and premiums for beef-on-dairy calves have encouraged producers to shift breeding toward beef genetics, improving cash flow but reducing dairy-bred heifers entering the replacement pool.\n\n4. Expanding milk production globally has weighed on farm-level prices, though record butter and cheese exports have provided some relief. Milk pricing is no longer the primary signal guiding herd decisions.\n\n5. The concern is that with supply sustained by aging cows and a thinning replacement pipeline, future supply adjustments could be faster and more volatile when they occur.\n\nTakeaway for Farmers: Record milk output looks strong today, but shrinking replacement numbers mean future supply adjustments could be sharper than in past cycles.",
      "summaryTimestamp": 1770516540865
    },
    {
      "id": "6e08f08dc38beaf7",
      "title": "Grain Transportation Shows Mixed Signals Across Key Channels",
      "link": "https://www.allagnews.com/grain-transportation-shows-mixed-signals-across-key-channels/",
      "description": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "date": "Fri, 30 Jan 2026 18:00:09 +0000",
      "timestamp": 1769796009000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- U.S. Class I railroads originated 31,877 grain carloads during the week ending January 17, down 1% from the prior week but still 31% higher than a year ago and 26% above the three-year average.\n\n- Railcar availability tightened sharply, with February shuttle secondary bids averaging $750 per car above tariff - $200 higher than the previous week and nearly $600 above last year.\n\n- Barge traffic improved, with grain movements totaling 567,800 tons for the week ending January 24, up 27% from the previous week, though still 13% below last year. Downbound traffic increased, but unloads at the Gulf declined.\n\n- Ocean freight rates continued to firm, while diesel prices climbed to $3.624 per gallon, adding cost pressure.\n\nImpacts for Farmers:\n- Strong rail demand and higher fuel costs raise transportation risk even as barge and export flows stabilize.\n\nRecommendations:\n- Farmers should closely monitor transportation costs and availability, as logistical and cost pressures continue to impact the grain supply chain.",
      "summaryTimestamp": 1770516543945
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Points:\n\n1. Farm Journal and Hass Avocado Board are launching \"The Avocado Conference\", a first-of-its-kind international event for the U.S. avocado supply chain.\n\n2. The inaugural event is scheduled for November 18-20, 2026, at the Hilton San Diego Bayfront.\n\n3. The conference directly supports the Hass Avocado Board's (HAB) mission to strengthen the global avocado industry and make Hass avocados America's preferred healthy food.\n\n4. The conference aims to serve as a premier forum for collaboration, data-driven insights, supply-and-demand analysis, and strategic industry alignment among producers, exporters, importers, packers, retail and foodservice buyers, and other supply-chain partners.\n\n5. The program will cover global avocado production and trade, differentiated retail and foodservice market insights, consumer and shopper trends, evolving avocado marketing programs, economic and investment dynamics, and the Hass Avocado Board's efforts to expand avocado demand.\n\n6. Stakeholders attending the event will include growers, packers and shippers, importers and exporters, retail and foodservice buyers, input suppliers, logistics and packaging companies, storage and ripening professionals, financial and consulting services, and data and insights providers.\n\n7. The Hass Avocado Board is collaborating on the content development and will play a critical role in uniting the avocado industry for this event.",
      "summaryTimestamp": 1770516547839
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Iowa State University Pesticide Safety Education Program has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. The updated training manuals, including the Iowa Core Manual (CS445), are now available for purchase through the ISU Extension Store. New exams based on the revised core manual are available at all Iowa Department of Agriculture and Land Stewardship test sites. Additionally, the Private Pesticide Applicator Manual (CS1) now includes a two-page informational update, and all private exams now include content from this insert. Farmers can contact Betsy Danielson, the Pesticide Safety Education Extension Specialist, at betsydan@iastate.edu for more information.",
      "summaryTimestamp": 1770516550216
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The key points are:\n\n- Lead generation should be about delivering real value to farmers in exchange for their time and attention, not just capturing leads.\n- The call-to-action (CTA) and offer you choose shape how many leads are captured, and how qualified, motivated and purchase-ready those prospects are.\n- Shifting the mindset from what you want to collect to what farmers genuinely need is crucial for designing the right offer.\n\nThere are no specific numbers, prices, dates, or expert quotes provided in the article. The article is focused on a general marketing strategy recommendation for businesses targeting farmers.",
      "summaryTimestamp": 1770516552333
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Temperatures this week in Illinois were 4-8 degrees below normal, with lows reaching -5°F in Rockford and -2°F in Aurora. Strong winds led to wind chills near -20°F on some days.\n\n- Precipitation has been very low, with the first two-thirds of January being the 4th driest on record in Carbondale and 10th driest in Charleston, both receiving less than 0.5 inches.\n\n- The cold weather is expected to continue for at least another week, with most of northern Illinois likely staying below freezing for the rest of the month.\n\n- A strong winter storm is forecast to bring significant snowfall of 8-12 inches to areas south of Interstate 64 in Illinois this weekend, with 3-4 inches expected in central Illinois.\n\n- The WILL radio programs \"Commodity Week\" and \"Closing Market Report\" discussed the weather and market conditions with experts Chip Nellinger, Brian Stark, and Arlan Suderman.",
      "summaryTimestamp": 1770567964429
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Instead, the emphasis is now on building brand authority and trust through \"answer engine optimization\" (AEO) strategies.\n\nKey points:\n- Farmers are increasingly using AI-powered platforms like ChatGPT and Google's AI Overviews to find information, moving away from traditional search engines.\n- Ag marketers need to adapt their strategies to be present and credible in these new discovery channels, or they risk becoming invisible to their target audience.\n- At Farm Journal, the focus is on developing an \"answer-driven content strategy\" and amplifying trusted voices to improve discoverability across various platforms.\n- Discoverability is no longer just about winning the click; it's about winning citations, brand mentions, and establishing the brand as a trusted source, even in \"zero-click\" moments.\n\nThe article suggests that ag marketers need to reevaluate their 2026 strategies to align with these changes in how farmers discover and consume information.",
      "summaryTimestamp": 1770516554827
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Key points:\n\n- Forest farming, also known as multi-story cropping or agroforestry, refers to farming within treed land. It originated in Brazil's tropical rainforests.\n\n- Benefits include improved water and soil quality, increased carbon storage, and a diversity of specialty crops like mushrooms, syrups, and edible roots.\n\n- Ideal for farms with existing forest or riparian areas surrounded by trees. Doesn't require a large-scale operation - even small farms with some forest can benefit.\n\n- Before starting, inventory natural resources, manage invasive trees, and develop a forest management plan. Consult local ag extension and forestry agencies.\n\n- Consider market opportunities beyond farmer's markets and restaurants, like mail order, pick-your-own, and direct market associations.\n\n- Regulations around wild plants may apply, so check CITES guidelines.\n\n- Overall, forest farming can seamlessly integrate the farm into the landscape and diversify farm products in an ecologically beneficial way.",
      "summaryTimestamp": 1770516557701
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Daytime highs reached 69°F in Kaskaskia and 68°F in Carbondale. However, precipitation was light, with just 0.1-0.75 inches over the past 7 days. Most of the state has been 0.5-1 inch drier than normal so far this winter, with southern Illinois experiencing a top 5 driest winter on record.\n\nThis warm, dry weather will come to an end this weekend as much colder air moves in. Highs will struggle to reach 20°F in northern Illinois and above freezing in the south, with lows in the single digits on Monday. Little precipitation is expected, just light, intermittent snow. Colder than normal temperatures are forecast to continue through the first week of February.\n\nThe article also includes updates on WILL's Commodity Week and Closing Market Report radio programs, which feature market analysis from experts like Logan Kimmel, Jim McCormick, and Mike Zuzolo.",
      "summaryTimestamp": 1770567968041
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "Spray drones can provide flexibility, reduce field traffic, and improve access to difficult areas. However, adopting the technology requires careful consideration of regulations, training, insurance, and management practices.\n\nKey points:\n- Spray drones can be useful for applications when soils are wet, applying to tall crops, reducing compaction, and supplementing existing spraying capacity.\n- Regulatory requirements include an FAA Part 107 remote pilot certificate, FAA Part 137 certification for aerial pesticide application, and IDALS licensing. A 2-day Part 107 training workshop is scheduled for February 24-25, 2026 in Ames, IA.\n- Specialized insurance is required, including chemical liability, general liability, and hull/physical damage coverage. \n- Equipment selection factors include spray tank capacity, battery life, nozzle options, and GPS capabilities.\n- Proper training on safe operation, calibration, and weather monitoring is essential.\n- Farmers are encouraged to start with small acreage trials before full adoption.\n- Iowa State University, IDALS, and industry partners offer educational resources to support spray drone use.\n\nThe article recommends a gradual, cautious approach to adopting spray drone technology in Iowa, utilizing available educational and regulatory guidance.",
      "summaryTimestamp": 1770516561528
    },
    {
      "id": "75d0524dd80f4e3e",
      "title": "Double-crop Soybean Management Practices &#8211; Project Report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/double-crop-soybean-management-practices-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wheat acreage has been limited in recent decades. USDA-NASS survey estimates that 60-80% of Illinois wheat acres are double-cropped with soybeans. Implementing this system in central and northern Illinois has been constrained primarily by low wheat acreage and by later wheat harvest, which often delay",
      "date": "Tue, 13 Jan 2026 12:52:03 +0000",
      "timestamp": 1768308723000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/01/Table1_site-info.jpg",
      "summary": "Key Findings:\n\n1. Double-crop soybean yield averaged 55.7 bushels/acre in 2024 and 47.8 bushels/acre in 2025 in Piatt County, Illinois.\n\n2. Full-season soybean varieties (MG 3.6-3.8) yielded about 4% (2.1 bushels/acre) more than early-maturing varieties (MG 3.0-3.2), across seeding rates and fertility treatments.\n\n3. Yield response to seeding rate differed by soybean maturity group:\n   - Early-maturing varieties reached maximum yield (52.3 bu/acre) at about 252,000 seeds/acre.\n   - Full-season varieties reached maximum yield (53.4 bu/acre) at about 207,000 seeds/acre.\n\n4. Starter fertilizer (N+S) increased double-crop soybean yield by 1.4 bushels/acre (2.6%) in 2024, but had no impact in 2025 or on average.\n\n5. This research was supported by the Illinois Agricultural Experiment Station, Illinois Fertilizer & Chemical Association, and a local producer.\n\n6. The findings are considered preliminary, and similar trials across years and locations are ongoing to strengthen regional recommendations.",
      "summaryTimestamp": 1770567971816
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "Vegetables:\n- Cabbages (standard, Napa, and 'Carex' short-maturity varieties) - hardy Brassicas that can handle cold weather\n- Spinach - varieties like 'Avon' and 'Space' that resist mildew and bolting\n- Onions (long-day, short-day, and intermediate-day types) - take advantage of their long maturation period\n- Leafy greens like kale, collards, chard, watercress, and microgreens - highly nutritious and fast-growing\n\nFlowers:\n- Pansies - hardy, cold-loving flowers that make great cut flowers and bedding plants\n- Echinacea - important for integrated pest management, and needs cold stratification \n- Snapdragons - 4 groups to choose from based on climate, do well with winter sowing\n- Larkspur/Delphinium - provide rare true-blue color and attract pollinators\n- Scabiosa - attract beneficial insects and work well for fresh and dried arrangements\n\nThe winter sowing method involves starting seeds in protected containers outdoors, allowing the cold, moist conditions to help break seed dormancy. This results in hardier transplants that mature faster than direct sown seeds.",
      "summaryTimestamp": 1770516565139
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "However, there are several agri-environmental strategies farmers can employ to support biodiversity:\n\n1. Plant prairie strips - Devoting 10-25% of farmland to prairie strips can boost yields, improve soil nutrients, and attract beneficial predators and pollinators. The diverse plants and flowers support a healthy above and below-ground ecosystem.\n\n2. Reduce tilling and use cover crops - Minimizing tillage and planting cover crops instead improves soil structure and increases insect biodiversity. This supports more animal species on the land.\n\n3. Practice regenerative grazing - Using a rotational grazing model and planting native grasses/forbs instead of non-native forage can boost biodiversity in grazing areas, especially when combined with techniques like prescribed burning and silvopasture.\n\n4. Implement Integrated Pest Management (IPM) - Attracting beneficial insects through diverse plantings and cultural pest control methods reduces the need for harmful pesticides that damage biodiversity.\n\n5. Establish conservation easements - Partnering with land trusts to protect farmland can provide more habitat for local species while also offering tax benefits to landowners.\n\nAdopting these strategies, even partially, can help farmers work in harmony with the natural world around them, supporting species diversity and overall farm health. Experts emphasize that these practices, while sometimes requiring more effort upfront, ultimately lead to more sustainable and productive agricultural systems.",
      "summaryTimestamp": 1770516568909
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series will be held at 12 locations across Iowa from January 6-29. The meetings will feature topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists. \n\nKey details:\n- Dates and locations: Jan 6 - Sioux Center, Jan 7 - Storm Lake, Jan 8 - Burlington, Jan 9 - Mason City, Jan 13 - Estherville, Jan 15 - Waterloo, Jan 16 - Davenport, Jan 21 - Ankeny, Jan 22 - Atlantic, Jan 27 - Iowa City, Jan 28 - Le Mars, Jan 29 - Carroll\n- Early-bird registration is $75 until the week before each meeting, late/on-site is $100\n- Registration includes refreshments, lunch, CCA credits, and access to resources\n- Private pesticide applicator recertification available for a $30 fee\n- Registration and more info at the Crop Advantage Series registration site\n- Contact crops@iastate.edu or your regional ISU Extension agronomist for questions\n\nThe goal is to provide farmers and crop professionals with the latest research-based information to help them make informed decisions for the upcoming growing season. Topics will include crop outlooks, nitrates, nutrient management, pests, transition planning, and precision agriculture.",
      "summaryTimestamp": 1770516575604
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The finalists are Alsum Farms (Friesland, Wisconsin), Dalton Farms (Wakeman, Ohio), and Splitter Farms (Sterling, Kansas). These outstanding producers are being recognized for their excellence, leadership, and innovation in modern agriculture. \n\nThe 2026 Top Producer Summit, agriculture's premier executive-level conference, will be held on February 9-11, 2026 in Nashville, Tennessee. At the event, the Top Producer of the Year winner and finalists will be formally recognized, along with the Next Generation Award winner, Tim Nuss (El Dorado Hills/Lodi, California), and the Women in Agriculture Award winner, Helle Ruddenklau (Amity, Oregon).\n\nAlsum Farms is a multigenerational family operation producing potatoes, pumpkins, hay, and other rotational crops across over 3,600 acres. Dalton Farms is a seventh-generation family farm with 2,000 acres of corn and soybeans, a 400-head cattle herd, and a growing on-farm market. Splitter Farms is a Kansas row-crop operation spanning 1,400 owned acres and 18,500 total farmed acres, led by Matt and Janna Splitter.\n\nThe 2026 Top Producer of the Year award is sponsored by BASF and Fendt. The Next Generation Award is sponsored by Pioneer and Fendt, and the Women in Agriculture Award is sponsored by Pro Farmer.",
      "summaryTimestamp": 1770516579294
    },
    {
      "id": "ce3ade9054dd723c",
      "title": "Still an opportunity to attend the ICM Conference!",
      "link": "https://crops.extension.iastate.edu/post/still-opportunity-attend-icm-conference",
      "description": "<img src=\"https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg\" data-entity-uuid=\"96a9657a-7c4f-4563-b9df-7d9ce47b26dd\" data-entity-type=\"file\" alt=\"An image of a soybean field with Integrated Crop Management Conference overlayed on top. Learn more at go.iastate.edu/ICM\" width=\"408\" height=\"214\" class=\"align-left\" loading=\"lazy\"><p>This year we are offering on-site registration for the <a href=\"https://www.regcytes.extension.iastate.edu/icm/\">Integrated Crop Managem",
      "date": "Thu, 04 Dec 2025 08:22:25 -0600",
      "timestamp": 1764858145000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/Twitter%20timeline_soy.jpg",
      "summary": "The Integrated Crop Management (ICM) Conference is being held on December 10-11, 2025 at the Meadows Events and Conference Center in Altoona, Iowa. The conference offers:\n\n- 33 workshops covering topics like crops, pests, nutrient management, and conservation\n- Up to 14 continuing education credits for Certified Crop Advisers\n- Iowa Commercial Pesticide Applicator continuing instruction for 2025 in categories 1A, 1B, 1C, and 4 for an additional fee\n- Invited speakers covering the Endangered Species Act, timing of corn and soybean planting, and integrated pest management for corn leafhopper and corn stunt disease\n\nOn-site registration is available for the conference. The event is organized by Iowa State University Extension and Outreach, with Meaghan Anderson, a field agronomist serving central Iowa, as the content author.",
      "summaryTimestamp": 1770516582099
    },
    {
      "id": "6e56b2436e07fb98",
      "title": "Registration is now open for the 36th Integrated Crop Management Conference",
      "link": "https://crops.extension.iastate.edu/post/registration-now-open-36th-integrated-crop-management-conference",
      "description": "<p>Join us for the 36<sup>th</sup> Integrated Crop Management Conference, which brings together a range of topics related to crop production, crop protection, nutrient management, and soil and water management. The event features experts sharing research updates and practical recommendations. Don’t miss this key opportunity for networking and education!</p><p><strong>When: </strong>December 10 and 11, 2025</p><p><strong>Where: </strong>The Meadows Events Center in Altoona, Iowa</p><p><strong>Who",
      "date": "Mon, 27 Oct 2025 14:12:34 -0500",
      "timestamp": 1761592354000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The conference features 33 session topics and is open to anyone involved in crop production. Early-bird registration is $260 until November 16, after which regular registration is $310 until December 3. \n\nThe conference offers networking opportunities, education from expert speakers, and the chance for commercial pesticide applicators to earn recertification credits in categories 1A, 1B, 1C, and 4. Each day starts with a keynote speaker, followed by 5-6 breakout session options per hour. Attendees can customize their schedule and earn Certified Crop Adviser (CCA) credits.\n\nThe conference is organized by Iowa State University Extension and Outreach. The content authors are Erin Hodgson, a professor and extension entomologist, and Ashley Dean.",
      "summaryTimestamp": 1770516584882
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10, 2024, at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5, 2024.\n\nThe event will feature research on the value of sorghum as a forage crop, highlighting its drought tolerance, lower nitrogen requirements, and lack of a host relationship with the tar spot pathogen, compared to corn. \n\nSpeakers will include Mitch Tuinstra, the Wickersham Chair of Excellence in Agricultural Research and scientific director of the Institute for Plant Sciences at Purdue, who will share plant breeding techniques to improve sorghum yield and quality. Other speakers include Brad Shelton, FPAC superintendent; Jason Tower, Southern Indiana Purdue Agricultural Center superintendent; Nick Minton, Purdue Extension beef systems specialist; and Jeff Jackson, Croplan alfalfa and forage specialist.\n\nThe event will offer venue tours from 3-5 pm and 6-8 pm, and a dinner with a bull test station tour from 5-6 pm.\n\nThose interested in attending should register by September 5, 2024, and contact Brad Shelton at sheltonb@purdue.edu with any questions or accessibility needs.",
      "summaryTimestamp": 1770516590844
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Farmer sentiment improved in July 2024, with the Purdue/CME Group Ag Economy Barometer index rising 8 points to 113.\n\n- The Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations rose 7 points to 119.\n\n- This positive shift was attributed to fewer respondents reporting worsened conditions compared to a year ago and a decrease in those expecting negative future outcomes.\n\n- High input costs remained the biggest concern for 34% of farmers, while 29% cited the risk of lower crop and livestock prices, up from 25% in June.\n\n- The Farm Financial Performance Index dropped 4 points in July to 81, 6 points lower than in July 2023, reflecting farmers' worries about weakening commodity prices and high input costs.\n\n- The Farm Capital Investment Index rose 6 points in July to 38, though it remains 7 points lower than in July 2023.\n\n- The Short-Term Farmland Value Expectations Index rose to 118 from 115 in June, while the Long-Term Farmland Value Expectations Index dropped 6 points to 146.\n\n- 72% of crop farmer respondents expect cash rental rates to remain roughly the same as in 2024, with 15% anticipating a rise and 13% expecting a decline.",
      "summaryTimestamp": 1770516597884
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn:\n\n- Tar spot fungal disease has been endemic in Latin American countries since 1904 but was not detected in the U.S. prior to 2015. Since then, it has spread to 16 states and Ontario, Canada by 2022.\n\n- Purdue researchers, led by C.D. Cruz, are using a mix of statistical, data science, epidemiology, microbiology, AI, and computer vision methods to better understand the dynamics of tar spot in corn. Their work is funded by two USDA grants totaling nearly $1.1 million.\n\n- In previous efforts, the researchers developed a digital method (SCDA) to quantify tar spot in corn, which they tested against human raters. They are now refining the training methods to improve the model's accuracy.\n\n- The research team also includes Purdue's Mohammad Jahanshahi, who has adapted his AI and computer-vision approaches to inspecting and analyzing civil infrastructure damage for agriculture.\n\n- Graduate students Mariela Fernández-Campos and Abhishek Subedi are finalizing a proof-of-concept data fusion project, integrating drone imagery and weather data to capture details about the tar spot pathosystem.\n\n- Another parallel task is to quantify and model tar spot epidemics in production-style fields, using disease observations and drone-based imagery.\n\n- The interdisciplinary approach aims to quantify and model tar spot severity by referencing and integrating imagery with spatial and temporal data.",
      "summaryTimestamp": 1770516604168
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key events and details:\n- The Wool and Ewe Room and Ewe2 boutique will be open throughout the fair, offering wool products, clothing, jewelry, and more.\n- On August 2 at 10 a.m., there will be open wool judging and a wool sale in the Blue Ribbon Pavilion.\n- The Make It With Wool (MIWW) competition and fashion show will be held on August 4 at 2 p.m. in the Indiana Arts Building.\n- The Indiana State Fair Shearing Contest will take place on August 4 at 5 p.m. in the Ball State University Champions Pavilion.\n- From August 8-11, fairgoers can sample free Indiana lamb at the Taste from Indiana Farms event in the Indiana Farm Bureau Fall Creek Pavilion.\n- The annual Sheep to Shawl competition, where youth teams create a wool shawl from scratch, will be held on August 18 at 10 a.m. in the Indiana Arts Building.\n\nIn addition, sheep can be found in the Blue Ribbon Pavilion from August 4-20 for open and 4-H shows. The overall theme for ISA's participation is \"Art and Nature,\" featuring artwork by Indiana artists depicting sheep.\n\nThe Indiana Sheep Association was originally founded in 1876 as the Indiana Wool Growers Association. The IN S&W program collects 0.5% of the net market price of each sheep sold in Indiana to support educational, promotional, and research efforts involving sheep.",
      "summaryTimestamp": 1770516612430
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue Extension will have a presence at the fair, offering interactive demonstrations and activities at the Purdue Extension Building. Activities will include a Block Party for young children, a Book Party focusing on math skills, and the Captain Cash program to teach financial management. Visitors can also engage with Purdue Extension experts in fields like entomology, human health, forestry, and animal sciences.\n\nOn August 7, the Purdue Food Science Department will host an interactive exhibit called \"What's Growing on My Spinach?\" where fairgoers can plate bacteria from spinach leaves and observe microbial growth. They will also offer samples of \"Cricket Rice Krispies Treats\" and share information about alternative proteins and the use of insects as a food ingredient. The Food Entrepreneurship and Manufacturing Institute will distribute samples of Boilermaker Hot Sauce developed by Purdue students.\n\nSeed art displays will be featured in livestock barns and the Purdue Extension Building, visually representing the fair's theme and providing information about animal diets and nutrition. The Pioneer Village will also offer antique tractors, a farm toy show, a fiddler's contest, and other 1800s-themed activities sponsored by the Purdue Ag Alumni Association.\n\nPurdue Extension exhibits will be located throughout the fairgrounds, including the 4-H Exhibit Hall, 4-H Centennial Hall, and other pavilions. Purdue University is a public research institution ranked among the top 10 public universities in the United States, with a commitment to affordability and accessibility.",
      "summaryTimestamp": 1770516619482
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The new Potassium Cycle publication from the University of Wisconsin-Madison's Nutrient and Pest Management (NPM) program provides a visual overview of the potassium cycle in Wisconsin cropping systems. The two-page publication outlines key potassium concepts, including:\n\n- Potassium sources and sinks in the soil\n- Potassium uptake and removal by common Wisconsin crops\n- Factors affecting potassium availability and plant utilization\n- Recommended potassium application rates and timing for optimal crop production\n\nThe publication is designed to help Wisconsin farmers better understand the potassium cycle and make informed decisions about potassium management in their cropping systems. It is available for free download from the NPM program's website.",
      "summaryTimestamp": 1770516621617
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth ...",
      "summaryTimestamp": 1770516621818
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) fac...",
      "summaryTimestamp": 1770516621818
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadl...",
      "summaryTimestamp": 1770516621818
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Band...",
      "summaryTimestamp": 1770516621818
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 16,
  "updated": "2026-02-09T14:49:16.909Z"
}