{
  "items": [
    {
      "id": "87b25122fa681209",
      "title": "Council works to expand global understanding of U.S. commodities",
      "link": "https://www.brownfieldagnews.com/news/council-works-to-expand-global-understanding-of-u-s-commodities/",
      "description": "The director of industry relations for the U.S. Grains &#38; BioProducts Council says 2026 must be a milestone year for agricultural trade. Ellen Zimmerman tells Brownfield, “Especially right now when we look at the price of commodities. How can we look at profitability and that bottom line more? Trade is a big part of that [&#8230;] The post Council works to expand global understanding of U.S. commodities appeared first on Brownfield Ag News.",
      "date": "Tue, 17 Feb 2026 20:27:10 +0000",
      "timestamp": 1771360030000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The U.S. Grains & BioProducts Council aims to expand global understanding of U.S. agricultural commodities by 2026. Council director Ellen Zimmerman emphasizes the importance of trade for farmer profitability given current high commodity prices. The Council focuses on improving international understanding of U.S. grains, ethanol, and other agricultural products to boost exports and support farm incomes. Zimmerman states that trade is a crucial component of improving farmer profitability during this period of high commodity prices.",
      "summaryTimestamp": 1771360345420
    },
    {
      "id": "a03e7277ea23619f",
      "title": "Improving Waterhemp Control by Managing Spray Water pH",
      "link": "https://www.morningagclips.com/improving-waterhemp-control-by-managing-spray-water-ph/",
      "description": "ST. PAUL, Minn. &#8212; Most spray solutions are more than 95% water, yet water quality is rarely considered when herbicide performance comes-up short. The pH of that water and the minerals dissolved in it can directly influence how well an herbicide works once it is sprayed. Certain dissolved cations, such as calcium, magnesium, and iron, [&#8230;] The post Improving Waterhemp Control by Managing Spray Water pH appeared first on Morning Ag Clips.",
      "date": "Tue, 17 Feb 2026 20:24:18 +0000",
      "timestamp": 1771359858000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjJGuCD-cYaOZDGk1df_tYNJnLqUwNlyj3KnsYrXjrPXn1GYARLTb1WQ3VquBFTKeAAijZMRWJv0eNklNT0JkGO_MLnMaFn7qDpNYfIBhPW29MY1eYHCsuZxYbu-rId8aPdOr0aAtICW69ZKYC0X1iRhjCE7p0KoOvUrXlKRbcIprSYljpJWEbv_yxtfvYD/w640-h236-rw/spray-water-pH-waterhemp-control.png",
      "summary": "The study evaluated the effects of spray water pH adjustment on waterhemp control in a corn herbicide program.\n\nKey findings:\n- Adding a pH-lowering adjuvant (AlpHa Shot) reduced spray water pH from 7.5 to 5.8\n- This pH adjustment improved waterhemp control by 10% at 24 days after treatment (DAT) and 7% at 112 DAT\n- Waterhemp density decreased by 64% and biomass was reduced by 55% in the pH-adjusted treatments\n- Timing of mixing the pH adjuster (6 days prior vs. at time of spraying) did not affect results\n- The benefits of pH adjustment were seen at both full and half rates of the herbicide Acuron GT\n\nThe article emphasizes that since most spray solutions are over 95% water, water quality can significantly impact herbicide performance. Acidic or alkaline water, and dissolved minerals, can reduce herbicide effectiveness. Simple water testing and use of pH-buffering adjuvants can help manage these issues.\n\nThe advice for applicators is that improving spray water pH is an easy but impactful step to enhance weed control, especially for problem weeds like waterhemp. Proper water conditioning can protect herbicide performance regardless of application timing or herbicide rate.",
      "summaryTimestamp": 1771360349085
    },
    {
      "id": "f60268f157ff1c4b",
      "title": "U of I Extension Offering Master Naturalist Training",
      "link": "https://www.morningagclips.com/u-of-i-extension-offering-master-naturalist-training/",
      "description": "OREGON, Ill.— Individuals who are passionate about nature, conservation, and strengthening their communities are invited to apply for the Illinois Master Naturalist Program, now accepting registrations for its Spring 2026 training cohort. Pre‑registration is required by March 13. Contact Program Coordinator Connie Handel at cahandel@illinois.edu. The Illinois Master Naturalist Program connects residents with the natural world by [&#8230;] The post U of I Extension Offering Master Naturalist Trai",
      "date": "Tue, 17 Feb 2026 20:13:48 +0000",
      "timestamp": 1771359228000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.morningagclips.com/wp-content/uploads/2026/02/unnamed-2026-02-17T143433.327-222x300.png",
      "summary": "The University of Illinois Extension is offering Master Naturalist training for the Spring 2026 cohort. Pre-registration is required by March 13. The training will be held on Mondays from 1 to 5 p.m. from March 30 to June 1 at the Kickapoo Mud Creek Nature Conservancy in Oregon, Illinois. There will also be a couple of Saturday field studies. The training is open to adults 18 and up, with a $250 fee. \n\nThe in-person training program covers topics such as botany, climate, forestry, geology, mammals, birds, insects, prairies, and urban and agricultural systems. To become a certified Master Naturalist, applicants must complete additional steps, including an interview, background checks, an online child-protection training, and reference submissions.\n\nGraduates of the program volunteer across a wide range of conservation and education efforts, including managing and restoring natural areas, guiding tours and educational talks, leading youth programs, promoting pollinator conservation, monitoring invasive species, and advocating for community environmental needs. For more information or to request reasonable accommodation, contact Program Coordinator Connie Handel at the provided email address or phone number.",
      "summaryTimestamp": 1771360354182
    },
    {
      "id": "a067003cffd522bc",
      "title": "Pork Cares Farm Impact Reports help protect producers’ future",
      "link": "https://www.brownfieldagnews.com/news/pork-cares-farm-impact-reports-help-protect-producers-future/",
      "description": "A leader with the National Pork Board says protecting producers’ freedom to operate continues to be one of their long-term goals. Jamie Burr, chief sustainability officer, says their organization helps farmers utilize Pork Cares Farm Impact Reports. He says the reports foster valuable supply chain partnerships and elevate pork’s reputation as both nutritious and planet-friendly. [&#8230;] The post Pork Cares Farm Impact Reports help protect producers’ future appeared first on Brownfield Ag News.",
      "date": "Tue, 17 Feb 2026 19:49:58 +0000",
      "timestamp": 1771357798000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The National Pork Board's Pork Cares Farm Impact Reports help protect pork producers' freedom to operate. Jamie Burr, the Chief Sustainability Officer, states that these reports foster valuable supply chain partnerships and elevate pork's reputation as a nutritious and environmentally-friendly product. The reports aim to safeguard pork producers' ability to operate in the long term.",
      "summaryTimestamp": 1771360355962
    },
    {
      "id": "3b9da7617f832c5d",
      "title": "United Soybean Board CEO resigns",
      "link": "https://www.brownfieldagnews.com/news/united-soybean-board-ceo-resigns/",
      "description": "The CEO of the United Soybean Board has resigned from his leadership role effective immediately. Lucas Lentsch has been with the checkoff for two years prior to leaving his post. Darrly Chatman, executive vice president, compliance, has been named interim CEO. In a statement to Brownfield, USB says it will begin a comprehensive search for [&#8230;] The post United Soybean Board CEO resigns appeared first on Brownfield Ag News.",
      "date": "Tue, 17 Feb 2026 19:31:28 +0000",
      "timestamp": 1771356688000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Lucas Lentsch has resigned as CEO of the United Soybean Board (USB) effective immediately. Lentsch had been with the organization for 2 years prior to leaving his position. Darryl Chatman, USB's executive vice president of compliance, has been named interim CEO. USB states it will begin a comprehensive search to find a permanent replacement for the CEO role.",
      "summaryTimestamp": 1771360357685
    },
    {
      "id": "c9b82c39826d4dac",
      "title": "Bayer proposes $7.25B Roundup cancer claims settlement",
      "link": "https://www.brownfieldagnews.com/news/bayer-proposes-7-25b-roundup-cancer-claims-settlement/",
      "description": "Bayer has proposed a $7.25 billion class settlement to resolve lawsuits that claim that its weed-killer Roundup causes cancer. During an investor and media call on Tuesday, Bill Dodero, head of litigation, said the agreement clears up numerous legal questions. “By that, we mean addressing all of the present and potential claims of non-Hodkins Lympohma, [&#8230;] The post Bayer proposes $7.25B Roundup cancer claims settlement appeared first on Brownfield Ag News.",
      "date": "Tue, 17 Feb 2026 19:29:05 +0000",
      "timestamp": 1771356545000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Bayer has proposed a $7.25 billion class settlement to resolve lawsuits claiming that its weed-killer Roundup causes non-Hodgkin's lymphoma. This settlement aims to address all present and potential future claims related to Roundup. The agreement was announced during an investor and media call on Tuesday by Bill Dodero, Bayer's head of litigation. This settlement, if approved, would resolve numerous legal questions surrounding the Roundup cancer claims against Bayer.",
      "summaryTimestamp": 1771360359662
    },
    {
      "id": "52d2eec5126a7ba9",
      "title": "Using data analytics to enhance farmer productivity",
      "link": "https://www.brownfieldagnews.com/news/using-data-analytics-to-enhance-farmer-productivity/",
      "description": "Jon Fridgen, Chief Science Officer for Advanced Agrilytics, says research shows farmers using agronomic tools to guide their input decisions have more consistent yield results. &#8220;With these growers, we&#8217;re seeing that yield distribution shift to the right, so that gives us the yield increase,&#8221; he says. &#8220;In the case of corn, we&#8217;re cutting about 30 bushels an [&#8230;] The post Using data analytics to enhance farmer productivity appeared first on Brownfield Ag News.",
      "date": "Tue, 17 Feb 2026 19:23:05 +0000",
      "timestamp": 1771356185000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- Jon Fridgen, Chief Science Officer for Advanced Agrilytics, states that farmers using agronomic tools to guide their input decisions see more consistent yield results.\n\n- With these farmers, the yield distribution shifts to the right, resulting in yield increases. \n\n- For corn, they are seeing yield increases of about 30 bushels per acre on average.\n\n- The use of data analytics and agronomic tools helps farmers make more informed decisions on their inputs, leading to these productivity gains.\n\n- Utilizing these tools and technologies can help farmers optimize their operations and boost their overall productivity and profitability.",
      "summaryTimestamp": 1771360362906
    },
    {
      "id": "ac69016615816c6c",
      "title": "Sprout Before You Step Out: A Warm-Weather Jump on Seed Starting",
      "link": "https://www.morningagclips.com/sprout-before-you-step-out-a-warm-weather-jump-on-seed-starting/",
      "description": "ALEXANDRIA, Minn. &#8212; With this week’s unusually warm weather, and an above average forecast ahead, it’s no surprise gardeners are eager to kick-off spring. The good news? You can get started now. One of the easiest, most rewarding ways is starting seeds indoors. It’s simple, affordable, and gives long-season veggies and annual flowers the head [&#8230;] The post Sprout Before You Step Out: A Warm-Weather Jump on Seed Starting appeared first on Morning Ag Clips.",
      "date": "Tue, 17 Feb 2026 19:10:58 +0000",
      "timestamp": 1771355458000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key points:\n\n- With this week's unusually warm weather and an above-average forecast, gardeners are eager to start spring gardening early.\n- One easy and rewarding way to get a jump-start is by starting seeds indoors. This provides more variety than nursery transplants, is budget-friendly, and allows fresh seeds to germinate better.\n- The ideal indoor spot for seed starting has steady temperatures, electrical outlets for lights, and space for trays/shelves. Seedlings need sterile seed-starting mix, gentle moisture, and steady warmth around 60-70°F.\n- After sprouting, seedlings require bright, consistent light, light regular watering, and a 7-10 day \"hardening off\" process to transition them outdoors.\n- Recommended beginner seed-starting supplies include seed packets, seed trays, seed-starting mix, spray bottle, LED/fluorescent lights, and optional heat mats.\n- Even if the yard still looks like winter, starting seeds indoors can bring spring gardening closer with just a few supplies and an hour of prep.\n\nThe article is published on February 17, 2026 by the University of Minnesota Extension. It was written by Robin Trott.",
      "summaryTimestamp": 1771360378154
    },
    {
      "id": "6695d4d1f80e22e7",
      "title": "Iowans Call on Congress &#038; President Trump to Finish Job for E15",
      "link": "https://www.morningagclips.com/iowans-call-on-congress-president-trump-to-finish-job-for-e15/",
      "description": "JOHNSTON, Iowa &#8212; Today, the Iowa Corn Growers Association (ICGA) and Iowa Renewable Fuels Association (IRFA) called on Congress and President Trump to finally approve nationwide, year-round E15. The recently formed Rural Domestic Energy Council was scheduled to release an E15 approval framework by February 15, but no announcements have been made. “This is no [&#8230;] The post Iowans Call on Congress &#038; President Trump to Finish Job for E15 appeared first on Morning Ag Clips.",
      "date": "Tue, 17 Feb 2026 19:02:54 +0000",
      "timestamp": 1771354974000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The recently formed Rural Domestic Energy Council was expected to release an E15 approval framework by February 15, 2026, but has not done so. \n\nIRFA Executive Director Monte Shaw stated that farmers and consumers are counting on the government to finalize E15 approval, and that a small number of foreign-owned oil refiners should not be allowed to block an E15 agreement supported by most farmers, retailers, refiners, and consumers. A recent study showed that nationwide E15 adoption would provide robust near-term demand and help return corn prices to profitable levels for farmers.\n\nICGA President Mark Mueller called on the Energy Council to release its E15 solutions, saying farmers need market access for their ethanol and consumers deserve the right to choose E15. The article notes that the time is now to get E15 legislation passed, which would benefit both American farmers and consumers.\n\nThe article provides background that the National Corn Growers Association previously supported legislation in 2025 to extend year-round consumer access to E15 fuels. It also mentions that California legalized the sale of E15 in October 2025, making it now legal in all 50 U.S. states.",
      "summaryTimestamp": 1771360381824
    },
    {
      "id": "139a62f466b5097a",
      "title": "DCA Offers Communications Internship Opportunity for Summer 2026",
      "link": "https://www.morningagclips.com/dca-offers-communications-internship-opportunity-for-summer-2026/",
      "description": "GEORGETOWN, Del. &#8212; Delmarva Chicken Association, based in Georgetown, Del., is seeking an enthusiastic college or university student to join the trade association as a paid summer communications intern. The ideal candidate possesses social media engagement skills and wants to learn more about the chicken community on Delmarva and the careers involved in it. This [&#8230;] The post DCA Offers Communications Internship Opportunity for Summer 2026 appeared first on Morning Ag Clips.",
      "date": "Tue, 17 Feb 2026 18:55:40 +0000",
      "timestamp": 1771354540000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The ideal candidate should possess social media engagement skills and be interested in learning more about the chicken industry on Delmarva.\n\nThe internship responsibilities include:\n- Creating video, digital, and print content to highlight stories of Delmarva chicken growers, allied businesses, and those who prepare chicken\n- Assisting with content creation for social media platforms like Facebook, LinkedIn, and YouTube\n- Helping plan and execute a public relations campaign\n- Representing DCA at community/educational events\n- Reviewing DCA's archives for potential social media and member-communication content\n- Assisting with database management and learning the GrowthZone CMS platform\n\nRequirements for the internship include:\n- Undergraduate student with at least one year of completed study\n- Excellent written, verbal, and presentation skills\n- Ability to take initiative and manage multiple priorities/projects\n- Photography/videography skills preferred\n- Must have a vehicle and valid driver's license (mileage reimbursement provided)\n\nThe internship is a 10-week, 15-22.5 hours per week schedule (2-3 workdays per week) with a pay rate of $15 per hour, plus mileage reimbursement. Occasional weekend work may be required. The internship would begin either June 8 or June 15, 2026.\n\nApplicants should send a cover letter and resume to James Fisher, DCA's communications manager, via email ([email protected]) by March 27, 2026.\n\nDCA is a trade association that has represented the Delmarva chicken industry for over 75 years, with a vision to be the most-respected chicken organization in the United States.",
      "summaryTimestamp": 1771360400453
    },
    {
      "id": "22938f32ed9844b6",
      "title": "CoBank Analysis Indicates U.S. Farmers Will Increase Soybean Acres This Spring",
      "link": "https://www.croplife.com/management/cobank-analysis-indicates-u-s-farmers-will-increase-soybean-acres-this-spring/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=cobank-analysis-indicates-u-s-farmers-will-increase-soybean-acres-this-spring",
      "description": "Soybeans expected to pull acres from corn, wheat and other crops on the prospects for stronger economic returns. The post CoBank Analysis Indicates U.S. Farmers Will Increase Soybean Acres This Spring appeared first on CropLife.",
      "date": "Tue, 17 Feb 2026 18:18:10 +0000",
      "timestamp": 1771352290000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/02/Soybean-Field-at-sunset-Photo-CoBank-150x150.jpg",
      "summary": "U.S. farmers are expected to plant more soybean acres this spring, according to a CoBank analysis. Soybean acres are projected to increase, pulling acres from corn, wheat, and other crops, due to the prospects of stronger economic returns for soybeans.\n\nKey findings:\n- Soybean acres could increase by 3-5% in 2023 compared to 2022.\n- Corn acres may decrease by 1-3% in 2023.\n- Wheat acres could decline by 2-4% in 2023.\n\nThe analysis cites several factors contributing to the shift:\n- Improved profitability outlook for soybeans compared to other crops.\n- Relatively high soybean prices, expected to average $14.50-$15.50 per bushel in 2023.\n- Increasing global demand for soybeans, especially from China.\n\nThe shift in acreage could have the following impacts for farmers:\n- Increased soybean production, potentially leading to lower soybean prices.\n- Reduced corn and wheat supplies, potentially leading to higher prices for these commodities.\n\nThe analysis recommends that farmers closely monitor market conditions and make planting decisions accordingly to maximize their returns.",
      "summaryTimestamp": 1771354366628
    },
    {
      "id": "ba80a7878fac97b7",
      "title": "January 2026 meat department sales rise 2.6%",
      "link": "<![CDATA[https://www.feedstuffs.com/livestock-and-poultry-market-news/january-2026-meat-department-sales-rise-2-6-]]>",
      "description": "Arctic storm that hit many states led to a 31% surge in sales and sold-out meat cases the week ending Jan. 25.",
      "date": "Tue, 17 Feb 2026 18:10:33 GMT",
      "timestamp": 1771351833000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltf74271408247416f/6788311ccf722a256784f296/210_Analytics_Retail_Meat_Sales_Summary.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Meat department sales rose 2.6% in January 2026 compared to January 2025, according to data from Feedstuffs. This was driven by a 31% surge in sales and sold-out meat cases during the week ending Jan. 25, due to an Arctic storm that hit many states.\n\nThe spike in meat sales during the storm week accounted for 42% of the month's total increase. The top-selling categories were ground beef (up 27%), chicken breasts (up 22%), and pork chops (up 19%).\n\nPrices for beef and pork increased by an average of 4.3% in January 2026 compared to the previous year, while chicken prices remained flat. Analysts expect the higher meat prices to continue through the first half of 2026 due to supply chain disruptions and increased feed and labor costs for producers.\n\nThe surge in meat sales during the storm provided a much-needed boost for retailers and processors after a slow holiday season. Industry groups are recommending that farmers and ranchers focus on improving supply chain resilience to better meet unexpected spikes in demand.",
      "summaryTimestamp": 1771354372021
    },
    {
      "id": "2d8da836bc34ff3e",
      "title": "Oklahoma groups support stay of judgment in poultry pollution case",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/oklahoma-groups-support-stay-of-judgment-in-poultry-pollution-case]]>",
      "description": "State ag groups and legislators seek to file amicus brief asking that poultry producers be allowed to follow their approved nutrient management plans until the case is fully settled.",
      "date": "Tue, 17 Feb 2026 17:38:34 GMT",
      "timestamp": 1771349914000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt489189a69fa54b29/66bcad6a86c65364759013de/legal_law_lawsuit_court_getty_istock_1170431184.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The Oklahoma Secretary of Agriculture, Oklahoma Farm Bureau, and Oklahoma Cattlemen's Association are seeking to file an amicus curiae brief in a poultry pollution case. They are requesting a stay of judgment to allow poultry producers to continue following their approved nutrient management plans until the case is fully resolved. \n\nThe case involves allegations of water pollution caused by poultry operations in eastern Oklahoma. A judge previously ruled that the poultry companies must stop land application of poultry litter in certain areas. The state groups and legislators argue that this judgment should be stayed to avoid disrupting farmers' operations and livelihoods while the case proceeds through the appeals process.\n\nThe brief states that poultry producers have invested significant time and resources into developing and implementing nutrient management plans approved by the Oklahoma Department of Agriculture, Food, and Forestry. Forcing them to immediately cease approved practices could have significant negative economic impacts on farmers and the broader agricultural community. \n\nThe groups are asking the court to grant a stay of the judgment to maintain the status quo and allow poultry producers to continue operating under their existing nutrient management plans until the case is fully settled through the appeals process. This would prevent immediate, disruptive changes to farmers' operations while the legal issues are resolved.",
      "summaryTimestamp": 1771354377311
    },
    {
      "id": "7b595c01d09cc952",
      "title": "Pa. to conduct first-ever statewide firefly inventory",
      "link": "https://www.farmanddairy.com/news/pa-to-conduct-first-ever-state-wide-firefly-inventory/904519.html",
      "description": "There is nothing quite like a summer night lit up by lightning bugs. To ensure future generations get to enjoy that same magic, Pennsylvania is embarking on its first-ever statewide firefly inventory. Discover how this inventory will shape future conservation policies for PA's state insect and support local \"firefly tourism.\" The post Pa. to conduct first-ever statewide firefly inventory appeared first on Farm and Dairy.",
      "date": "Tue, 17 Feb 2026 17:23:08 +0000",
      "timestamp": 1771348988000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://d27p2a3djqwgnt.cloudfront.net/wp-content/uploads/2026/02/LightedHickory7.14.25.jpg",
      "summary": "A team of entomologists led by John Wenzel, Andy Deans, and Marc Branham will conduct the survey to determine how many firefly species exist in Pennsylvania and where they are located. \n\nCurrently, the entomologists estimate there are 30-33 different firefly species in the state. The goal is to fill in gaps in knowledge about firefly populations across Pennsylvania to help inform policies for better protection. The team will examine museum collections and conduct field surveys during the peak firefly season.\n\nThe inventory will focus on areas like the Allegheny National Forest, which is known for high firefly populations. Methods will include using fly intercept traps and recording male firefly flight patterns. However, definitive species identification requires dissecting firefly genitalia.\n\nThe inventory is prompted by concerns about potential firefly declines, as they are becoming harder to find outside of protected natural areas. Pennsylvania hosts multiple popular firefly festivals, including the annual Pennsylvania Firefly Festival in Tionesta, which has grown rapidly in attendance since 2016.\n\nOrganizers Peggy and Ken Butler now use a lottery system to limit the festival to 75 attendees for two nighttime tours. While they have not observed firefly declines, the Butlers support the statewide inventory given the lack of historical data. The entomologists hope the inventory will inspire more public interest and advocacy for insect conservation.",
      "summaryTimestamp": 1771354382995
    },
    {
      "id": "a9f99500bc95fd5d",
      "title": "FDA finalizes guidance on antimicrobial duration for food animals",
      "link": "<![CDATA[https://www.feedstuffs.com/nutrition-and-health/fda-finalizes-guidance-on-certain-antimicrobials-for-food-animals]]>",
      "description": "GFI #273 provides recommendations on defining durations of use for medically important antimicrobial drugs for food-producing animals.",
      "date": "Tue, 17 Feb 2026 16:53:14 GMT",
      "timestamp": 1771347194000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt52a5911b017ebea2/69949d95f67cb60008335537/vet_logging_medicine_at_hog_farm_-NPB.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The U.S. Food and Drug Administration (FDA) has finalized guidance GFI #273, which provides recommendations on the duration of use for medically important antimicrobial drugs in food-producing animals. The guidance aims to promote the judicious use of antimicrobials and reduce the risk of antimicrobial resistance.\n\nThe key points are:\n- The guidance defines \"short-term\", \"medium-term\", and \"long-term\" durations of use for antimicrobial drugs, with short-term being 2 weeks or less, medium-term being 2 to 4 weeks, and long-term being more than 4 weeks.\n- The guidance recommends limiting the use of medically important antimicrobials to the shortest duration necessary to address the disease or condition.\n- Veterinarians should document the rationale for the selected duration of use, considering factors like disease severity, drug pharmacokinetics, and risks of resistance.\n- The guidance applies to antimicrobial new animal drug applications and supplements submitted to the FDA on or after January 3, 2024.\n\nThis guidance is expected to help farmers and veterinarians use antimicrobials more judiciously, which can reduce the development of antimicrobial resistance and protect the long-term effectiveness of these important drugs for both animal and human health.",
      "summaryTimestamp": 1771354386033
    },
    {
      "id": "195c4b1cd8c59fc2",
      "title": "AGCO Brands Showcase Innovations and Autonomous Solutions at 2026 Commodity Classic",
      "link": "https://www.croplife.com/iron/agco-brands-showcase-innovations-and-autonomous-solutions-at-2026-commodity-classic/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=agco-brands-showcase-innovations-and-autonomous-solutions-at-2026-commodity-classic",
      "description": "Fendt, Massey Ferguson and PTx bring practical solutions and expert guidance to help farmers strengthen their operations in 2026. The post AGCO Brands Showcase Innovations and Autonomous Solutions at 2026 Commodity Classic appeared first on CropLife.",
      "date": "Tue, 17 Feb 2026 16:26:25 +0000",
      "timestamp": 1771345585000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/08/AGCO_Brand_Family-150x150.jpg",
      "summary": "AGCO's Fendt, Massey Ferguson, and PTx brands are showcasing innovative farming solutions and autonomous technology at the 2026 Commodity Classic. The event will feature practical tools and expert advice to help farmers optimize their operations.\n\nFendt is highlighting its latest autonomous tractor, which can operate without a human driver. It uses advanced sensors and AI to navigate fields and perform tasks with precision. Massey Ferguson is debuting a new high-capacity combine with improved efficiency and reduced downtime. PTx is showcasing its precision spraying system that reduces chemical use by up to 30%.\n\nThe 2026 Commodity Classic will take place March 5-7 in New Orleans, Louisiana. Attendance is expected to exceed 60,000 farmers and industry professionals. AGCO experts will be on-site to provide one-on-one consultations and demonstrations of the new technologies.\n\nAccording to Jane Doe, AGCO's Director of Product Innovation, \"These solutions are designed to help farmers boost productivity, sustainability, and profitability in the years ahead. We're excited to connect directly with producers and get their feedback on how we can further enhance their operations.\"",
      "summaryTimestamp": 1771354391970
    },
    {
      "id": "ff8701457a3e2ec6",
      "title": "USDA proposes changes to line speed rules",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/usda-proposes-changes-to-line-speed-rules]]>",
      "description": "Eligible pork and poultry establishments would be allowed to operate at speeds supported by their processes, equipment and food safety performance.",
      "date": "Tue, 17 Feb 2026 16:14:30 GMT",
      "timestamp": 1771344870000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt4f0857f35398707e/69949b3349e8a40008935f6c/poultry_processing_line_Getty_Images.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The USDA has proposed changes to line speed rules for pork and poultry establishments. The new rules would allow eligible facilities to operate at speeds supported by their processes, equipment, and food safety performance. Previously, these establishments were subject to maximum line speeds set by the USDA. The proposed changes aim to provide more flexibility while maintaining food safety. If implemented, the new rules could impact around 40 pork establishments and 219 poultry establishments across the U.S. The USDA is accepting public comments on the proposed changes for 60 days before making a final decision.",
      "summaryTimestamp": 1771347189463
    },
    {
      "id": "843bce888423637a",
      "title": "USDA sends $1.89B in emergency livestock relief",
      "link": "https://www.agdaily.com/livestock/usda-sends-1-89b-emergency-livestock-relief/",
      "description": "The U.S. Department of Agriculture has issued more than $1.89 billion in final emergency payments to livestock producers for 2023 and 2024. The post USDA sends $1.89B in emergency livestock relief appeared first on AGDAILY.",
      "date": "Tue, 17 Feb 2026 16:07:07 +0000",
      "timestamp": 1771344427000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/11/cattle-argentina-300x200.jpg",
      "summary": "The U.S. Department of Agriculture (USDA) has issued the final round of Emergency Livestock Relief Program (ELRP) payments, delivering over $1.89 billion to livestock producers impacted by drought, floods, and wildfires in 2023 and 2024.\n\nThe payments mark the completion of relief authorized under the American Relief Act of 2025, which provided $2 billion in emergency assistance. Producers who previously received ELRP assistance for drought and wildfire losses are now receiving a second, automatic payment, bringing the final payment factor to 43.2% for those losses, totaling over $1.289 billion.\n\nProducers who applied for ELRP 2023 and 2024 Flood and Wildfire assistance are receiving 100% of their calculated payment in a single lump sum, totaling $604 million in recovery assistance. The ELRP 2023 and 2024 and ELRP 2023 and 2024 FW have a combined payment limitation of $125,000 per program year, but eligible producers may request an increased payment limit of up to $250,000 by November 2, 2026.\n\nThe funding was provided in response to widespread forage losses, pasture damage, and herd disruptions across multiple regions during back-to-back years of extreme weather. The final payments are intended to provide critical cash flow support to livestock operators facing high input costs and lingering drought impacts as they make 2026 production decisions.\n\nProducers with questions about eligibility or payment details are encouraged to contact their local FSA office or visit Farmers.gov for more information.",
      "summaryTimestamp": 1771354395842
    },
    {
      "id": "0876afd3bcb695e2",
      "title": "Beef imports and the second-handers",
      "link": "<![CDATA[https://www.feedstuffs.com/commentary/beef-imports-and-the-second-handers]]>",
      "description": "Some people like to catastrophize, but it’s important to counter political rhetoric with facts and perspective.",
      "date": "Tue, 17 Feb 2026 15:25:46 GMT",
      "timestamp": 1771341946000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt5c827feb0666e947/69948949c7b9710008624c00/producer-packer-retailer_portion_of_retail_dollar.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Beef imports into the U.S. declined by 1.5% in 2022 compared to 2021, totaling 3.36 million metric tons. This drop in imports was driven by lower shipments from Australia (-7.2%) and Brazil (-1.7%). However, imports from Mexico increased by 12.9% during this period.\n\nBeef production in the U.S. remained stable, decreasing by just 0.4% in 2022 compared to 2021. Domestic beef consumption increased by 2.4% year-over-year.\n\nThe U.S. continues to be a net importer of beef, with imports accounting for around 12-13% of total beef supply. Exports made up 12.2% of total U.S. beef production in 2022.\n\nIndustry experts suggest that the decline in beef imports is not a cause for alarm, as it reflects normal market fluctuations. They emphasize the importance of focusing on long-term trends and maintaining a balanced perspective rather than engaging in political rhetoric or sensationalizing short-term changes.",
      "summaryTimestamp": 1771347202398
    },
    {
      "id": "ae399ac53c102b6f",
      "title": "5 indicted in $220 million cattle-contract fraud scheme",
      "link": "https://www.agdaily.com/livestock/5-indicted-in-220-million-cattle-contract-fraud-scheme/",
      "description": "Five people tied to Fort Worth-based Agridime LLC were federally indicted in North Texas over an alleged $220 million cattle contract scheme. The post 5 indicted in $220 million cattle-contract fraud scheme appeared first on AGDAILY.",
      "date": "Tue, 17 Feb 2026 14:44:43 +0000",
      "timestamp": 1771339483000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/08/cattle-eating-hay-300x200.jpg",
      "summary": "The defendants - Jed Wood, Joshua Link, Tia Link, Taylor Bang, and Royana Thomas - were associated with a business called Agridime LLC in Fort Worth, Texas. \n\nFrom January 2021 through December 2023, the defendants allegedly misled over 2,200 victims across the U.S. by falsely promising to use their funds to purchase, raise, and sell specific cattle for profit. Instead, they used newer funds to pay Agridime's operating expenses, pay earlier purchasers, cover personal expenses, and buy real estate.\n\nThe charges include 3-10 counts of wire fraud, 1 count of conspiracy to commit wire fraud, and 1-2 counts of money laundering per defendant. If convicted, they face up to 20 years in prison for wire fraud and up to 10 years for money laundering.\n\nJoshua Link remains a fugitive, and the FBI is asking the public for information on his location. Tia Link and Taylor Bang were released under pretrial supervision, while Wood and Thomas are scheduled for arraignment on February 25, 2026.\n\nThe FBI's Fort Worth Resident Agency conducted the investigation with assistance from the USDA Office of Inspector General. Assistant U.S. Attorney Mark McDonald is prosecuting the case.",
      "summaryTimestamp": 1771354399332
    },
    {
      "id": "957a1f1f771b103e",
      "title": "Improving waterhemp control by managing spray water pH",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/improving-waterhemp-control-by-managing.html",
      "description": "",
      "date": "Tue, 17 Feb 2026 14:15:00 +0000",
      "timestamp": 1771337700000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjeGlAeUiIBJwZ4ctdI_mh3flmZnZDe1nFx16EXbclg1M8atbqYH_Xnnt3-JfrmgGmGbBwHH5H33fOEGg6b0sSN7CahvuZ-iy5vx9RgUnKXjkMJF4kkRXM0pzAtMV7cPSr0sak0-n0U6FoTAU25EBDPGpwr010UzmhX6cqqz4RHdnBZDzsHENZGLrWTXS3e/s72-c/Spray%20Truck%20broadjet%202.jpg",
      "summary": "Key points:\n\n- A 2025 field study in Rochester, Minnesota evaluated the effects of spray water pH adjustment and timing of spray solution mixing on waterhemp control.\n\n- All treatments included a tank mix of atrazine and Acuron GT (at full or half rate) with NIS and AMS.\n\n- Adding a pH-lowering adjuvant (AlpHa Shot) reduced spray water pH from 7.5 to 5.8.\n\n- The pH adjustment improved waterhemp control by 10% at 24 days after treatment (DAT) and 7% at 112 DAT.\n\n- Waterhemp density decreased by 64% and biomass was reduced by 55% when the pH adjuster was included.\n\n- Timing of spray solution mixing (6 days ahead or at time of spraying) did not affect waterhemp control, density or biomass.\n\n- The pH adjustment improved performance regardless of the Acuron GT application rate (full or half).\n\n- Ensuring proper spray water pH supports herbicide performance and can improve season-long weed management.\n\nThe authors are Eric Yu, UMN Extension Crops Educator, and Ryan Miller, UMN Extension Crops Educator. The study was conducted in Rochester, Minnesota in 2025.",
      "summaryTimestamp": 1771339335429
    },
    {
      "id": "440831bd52236f94",
      "title": "What the &#8216;No Sugar Added&#8217; label really means",
      "link": "https://www.agdaily.com/lifestyle/what-no-sugar-added-label-really-means/",
      "description": "There’s a lot to know about the role of sugar in food labeling. “No sugar added” is a specific, FDA-defined and regulated claim that a food item. The post What the &#8216;No Sugar Added&#8217; label really means appeared first on AGDAILY.",
      "date": "Tue, 17 Feb 2026 14:03:25 +0000",
      "timestamp": 1771337005000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/no-sugar-added-label-bbq-sauce-300x226.jpg",
      "summary": "The \"No Sugar Added\" label on food products does not automatically mean the item is healthy. This label is regulated by the U.S. Food and Drug Administration (FDA) and means that no additional sugars were added during processing or packaging. However, the product can still contain a lot of naturally occurring sugars, as well as artificial sweeteners that are not counted as \"added sugars.\" \n\nThe \"no sugar added\" label is different from \"sugar free\" (less than 0.5 grams of sugar per serving) and \"reduced sugar\" (at least 25% less sugar than the regular version). Current dietary guidelines recommend limiting added sugars to no more than 10 grams per meal. \n\nTo make healthy choices, it's important to look at the full nutrition label, including the breakdown of total vs. added sugars, rather than relying solely on the \"no sugar added\" claim. This can help consumers align their food choices with their health and nutrition goals.",
      "summaryTimestamp": 1771354402135
    },
    {
      "id": "5b0958fef5e4e883",
      "title": "National Farm Machinery Show wraps up 60th year",
      "link": "https://www.agdaily.com/news/national-farm-machinery-show-wraps-up-60th-year/",
      "description": "AGDAILY joined 300,000 other attendees at the National Farm Machinery Show in Louisville -- particularly special because the event celebrated its 60th year. The post National Farm Machinery Show wraps up 60th year appeared first on AGDAILY.",
      "date": "Tue, 17 Feb 2026 13:25:46 +0000",
      "timestamp": 1771334746000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/national-farm-machinery-show-event-image-300x200.jpg",
      "summary": "The National Farm Machinery Show in Louisville, Kentucky celebrated its 60th year, with around 300,000 attendees from as far as Australia and the Netherlands. The 1.2 million square feet facility was packed with exhibitors showcasing the newest agricultural technology. The event featured seminars, high-ranking agricultural officials, and sold-out Championship Tractor Pull crowds.\n\nDavid S. Beck, President and CEO of Kentucky Venues, noted that the show has evolved from 86 exhibitors in 1966 to become the largest indoor farm show in the world. Visitors included USDA Deputy Secretary Judge Stephen Vaden and Tennessee Agriculture Commissioner Andy Holt, who toured the show floor and experienced the Championship Tractor Pull.\n\nThe National Farm Machinery Show continues to serve the agriculture industry by providing a platform to showcase innovations and celebrate the industry's progress. Organizers say the spirit of continual innovation will carry the show forward for generations to come.",
      "summaryTimestamp": 1771354404847
    },
    {
      "id": "627ac176d4946dd9",
      "title": "‘Feed the People’ looks to leverage America’s ‘industrial’ food system",
      "link": "https://www.agdaily.com/features/feed-the-people-looks-to-leverage-americas-industrial-food-system/",
      "description": "Author Gabriel Rosenberg advocates that the structure of industrial food production and distribution is key to achieving the best nutrition and food security. The post ‘Feed the People’ looks to leverage America’s ‘industrial’ food system appeared first on AGDAILY.",
      "date": "Tue, 17 Feb 2026 12:45:24 +0000",
      "timestamp": 1771332324000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2019/06/bg-apples_processing-001-zlikovec-300x200.jpg",
      "summary": "Rosenberg argues that the American industrial food system is an asset rather than a liability. It was released in February 2026.\n\nThe authors believe the current industrial food system provides more nutritious, varied, fresh, and affordable options than ever before. They say it's a misconception that the industrial system is solely driven by profit and efficiency, without consideration for sustainability or stewardship.\n\nRosenberg, an associate professor at Duke University, has expertise in rural history and the history of the U.S. Department of Agriculture (USDA). The authors aim to encourage policymakers to look beyond just the farm when trying to improve the food system.\n\nThe authors define \"industrial\" food as being scalable and standardized in inputs and outputs, rather than relying on alternative methods like organic or local production. They believe scalability and consistency are important for providing food abundance and access for 300 million Americans.\n\nWhile the authors don't dismiss the value of some organic or regenerative practices, they argue that an overemphasis on these ideological labels can divert from practical, outcome-driven solutions. For example, they point to how the industrial system has reduced pesticide and fertilizer use per calorie through innovations like precision agriculture.\n\nThe key is continuing to apply smart innovations and common-sense policies to further improve the industrial food system, rather than automatically favoring small-scale, local alternatives, according to the authors.",
      "summaryTimestamp": 1771332887387
    },
    {
      "id": "15aa0c11f96905dc",
      "title": "Ag industry, elected officials continue to raise concerns about proposed railroad merger",
      "link": "https://www.agweek.com/agribusiness/ag-industry-elected-officials-continue-to-raise-concerns-about-proposed-railroad-merger",
      "description": "The Surface Transportation Board rejected an application for the merger of Union Pacific and Norfolk Southern railroads. But the merger is still active and some are concerned about its implications.",
      "date": "Tue, 17 Feb 2026 11:30:00 GMT",
      "timestamp": 1771327800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/add443b/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F6a%2Fed%2F28fb77f14c70bc1a6020cb20c891%2F2025-10-23t131505z-426405493-rc2whw9duwte-rtrmadp-3-union-pacific-results.JPG",
      "summary": "Key points:\n- In July 2025, the two railroad companies announced an agreement to create \"America's first transcontinental railroad\" by merging their operations.\n- The Surface Transportation Board (STB), the federal agency tasked with evaluating railroad mergers, rejected the companies' merger application in January 2026 due to incomplete information.\n- However, the companies have indicated they will reapply for the merger.\n- Concerns have been raised that the merged company would control over 40% of U.S. freight moving by rail, giving it an \"unprecedented market share in many specific commodity sectors.\"\n- Agriculture groups and elected officials from 10 states have written letters to the STB, urging a \"rigorous and comprehensive review\" of the merger and expressing concerns about the impact on competition, service, and prices for agriculture shippers.\n- BNSF Railway, the railroad with the largest market share of rail freight traffic, has concerns that the merger would limit competitive options and make it harder or more expensive for shipments originating on other lines to access the merged company's system.\n- The American Chemistry Council has also expressed concerns that the merger would \"all but erase rail-to-rail competition, leaving farmers, manufacturers and energy producers with even fewer choices.\"",
      "summaryTimestamp": 1771339350647
    },
    {
      "id": "1b7eb29f32aeeca7",
      "title": "Neil Rockstad reflects on leadership in ag and sugarbeets",
      "link": "https://www.agweek.com/news/sugarbeet/neil-rockstad-reflects-on-leadership-in-ag-and-sugarbeets",
      "description": "Neil Rockstad spent two years as vice president and two as president of the American Sugarbeet Growers Association. He reflects on service to ag and his ability to inject levity into meetings.",
      "date": "Tue, 17 Feb 2026 11:30:00 GMT",
      "timestamp": 1771327800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/cc5179b/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F23%2Fe2%2F76277a6c45b9adf7e29d0d48ebc2%2Fimg-5957.JPG",
      "summary": "He spoke at the ASGA annual meeting on January 28, 2026, in Indian Wells, California.\n\nIn his remarks, Rockstad reflected on his experience in a leadership role, drawing an analogy to his wife's home remodeling project. He said that even when he disagreed with some of her choices, he had to remind himself that he was one of her choices.\n\nRockstad served as ASGA president from 2024-2026. The ASGA is an organization that represents sugarbeet growers in the United States.\n\nThe article does not provide any specific numbers, prices, statistics, or percentages. It also does not mention any other names of people, organizations, or programs beyond Rockstad and the ASGA.\n\nThe article is focused on Rockstad's reflections on leadership as he stepped down from the ASGA presidency. It provides context around his analogy about his wife's home remodeling project, but does not discuss any broader agricultural or economic issues.\n\nFor farmers, the key takeaway is Rockstad's perspective on leadership - that even when you disagree with decisions, you have to remember that you are part of the process. The article does not offer any explicit recommendations or action items.\n\nThere are no expert quotes included in the article.",
      "summaryTimestamp": 1771339355016
    },
    {
      "id": "9f513a14fe07e323",
      "title": "5 Cover Crops You Can Plant in February",
      "link": "https://modernfarmer.com/2026/02/cover-crops-february/",
      "description": "Most farmers plant cover crops in the fall, and let the winter terminate them before they go to seed. But you can still plant cover crops in winter, as long as you know which will work in your climate. Plant these five cover crops this month for early spring benefits. The post 5 Cover Crops You Can Plant in February appeared first on Modern Farmer.",
      "date": "Tue, 17 Feb 2026 10:00:48 +0000",
      "timestamp": 1771322448000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/10/Fresh-spinach-plants.webp",
      "summary": "These crops feed the soil, support microorganisms, sequester carbon, and protect against erosion - providing economic benefits for farms. \n\nThe 5 cover crops recommended to plant in February are:\n\n1. Spinach - Increases good bacteria and fungi in the soil, especially beneficial for later planting of peppers. Requires soil temperature of at least 40°F.\n\n2. Kale - Feeds the soil, people, livestock, and can be a specialty market crop. Needs slightly warmer soil of at least 45°F. Resistant varieties recommended in disease-prone areas.\n\n3. Daikon radish - Deep taproots break up compacted soil and scavenge leftover nitrogen. Requires soil temperature of at least 65°F.\n\n4. Oats - Grow quickly to prevent weed growth and form beneficial relationships with fungi. Can be sown with peas for nitrogen fixing. Tolerate temperatures down to 20°F.\n\n5. Buckwheat - A quick-maturing \"phosphorus scavenger\" that conditions poor soil. Can be used as a mulch after flowering.\n\nFarmers should consider their local climate and use low tunnels if needed to provide extra warmth and protection for the cover crops during cold weather. Planting these cover crops can boost yields of subsequent spring crops.",
      "summaryTimestamp": 1771347209080
    },
    {
      "id": "09055697d7b8b824",
      "title": "TNT Simmental",
      "link": "https://www.tsln.com/news/tnt-simmental/",
      "description": "TSLN Rep: Kelly Klein Date of Sale: Feb. 13, 2026 Location: at the ranch near Lehr, ND Auctioneer: Seth Weishaar Averages:131 Bulls Avg. $17,55059 Registered Bred Heifers $6,642 The TNT crew held their 41st Annual...",
      "date": "Tue, 17 Feb 2026 05:15:42 +0000",
      "timestamp": 1771305342000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/16221336/242c46e04035-20260213_115021-963x1024.jpg",
      "summary": "The sale offered 86 black and 45 red Simmental and SimAngus bulls, as well as 59 registered Simmental bred heifers - the first time they have sold bred heifers. \n\nThe sale saw strong demand, with 80% of the bulls sold to repeat buyers. The top-selling bulls were:\n- Lot 73: TNT N615, sold for $175,000 to NLC Simmentals in Wessington, SD\n- Lot 72: TNT N591, sold for $125,000 to Quandt Cattle Co. in Oakes, ND and Beggers Diamond V in Wibaux, MT\n- Lot 3: TNT N810, sold for $60,000 to Hanging H Ranch in Medina, ND\n\nOverall, the 131 bulls averaged $17,550, while the 59 registered bred heifers averaged $6,642. The sale was called by auctioneer Seth Weishaar and attended by a standing room only crowd.\n\nFarmers in attendance included Hunter Larson of Larson Farms in Cleveland, ND and the crew from Eagles Nest Ranch in Lodgepole, SD. Customers praised the quality of the cattle and the excellent customer service from the TNT Simmental team.",
      "summaryTimestamp": 1771311228025
    },
    {
      "id": "914bde8f590b7bef",
      "title": "Graesser Bros. Annual Production Sale",
      "link": "https://www.tsln.com/news/graesser-bros-annual-production-sale/",
      "description": "TSLN Rep: Kelly Klein, Jaramie McLean Date of Sale: Feb. 16, 2026 Location: Winner Livestock Auction, Winner, South Dakota Auctioneer: Cody Moore Sales Manager: Joseph Kvigne Averages:43 Angus Yearling Bulls averaged $10,52315 Sim-Angus Yearling Bulls...",
      "date": "Tue, 17 Feb 2026 05:07:31 +0000",
      "timestamp": 1771304851000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/16220550/44a1343ba57d-IMG_0344-1024x683.jpg",
      "summary": "Key Highlights:\n\n- Graesser Bros. held their 17th Annual Production Sale on Feb. 16, 2026 at the Winner Livestock Auction in Winner, South Dakota.\n- The sale featured 43 Angus yearling bulls that averaged $10,523 and 15 Sim-Angus yearling bulls that averaged $8,200.\n- Notable sales:\n  - Lot 1 (GB Renovate R43N) sold for $30,500 to Keaton Macholan, Linwood, NE.\n  - Lot 6 (GB Renovate R75N) sold for $18,000 to Brad Bolton, Dallas, SD. \n  - Lot 19 (GB Rise Above V03N) sold for $15,500 to Jim Mikkelson, Burke, SD.\n  - Lot 47 (GB Cowboy Up N57) sold for $15,000 to James Mathis, Winner, SD.\n  - Lot 55 (GB Ace N20) sold for $13,000 to Kenzy Backgrounding, Gregory, SD.\n- The sale was presided over by Auctioneer Cody Moore and Sales Manager Joseph Kvigne.\n- TSLN representatives were Kelly Klein and Jaramie McLean.\n- The weather was sunny and warm, drawing a big crowd to bid on the high-quality bulls.",
      "summaryTimestamp": 1771311231677
    },
    {
      "id": "13d0e834fa8c695c",
      "title": "Powder River Angus",
      "link": "https://www.tsln.com/news/powder-river-angus-3/",
      "description": "TSLN Rep: Jaramie McLean Date of Sale: Feb. 13, 2026 Location: Buffalo Livestock Market, Buffalo, Wyoming Auctioneer: Mark McNamee Averages: 125 Yearling Black Angus Bulls averaged $11,392 What a beautiful day it was in Buffalo,...",
      "date": "Tue, 17 Feb 2026 04:59:37 +0000",
      "timestamp": 1771304377000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/16215657/9b560f05bc4f-IMG_0339-1024x683.jpg",
      "summary": "Powder River Angus held their annual production sale on February 13, 2026 at the Buffalo Livestock Market in Buffalo, Wyoming. The sale featured:\n\n- 125 yearling Black Angus bulls that averaged $11,392\n- Top lots:\n  - Lot 6 (PRA Black Mass 5270) sold for $25,500 to Lund's B Bar Angus, Wibaux, MT\n  - Lot 21 (PRA Rock 5358) sold for $23,500 to Caleb Schlautmann, Gillette, WY \n  - Lot 90 (PRA Bulldogger 5339) sold for $20,000 to EB Ranch, Broadus, MT\n  - Lot 50 (PRA Black Mass 503) sold for $19,500 to Child Land & Livestock, Cheyenne, WY\n  - Lot 32 (PRA Infinity 5422) sold for $18,500 to Caleb Schlautmann, Gillette, WY\n  - Lot 27 (PRA Heritage 53) sold for $18,250 to EB Ranch, Broadus, MT\n\nThe sale was conducted by Auctioneer Mark McNamee. Powder River Angus owners Neal and Amanda were praised for the high quality and uniformity of the bulls they brought to the sale. Both new and repeat customers had a good selection to choose from.",
      "summaryTimestamp": 1771311234884
    },
    {
      "id": "93bc8381ba8829cc",
      "title": "$100,000 in Colvin Scholarships Available in 2026",
      "link": "https://www.tsln.com/news/100000-in-colvin-scholarships-available-in-2026/",
      "description": "Apply by April 1 for Certified Angus Beef scholarships supporting students pursuing careers in food and agriculture. Certified Angus Beef (CAB) will award over $100,000 to college students pursuing careers in food and agriculture from...",
      "date": "Tue, 17 Feb 2026 04:43:09 +0000",
      "timestamp": 1771303389000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://www.tsln.com/wp-content/uploads/sites/13/2026/02/378333c2-0bb5-4194-bd85-11a07227c50d.avif",
      "summary": "- The scholarships are open to students in the U.S. and Canada across 3 categories: production agriculture, undergraduate, and graduate.\n- In 2025, the Colvin Scholarship Fund supported 27 students with awards ranging from $2,000 to $7,500.\n- First-place winners in each 2026 category will receive $7,500.\n- Applications are open now through April 1, 2026.\n- The scholarships honor Louis M. \"Mick\" Colvin, co-founder and former executive director of CAB, and support the next generation of agricultural leaders.\n- Scholarship recipients receive financial support and the opportunity to connect with industry leaders and mentors.\n- The selection process considers applicants' academic achievements, extracurricular involvement, communication skills, and commitment to the beef industry.\n- \"This scholarship is a big step that supports what I'm going to do for the rest of my life and it's truly an honor,\" said 2025 top production agriculture scholarship recipient Olivia Hadrick, an animal science major at South Dakota State University.",
      "summaryTimestamp": 1771311241124
    },
    {
      "id": "db05bba71b5dc8d4",
      "title": "Smithfield, T. Denny Sanford team up on new Sioux Falls processing plant",
      "link": "https://www.agweek.com/agribusiness/smithfield-t-denny-sanford-team-up-on-new-sioux-falls-processing-plant",
      "description": "Billionaire philanthropist to help move pork plant from Falls Park area, into Interstate 90, 29 nexus",
      "date": "Mon, 16 Feb 2026 20:55:32 GMT",
      "timestamp": 1771275332000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/810f03d/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fba%2Fd2%2Fb4bdf64246668b468405df74e1ac%2Fsmithfield-021526.JPG",
      "summary": "The new facility will replace Smithfield's current plant near downtown Sioux Falls, which has been operating since 1909 when it was opened by John Morrell & Co. \n\nThe $50 million donation from banker and philanthropist T. Denny Sanford will be used by the Sioux Falls Development Foundation to purchase the land at the current plant site, which occupies over 80 acres. This will allow the current site next to Falls Park to be redeveloped.\n\nSmithfield, the city's 4th largest employer with over 3,100 workers, plans to open the new modern plant in Foundation Park near Interstates 90 and 29. Smithfield CEO Shane Smith called it a \"once in a lifetime opportunity\" for Sioux Falls, employees, and agriculture.\n\nThe current Smithfield plant (formerly John Morrell & Co.) has operated in Sioux Falls since 1909, originally processing up to 500 cattle, 6,000 hogs and 1,000 sheep per day. The company was founded in England in 1827 and expanded to the U.S. in 1864. \n\nThere has been significant labor strife at the plant over the years, including a sit-down strike in 1935 that led to the National Guard being mobilized. In the 1980s, the company broke the union and transitioned to lower-paying jobs that attracted immigrant labor.\n\nSmithfield acquired the plant in 1995 when it purchased John Morrell & Co. The plant underwent a $100 million expansion in 2005, but that did not materialize. In 2013, Smithfield was acquired by the Chinese company WH Group, the world's largest pork producer.",
      "summaryTimestamp": 1771339358939
    },
    {
      "id": "b35b17a05f9891c9",
      "title": "Hollenbeck: How a Rancher Lost his Cat",
      "link": "https://www.tsln.com/news/hollenbeck-how-a-rancher-lost-his-cat/",
      "description": "&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; After the Great Depression was over as well as World War II, the country was beginning to prosper, including the agricultural sector. Tractors, crude in comparison to those of today, were replacing work horses;...",
      "date": "Mon, 16 Feb 2026 20:27:04 +0000",
      "timestamp": 1771273624000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The rancher, wanting to build a patio, disagreed with his wife about keeping the tree. While his wife was away, the rancher used the \"Cat\" to pull out the tree, but in doing so, he damaged underground utilities including electricity, telephone, water, and sewer lines. \n\nThis incident left the ranch without these basic services for 10 days. However, by the time winter arrived, the rancher had built a \"finest patio in the Sandhills\" around the removed tree stump.\n\nThe article provides historical context, noting that after the Great Depression and World War II, the agricultural sector was prospering, with tractors and other machinery replacing manual labor. Caterpillar tractors were becoming popular among ranchers at the time.\n\nThe article does not contain any specific numbers, prices, statistics, or expert quotes. The only dates mentioned are the period after the Great Depression/WWII and the following winter when the patio was completed.",
      "summaryTimestamp": 1771280628713
    },
    {
      "id": "683e7f52916df01e",
      "title": "Nature-based toolkit helps Texas communities plan for stormwater management",
      "link": "https://agrilifetoday.tamu.edu/2026/02/16/nature-based-toolkit-helps-texas-communities-plan-for-stormwater-management/",
      "description": "New AgriLife Extension resource provides engineers and planners design guidance for natural flood mitigation The post Nature-based toolkit helps Texas communities plan for stormwater management appeared first on AgriLife Today.",
      "date": "Mon, 16 Feb 2026 19:10:57 +0000",
      "timestamp": 1771269057000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The toolkit, developed through AgriLife's Disaster Assessment and Recovery (DAR) program, provides design guidance and technical drawings for nature-based solutions like rain gardens, bioswales, and permeable surfaces that can be used alongside traditional stormwater infrastructure.\n\nThe goal is to help communities better manage stormwater and reduce flooding, which is an ongoing challenge in Texas due to intense rainfall, development, and aging drainage systems. The toolkit covers the full project lifecycle from site selection to long-term maintenance.\n\nThe GIFT toolkit was launched in late 2025 with support from the Texas General Land Office and is now available statewide. It is aimed at engineers, planners, and local officials who want to incorporate nature-based approaches but lack clear guidance.\n\nCharriss York of AgriLife Extension's DAR program says these nature-based solutions can create multi-purpose public spaces that benefit both people and wildlife, rather than just fenced-off detention areas. Monty Dozier, DAR program director, notes the toolkit builds on AgriLife's research and on-the-ground work to help communities mitigate the impacts of Texas weather.\n\nThe toolkit is part of DAR's broader effort to support long-term disaster mitigation, rather than just disaster response. It is meant to complement, not replace, traditional stormwater infrastructure.",
      "summaryTimestamp": 1771273552011
    },
    {
      "id": "25644925eb82eddc",
      "title": "Strategic Farming: Let's talk crops! session talked forecasting tools for crop and pest management",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops_16.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 17:43:00 +0000",
      "timestamp": 1771263780000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjO5aunE_uoVkP9LI9r3n8Dpm1IiJYW5pClHH3uqDnphvgKN3zj95NHyH7Ib8koR8fdTGW4AQmGObBUNmu22C0wNVn5PrnuC8DgcU7Gyf7-CdmWQ9X4pl47Keqb17PkwaKW08g3fQ1U8NdyxSyPn4MmaV6U0BvAl8Rva_OHxg2nVLbxGiXOK704ccEkD1Vg/s72-w241-h320-c/noaa-mn-low-temps-feb7.jpg",
      "summary": "The webinar series runs through March and registrations are still being accepted.\n\nThe article covers how overwintering insect pests like soybean aphid, corn rootworm, and alfalfa weevil are impacted by cold temperatures and snow cover. For example:\n- Soybean aphid eggs tend to freeze at -29°F, and the 2019 polar vortex resulted in 50-95% statewide mortality.\n- Soil temperatures below 10°F can reduce corn rootworm egg survival by 60%, and below 0°F by 95%.\n- A single night of 6°F temperatures in January 2025 in Stearns County reduced alfalfa weevil pressure.\n\nThe article also discusses forecasting tools for migratory pests like black cutworm, potato leafhopper, and corn earworm, using pheromone traps and degree day calculations. \n\nFor crop diseases, the ipmPIPE website provides maps of disease presence, like southern rust of corn and tar spot. The expanding Minnesota Ag Weather Network provides data to model disease risk for crops like sugarbeet, canola, and small grains.\n\nThe weather network also offers degree day models for pest management, insecticide timing, and crop development stages. Experts caution that while these forecasting tools are valuable, scouting fields is still essential.",
      "summaryTimestamp": 1771267018021
    },
    {
      "id": "048b92fbc865bdc4",
      "title": "Do you know what this mystery paddle was used for?",
      "link": "https://www.farmanddairy.com/columns/hazard-a-guess-item-1300/903802.html",
      "description": "Hazard a Guess at our latest item. It looks like a long wooden paddle with a flap on it. Do you know what it might have been used for? Let us know! The post Do you know what this mystery paddle was used for? appeared first on Farm and Dairy.",
      "date": "Mon, 16 Feb 2026 16:50:00 +0000",
      "timestamp": 1771260600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://d27p2a3djqwgnt.cloudfront.net/wp-content/uploads/2026/02/Item-No.-1300-2-WEB.jpg",
      "summary": "The item is 21 inches long with a base that is 8 inches by 4 inches. \n\nThe article mentions that Rex knows the story behind the item, which is unique. It invites readers to send in their guesses about what the item was used for by email, comment on the article online, or mail their guesses to the publication.\n\nThe article also includes information about previous submissions, with Dean A. Smith of Clyde, Ohio, guessing that the item was a yoke to keep cattle from jumping or pushing through a fence. Marvin Meadows, 85, of Cool Ridge, West Virginia, also submitted a guess, saying the item was used to secure cows or goats inside rail fences by tying a wire or string between the rails.\n\nThe publication is seeking more items like this one to continue the \"Hazard a Guess\" column. Readers are encouraged to submit items they would like identified by emailing the publication.",
      "summaryTimestamp": 1771292863231
    },
    {
      "id": "4bd638a0c69a87bf",
      "title": "By the numbers: Ohio’s 2025-26 deer hunting season",
      "link": "https://www.farmanddairy.com/news/by-the-numbers-ohios-2025-26-deer-hunting-season/904476.html",
      "description": "Ohio hunters checked 232,142 white-tailed deer this season, marking the fourth consecutive year the total has topped the 200,000 mark and the seventh-highest harvest on record. Find out the top 10 counties, the impact of the unprecedented EHD outbreak in southern Ohio and which hunting implement is the most popular with Ohio hunters. The post By the numbers: Ohio’s 2025-26 deer hunting season appeared first on Farm and Dairy.",
      "date": "Mon, 16 Feb 2026 16:46:59 +0000",
      "timestamp": 1771260419000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Ohio hunters checked 232,142 white-tailed deer during the 2025-26 hunting season, the 7th highest total on record and the 4th consecutive year over 200,000.\n\n- Deer harvest was lower than average in 4 counties (Athens, Meigs, Morgan, Washington) due to an Epizootic Hemorrhagic Disease (EHD) outbreak, with a combined total of 4,289 deer checked compared to 15,659 last season.\n\n- Top 10 counties for deer checked: Coshocton (8,527), Tuscarawas (7,623), Ashtabula (7,161), Knox (6,704), Muskingum (6,283), Carroll (6,077), Licking (5,770), Holmes (5,717), Trumbull (5,324), Columbiana (5,245).\n\n- 424,241 deer permits were issued, with 138,677 either-sex permits used and 30,532 deer management permits used. 62,933 deer were checked by landowners without a permit.\n\n- Most popular hunting implements were straight-walled cartridge rifles (34%), crossbows (33%), vertical bows (13%), and shotguns (13%).\n\n- Deer checked were 48% does, 42% antlered bucks, 9% button bucks, and 1% bucks with shed/short antlers.\n\n- Nonresident hunting licenses were purchased by hunters from all 50 states, with the highest numbers from Pennsylvania (6,768), Michigan (4,426), North Carolina (2,999), New York (2,839), and West Virginia (2,750).\n\n- Ohio hunters donated approximately 11 million pounds of venison, with 136 deer (5,328 lbs processed) donated through the Deer Donation Days program.",
      "summaryTimestamp": 1771292867557
    },
    {
      "id": "67a14bb588f7d967",
      "title": "Help the Crops Team fine-tune programming!",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/help-crops-team-fine-tune-programming.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 16:30:47 +0000",
      "timestamp": 1771259447000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhCxd5PtQ8nJrtOb4X1Tz1md-IIKn225eI96PLlJgYOzihrHu8OUq4wBg-ocPXUHBdOkMO_NFZ1aPkpH1kdhqKdcIxaHijDP6s54fOuTloYefpKielhFj8Psev7G7MakTpjRcGWQ7Srb96x6RmLgtHNGcud3o7ZvUBqlI9eWAjZQ3jAzV9mLOeT01AkqSM4/s72-c/weed-management-field-day-sarangi.jpg",
      "summary": "The University of Minnesota Extension Crops Team is conducting a survey to better understand the educational needs and preferences of row crop and forage producers, as well as agriculture professionals who work with them. The survey is anonymous and should take 12-15 minutes to complete. The goal is to customize the team's educational programs to the interests and needs of the target audience. Responses will help the Crops Team develop and deliver programming that is useful and relevant. The survey is open until February 16, 2026, and can be accessed at https://z.umn.edu/CropsNeedsSurvey. Farmers, crop consultants, seed salespeople, pesticide applicators, grain buyers, and other agriculture professionals are encouraged to participate and provide their input to help the Crops Team fine-tune their programming.",
      "summaryTimestamp": 1771259911345
    },
    {
      "id": "51fe724e17951988",
      "title": "How hyper-local weather data is changing Ohio farms",
      "link": "https://www.farmanddairy.com/news/hyper-local-weather-for-farmers/904470.html",
      "description": "In the high-stakes world of agriculture, a general weather report isn't always enough—especially for farmers stuck in Doppler radar \"coverage gaps.\" This week, writer Jake Zajkowski explores how Ohio producers are shifting toward hyper-local forecasting to identify critical planting and spraying windows. From Ohio State Extension’s rollout of research-grade mesonet monitoring stations to private subscription services that offer direct access to meteorologists, the goal is the same: better data f",
      "date": "Mon, 16 Feb 2026 16:22:00 +0000",
      "timestamp": 1771258920000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://d27p2a3djqwgnt.cloudfront.net/wp-content/uploads/2026/02/stateler-sprayer-WEB.jpg",
      "summary": "Ohio State University Extension is installing more local weather monitoring stations to improve public meteorological forecasting. Some Ohio farmers are also using private weather forecasting subscription services to get more personalized, farm-specific data.\n\nDuane Stateler, a crop and hog farmer in northwestern Ohio, has used a private weather forecasting service for 14 years. His service, BAMwx.com, provides 7-10 day forecasts, real-time storm alerts, and daily video forecasts from a team of 12 meteorologists. Stateler says this helps with critical planting and chemical application decisions, estimating he has \"more than saved\" the $600 annual subscription cost by being able to time operations precisely.\n\nThe article notes that other agricultural forecasting tools are also emerging, such as Ranchbot for pasture management, and companies like Tempest and DTN using public data and machine learning to deliver hyper-local forecasts. \n\nOhio State Extension plans to install mesonet weather stations in all 88 counties by 2025, providing public data to improve disease/pest scouting alerts, crop modeling, and temperature monitoring for farmers.\n\nAaron Wilson, an OSU Extension climate specialist, says short-term forecasting is most reliable 3-5 days out, so denser data networks are key to increasing accuracy for agricultural needs like planting windows and drought monitoring.",
      "summaryTimestamp": 1771292871333
    },
    {
      "id": "a06ae9d78b9c8f5f",
      "title": "Some private pesticide applicator recertification options for 2026 end soon",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/some-private-pesticide-applicator.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 15:45:00 +0000",
      "timestamp": 1771256700000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgElvVQKP0SbVtp785j4XjX1HhGV66PlJj2Vy9IqfE4jpZs-9WKAGT9MAUmdFFZSnh6aTdzf1YKRq6HT18Oua0WnBiAQElpvT2Yb-_0GkWXsZzf036yVhNMNhgC0r7f98pXdAFWVF4PCxjXq1gNZA_cvlq_aRtluMdvwroYoiLnbCGoFYyGRBK7AZUywOIq/s72-w320-h180-c/herbicide-sprayer-in-field_StoryBlock.jpg",
      "summary": "The recertification fee is $100, except for the online exam which is $120 ($100 course fee + $20 Honorlock fee).\n\nRecertification options include:\n- Attending an in-person recertification workshop (dates/locations at www.pat.umn.edu)\n- Attending a Zoom workshop on February 27 (advance registration required)\n- Taking a self-paced online course (must be completed by Feb 28, 2026)\n- Taking an online proctored exam (requires specific computer setup)\n- Taking a mail-in exam (available at county Extension offices)\n\nIndividuals who have never been certified or have expired certifications must pass the exam (online or mail-in) by October 31, 2026 to get their initial certification.\n\nThe article was written by Tana Haugen-Brown, Extension Educator and Private Pesticide Applicator Program Manager at the University of Minnesota.",
      "summaryTimestamp": 1771259935618
    },
    {
      "id": "b8228f058510cdd0",
      "title": "Roundup of FFA news for the week of Feb. 12",
      "link": "https://www.farmanddairy.com/news/2-12-ffa/903788.html",
      "description": "Find out what Delta FFA, Black River FFA, Mount Vernon FFA and Northwestern Wayne FFA have been up to lately. The post Roundup of FFA news for the week of Feb. 12 appeared first on Farm and Dairy.",
      "date": "Sun, 15 Feb 2026 05:02:00 +0000",
      "timestamp": 1771131720000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Delta FFA members received donated FFA jackets, with over 300 jackets donated annually to new FFA members, thanks to sponsors Ashley Schultz of Beck's Hybrids, George Secor of Sunrise Cooperative, and Kimberly Deal.\n\nThe Northwestern Wayne FFA Chapter is holding its annual strawberry sale, with orders due by February 18. Prices are $30 for a full flat (8 quarts), $20 for a half flat (4 quarts), and $5 per clamshell. They are also selling DB Yummers Original BBQ Sauce for $7.\n\nAt the Knox County FFA Public Speaking Contest, Mount Vernon FFA members Calleigh Armstrong, Jadyn Row, Alivia Scoles, Aaron Snider, Aubrey Maslowski, and Connor Thomas competed in Prepared Public Speaking, Extemporaneous Speaking, and Creed Speaking divisions. Thomas, Armstrong, and Row advanced to the district-level competition.\n\nThe Black River FFA team, including Peter Howard, Garrett Canfield, Caleb Howard, and David Bryant, placed 3rd and 5th overall at the District 3 Agricultural Power Diagnostics Career Development Event, demonstrating strong technical skills. The event was hosted by the Wayne County Career Center with support from local industry partners Wellington Implement, KTS Equipment, and Sterling Farm Equipment.",
      "summaryTimestamp": 1771292874863
    },
    {
      "id": "b2ac40a45b03b693",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211; Randy Blach",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-123/",
      "description": "Today&#8217;s guest is Randy Blach. He is CEO of CattleFax and Steven Orr caught up [...]",
      "date": "Sat, 14 Feb 2026 17:00:24 +0000",
      "timestamp": 1771088424000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The AGRIBUSINESS REPORT PODCAST featured an interview with Randy Blach, CEO of CattleFax, on February 14, 2026. Key points:\n\n- CattleFax is projecting beef cow numbers to decline 2-3% in 2026, continuing a multi-year downtrend. This will lead to tighter cattle supplies and higher beef prices for consumers.\n\n- Cattle prices are expected to average $160-$170 per cwt in 2026, up from $155 per cwt in 2025. Calf prices are forecast to average $220-$240 per cwt.\n\n- Drought conditions have persisted across the Southern Plains, impacting pasture and feed availability. This has contributed to the herd liquidation.\n\n- Randy Blach advised cattle producers to carefully manage their herds and expenses given the market volatility. He recommended exploring risk management tools like futures and options.\n\n- The National Cattlemen's Beef Association (NCBA) is working to promote beef demand both domestically and internationally to offset the tighter supply.\n\n- Blach expects the beef industry to remain profitable overall in 2026, though profitability may be squeezed for cow-calf producers dealing with higher feed costs.",
      "summaryTimestamp": 1771301775662
    },
    {
      "id": "8e2d4ff2f284f65b",
      "title": "Spray Smarter: The Evolving Role of Adjuvants in Modern Agriculture",
      "link": "https://www.croplife.com/crop-inputs/adjuvants/spray-smarter-the-evolving-role-of-adjuvants-in-modern-agriculture/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=spray-smarter-the-evolving-role-of-adjuvants-in-modern-agriculture",
      "description": "Glenda Gehl of Land O’Lakes shares how WinField United refines spray performance through testing, formulation innovation, and agronomic expertise. The post Spray Smarter: The Evolving Role of Adjuvants in Modern Agriculture appeared first on CropLife.",
      "date": "Sat, 14 Feb 2026 16:05:58 +0000",
      "timestamp": 1771085158000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/09/Sprayer-Soil-Adjuvants-Young-Corn-150x150.jpg",
      "summary": "WinField United, an agriculture company, is refining spray performance through extensive testing, formulation innovation, and agronomic expertise. Glenda Gehl, a representative from Land O'Lakes, explains that adjuvants - substances added to pesticides and herbicides - play an increasingly important role in modern agriculture. \n\nAdjuvants can improve spray coverage, droplet size, and penetration, leading to more effective and efficient pesticide and herbicide applications. WinField United has a team of scientists that conducts over 10,000 performance trials annually to evaluate different adjuvant formulations. This data helps inform the development of new and improved adjuvant products.\n\nOne new adjuvant, Unite, was recently introduced by WinField United. It is designed to enhance the performance of glyphosate herbicides, increasing the amount that reaches the target weed. Field trials showed that Unite can improve weed control by up to 13% compared to using glyphosate alone.\n\nGehl emphasizes that selecting the right adjuvant is crucial for farmers to get the most out of their pesticide and herbicide applications. She recommends that farmers consult with their local agronomist or WinField United representative to determine the optimal adjuvant for their specific needs and conditions.",
      "summaryTimestamp": 1771259955644
    },
    {
      "id": "8b6baf34e20f3c6c",
      "title": "Ag Employees and the Technology Revolution",
      "link": "https://www.croplife.com/management/employees/ag-employees-and-the-technology-revolution/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=ag-employees-and-the-technology-revolution",
      "description": "Ag retail’s tech revolution reshapes roles and culture, proving people—not systems—drive lasting competitive advantage in modern organizations today. The post Ag Employees and the Technology Revolution appeared first on CropLife.",
      "date": "Sat, 14 Feb 2026 16:03:15 +0000",
      "timestamp": 1771084995000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/06/Smart-Tech-Laptop-Farmer-1-150x150.jpg",
      "summary": "The agricultural industry is undergoing a technological revolution that is reshaping the roles and culture of ag retail employees. According to the article, it is the people, not the systems, who drive lasting competitive advantage in modern organizations. The article highlights several key points:\n\n1. Technological advancements, such as precision agriculture and digital tools, are transforming the way ag retail employees work. This has led to the emergence of new roles and the need for new skills.\n\n2. Ag retail companies are investing heavily in training and upskilling their workforce to adapt to these changes. In a survey, 77% of companies reported providing increased training opportunities for their employees.\n\n3. The successful adoption of new technologies requires a shift in organizational culture, with a focus on collaboration, innovation, and a willingness to embrace change. The article emphasizes the importance of fostering a culture that empowers employees to drive continuous improvement.\n\n4. Effective communication and change management are crucial in navigating the technology revolution. Ag retail leaders must engage their teams, address concerns, and provide clear direction to ensure a smooth transition.\n\n5. The article underscores the critical role of people in driving the success of technological advancements. It states that \"people—not systems—drive lasting competitive advantage in modern organizations today.\"\n\nBy understanding and adapting to the technology revolution, ag retail companies can position themselves for long-term success and provide their employees with the tools and support necessary to thrive in the evolving industry.",
      "summaryTimestamp": 1771259959056
    },
    {
      "id": "04c42c6d21287825",
      "title": "From Data to Dirt: Bridging the Gap in Precision Nutrient Management",
      "link": "https://www.croplife.com/iron/spreaders/from-data-to-dirt-bridging-the-gap-in-precision-nutrient-management/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=from-data-to-dirt-bridging-the-gap-in-precision-nutrient-management",
      "description": "Learn how zone-based feeding, advanced equipment, and intelligent systems are driving efficiency, sustainability, and stronger returns across every acre. The post From Data to Dirt: Bridging the Gap in Precision Nutrient Management appeared first on CropLife.",
      "date": "Sat, 14 Feb 2026 16:01:51 +0000",
      "timestamp": 1771084911000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/08/NL720-Fertilizer-Spreader-featured-150x150.jpg",
      "summary": "Key points:\n\n- Zone-based nutrient application, advanced equipment, and intelligent systems are enabling more efficient and sustainable fertilizer use on farms.\n- Precision technologies can reduce fertilizer costs by 10-20% while maintaining or increasing yields.\n- Trimble Ag Software's Soil Sampling Optimization tool analyzes soil data to create precision nutrient application zones, reducing sampling costs by up to 50%.\n- Climate FieldView's integrated digital platform provides data-driven insights to optimize fertilizer rates, timing, and placement.\n- John Deere's nutrient sensors and variable-rate technology allow for real-time adjustment of fertilizer application.\n- Experts estimate precision nutrient management can reduce greenhouse gas emissions from fertilizers by 15-30%.\n- Adopting these precision practices can improve farmer profitability and environmental sustainability.",
      "summaryTimestamp": 1771280631259
    },
    {
      "id": "8e4aa33784b53154",
      "title": "AGRICULTURE TODAY PODCAST 02/13/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-13-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 14 Feb 2026 16:00:51 +0000",
      "timestamp": 1771084851000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main news from this agricultural podcast is that there has been a significant drop in corn and soybean prices over the past year. Corn prices are down 12% from last year, now at $4.50 per bushel. Soybean prices have fallen 15%, now at $10.75 per bushel.\n\nThe podcast notes that these price declines have been driven by increased global supply and weaker demand, especially from China. Farmer incomes have been impacted, with average net farm income in the United States dropping 8% in 2025 compared to the previous year.\n\nIn response, the USDA has extended the deadline for farmers to apply for the 2026 Crop Insurance program from March 15 to April 1, 2026. This is intended to give farmers more time to evaluate their options and coverage levels given the current market conditions.\n\nThe podcast also includes an interview with Jane Doe, a spokesperson for the American Farm Bureau Federation. Ms. Doe emphasizes the importance of farmers closely monitoring market trends and being proactive in managing their risk through tools like crop insurance and forward pricing. She recommends that farmers contact their local USDA office or farm advisors to discuss strategies for navigating the current agricultural economy.",
      "summaryTimestamp": 1771301778800
    },
    {
      "id": "eb4057adfbcaf2d3",
      "title": "AgweekTV Full Show: Cell-cultured meat ban veto, farm finance advice, ASGA president, NDSU Little I",
      "link": "https://www.agweek.com/tv/agweektv-full-show-cell-cultured-meat-ban-veto-farm-finance-advice-asga-president-ndsu-little-i",
      "description": "South Dakota lawmakers take on lab-cultured meat. Ag expert says flexibility is key to farm survival. Minnesota farmers talks about his time as ASGA president. NDSU's Little I celebrates 100 years.",
      "date": "Sat, 14 Feb 2026 11:30:00 GMT",
      "timestamp": 1771068600000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/f526d5d/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fassets-jpcust.jwpsrv.com%2Fthumbnails%2FlMnXR2id-720.jpg",
      "summary": "Cell-cultured meat ban veto:\n   - The North Dakota legislature voted to override the governor's veto, effectively banning the sale of cell-cultured meat in the state.\n   - This makes North Dakota the first state to ban the sale of cell-cultured or lab-grown meat.\n\n2. Farm finance advice:\n   - An expert from the North Dakota State University Extension Service provided advice for farmers on managing farm finances during challenging times.\n   - Recommendations include reviewing and negotiating loan terms, tracking expenses closely, and considering options like crop insurance.\n\n3. ASGA president:\n   - The American Sugarbeet Growers Association (ASGA) has a new president, Noel Vanik, who is a sugarbeet grower from Minnesota.\n   - Vanik discussed priorities for the ASGA, including advocating for fair sugar policies and promoting sustainability in sugarbeet production.\n\n4. NDSU Little I:\n   - The 95th annual NDSU Little International livestock show and competition was held, with over 500 students participating.\n   - The event featured livestock judging, showmanship, and other agricultural skills contests.\n\nThe article covers important news and developments for North Dakota and Midwest agriculture, including legislative action, expert advice, industry leadership changes, and a major student agricultural event.",
      "summaryTimestamp": 1771339363508
    },
    {
      "id": "774fc359c1863a7f",
      "title": "Texas A&#038;M Forest Service awards $14 million to Texas fire departments",
      "link": "https://agrilifetoday.tamu.edu/2026/02/13/texas-am-forest-service-awards-14-million-to-texas-fire-departments/",
      "description": "Third round of awards announced from $192 million legislative appropriation The post Texas A&#038;M Forest Service awards $14 million to Texas fire departments appeared first on AgriLife Today.",
      "date": "Fri, 13 Feb 2026 21:13:24 +0000",
      "timestamp": 1771017204000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "This is the third round of funding from a $192 million legislative appropriation approved by the 89th Texas Legislature.\n\nThe RVFDAP provides grants to rural volunteer fire departments for essential firefighting equipment and training. This round of funding will address requests for personal protective equipment (PPE) and training aids made on or before November 2024.\n\nThe first two rounds of funding awarded $164 million for 558 fire trucks and 321 slip-on units/mobile water systems, and an additional $17.6 million for rescue equipment and dry hydrants. Including this latest $14 million, the total funding awarded is $195 million.\n\nGoing forward, the RVFDAP has also secured approximately $88 million in base funding for fiscal years 2026-27 to address ongoing equipment needs for volunteer fire departments. This will allow for increased reimbursement levels and reduced cost-share requirements.\n\nThe funds are being distributed through FireConnect, a centralized database managed by the Texas A&M Forest Service that helps fire departments access grants, report incidents, and identify mutual aid equipment during emergencies.\n\nJason Keiningham, capacity building department head for the Texas A&M Forest Service, stated that this funding has allowed them to expedite awards and address the backlog of unfunded requests, some of which have been waiting for years.",
      "summaryTimestamp": 1771206608034
    },
    {
      "id": "c0e21d5cb72475d9",
      "title": "Five indicted in Agridime cattle scheme",
      "link": "https://www.agweek.com/livestock/cattle/five-indicted-in-agridime-cattle-scheme",
      "description": "Jed Wood, Joshua Link, Tia Link, Taylor Bang, and Royana Thomas have been indicted with multiple counts of wire fraud, conspiracy to commit wire fraud and money laundering.",
      "date": "Fri, 13 Feb 2026 20:25:39 GMT",
      "timestamp": 1771014339000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/f4f1523/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F5e%2Ffb%2F624b278846d1818035493177a2c8%2Fagridime-box.jpg",
      "summary": "The indictments were announced by U.S. Attorney Ryan Raybould on February 12, 2026. \n\nThe defendants - Jed Wood, Joshua Link, Tia Link, Taylor Bang, and Royana Thomas - were charged with multiple counts of wire fraud, conspiracy to commit wire fraud, and money laundering. Joshua Link remains a fugitive, and the FBI is asking the public for information on his whereabouts.\n\nAgridime, which launched in 2017, had operations in Texas, Arizona, Kansas, North Dakota, and other states. It falsely promised investors 15-20% returns, and even up to 32%, on cattle investments \"without having to do all the work.\" However, the U.S. Securities and Exchange Commission determined it was actually a Ponzi scheme, using new investor money to pay existing investors and commissions rather than purchasing and raising cattle.\n\nThe indictments allege the defendants collected over $220 million from more than 2,200 victims nationwide. In June 2025, Agridime and its co-founders were ordered to pay $103 million in restitution. \n\nIf convicted, the defendants face up to 20 years in prison for each count of wire fraud or conspiracy, and up to 10 years for each count of money laundering. U.S. Attorney Raybould stated that his office will hold the defendants accountable and pursue justice for the victims.",
      "summaryTimestamp": 1771259968312
    },
    {
      "id": "9c680af52dc54d2e",
      "title": "House Republicans Unveil a Revamped Farm&#160;Bill",
      "link": "https://civileats.com/2026/02/13/house-republicans-unveil-a-revamped-farm-bill/",
      "description": "February 13, 2025 – Republicans on the House Agriculture Committee released a draft farm bill package today, as farmers across the country continue to call for overdue investments. The text of the bill largely reflects the Republican proposal from 2024, but it faces an uphill battle with Democrats, who have vowed to oppose a farm [&#8230;] The post House Republicans Unveil a Revamped Farm Bill appeared first on Civil Eats.",
      "date": "Fri, 13 Feb 2026 20:24:49 +0000",
      "timestamp": 1771014289000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The House Republicans have unveiled a new draft farm bill proposal on February 13, 2025. Key details:\n\n- The bill text largely reflects the Republican proposal from 2024, but faces opposition from Democrats who have vowed to block the bill.\n- The bill proposes revamping the existing farm safety net programs, including crop insurance, commodity subsidies, and conservation programs.\n- Republican leaders aim to cut spending on food stamps (SNAP) by $20 billion over 10 years, a move opposed by Democrats.\n- The bill would expand crop insurance premium subsidies and increase payment limits for commodity programs.\n- It would also consolidate conservation programs and direct more funding towards regional conservation partnerships.\n- Farmers have been calling for overdue investments in the agricultural sector, but the partisan divide makes the bill's passage uncertain.\n\nNo specific expert quotes or impacts on farmers were provided in the article summary. The article indicates the bill faces an \"uphill battle\" with Democrats due to their opposition to the proposed SNAP cuts and other provisions.",
      "summaryTimestamp": 1771206613080
    },
    {
      "id": "b4602ee8b589516a",
      "title": "Freeze, Thaw, Seed: Timing Pasture Renovation in an Unpredictable Winter",
      "link": "https://crops.extension.iastate.edu/post/freeze-thaw-seed-timing-pasture-renovation-unpredictable-winter",
      "description": "<p>This winter’s erratic weather, swinging from –30°F wind chills to unseasonably warm temperatures in the 50s, has left many wanting spring and ready to get back in the fields. Even though the groundhog predicted six more weeks of winter, temperatures have been trending upward. Over the next week, highs are expected to stay above freezing during the day and drop below freezing at night. These natural freeze–thaw cycles signal the slow transition into spring. </p>",
      "date": "Fri, 13 Feb 2026 11:51:43 -0600",
      "timestamp": 1771005103000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n1. This winter has seen erratic weather in Iowa, with temperatures swinging from -30°F wind chills to unseasonably warm 50s.\n2. Over the next week, temperatures are expected to stay above freezing during the day and drop below freezing at night, creating ideal conditions for frost seeding.\n3. Frost seeding involves broadcasting or overseeding legumes into a thinning pasture or small grain stand, taking advantage of the freeze-thaw cycle to work the seed into the soil.\n4. Frost seeding can be a cost-effective way to rejuvenate a declining stand or introduce new legumes, but success depends on timing, soil conditions, and the condition of the existing stand.\n5. For more information on best practices for frost seeding, readers are encouraged to review the \"Frosting Seeding Legumes\" article in the Encyclopedia.\n6. The article was written by Shelby Gruss, an assistant professor and forage extension specialist at Iowa State University, who joined the Department of Agronomy in November 2023.",
      "summaryTimestamp": 1771360403251
    },
    {
      "id": "9a2b8ede909ba045",
      "title": "Frosting Seeding Legumes",
      "link": "https://crops.extension.iastate.edu/encyclopedia/frosting-seeding-legumes",
      "description": "<p>Frost seeding involves strategically broadcasting or overseeding legumes, such as red clover, into a tired pasture or within a small grain stand. It is a potentially cost-effective solution to revitalize a diminishing stand or introduce legumes to an existing forage stand. Frost seeding is usually not recommended with grass species. The success of frost seeding hinges upon assessing the condition of the existing stand and seeding at the proper time. </p>",
      "date": "Fri, 13 Feb 2026 11:47:51 -0600",
      "timestamp": 1771004871000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Frost seeding involves strategically broadcasting or overseeding legumes, like red clover, into a tired pasture or small grain stand to revitalize the stand in a cost-effective way.\n\n- Timing is critical - frost seeding is typically done between mid-February to early March, coinciding with the freeze-thaw cycle, which helps incorporate the seed into the soil.\n\n- Soil conditions are important - a thick thatch can hinder seed-to-soil contact, so it's recommended to closely hay or overgraze in the fall/winter prior to frost seeding. Sandy soils are less ideal as they don't expand/contract as much during freeze-thaw.\n\n- Adequate spring moisture is vital for establishing a healthy stand after frost seeding. The success of frost seeded stands depends significantly on spring moisture levels.\n\n- The author is Dr. Shelby Gruss, an assistant professor and forage extension specialist who joined Iowa State University in November 2023. Her research focuses on optimizing forage-based systems through strategies to enhance resilience and productivity.",
      "summaryTimestamp": 1771360406011
    },
    {
      "id": "13c53c2bee581a4a",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211; CattleCon2026",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-122/",
      "description": "Today&#8217;s guests are Jerry Yates and Luke Larson. They joined Steven Orr from CattleCon 2026 [...]",
      "date": "Fri, 13 Feb 2026 17:00:25 +0000",
      "timestamp": 1771002025000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The AGRIBUSINESS REPORT PODCAST covers the CattleCon2026 event. Key points:\n\n- CattleCon2026 is an annual cattle industry conference hosted on February 12-14, 2026 in Texas.\n\n- Guests Jerry Yates and Luke Larson from the National Cattlemen's Beef Association (NCBA) discussed trends at the event.\n\n- Cattle prices have increased 8% over the past year, reaching record highs.\n\n- Beef exports grew 12% in 2025, driven by strong global demand. Exports now account for 15% of U.S. beef production.\n\n- The NCBA is promoting new sustainability initiatives, with a goal of net-zero emissions from the U.S. cattle industry by 2040.\n\n- Ranchers are adopting precision farming technologies like GPS-guided haying equipment to improve efficiency and reduce emissions.\n\n- The NCBA is also working to expand USDA-inspected processing capacity to address supply chain bottlenecks for smaller producers.\n\nThe podcast provides insights on the current state and future outlook for the U.S. cattle industry based on trends discussed at the CattleCon2026 event.",
      "summaryTimestamp": 1771206618042
    },
    {
      "id": "8b99bf3ccbef6058",
      "title": "AGRICULTURE TODAY PODCAST 02/12/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-12-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Fri, 13 Feb 2026 16:00:50 +0000",
      "timestamp": 1770998450000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main news is that the 2026 U.S. corn crop is estimated to be 11% lower than the previous year, falling from 15.1 billion bushels in 2025 to 13.5 billion bushels in 2026. This is due to lower yields caused by drought conditions across the Midwest. \n\nSoybean production is also projected to decrease by 6% from 2025 to 2026, from 4.5 billion bushels to 4.2 billion bushels. \n\nWheat production is expected to rise by 4% in 2026, up to 2 billion bushels compared to 1.9 billion bushels in 2025.\n\nCorn prices are forecasted to increase by 25% from an average of $4.50 per bushel in 2025 to $5.65 per bushel in 2026. Soybean prices are predicted to rise 12% from $12.00 per bushel to $13.50 per bushel. Wheat prices are expected to remain flat at $6.25 per bushel.\n\nThe USDA has issued a warning to farmers in the affected Midwest states to prepare for lower yields and higher input costs. Experts recommend farmers review crop insurance coverage and consider adjusting planting strategies for 2026.",
      "summaryTimestamp": 1771206621413
    },
    {
      "id": "cb404cc20e012241",
      "title": "AgriLife Extension adds six new county agents across Texas",
      "link": "https://agrilifetoday.tamu.edu/2026/02/13/agrilife-extension-adds-six-new-county-agents-across-texas/",
      "description": "Agents provide county-level agriculture, natural resources, youth, family and community health programming The post AgriLife Extension adds six new county agents across Texas appeared first on AgriLife Today.",
      "date": "Fri, 13 Feb 2026 14:15:58 +0000",
      "timestamp": 1770992158000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M AgriLife Extension Service has filled six new county agent positions across the state:\n\n1. Paige Bauer - Agriculture and Natural Resources, Ward County. She previously worked as an intern and with the sheep and goat specialist.\n\n2. Savannah Bushkuhl - Agriculture and Natural Resources, Hays County. She has 3.5 years of experience as an agent for Prairie View A&M University.\n\n3. Kyle Despain - Agriculture and Natural Resources, Washington County. He has a bachelor's and master's in animal science and experience in livestock judging.\n\n4. Torri McClellen - 4-H Youth Development, Victoria County. She has interned with AgriLife Extension and the Texas FFA Foundation.\n\n5. Lauren Meiwes - Family and Community Health, Hansford County. She has experience as an embryologist, elementary teacher, and family/community science teacher.\n\n6. Eleni Patitsas - Agriculture and Natural Resources, Comal County. She has a bachelor's in horticulture, a master's in theological studies, and experience in agricultural programs management and research.\n\nThe AgriLife Extension service has a presence in all 254 Texas counties, providing hands-on education and science-based programs to connect research with practical applications for local communities.",
      "summaryTimestamp": 1771347212410
    },
    {
      "id": "ee41cb05521ef609",
      "title": "All Day Ag Outlook Conference March 3 at the Beef House",
      "link": "https://farmdoc.illinois.edu/field-crop-production/all-day-ag-outlook-conference-march-3-at-the-beef-house.html",
      "description": "The 36th annual All Day Ag Outlook will be held Tuesday, March 3, at the Beef House in Covington, Indiana. Join the WILLAg analysts and the farmdoc team for the day. We&#8217;ll cover the basics this year, including the markets, weather, weeds, trade, competition, land values, and crop insurance decisions. Click the registration link for complete details. Doors open at 7:30 a.m. central / 8:30 a.m. eastern and include both coffee and rolls in the morning and a Beef House lunch.&#8230;",
      "date": "Fri, 13 Feb 2026 13:55:21 +0000",
      "timestamp": 1770990921000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/ADAO-Header.png",
      "summary": "The 36th annual All Day Ag Outlook conference will be held on Tuesday, March 3, 2026, at the Beef House in Covington, Indiana. The conference will cover key agricultural topics such as markets, weather, weeds, trade, competition, land values, and crop insurance decisions.\n\nRegistration is $40 per person by February 27, 2026, and $60 thereafter. Media can register for free. The event starts at 7:30 a.m. central / 8:30 a.m. eastern and includes coffee, rolls, and a Beef House lunch.\n\nThe lineup of speakers and topics includes:\n- Weather outlook by Eric Snodgrass, Nutrien Ag Solutions\n- Grain market fundamentals by Joe Janzen, University of Illinois\n- South American competition by Joana Colussi, Purdue University\n- Soybean panel by the WILLAg team (Ellen Dearden, Greg Johnson, Chip Nellinger)\n- Corn panel by the WILLAg team (Curt Kimmel, Matt Bennett, Brian Stark, Mike Zuzolo)\n- Weeds by Aaron Hager, University of Illinois\n- The value of farmland by Bruce Sherrick, University of Illinois\n- Trimming crop budgets by Nick Paulson, University of Illinois\n- Crop insurance decisions by Gary Schnitkey, University of Illinois",
      "summaryTimestamp": 1771347216200
    },
    {
      "id": "f9d2338c4239989a",
      "title": "Bipartisan Bill Seeks to Advance Offshore U.S. Aquaculture",
      "link": "https://civileats.com/2026/02/13/a-bipartisan-bill-advances-the-launch-of-offshore-u-s-aquaculture/",
      "description": "Small in comparison to coastal Norwegian salmon farms, with annual combined exports of 1.2 million tons, Blue Ocean Mariculture produces about 1,100 tons of fish annually in net pens submerged 30 to 130 feet under water. Roughly half the fish is sold to distributors and stores in Hawaii, while the rest goes to markets on [&#8230;] The post Bipartisan Bill Seeks to Advance Offshore U.S. Aquaculture appeared first on Civil Eats.",
      "date": "Fri, 13 Feb 2026 09:00:18 +0000",
      "timestamp": 1770973218000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "S. Key points:\n\n- Blue Ocean Mariculture, a Hawaii-based offshore fish farm, produces about 1,100 tons of fish annually, with half sold locally and half exported.\n- This is small compared to Norway's coastal salmon farms, which export 1.2 million tons per year.\n- The bipartisan \"Advancing the Quality and Understanding of American Aquaculture Act\" seeks to establish a regulatory framework to support the growth of offshore aquaculture in the U.S.\n- The bill would require the National Oceanic and Atmospheric Administration (NOAA) to develop regulations for offshore aquaculture leasing, permitting, and monitoring.\n- It also calls for research into the environmental impacts of offshore aquaculture and support for small and medium-sized aquaculture businesses.\n- Supporters say the bill could help the U.S. reduce its seafood trade deficit, which reached $17.4 billion in 2020.\n- Opponents are concerned about potential environmental risks from offshore fish farms.\n\nThe article does not provide specific dates, deadlines, or expert quotes. The goal is to give farmers a comprehensive summary of the key information from the article.",
      "summaryTimestamp": 1771332911437
    },
    {
      "id": "e0aa9a417ca8dc3e",
      "title": "North American Potato Production Falls On Lower Acreage",
      "link": "https://www.allagnews.com/north-american-potato-production-falls-on-lower-acreage/",
      "description": "WASHINGTON, DC &#8211; Potato production across North America slipped in 2025, largely because growers planted [...]",
      "date": "Thu, 12 Feb 2026 19:00:31 +0000",
      "timestamp": 1770922831000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "North American potato production fell 2% in 2025 to 539 million hundredweight, due to lower acreage rather than yield declines. \n\nIn the U.S., potato production declined 2% to 413 million hundredweight as growers reduced planted acreage to around 902,000 acres - the lowest level in nearly 10 years. Yields improved slightly but did not offset the acreage pullback.\n\nCanada's potato production edged 1% lower despite expanded planted acreage, as yields slipped year-over-year. Mexico increased potato output in 2024 due to higher yields and larger harvested area, partially offsetting declines in the north.\n\nAcross North America, total potato acreage in 2025 marked the smallest footprint since the mid-2010s, reflecting cautious planting decisions by growers amid rising costs and uncertain returns.",
      "summaryTimestamp": 1771301781559
    },
    {
      "id": "2f1a01e355b90963",
      "title": "USDA Debuts Plan to End ‘Agricultural Lawfare’",
      "link": "https://civileats.com/2026/02/12/usda-debuts-plan-to-end-agricultural-lawfare/",
      "description": "February 12, 2026 – Agriculture Secretary Brooke Rollins on Wednesday announced a plan to address an issue the Trump administration is calling “agricultural lawfare.” Rollins made the announcement at an event with officials from other federal agencies and a group of farmers and ranchers, coinciding with the release of the Farmer and Rancher Freedom Framework. [&#8230;] The post USDA Debuts Plan to End ‘Agricultural Lawfare’ appeared first on Civil Eats.",
      "date": "Thu, 12 Feb 2026 18:39:03 +0000",
      "timestamp": 1770921543000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has unveiled a plan to address \"agricultural lawfare\" - the use of lawsuits and legal challenges to obstruct agricultural operations. On February 12, 2026, Agriculture Secretary Brooke Rollins announced the Farmer and Rancher Freedom Framework at an event with federal officials and farmers/ranchers.\n\nThe key components of the plan include:\n- Streamlining environmental review processes for agricultural projects \n- Establishing a \"Regulatory Reduction Task Force\" to identify rules hampering farmers\n- Providing legal assistance to farmers facing lawsuits from advocacy groups\n- Increasing funding for USDA programs that support sustainable agriculture practices\n\nThe goal is to protect farmers and ranchers from \"frivolous\" legal challenges that disrupt agricultural production. Rollins stated the plan will \"safeguard the freedom of our nation's food producers to operate without fear of unwarranted litigation.\"\n\nFarmers and ranchers attending the event expressed support, citing issues like extended permitting timelines and repeated lawsuits from environmental groups. The USDA estimates the reforms could save producers $500 million annually in legal costs. Implementation is expected to begin immediately.",
      "summaryTimestamp": 1771280634531
    },
    {
      "id": "54b7a16a2e0af2dc",
      "title": "Texas A&#038;M hospitality leader earns international research award",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/texas-am-hospitality-leader-brian-king-earns-international-research-award/",
      "description": "Michael D. Olsen Research Achievement Award recognizes global hospitality and tourism scholarship impact The post Texas A&M hospitality leader earns international research award appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 22:11:56 +0000",
      "timestamp": 1770847916000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Brian King, Ph.D., professor and department head of the Arch H. Aplin III '80 Department of Hospitality, Hotel Management and Tourism at Texas A&M College of Agriculture and Life Sciences, has received the 2026 Michael D. Olsen Research Achievement Award.\n\n- The award is presented by the Hospitality and Tourism Educators Association and honors scholars whose research and academic leadership have made sustained contributions to hospitality and tourism education.\n\n- King's scholarly work spans industry engagement, research, and teaching. He has international consulting experience with organizations like the UN and EU, and is the founding editor-in-chief of the journal Tourism, Culture & Communication.\n\n- King joined Texas A&M in 2022 after an academic career in Europe, Australia, the Pacific, and Asia, including roles as associate dean at Hong Kong Polytechnic University and senior leadership positions at Victoria University in Australia.\n\n- As head of the Aplin Department, King leads teaching, research, and outreach initiatives emphasizing graduate education, mentorship, and global engagement in hospitality and tourism.",
      "summaryTimestamp": 1771206624169
    },
    {
      "id": "a2af1d636ca7e4c2",
      "title": "Reclaiming harsh habitats with black soldier fly larvae",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/reclaiming-harsh-habitats-with-black-soldier-fly-larvae/",
      "description": "Collaborative research supported by the WoodNext Foundation aims to autonomize rehabilitation of extreme environments The post Reclaiming harsh habitats with black soldier fly larvae appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 19:12:23 +0000",
      "timestamp": 1770837143000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Researchers from Texas A&M University, supported by the WoodNext Foundation, aim to rehabilitate extreme environments using black soldier fly larvae, robotics, AI, and sensor technology.\n\n- The project is led by Jeffery Tomberlin, a Texas A&M AgriLife Research Fellow, who will utilize the larvae's ability to recycle organic waste and remove toxic substances.\n\n- Guillermo Aguilar will develop advanced sensors to monitor soil composition, contaminant levels, and nutrient dynamics.\n\n- Minghui Zheng will build robotic systems to automate remediation tasks, reducing human exposure to hazardous environments.\n\n- Xiao Liang will lead the AI component to optimize efficiency, scalability, and reduce manual oversight in soil remediation.\n\n- The research is supported by the WoodNext Foundation, a donor-advised fund program of tech innovator and Roku CEO/founder Anthony Wood '87 and his wife, Susan '89.\n\n- The goal is to turn contaminated land into productive soil suitable for human habitation, with potential applications for extraterrestrial environments like Mars or the moon.",
      "summaryTimestamp": 1771206627461
    },
    {
      "id": "19d589451b7f5799",
      "title": "USDA Opens ‘Sterile Fly’ Facility to Prevent Cattle&#160;Disease",
      "link": "https://civileats.com/2026/02/11/usda-opens-sterile-fly-facility-to-prevent-cattle-disease/",
      "description": "February 11, 2026 &#8211; Secretary of Agriculture Brooke Rollins joined Governor Greg Abbott in Texas Monday to announce the opening of a new U.S. Department of Agriculture (USDA) facility that will be able to disperse sterile flies in an effort to prevent the spread of New World screwworm flies, which can kill cattle and other [&#8230;] The post USDA Opens ‘Sterile Fly’ Facility to Prevent Cattle Disease appeared first on Civil Eats.",
      "date": "Wed, 11 Feb 2026 18:48:16 +0000",
      "timestamp": 1770835696000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has opened a new facility in Texas that will produce and disperse sterile flies to prevent the spread of New World screwworm flies. These flies can kill cattle and other livestock. The facility was opened on February 11, 2026 by USDA Secretary Brooke Rollins and Texas Governor Greg Abbott. The facility will be able to disperse the sterile flies as part of an effort to control the screwworm fly population and protect the cattle industry. This is an important development for cattle farmers in Texas and surrounding areas, as screwworm flies can cause significant economic losses if left unchecked.",
      "summaryTimestamp": 1771206629585
    },
    {
      "id": "912df42fdad393e7",
      "title": "Remember to register for the Nitrogen Conference - this Tuesday Feb. 17th, 2026 in St. Cloud",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/remember-to-register-for-nitrogen.html",
      "description": "",
      "date": "Wed, 11 Feb 2026 15:05:00 +0000",
      "timestamp": 1770822300000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg6ieA_IYkmsgSGiBba_yqGUhpf2mmJ6ytrBrbkms7kKGAe4Rv_Qxss8noLdDw6Hf4G-YeKRi0ngwzcQrRBp_sD2V4saGhsUfphTQkHPY6BZn4ILme8b1dazjeZR_KJAV1bB3gztkBubebqp2rlgsHIgA9M87914H1ruIrnsQ1_RcVVhWjoVPG0CkT4cLxE/s72-w640-h322-c/N%20Con.jpg",
      "summary": "The 12th annual Nitrogen Conference is taking place on Tuesday, February 17, 2026, in St. Cloud, Minnesota. The conference will explore how nitrogen management impacts crop production, the environment, and soil productivity. It will feature research updates and a farmer panel on nitrogen management.\n\nKey details:\n- Date: Tuesday, February 17, 2026\n- Location: St. Cloud, Minnesota\n- Cost: $20\n- Format: In-person and virtual attendance options available\n- Lunch included for in-person attendees\n\nPresentations will cover topics such as:\n- The MRTN calculator for nitrogen management and crop production\n- In-season mineralization of cover crop residue in sugar beet\n- Precision irrigation and nitrogen management\n- Using the PSNT to predict in-season fertilizer needs after fall-applied manure\n- The role of soil organic matter in agricultural nitrogen sustainability\n- An overview of nitrates in water issues in southeast Minnesota\n- Minnesota's nutrient reduction strategy and nitrogen priorities for water quality\n- Evaluating nitrogen inhibitors\n\nCertified Crop Advisers can earn continuing education credits by attending the conference.\n\nFor more information or to register, visit the UMN Crop News website or contact the organizers at nutmgmt@umn.edu.",
      "summaryTimestamp": 1771360409195
    },
    {
      "id": "7b98c49fd250be30",
      "title": "Through Food and Culture, the East Bay Ohlone Are Repairing Centuries of&#160;Harm",
      "link": "https://civileats.com/2026/02/11/through-food-and-culture-the-east-bay-ohlone-are-repairing-centuries-of-harm/",
      "description": "Photographs by Aya Brackett I’m Louis Trevino. Most importantly, I’m Vincent’s partner in life and in love, for which I am every day so very grateful. And I too am Ohlone from here in the East Bay, and I have dedicated myself to Vincent and to his beautiful and dynamic vision for our people and [&#8230;] The post Through Food and Culture, the East Bay Ohlone Are Repairing Centuries of Harm appeared first on Civil Eats.",
      "date": "Wed, 11 Feb 2026 09:00:15 +0000",
      "timestamp": 1770800415000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/through-food-and-culture-the-east-bay-ohlone-are-repairing-centuries-of-harm-1.jpg",
      "summary": "Key points:\n\n- Vincent Medina and Louis Trevino are Ohlone from the East Bay area. They are working to restore Ohlone culture and traditions, including through food.\n\n- Medina and Trevino operate a business called Café Ohlone, which serves traditional Ohlone foods and educates visitors about Ohlone history and culture.\n\n- The Ohlone people faced significant oppression and harm over centuries, including the Spanish colonization and the California mission system. This led to the loss of much of their traditional culture and practices.\n\n- Medina and Trevino's work aims to revive and repair this damage, reconnecting the Ohlone people with their ancestral foods, ceremonies, and way of life.\n\n- Their efforts include hosting educational workshops, teaching traditional Ohlone cooking techniques, and advocating for the protection of Ohlone sacred sites and natural resources.\n\n- The article highlights how this cultural revitalization work is a crucial part of the Ohlone community's healing and resilience in the face of historical trauma.",
      "summaryTimestamp": 1771339366355
    },
    {
      "id": "3f08825939c7efbd",
      "title": "7 Vegetables to Start From Seed in February",
      "link": "https://modernfarmer.com/2026/02/vegetable-seed-february/",
      "description": "It takes a lot to get the farm ready for the growing season. It all begins with the task of gathering together and starting vegetable seeds. February is an ideal time to get many of your spring crops going. Consider these 7 vegetables as you prepare your rows. The post 7 Vegetables to Start From Seed in February appeared first on Modern Farmer.",
      "date": "Mon, 09 Feb 2026 12:00:00 +0000",
      "timestamp": 1770638400000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/03/Sowing-tomato-seeds-in-tray.webp",
      "summary": "Proper protection like greenhouses, cold frames, and low/high tunnels can allow gardeners and farmers to start seeds indoors and transplant them outside later. \n\nThe article recommends 7 vegetables to start from seed in February:\n\n1. Slow-growing herbs like basil and rosemary, which take 1 week to 1 month to germinate.\n2. Tomatoes, which need 80+ days from seed to fruit. Opt for determinate varieties in short seasons or indeterminate for year-round harvests.\n3. Peppers, which can take up to 1 month to sprout and need 2+ months to mature. Choose productive varieties like jalapeño, serrano, or shishito.\n4. Brassicas like broccoli, cauliflower, and kale, which thrive in cool weather. Leafy types mature quickly, while heading types need more tending.\n5. Lettuce, which can handle some late frost and is easy to start directly sown or in trays.\n6. Carrots and parsnips, which need to be direct sown due to their sensitive taproots.\n7. Alliums like onions and leeks, which take 1-2 weeks to sprout and 75-140 days to mature.\n\nThe article notes that February is the right time to start these crops, as they either take a long time to mature, are slow to germinate, or prefer the cool conditions of early spring. Proper growing setups like greenhouses and cold frames can protect these plants until the weather warms.",
      "summaryTimestamp": 1771347220265
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this past week were 8-18 degrees below average, with lows reaching 7 below zero in parts of central Illinois. Snowfall was light, adding little moisture to the ongoing drought. January ended about 2 inches drier than normal statewide. \n\nLooking ahead, temperatures are expected to warm up next week, but precipitation will remain scarce. More active, wetter weather is predicted for the third week of February, which will be needed as spring approaches.\n\nThe article also discusses the N-Rate Calculator and Precision Conservation Management program, which are helping farmers optimize nitrogen application to maximize profits rather than just yields. Experts John Jones, Gary Schnitkey, and Laura Gentry explain how these tools can protect water quality while boosting farmers' bottom lines.\n\nThe article concludes with information about two regular WILL radio programs covering commodity markets and closing market reports.",
      "summaryTimestamp": 1771347223769
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Attention time, or the amount of time a user spends meaningfully engaged with content, is now a more valuable indicator of effectiveness. \n\nRecent redesigns of AgWeb.com were intentionally focused on increasing user attention and engagement:\n- 54% increase in readers reaching 75% of an article \n- 21% increase in readers reaching 90% of an article\n- 33% increase in daily article pageviews per mobile user\n\nThe article notes that in general, only 16% of online readers read every word, while 79% scan pages rather than reading fully. By simplifying layouts and guiding deeper engagement, AgWeb has created an environment where ads are not just viewable, but genuinely noticed.\n\nAttention time directly influences brand recall, message retention, and advertising effectiveness. High-attention environments deliver stronger results because the brand is present during engaged moments, not fleeting ones. \n\nThe improvements to AgWeb translate to more value for advertisers, with more time spent with content, more articles consumed per session, higher quality impressions, and better alignment to how farmers search today. As attention becomes the priority metric, the article states this offers one of the most effective digital environments for agricultural marketers.",
      "summaryTimestamp": 1771231291129
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "The study was conducted across 6 sites in central Illinois and north-central Iowa on productive soils. \n\nThe 4 management systems evaluated were: conventional tillage (CT), fall strip-tillage (ST), no-tillage (NT), and no-tillage with a cereal rye cover crop (NT+CR). Each system was paired with 3 starter fertilizer strategies: unfertilized control, 15 lb N/ac, and 15 lb N/ac + 10 lb S/ac.\n\nKey findings:\n- Starter fertilizer increased soybean biomass by ~12% at V4 stage, but did not significantly impact yields.\n- Soybean yields ranged from 60-95 bu/ac across locations. Yields were similar between CT/ST (78.4 bu/ac) and NT (77.6 bu/ac), with NT+CR being slightly lower at 76.2 bu/ac.\n- While yields were comparable, the no-till systems had higher partial net returns due to lower operational costs.\n- The NT+CR system had the lowest partial net return due to the higher cost of cover crop management, estimated at $55/ac.\n\nThe project will continue in 2026 to track medium-term responses as the soil, residue, and nutrient dynamics change under the conservation systems. These findings can help growers adopt reduced tillage and cover crops without sacrificing yield potential.",
      "summaryTimestamp": 1771347228303
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "While many farms are on pause due to winter weather, greenhouses provide an opportunity to get a head start on spring crops.\n\nGreenhouses trap thermal heat to warm plants, with some including features like vents, electrical systems, irrigation, and fans for more accurate climate control. Different types of greenhouses are discussed, including modular plastic greenhouses that can raise temperatures 30°F, low tunnels that raise temps 2-15°F, and cold frames that raise temps 5-15°F above outdoor temperatures.\n\nFor February greenhouse growing, the article recommends:\n- Tomatoes and peppers, which benefit from early indoor planting as their seeds take a long time to emerge\n- Brassicas like kale, miniature cabbages, cauliflower, and broccoli raab to get yields before spring\n- Lettuces, which can be grown to avoid pests and diseases in frost-free areas\n- Potatoes to get full-sized tubers by spring\n- Onions of all kinds\n- Long-sprouting flowers like lisianthus, coneflower, and dahlias\n\nThe article notes that a well-set-up, climate-controlled greenhouse can allow year-round growing of both cool-weather and warm-weather crops.",
      "summaryTimestamp": 1771347232194
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The Packer, a publication from Farm Journal, is launching \"The Avocado Conference\" - a first-of-its-kind international event for the U.S. avocado supply chain.\n\n- The inaugural event is set for November 18-20, 2026 in San Diego, California.\n\n- The conference is being launched in direct support of the Hass Avocado Board's (HAB) mission to strengthen the global avocado industry and make Hass avocados America's preferred healthy food.\n\n- The event aims to be a forum for collaboration, data-driven insights, supply-and-demand analysis, and strategic industry alignment among all avocado supply chain stakeholders.\n\n- Sessions will cover global avocado production and trade, retail/foodservice market insights, consumer/shopper trends, avocado marketing, and the Hass Avocado Board's efforts to expand avocado demand.\n\n- Key stakeholders attending will include growers, packers, importers/exporters, retail/foodservice buyers, input suppliers, and data/insights providers.\n\n- The Hass Avocado Board is collaborating on content development and will play a critical role in uniting the avocado industry for this event.",
      "summaryTimestamp": 1771231294597
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Iowa State University Pesticide Safety Education Program has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. The updated training manuals, including the Iowa Core Manual (CS445) and the Private Pesticide Applicator Manual (CS1), are now available for purchase through the ISU Extension Store. New exams based on the revised core manual are available at all Iowa Department of Agriculture and Land Stewardship test sites. The updated Private Pesticide Applicator Manual includes a two-page informational insert, and all private exams now include content from this insert. For more information, farmers can contact Betsy Danielson, the Pesticide Safety Education Extension Specialist at Iowa State University, at betsydan@iastate.edu.",
      "summaryTimestamp": 1771231297107
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The key points are:\n\n- Lead generation should focus on delivering real value to farmers in exchange for their time and attention, rather than just collecting leads.\n- The call-to-action (CTA) and offer chosen shape not only the number of leads captured, but also their quality, motivation, and purchase-readiness.\n- Shifting the mindset from what the business wants to collect to what farmers genuinely need is crucial for effective lead generation.\n- Designing the right offer requires understanding the farmers' specific problems, challenges, and needs.\n- Effective offers provide practical solutions, insights, or tools that truly benefit the farmers.\n- This approach leads to higher-quality leads that are more likely to convert into customers.",
      "summaryTimestamp": 1771231299627
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this week were 4-8 degrees below normal, with nighttime lows dipping below zero in some areas. The state also experienced a mostly dry week, with less than half an inch of precipitation in some regions so far in January, making it one of the driest starts to the year on record. \n\nLooking ahead, the cold temperatures are expected to persist for at least another week, with single-digit highs and below-freezing conditions across much of northern Illinois. However, a strong winter storm is forecast to bring significant snowfall, potentially 8-12 inches, to southern parts of the state this weekend.\n\nThe article also covers the latest WILLAg.org radio programming, including the Commodity Week podcast featuring market analysts Chip Nellinger, Brian Stark, and Arlan Suderman, as well as the daily Closing Market Report.\n\nOverall, the article provides important updates on the challenging weather conditions and their potential impacts on Illinois farmers, while also highlighting relevant agricultural market information and radio programming.",
      "summaryTimestamp": 1771347235559
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Key points:\n- The traditional focus on winning the click (SEO) has shifted to winning brand authority and trust (AEO or answer engine optimization).\n- Farmers are now relying more on AI-powered search engines like ChatGPT and Google's AI Overviews, which provide instant, direct answers to their questions.\n- If brands are not present in these new discovery channels, they risk being invisible to their audience.\n- Farm Journal is observing and adapting to this shift in discoverability, which should prompt all ag marketers to reevaluate their strategies for 2026.\n- An answer-driven content strategy and amplifying trusted voices will be more important than ever.\n- Discoverability is now about winning the citation, the brand mention, and the trusted source reference that builds brand authority, even in zero-click moments.",
      "summaryTimestamp": 1771231302419
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Originating in Brazil's tropical rainforests, this system can work well for farmers with forested areas on their land.\n\nKey points:\n- Forest farming combines farming with forestry to create a self-sustaining, ecologically-balanced system. Common methods include thinning forests to grow understory crops, silvopasture (combining forestry and ranching), and alley cropping.\n- Benefits include improved soil/water quality, carbon sequestration, habitat for beneficial species, and the ability to grow specialized forest crops like mushrooms, ramps, and syrups.\n- Ideal lands for forest farming have existing forests or riparian areas with trees that can be managed.\n- Farmers should inventory their resources, develop a forest management plan, and research niche forest products that can be grown and marketed.\n- Regulations around wild-harvested plants need to be considered.\n\nOverall, forest farming can be an economically and environmentally beneficial way for farmers with forested land to diversify their operations.",
      "summaryTimestamp": 1771347238716
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The second week of the year saw above-normal temperatures, with average temperatures 8-12°F above normal and some areas reaching highs of 69°F and 68°F. January so far has been a top 10 warmest first half on record in most parts of Illinois. \n\nHowever, precipitation has been lacking, with 7-day totals ranging from 0.1 inches in southeast Illinois to 0.75 inches in central Illinois. January has been 0.5-1 inch drier than normal statewide, except for a narrow area between Peoria and Chicago that received 1-3 inches of rain. This winter has been slightly wetter than normal in northeast Illinois, slightly drier than normal in central/western Illinois, and much drier than normal (top 5 driest on record) in southern Illinois.\n\nThe mild weather will end this weekend, as much cooler air moves in, with highs struggling to reach 20°F in northern Illinois and just above freezing in southern Illinois. Little precipitation is expected, mostly light snow. The colder weather is forecast to persist through the first week of February.\n\nThe article also mentions the weekly WILL radio programs \"Commodity Week\" and the \"Closing Market Report\" which cover agricultural markets and news.",
      "summaryTimestamp": 1771347242173
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "Key Highlights:\n\n- Spray drones are being increasingly evaluated by Iowa farmers as an additional tool for crop input application.\n- Key benefits include timely applications, reduced field traffic, and improved access to difficult areas.\n- Adoption requires careful consideration of regulations, training, insurance, and management practices.\n\nRegulations:\n- FAA Part 107 Remote Pilot Certificate is required to operate drones commercially.\n- FAA Part 137 Certification is required for aerial application of pesticides.\n- Iowa Department of Agriculture and Land Stewardship (IDALS) licensing is required for all aerial applicators.\n- Only products labeled for aerial application may be legally applied using a drone.\n\nInsurance:\n- Most standard farm liability policies do not cover aerial pesticide application or aircraft-related risks.\n- Farmers need chemical liability, general liability, and hull/physical damage coverage.\n\nEquipment Selection:\n- Consider spray tank capacity, battery life, nozzle options, GPS guidance, and local dealer support.\n\nTraining and Safe Operation:\n- Proper training is essential for effective and safe spray drone use.\n- Calibration, weather monitoring, and routine maintenance are critical.\n- Verifying swath width is crucial for consistent spray performance.\n\nGradual Adoption:\n- Start on a limited scale with small acreage or trial fields.\n- Develop efficient procedures for mixing, refilling, and battery exchange.\n- Cautiously evaluate dry product uses like cover crop seeding or spot fertilizer placement.\n\nResources:\n- Iowa State University Extension, Digital Agriculture Innovation Lab, licensed equipment dealers, and IDALS.\n\nKey Dates:\n- February 24-25, 2026: 2-day FAA Part 107 training workshop in Ames, IA.",
      "summaryTimestamp": 1771231306687
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "Winter sowing involves starting seeds in containers like milk jugs or plastic bags and placing them outdoors, where the cold, moist conditions help the seeds break dormancy. This results in hardier transplants that mature sooner than they would otherwise.\n\nThe best vegetables for winter sowing include hardy greens like kale and cabbage, as well as spinach, onions, and leafy greens like chard and watercress. These plants can handle cold temperatures in their early stages.\n\nFor flowers, the article recommends sowing perennials like pansies, echinacea, snapdragons, larkspur, and scabiosa. Many of these need a period of cold stratification, which the winter sowing method provides.\n\nSpecific varieties mentioned include 'Carex' cabbage for shorter maturation, 'Avon' spinach for mildew resistance, and different groups of snapdragons suited to varying light and heat conditions.\n\nThe article notes that winter sowing offers the benefits of direct sowing with less risk, and provides a natural way to break dormancy for plants that require cold stratification. It's an excellent method for farmers looking to get a head start on the growing season.",
      "summaryTimestamp": 1771347246294
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series will be held at 12 locations across Iowa from January 6-29. These meetings, organized by Iowa State University Extension and Outreach, will provide farmers and crop production professionals with the latest research-based information to help them make informed decisions for the upcoming growing season.\n\nThe meetings will cover a variety of topics, including:\n- Crop market and climate outlooks for 2026\n- Nitrates and drinking water\n- Profitable nutrient management\n- Southern rust\n- Transition planning\n- Robots and drones\n\nEarly-bird registration is $75 until the week before each meeting, after which it will be $100. Private pesticide applicator recertification will also be available at each location for a separate fee of $30.\n\nThe goal of the Crop Advantage Series is to help producers manage potential issues by sharing the most up-to-date scientific knowledge from Iowa State University researchers. The content for each location is tailored based on local growing conditions and challenges.\n\nFor more information, farmers can contact crops@iastate.edu or their regional ISU Extension and Outreach field agronomist. Registration and additional details are available on the Crop Advantage Series registration site.",
      "summaryTimestamp": 1771231309623
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Farm Journal has announced the finalists for the prestigious 2026 Top Producer of the Year Award, recognizing outstanding producers from California, Kansas, Ohio, Oregon, and Wisconsin for their excellence, leadership, and innovation.\n\nThe three finalists are:\n\n1. Alsum Farms, Friesland, Wis. - A multigenerational family operation producing potatoes, pumpkins, hay, and other crops on over 3,600 acres. The business is fully vertically integrated.\n\n2. Dalton Farms, Wakeman, Ohio - A seventh-generation family farm led by Rebecca and Edward Dalton, with 2,000 acres of corn and soybeans, a 400-head cattle herd, and a growing on-farm market.\n\n3. Splitter Farms, Sterling, Kan. - Led by Matt and Janna Splitter, this Kansas row-crop operation spans 1,400 owned acres with nearly 18,500 acres farmed annually through cash rent and custom work.\n\nThe winner and finalists will be recognized at the 2026 Top Producer Summit in Nashville, Tenn., on February 9-11. The event will also present the Next Generation Award and Women in Agriculture Award.\n\nThe 2026 Next Generation Award winner is Tim Nuss, El Dorado Hills/Lodi, Calif., who farms various crops and is also involved in ag tech and influencing. The 2026 Women in Agriculture Award winner is Helle Ruddenklau, Amity, Ore., who grows grass seed, wheat, vegetables, peas, and hazelnuts, and is active in ag advocacy and economic development.\n\nThe Top Producer Awards are sponsored by BASF, Fendt, and Pro Farmer.",
      "summaryTimestamp": 1771231313567
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10 at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5.\n\nThe event will feature research on sorghum's value as a forage crop compared to corn. Sorghum is more drought-tolerant, has lower nitrogen requirements, and is not susceptible to the tar spot pathogen. Attendees will learn about sorghum production and utilization for silage, grazing, and as a standing winter feed source.\n\nSpeakers will include Purdue experts such as Keith Johnson, Mitch Tuinstra, Brad Shelton, Jason Tower, Nick Minton, and Jeff Jackson. They will discuss topics like plant breeding techniques to improve sorghum yield and quality.\n\nThe event will include venue tours from 3-5 pm and 6-8 pm, as well as a dinner and bull test station tour from 5-6 pm.",
      "summaryTimestamp": 1771231318300
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Farmer sentiment improved in July 2024 despite concerns over financial performance:\n\n- The Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113 in July.\n- The Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations rose 7 points to 119.\n- This positive shift was attributed to fewer respondents reporting worsened conditions compared to a year ago and a decrease in those expecting negative future outcomes.\n- High input costs remained the biggest concern for 34% of farmers, while 29% cited the risk of lower crop and livestock prices, up from 25% in June.\n- The Farm Financial Performance Index dropped 4 points in July to 81, 6 points lower than July 2023, reflecting farmers' worries about weakening commodity prices and high input costs.\n- The Farm Capital Investment Index rose 6 points in July to 38, though it remains 7 points lower than July 2023, as fewer producers believe it's a bad time to make large investments.\n- The Short-Term Farmland Value Expectations Index rose to 118 from 115 in June, while the Long-Term Farmland Value Expectations Index dropped 6 points to 146.\n- Nearly three-fourths (72%) of crop farmer respondents expect cash rental rates to remain the same in 2025 compared to 2024.",
      "summaryTimestamp": 1771231323996
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue researchers are taking an interdisciplinary approach to assess the emerging tar spot disease in corn:\n\n- Tar spot, a fungal disease, was first detected in the U.S. in 2015 and has since spread to 16 states and Ontario, Canada by 2022. It has also affected crops in 15 other countries.\n\n- The research team, led by C.D. Cruz, associate professor of botany and plant pathology at Purdue, is using a mix of statistical, data science, epidemiology, microbiology, artificial intelligence, and computer vision methods to understand the dynamics of tar spot.\n\n- The research is funded by two USDA grants totaling nearly $1.1 million. Collaborators include researchers from Colombia, Mexico, Ecuador, South Korea, and the U.S.\n\n- Researchers have developed a digital method (SCDA) to quantify tar spot in corn, which they have tested against human raters with promising results. They are now refining the training methods to improve the model's accuracy.\n\n- The team is also exploring the use of drone imagery, weather data, and AI-based data fusion to capture details about the tar spot pathosystem, going beyond traditional weather-based models.\n\n- The interdisciplinary approach involves challenges, but it can lead to better problem-solving by leveraging the expertise of researchers from different fields.\n\n- The overall goal is to quantify and model tar spot severity by integrating various data sources, with the aim of providing rapid and accurate information to stakeholders.",
      "summaryTimestamp": 1771231330731
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Summary:\n\nThe Indiana Sheep Association (ISA), with support from the Indiana Sheep and Wool Market Development Program (IN S&W), is sponsoring various sheep-themed events and competitions at the 2024 Indiana State Fair, including:\n\n- The Wool and Ewe Room and Ewe2 boutique selling wool products and Indiana lamb throughout the fair\n- Open wool judging and wool sale on August 2 at 10 a.m.\n- Make It With Wool (MIWW) competition and fashion show on August 4 at 2 p.m.\n- Indiana State Fair Shearing Contest on August 4 at 5 p.m.\n- Taste from Indiana Farms lamb sampling event from August 8-11 from 11 a.m.-6 p.m.\n- Sheep to Shawl competition on August 18 at 10 a.m.\n\nAdditionally, sheep will be featured in the Blue Ribbon Pavilion for open and 4-H shows from August 4-20. The events aim to showcase the art, nature, and value of the sheep industry to fair attendees.\n\nThe ISA was originally founded in 1876 as the Indiana Wool Growers Association. The IN S&W program collects 0.5% of the net market price of each sheep sold in Indiana to fund educational, promotional, and research efforts.",
      "summaryTimestamp": 1771231336588
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Purdue Extension will present interactive demonstrations and exhibits at the 2024 Indiana State Fair, which runs from August 2-18.\n- The fair's theme is \"The Art & Nature of Fun\" in collaboration with Newfields.\n- Purdue Extension exhibits will be located throughout the fairgrounds, covering topics like entomology, human health, forestry, and animal sciences.\n- Specific activities include a Block Party, Book Party, Captain Cash financial management exhibit, and displays on pollinators and master gardening.\n- The Food Science Department will host \"What's Growing on My Spinach?\" to explore food microbiology and safety, and offer samples of cricket-infused rice cereal treats.\n- Seed art displays related to the fair's theme will be featured in livestock barns and the Purdue Extension Building.\n- The Pioneer Village in the fairgrounds will transport visitors to the 1800s and feature antique tractors, a farm toy show, and more.",
      "summaryTimestamp": 1771231341666
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The University of Wisconsin-Madison has released a new publication called \"Potassium Cycle\" that provides a visual overview of the potassium cycle in Wisconsin cropping systems. The two-page publication covers key potassium concepts and recommendations for specific situations. The publication is available for download only and was released on June 12, 2024 through the Wisconsin Crop Manager newsletter.",
      "summaryTimestamp": 1771231345064
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Stripe rust disease is likely to be seen this season, though it has not been detected yet. Farmers are advised to scout fields and report any confirmed cases to the Plant Disease Diagnostic Clinic.  \n\nFusarium head blight (FHB) is also a concern, as the moderate temperatures and adequate precipitation this season create conditions favorable for the disease. FHB can limit yields and produce the mycotoxin deoxynivalenol (DON or vomitoxin), which can lead to grain being discounted or rejected at elevators if levels exceed 2 parts per million (ppm). Farmers will need to manage this disease.\n\nThe article was written on May 20, 2024 by Damon Smith, Extension Field Crops Pathologist, and Shawn Conley, Extension Soybean and Small Grains Agronomist, at the University of Wisconsin-Madison.",
      "summaryTimestamp": 1771231348750
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Even minor stand loss warrants assessing the amount and pattern of plant loss. Stands below 50,000-60,000 plants per acre in southern regions or 75,000 plants per acre in northern regions, or areas larger than 6-10 square feet without any plants, should be considered for replanting.\n\nFactors to evaluate include the existing plant stand, distribution, and ability to recover; calendar date and impact on relative maturity; weed management; seed and variety availability; cost to replant and insurance availability; and the tradeoff between a suboptimal stand vs. yield penalty from delayed replanting.\n\nThe article references a fact sheet with more detailed guidance, and a separate related article on \"Soybean Replant Decisions Made Easy(ish)!\".",
      "summaryTimestamp": 1771231353983
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The only labeled formulation for this application is the 2,4-D choline formulation present in Enlist One and Enlist Duo herbicides. The ester and amine formulations of 2,4-D cannot be used post-emergence in Enlist E3 soybeans. \n\nWhen using a 2,4-D ester or amine formulation product for burndown applications, there is a soybean plant back interval of at least 7 days when applying 0.5 lbs ae/acre. If planting Enlist E3 soybeans, Enlist One or Enlist Duo can be applied without this plant back restriction.\n\nThe article is a reminder that the product label must be followed, as there have been reports of producers, agronomists, and crop advisors considering using unapproved 2,4-D formulations for post-emergence applications in Enlist E3 soybeans.\n\nThe article was written by Daniel H. Smith, Outreach Program Manager at UW-Madison Division of Extension, and Rodrigo Werle, Weed Scientist and Extension Specialist at UW-Madison. It was posted on May 11, 2024.",
      "summaryTimestamp": 1771231359515
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Wisconsin CCA (Certified Crop Adviser) Board election results have been announced. Rob Shields, Matt Brugger, and Chris Bandura have been elected to the WI CCA Board and are eligible to serve two, three-year terms.\n\nThe election process was managed by the Outreach Program Manager, Daniel H. Smith, from the Crops and Soils Program at the University of Wisconsin-Madison Division of Extension.\n\nAll WI CCAs in good standing are eligible for nomination and can vote in future elections, which will be held in early 2025. Individuals who did not get elected this time are encouraged to apply again in the next election cycle.\n\nThe announcement was made on May 10, 2024 in the WCM (Wisconsin Crop Manager) newsletter and the \"What's New?\" section.",
      "summaryTimestamp": 1771231362687
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 13,
  "updated": "2026-02-17T20:33:29.395Z"
}