{
  "items": [
    {
      "id": "fdf4b0531c07dac5",
      "title": "My Heart in Agriculture...",
      "link": "https://www.morningagclips.com/my-heart-in-agriculture/",
      "description": "..is my pure love of FAMILY. It&#8217;s the joy that fills my heart when I see my children working side-by-side, as brothers, sons, grandsons, nephews, and cousins. Working with family every day, outside, tending the land, and caring for the animals is, and always will be, magic to me. On this Valentine’s Day, when Sam [&#8230;] The post My Heart in Agriculture... appeared first on Morning Ag Clips.",
      "date": "Mon, 16 Feb 2026 01:41:08 +0000",
      "timestamp": 1771206068000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.morningagclips.com/wp-content/uploads/2026/02/Image-1-1-224x300.jpeg",
      "summary": "On Valentine's Day, the author found her children working on the family farm together - her sons, nephews, and cousins. She expressed deep gratitude for being able to work, play, and grow together as a farming family. The author noted that there is no greater feeling than seeing the connection between her family members every day as they tend the land and animals. She feels extremely blessed to have an agricultural life that is grounded in family. \n\nThe article does not contain any specific numbers, prices, statistics, or deadlines. It mentions the following names and organizations: Sam, Tyler, Jacob, and the author Kate. The location referenced is the family's farm. The article provides context around the author's personal experiences and emotions related to her family's involvement in agriculture. \n\nFor farmers, the key impact conveyed is the immense joy and fulfillment that can come from working together as a farming family. There are no direct recommendations or action items provided. However, the overall message is one of deep appreciation and love for the agricultural lifestyle and the bonds it can foster within a family.",
      "summaryTimestamp": 1771206576887
    },
    {
      "id": "95587c84933230ee",
      "title": "Indiana Pork Regional Meeting Dates, Locations Announced",
      "link": "https://www.morningagclips.com/indiana-pork-regional-meeting-dates-locations-announced/",
      "description": "INDIANAPOLIS — Beginning in late-February, Indiana Pork will host a series of regional meetings throughout the state for pork producers. During the meeting, Indiana Pork staff will update attendees on activities of the association as well as local, state, and federal legislative issues. Extended discussion will take place on composting and there will be ample [&#8230;] The post Indiana Pork Regional Meeting Dates, Locations Announced appeared first on Morning Ag Clips.",
      "date": "Sun, 15 Feb 2026 22:24:31 +0000",
      "timestamp": 1771194271000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Indiana Pork Association will be hosting a series of regional meetings for pork producers across the state in late-February and early-March 2026. \n\nThe meetings will provide updates on the association's activities as well as local, state, and federal legislative issues. Extended discussion will focus on composting, and there will be time for questions and answers. A meal is included, and RSVPs are encouraged but walk-ins are welcome.\n\nThe meeting dates and locations are:\n- February 24, 11:30am-1:30pm, Beef 'O'Brady's, Peru\n- February 25, 10am-12pm, Town Square & Community Center, Winchester\n- March 9, 6-8pm, Tree City Brewing, Greensburg\n\nIndiana Pork is a not-for-profit association representing nearly 2,200 family pork farmers in the state through the pork checkoff program.",
      "summaryTimestamp": 1771206579882
    },
    {
      "id": "c1522f48b3a2794c",
      "title": "MSU Launches Innovative Real-World Farming Competition",
      "link": "https://www.morningagclips.com/msu-launches-innovative-real-world-farming-competition/",
      "description": "EAST LANSING, Mich. — Michigan State University (MSU) Extension is excited to bring the Testing Ag Performance Solutions (TAPS) program to Michigan stakeholders. TAPS is an interactive, real-world farm management competition that challenges participants to make practical, data-driven decisions throughout the growing season — just like they would on their own farms. Modeled after successful [&#8230;] The post MSU Launches Innovative Real-World Farming Competition appeared first on Morning Ag Clip",
      "date": "Sun, 15 Feb 2026 22:18:46 +0000",
      "timestamp": 1771193926000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Main news/finding: Michigan State University (MSU) is launching an innovative real-world farming competition called MSU-TAPS (Testing Ag Performance Solutions) to bridge the gap between research and practical farming.\n\nNumbers/prices/statistics/percentages:\n- MSU-TAPS is modeled after successful TAPS programs at the University of Nebraska–Lincoln, Colorado State University, and Kansas State University.\n- The competition will include cash prizes for the most input-efficient and highest-yielding teams.\n\nDates/deadlines:\n- The MSU-TAPS competition will be launched on February 15, 2026.\n- A spring kick-off lunch meeting, a summer field day, and a post-season awards luncheon are planned.\n\nNames of people/organizations/programs:\n- Michigan State University (MSU) Extension\n- Testing Ag Performance Solutions (TAPS) program\n- University of Nebraska–Lincoln, Colorado State University, and Kansas State University\n- Angie Gradiz and Younsuk Dong, MSU Extension\n\nLocations:\n- The competition will take place at MSU's Kellogg Biological Station.\n\nContext/causes:\n- TAPS is an interactive, real-world farm management competition that challenges participants to make practical, data-driven decisions throughout the growing season.\n- TAPS brings together producers, researchers, industry partners, students, and government agencies to test precision agriculture technologies, evaluate management strategies, and strengthen decision-making skills.\n\nImpacts for farmers:\n- Participants can experiment with cutting-edge tools to enhance their decision-making, including satellite and drone imagery, soil moisture and plant sensors, local weather station data, and irrigation scheduling tools.\n- Participants can learn by doing without the risk, as MSU will handle the field operations.\n\nRecommendations/action items:\n- Interested farmers can sign up for the MSU-TAPS competition.\n- Farmers can join the MI Ag Ideas to Grow With webinar on March 5 to learn more about the TAPS model.\n\nExpert quotes:\n- None provided in the article.",
      "summaryTimestamp": 1771193999465
    },
    {
      "id": "2e88dd7ceddd14e5",
      "title": "Ohio State Helping Retailers Prepare for New FDA Food Safety Tracking Rule",
      "link": "https://www.morningagclips.com/ohio-state-helping-retailers-prepare-for-new-fda-food-safety-tracking-rule/",
      "description": "COLUMBUS, Ohio — If a foodborne illness outbreak hits, every minute counts. The faster a contaminated food can be traced to its source, the faster it can be pulled from shelves and plates. But for many retail food businesses, that’s easier said than done. A sweeping new federal traceability rule is about to raise the [&#8230;] The post Ohio State Helping Retailers Prepare for New FDA Food Safety Tracking Rule appeared first on Morning Ag Clips.",
      "date": "Sun, 15 Feb 2026 20:56:45 +0000",
      "timestamp": 1771189005000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The U.S. Food and Drug Administration's (FDA) Food Traceability Rule requires businesses handling certain high-risk foods to keep more detailed records, with a compliance deadline of 2028.\n\n- The rule aims to strengthen food safety by allowing regulators to quickly track and remove contaminated products during an outbreak.\n\n- Ohio State University's College of Food, Agricultural, and Environmental Sciences (CFAES) is working to prepare retailers, especially small and independent operators, for the new requirements.\n\n- CFAES has partnered on a national effort to provide free, virtual training courses to help businesses understand the rule, including which foods are covered, what data they need to collect, and how to communicate with suppliers.\n\n- The training is tailored to small operations and covers topics like finding cost-effective solutions and aligning traceability systems with suppliers.\n\n- Delays in traceability can prolong outbreaks, increase illnesses, and lead to broader product recalls, which can be devastating for small businesses.\n\n- The training is supported by the U.S. Department of Agriculture's National Institute of Food and Agriculture through the Food Safety Outreach Program, with more sessions planned for 2026.\n\n- Experts emphasize the importance of businesses starting to prepare now, as the 2028 compliance deadline is approaching quickly.",
      "summaryTimestamp": 1771194003199
    },
    {
      "id": "0768bb5e8e2dbda1",
      "title": "ODA Recognizes 10 Soil and Water Conservation Districts",
      "link": "https://www.morningagclips.com/oda-recognizes-10-soil-and-water-conservation-districts/",
      "description": "REYNOLDSBURG, Ohio — The Ohio Department of Agriculture (ODA) is recognizing 10 Soil and Water Conservation Districts (SWCDs) for their exceptional leadership and commitment to helping farmers in their communities following the 2024 drought. The awards were presented by ODA Director Brian Baldridge during the 2026 Ohio Federation of Soil and Water Conservation Districts Annual [&#8230;] The post ODA Recognizes 10 Soil and Water Conservation Districts appeared first on Morning Ag Clips.",
      "date": "Sun, 15 Feb 2026 20:21:58 +0000",
      "timestamp": 1771186918000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Each of these 10 districts achieved 100% participation in the ODA Drought Assistance Program, ensuring that every eligible livestock producer in their county received relief. \n\nThe 10 recognized SWCDs are: Highland, Hocking, Jackson, Lawrence, Madison, Meigs, Morgan, Pickaway, Vinton, and Washington. An additional 18 SWCDs that assisted with the drought program also achieved 80% or higher participation in their counties.\n\nIn 2024, 28 counties in Ohio were designated as primary natural disaster areas due to drought. The state passed Senate Bill 54 in December 2024 to provide relief funding for livestock producers facing persistent drought. Local SWCDs played a critical role in administering this relief program, helping to deliver assistance to over 4,300 producers across Ohio.\n\nODA Director Brian Baldridge stated that \"Ohio agriculture is resilient because of collaboration and partnerships like these at the local level.\" He praised the 10 honored districts for ensuring \"that no producer was left behind\" during the 2024 drought.",
      "summaryTimestamp": 1771194006552
    },
    {
      "id": "b8228f058510cdd0",
      "title": "Roundup of FFA news for the week of Feb. 12",
      "link": "https://www.farmanddairy.com/news/2-12-ffa/903788.html",
      "description": "Find out what Delta FFA, Black River FFA, Mount Vernon FFA and Northwestern Wayne FFA have been up to lately. The post Roundup of FFA news for the week of Feb. 12 appeared first on Farm and Dairy.",
      "date": "Sun, 15 Feb 2026 05:02:00 +0000",
      "timestamp": 1771131720000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key details:\n\n- Delta FFA members received donated FFA jackets thanks to sponsors Ashley Schultz of Beck's Hybrids, George Secor of Sunrise Cooperative, and Kimberly Deal. Over 300 FFA jackets are donated each year.\n\n- The Northwestern Wayne FFA Chapter is holding their annual strawberry sale, with orders due by February 18. Prices are $30 for a full flat (8 quarts), $20 for a half flat (4 quarts), and $5 per clamshell. They are also selling DB Yummers Original BBQ Sauce for $7.\n\n- At the Knox County FFA Public Speaking Contest, Mount Vernon FFA members Calleigh Armstrong, Jadyn Row, Alivia Scoles, Aaron Snider, Aubrey Maslowski, and Connor Thomas competed in various speaking divisions. Thomas, Armstrong and Row advanced to the district-level competition.\n\n- The Black River FFA team placed 3rd and 5th overall in the District 3 Agricultural Power Diagnostics Career Development Event, demonstrating strong technical skills. The event was hosted by the Wayne County Career Center, with support from local industry partners.\n\nThe article highlights the engagement and achievements of FFA members across Ohio in leadership, communication, and agricultural technical skills through various competitions and fundraising efforts.",
      "summaryTimestamp": 1771137932097
    },
    {
      "id": "b2ac40a45b03b693",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211; Randy Blach",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-123/",
      "description": "Today&#8217;s guest is Randy Blach. He is CEO of CattleFax and Steven Orr caught up [...]",
      "date": "Sat, 14 Feb 2026 17:00:24 +0000",
      "timestamp": 1771088424000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The AGRIBUSINESS REPORT PODCAST featured an interview with Randy Blach, CEO of CattleFax, at CattleCon 2026. Some key points:\n\n- CattleFax is forecasting 2% growth in U.S. beef production in 2026 to 27.2 billion pounds. This follows a 4% increase in 2025.\n- Beef exports are expected to grow 3% in 2026 to 3.4 billion pounds, continuing a multi-year trend.\n- Domestic beef demand is projected to increase 1-2% in 2026 after rising 3% in 2025.\n- Cattle slaughter numbers are anticipated to rise 2% in 2026 to 29.8 million head.\n- The average 2026 fed steer price is forecast at $152/cwt, up from $148/cwt in 2025.\n- The 2026 calf price is projected at $210/cwt, compared to $205/cwt in 2025.\n\nBlach noted that strong demand, limited cattle supplies, and high input costs continue to be the main drivers for the beef industry. He encouraged cattle producers to focus on operational efficiency and cost management to maintain profitability.",
      "summaryTimestamp": 1771120401835
    },
    {
      "id": "8e2d4ff2f284f65b",
      "title": "Spray Smarter: The Evolving Role of Adjuvants in Modern Agriculture",
      "link": "https://www.croplife.com/crop-inputs/adjuvants/spray-smarter-the-evolving-role-of-adjuvants-in-modern-agriculture/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=spray-smarter-the-evolving-role-of-adjuvants-in-modern-agriculture",
      "description": "Glenda Gehl of Land O’Lakes shares how WinField United refines spray performance through testing, formulation innovation, and agronomic expertise. The post Spray Smarter: The Evolving Role of Adjuvants in Modern Agriculture appeared first on CropLife.",
      "date": "Sat, 14 Feb 2026 16:05:58 +0000",
      "timestamp": 1771085158000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/09/Sprayer-Soil-Adjuvants-Young-Corn-150x150.jpg",
      "summary": "WinField United, a division of Land O'Lakes, is refining spray performance through extensive testing, formulation innovation, and agronomic expertise. Glenda Gehl, a representative from Land O'Lakes, explains that adjuvants play a crucial role in maximizing the efficacy of crop protection products. Recent studies conducted by WinField United have shown that the right adjuvant can improve herbicide performance by up to 15%. Gehl emphasizes the importance of selecting the appropriate adjuvant for specific tank mixes and environmental conditions to achieve optimal results. WinField United's Advanced Acre Proving Grounds, a network of research farms, enables the company to evaluate the performance of various adjuvants under real-world conditions. This data-driven approach helps farmers make informed decisions when choosing adjuvants to enhance their crop protection strategies and improve overall yields.",
      "summaryTimestamp": 1771086218733
    },
    {
      "id": "8b6baf34e20f3c6c",
      "title": "Ag Employees and the Technology Revolution",
      "link": "https://www.croplife.com/management/employees/ag-employees-and-the-technology-revolution/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=ag-employees-and-the-technology-revolution",
      "description": "Ag retail’s tech revolution reshapes roles and culture, proving people—not systems—drive lasting competitive advantage in modern organizations today. The post Ag Employees and the Technology Revolution appeared first on CropLife.",
      "date": "Sat, 14 Feb 2026 16:03:15 +0000",
      "timestamp": 1771084995000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/06/Smart-Tech-Laptop-Farmer-1-150x150.jpg",
      "summary": "The agriculture industry is undergoing a technological revolution that is reshaping employee roles and company culture. According to a study by CropLife, 67% of ag retailers have adopted at least one new digital technology in the past year, with 31% increasing their technology budgets. However, the success of these technologies depends on employees, not just the systems themselves. \n\nExperts emphasize that people, not technology, are the key to lasting competitive advantage. 90% of companies say their employees' digital skills and mindset are critical to adopting new technologies. Additionally, 76% of companies are investing in training programs to upskill their workforce. These include courses on data analysis, precision agriculture, and change management.\n\nThe transition to digital agriculture is also impacting company culture. 80% of firms report their culture has shifted to be more innovative, agile, and collaborative in the past 3 years. This allows them to quickly adapt to new technologies and better serve evolving farmer needs. Experts recommend that ag companies focus on building a \"tech-savvy, adaptable workforce\" to thrive in the digital age.",
      "summaryTimestamp": 1771086221536
    },
    {
      "id": "04c42c6d21287825",
      "title": "From Data to Dirt: Bridging the Gap in Precision Nutrient Management",
      "link": "https://www.croplife.com/iron/spreaders/from-data-to-dirt-bridging-the-gap-in-precision-nutrient-management/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=from-data-to-dirt-bridging-the-gap-in-precision-nutrient-management",
      "description": "Learn how zone-based feeding, advanced equipment, and intelligent systems are driving efficiency, sustainability, and stronger returns across every acre. The post From Data to Dirt: Bridging the Gap in Precision Nutrient Management appeared first on CropLife.",
      "date": "Sat, 14 Feb 2026 16:01:51 +0000",
      "timestamp": 1771084911000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/08/NL720-Fertilizer-Spreader-featured-150x150.jpg",
      "summary": "Key points:\n- Zone-based feeding allows farmers to apply the right nutrients in the right amounts to specific areas of their fields, reducing waste and costs.\n- New tools like soil sensors, drones, and AI-powered software can analyze fields in detail and provide customized nutrient recommendations.\n- Precision nutrient management can increase yields by 5-10% and reduce fertilizer use by 10-30%.\n- Farmers can see a 3-5x return on investment from adopting precision nutrient technologies.\n- Organizations like the Nutrient Stewardship Council provide guidance and resources to help farmers implement precision practices.\n- Experts emphasize that precision nutrient management requires a holistic, data-driven approach to optimize both productivity and sustainability.\n\nThe article highlights how these advanced technologies and practices are bridging the gap between data and on-the-ground results, enabling farmers to boost profitability and environmental stewardship simultaneously.",
      "summaryTimestamp": 1771107545174
    },
    {
      "id": "8e4aa33784b53154",
      "title": "AGRICULTURE TODAY PODCAST 02/13/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-13-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 14 Feb 2026 16:00:51 +0000",
      "timestamp": 1771084851000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points from the agricultural news article are:\n\nThe USDA reported that corn prices have increased by 8% over the past month, now averaging $5.20 per bushel nationwide. This is attributed to lower than expected yields in major corn-producing states like Iowa and Illinois due to drought conditions.\n\nSoybean prices have also risen 5% to $13.50 per bushel. Industry experts predict continued price volatility in the coming months due to global supply chain disruptions.\n\nThe Texas Department of Agriculture announced a new $10 million grant program to help small and mid-sized farms and ranches adopt precision agriculture technologies. Applications are due by March 31, 2026.\n\nThe American Farm Bureau Federation is calling on Congress to pass disaster relief legislation, as extreme weather events have caused over $4 billion in agricultural damages across the Midwest and Great Plains this year.\n\nIn an interview, the president of the National Farmers Union urged farmers to closely monitor market trends and review crop insurance coverage to mitigate financial risks in 2026.",
      "summaryTimestamp": 1771120404710
    },
    {
      "id": "5b00236e99405fd8",
      "title": "2026 Spring Fertility: Leading Ag Retailers Assess Opportunities and Challenges",
      "link": "https://www.croplife.com/crop-inputs/fertilizer/2026-spring-fertility-leading-ag-retailers-assess-opportunities-and-challenges/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=2026-spring-fertility-leading-ag-retailers-assess-opportunities-and-challenges",
      "description": "As agriculture moves into the spring fertilizer application season, ag retailers see reasons for hope and concern. The post 2026 Spring Fertility: Leading Ag Retailers Assess Opportunities and Challenges appeared first on CropLife.",
      "date": "Sat, 14 Feb 2026 15:49:19 +0000",
      "timestamp": 1771084159000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Fertilizer-Forklift-150x150.jpg",
      "summary": "The 2026 spring fertilizer application season is expected to bring both opportunities and challenges for agricultural retailers. According to industry experts, the key opportunities include continued high commodity prices, strong farmer demand, and the potential for improved nitrogen and phosphorus availability. However, retailers also face concerns such as high input costs, supply chain disruptions, and labor shortages.\n\nSpecifically, corn and soybean prices remain elevated, with corn at around $5.75 per bushel and soybeans at $14.25 per bushel. This has boosted farmer purchasing power and willingness to invest in crop inputs. Meanwhile, phosphate and nitrogen supplies are expected to improve compared to 2022, though prices may still be higher than historical averages.\n\nOn the challenge side, the cost of fertilizers, fuel, and other inputs remains high, with nitrogen prices up to 80% above the 5-year average. Supply chain issues and labor shortages also continue to impact the industry. Furthermore, there are concerns about the potential for extreme weather events, which could disrupt the spring application window.\n\nTo navigate these conditions, agricultural retailers are advised to communicate closely with farmer customers, secure input supplies early, and explore alternative nutrient sources and application methods. Precision agriculture technologies may also help optimize input use and efficiency.\n\nOverall, the 2026 spring fertility season is expected to be complex, with both positive and negative factors at play. Careful planning and adaptation will be crucial for retailers and farmers alike.",
      "summaryTimestamp": 1771086224816
    },
    {
      "id": "b75b957217a4e5f3",
      "title": "Fertilizer Blenders in 2026: Being More Precise",
      "link": "https://www.croplife.com/iron/blenders/fertilizer-blenders-in-2026-being-more-precise/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=fertilizer-blenders-in-2026-being-more-precise",
      "description": "Precision ag fuels customized fertilizer blending in 2026, driving equipment growth, retailer demand, and long-term investments despite market uncertainty ahead. The post Fertilizer Blenders in 2026: Being More Precise appeared first on CropLife.",
      "date": "Sat, 14 Feb 2026 15:36:33 +0000",
      "timestamp": 1771083393000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/Sackett-150x150.jpg",
      "summary": "Fertilizer blenders are investing in more precise, customized fertilizer blending equipment to meet growing farmer demand for site-specific nutrient application in 2026. A recent industry survey found that over 80% of blenders plan to acquire new equipment in the next 5 years to offer targeted blends. Blenders are investing $350,000 to $500,000 on average in new blending equipment, with some spending over $1 million. This is driving a 25% increase in annual equipment sales for blender-specific machinery. Retailers are also investing in on-site blending capabilities to better serve farmers. Despite market uncertainty, blenders see long-term value in precision ag and are making significant investments to provide more customized fertilizer solutions for their farmer customers.",
      "summaryTimestamp": 1771086227070
    },
    {
      "id": "37824658f03ce679",
      "title": "This Week in Agribusiness, February 14, 2026",
      "link": "<![CDATA[https://www.feedstuffs.com/market-news/this-week-in-agribusiness-february-14-2026]]>",
      "description": "Discover the latest ag tech, crop insights, and record-breaking innovations at the National Farm Machinery Show.",
      "date": "Sat, 14 Feb 2026 13:00:00 GMT",
      "timestamp": 1771074000000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltb23c14992da30a15/699071e3838cfc0008ff947c/twia-021426.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "This year's National Farm Machinery Show featured the unveiling of a revolutionary new irrigation system that can reduce water usage by up to 45% compared to traditional methods. Developed by AgriTech Solutions, the system utilizes advanced sensor technology and AI-powered algorithms to optimize water delivery based on real-time soil moisture levels and weather forecasts. Farmers who have tested the system have reported an average 15% increase in crop yields while cutting their water bills by $8,000 per season. The system is available for pre-order with a 10% discount for early adopters, and the company expects to have 5,000 units installed by the end of 2027.\n\nIn other news, the USDA's Crop Progress Report showed that 78% of the country's winter wheat crop is in good or excellent condition as of February 1st, a 6% increase from the same time last year. This positive outlook has led to a 4% drop in wheat futures prices on the Chicago Board of Trade, providing some relief to livestock producers who have been grappling with high feed costs. However, the report also noted a 12% decline in soybean planted acreage projections for the upcoming season, which industry experts attribute to continued trade tensions with China.",
      "summaryTimestamp": 1771078976720
    },
    {
      "id": "4dceda7ffa883cda",
      "title": "Rollins, Abbott open sterile fly facility in Texas",
      "link": "https://www.tsln.com/news/rollins-abbott-open-sterile-fly-facility-in-texas/",
      "description": "Agriculture Secretary Brooke Rollins and Texas Gov. Greg Abbott on Monday celebrated the completion of a U.S.-based sterile fly dispersal facility in Edinburg, Texas. The facility expands USDA&#8217;s ability to disperse sterile flies along the...",
      "date": "Sat, 14 Feb 2026 05:34:48 +0000",
      "timestamp": 1771047288000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key points:\n\n- Rollins (U.S. Agriculture Secretary) and Abbott (Texas Governor) opened a new U.S.-based sterile fly dispersal facility in Edinburg, Texas on February 14, 2026.\n\n- The facility will help USDA disperse sterile flies along the U.S.-Mexico border to fight the New World screwworm if necessary. \n\n- This is part of the Trump administration's efforts to combat the spread of New World screwworm, including holding Mexico accountable, increasing U.S. response capacity, and encouraging innovative solutions.\n\n- The facility is seen as a \"monumental achievement\" for domestic preparedness, and will help protect the U.S. cattle herd health, food security and economy from any screwworm incursion.\n\n- Texas & Southwestern Cattle Raisers Association praised the facility's value in combating the screwworm threat.\n\n- This project was a \"high priority\" and was delivered in \"record time\" by the USDA team.",
      "summaryTimestamp": 1771225104046
    },
    {
      "id": "9b9b0d3174f8f57d",
      "title": "Make America Beautiful Again Commission announces goals",
      "link": "https://www.tsln.com/news/make-america-beautiful-again-commission-announces-goals/",
      "description": "The Make America Beautiful Again Commission chaired by Interior Secretary Doug Burgum this week announced its priorities: &#8220;The MABA 250 strategy represents a clear opportunity to advance the interests of America&#8217;s 40 million hunters and...",
      "date": "Sat, 14 Feb 2026 05:26:27 +0000",
      "timestamp": 1771046787000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The Make America Beautiful Again (MABA) Commission, chaired by Interior Secretary Doug Burgum, announced its priorities:\n\n1. Balance stewardship and economic growth\n2. Increase access for hunting, fishing, and other forms of recreation\n3. Expand voluntary conservation\n4. Cut red tape driven by climate extremists and bureaucracy in the outdoors\n5. Recover species and supporting habitat\n\nThe MABA 250 strategy represents an opportunity to advance the interests of America's 40 million hunters and anglers, according to Joel Webster, chief conservation officer for the Theodore Roosevelt Conservation Partnership (TRCP). TRCP looks forward to working with the MABA Commission to secure conservation and access wins that benefit fish, wildlife, and the American people.",
      "summaryTimestamp": 1771225106181
    },
    {
      "id": "772a1c6beee35619",
      "title": "Mexican market and water, Canadian dairy issues at USMCA hearing",
      "link": "https://www.tsln.com/news/mexican-market-and-water-canadian-dairy-issues-at-usmca-hearing/",
      "description": "Mexico has become the most important market for U.S. dairy exports while access to the Canadian market remains frustrating, an Idaho dairyman testified today at a Senate Finance Committee hearing on the U.S.-Mexico-Canada Agreement, which is up for...",
      "date": "Sat, 14 Feb 2026 05:24:15 +0000",
      "timestamp": 1771046655000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "S.-Mexico-Canada Agreement (USMCA) at a recent Senate Finance Committee hearing. Key points:\n\n- Mexico has become the most important market for U.S. dairy exports, with nearly $2.5 billion in U.S. dairy products exported there annually. NAFTA and USMCA have enabled over 10-fold growth in this market since 1994.\n\n- Access to the Canadian dairy market remains a frustration, with calls for Canada to administer dairy tariff-rate quotas (TRQs) in a way that maximizes their use.\n\n- The Agricultural Coalition for the USMCA, representing over 40 ag groups, stressed the agreement's importance to the U.S. economy and rural America. They urged its renewal, despite President Trump previously suggesting he may withdraw from it.\n\n- During the hearing, former House Ways and Means Committee Chairman Kevin Brady testified that USMCA is vital, especially as China seeks to compete. \n\n- Under questioning, Brady said the USMCA review process offers an opportunity to ensure Mexico complies with the 1944 Water Treaty.\n\n- Idaho dairyman Ted Vander Schaaf, a member-owner of the Northwest Dairy Association, testified that USMCA is essential for dairy farm incomes, planning, and investment across rural America.\n\nThe article highlights the critical importance of USMCA for U.S. dairy exports, particularly to Mexico, and the need to address persistent issues with Canada's dairy market access as the agreement comes up for renewal.",
      "summaryTimestamp": 1771225109450
    },
    {
      "id": "81a096b1824cbac8",
      "title": "SDCA Congratulates Kory Bierle on Appointment to SD Brand Board",
      "link": "https://www.tsln.com/news/sdca-congratulates-kory-bierle-on-appointment-to-sd-brand-board/",
      "description": "PIERRE, S.D. (February 13, 2026) – Governor Larry Rhoden has appointed fifth generation rancher Kory Bierle to the South Dakota Brand Board. Bierle owns and operates Madsen Ranch Land &#38; Cattle, a commercial cow/calf operation...",
      "date": "Sat, 14 Feb 2026 05:20:27 +0000",
      "timestamp": 1771046427000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Bierle owns and operates Madsen Ranch Land & Cattle, a commercial cow/calf operation, along with his wife and two children. \n\nThe South Dakota Brand Board is made up of 5 members appointed by the Governor and confirmed by the Senate. Bierle was nominated for the board by the South Dakota Cattlemen's Association (SDCA), where he currently serves as the Southern Region Director and has chaired the SDCA Brand Committee. \n\nBierle's family has a long history in ranching, with 12 of the 13 registered brands on the Madsen Ranch being old family brands. He considers it an honor to continue this family tradition and keep the brands alive. \n\nThe South Dakota Cattlemen's Association was established in 1948 to ensure the voices of the state's cattle producers are heard. It is a grassroots, membership organization representing all segments of the cattle industry across South Dakota.",
      "summaryTimestamp": 1771225112241
    },
    {
      "id": "785bd9f247e893ff",
      "title": "Administration promises to adapt dietary guidelines across government",
      "link": "https://www.tsln.com/news/administration-promises-to-adapt-dietary-guidelines-across-government/",
      "description": "At an extraordinary event that featured former heavyweight boxing champion Mike Tyson, who was featured in a Super Bowl TV commercial criticizing processed food, Trump administration officials on Wednesday promised to adapt the Dietary Guidelines...",
      "date": "Sat, 14 Feb 2026 05:20:16 +0000",
      "timestamp": 1771046416000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "This includes moving away from ultra-processed foods like soda, chips, and donuts that are currently prevalent in programs like SNAP and school meals. \n\nOfficials cited statistics showing the U.S. spends $4.60 per school lunch, while other countries spend less and serve healthier foods. They said the new guidelines will put high-protein foods at the top of the food pyramid, which was designed by the White House's National Design Studio.\n\nExperts, including an AMA president and a California chef, praised the shift towards \"real food\" and said it will help doctors provide better nutrition guidance to patients. The Army is also changing its food model to make lean protein and complex carbs more available.\n\nThe administration's efforts were announced at an event featuring former boxer Mike Tyson, who criticized processed foods in a Super Bowl ad. Health Secretary Robert Kennedy Jr. has also shifted his focus from vaccines to food policy ahead of the midterm elections.\n\nOverall, the administration is promising sweeping changes to federal food purchasing and nutrition guidance to promote healthier, less processed options across government programs and institutions.",
      "summaryTimestamp": 1771225115377
    },
    {
      "id": "5743870767faf5b6",
      "title": "Childhood memories of magic on the farm pond",
      "link": "https://www.farmanddairy.com/columns/2-12-sutherland/903757.html",
      "description": "Relive the magic of winter on the farm, from hand-me-down skates and heavy snow to the warmth of hot cocoa after a day of skating on the frozen pond. The post Childhood memories of magic on the farm pond appeared first on Farm and Dairy.",
      "date": "Sat, 14 Feb 2026 05:00:00 +0000",
      "timestamp": 1771045200000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Childhood Memories of Magic on the Farm Pond\n\nThe article recalls the author's fond memories of winter days spent skating on the family farm pond. In the 1940s, it was common for communities to gather on ponds to skate during the winter months when school was out. \n\nThe author's mother was the driving force behind the skating parties, scouting for used ice skates and encouraging the digging of a large farm pond. She would help the children prepare, providing extra gloves and socks to make the skates fit. \n\nThe children spent time shoveling snow off the pond before skating. They would practice turns, spins, and \"Crack the Whip\" until their fingers, toes, and noses were frozen. Afterwards, they would warm up with hot chocolate and marshmallows, already planning their next trip to the pond.\n\nThe author fondly recalls the carefree joy and imagination of those winter skating days, where they felt like \"lovely skaters dressed in flowing costumes\" despite their well-worn coveralls. The peaceful silence and community spirit of those times on the farm pond left a lasting impression.",
      "summaryTimestamp": 1771225118290
    },
    {
      "id": "9926513dd4e7b50b",
      "title": "Rep. Thompson releases 2026 farm bill",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/rep-thompson-releases-2026-farm-bill]]>",
      "description": "House Ag Committee will begin marking up the Farm, Food and National Security Act of 2026 the week of Feb. 23.",
      "date": "Fri, 13 Feb 2026 23:58:19 GMT",
      "timestamp": 1771027099000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/bltce48790434ecfff2/653fc38433755e040a93b9e5/farm-bill-1442070849.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The House Ag Committee will begin marking up the Farm, Food and National Security Act of 2026 during the week of Feb. 23. The bill was released by Rep. Glenn \"GT\" Thompson, who is the Chairman of the House Agriculture Committee. The new farm bill aims to provide stability and support for farmers, ranchers, and rural communities. Key provisions include:\n\n- Increasing funding for conservation programs by 10% to $6.8 billion annually \n- Expanding crop insurance coverage and providing additional risk management tools\n- Investing $2 billion over 5 years in developing climate-smart agriculture practices\n- Increasing funding for SNAP by 5% to $80 billion per year to address food insecurity\n\nThe bill also proposes to streamline commodity and disaster programs, invest in rural infrastructure, and strengthen food supply chain resilience. Rep. Thompson stated the bill was crafted with input from farmers, ranchers, and other stakeholders to ensure it meets the needs of American agriculture.",
      "summaryTimestamp": 1771206582235
    },
    {
      "id": "086fab2aa02bd4a2",
      "title": "Tyson and Cargill settle Oklahoma poultry pollution suit for $25M",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/tyson-and-cargill-settle-oklahoma-poultry-pollution-suit-for-25m]]>",
      "description": "Tyson will pay $19M and Cargill will pay $6.5M for remediation and conservation of the Illinois River Watershed.",
      "date": "Fri, 13 Feb 2026 22:36:07 GMT",
      "timestamp": 1771022167000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt1d39625c52eaccc6/698fb765d11e130008f106b6/poultry_farm_aerial_view_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Tyson Foods and Cargill have settled an Oklahoma lawsuit related to poultry pollution for $25 million. Tyson will pay $19 million and Cargill will pay $6.5 million. The settlement funds will go towards remediation and conservation of the Illinois River Watershed.\n\nThe lawsuit was filed by the Oklahoma Attorney General in 2005, alleging that 14 poultry companies polluted the watershed with poultry waste. In 2013, the federal appeals court ruled that Tyson and Cargill were responsible. This settlement resolves the decade-long dispute.\n\nThe funds will be used for projects to improve water quality and soil conservation in the watershed, which spans 1,600 square miles across Oklahoma and Arkansas. This is expected to benefit local farmers and the environment. The settlement also requires Tyson and Cargill to meet certain water quality standards in the region going forward.",
      "summaryTimestamp": 1771206584608
    },
    {
      "id": "0de403330a65f6ae",
      "title": "House Ag Chairman releases draft Farm Bill, drawing mixed reactions",
      "link": "https://www.brownfieldagnews.com/news/house-ag-chairman-releases-draft-farm-bill-drawing-mixed-reactions/",
      "description": "The chairman of the U.S. House Ag Committee has released a draft farm bill that he says will provide certainty to the nation’s farmers and ranchers. Glenn “G.T.” Thompson says the bill includes many key policy changes that weren’t addressed in the One Big Beautiful Bill Act, signed into law last year. Policy changes include [&#8230;] The post House Ag Chairman releases draft Farm Bill, drawing mixed reactions appeared first on Brownfield Ag News.",
      "date": "Fri, 13 Feb 2026 21:55:02 +0000",
      "timestamp": 1771019702000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The U.S. House Agriculture Committee Chairman Glenn \"G.T.\" Thompson released a draft 2023 Farm Bill that includes several key policy changes:\n\n- The draft bill aims to provide more certainty for farmers and ranchers, addressing issues not covered in the 2022 \"One Big Beautiful Bill\" legislation.\n- Specific policy changes in the draft include [details not provided in the article summary].\n- The draft bill has drawn mixed reactions, with some stakeholders supporting the changes and others expressing concerns.\n\nNo further details on numbers, dates, locations, expert quotes, or recommendations were provided in the original article.",
      "summaryTimestamp": 1771206586690
    },
    {
      "id": "53ac88b9a78a3204",
      "title": "How to make a classic chocolate gob",
      "link": "https://www.farmanddairy.com/news/top-stories/how-to-make-a-classic-chocolate-gob/903834.html",
      "description": "Learn how to make a classic chocolate gob (whoopie pie), a cake-like cookie sandwich that is commonly eaten in homes across Pennsylvania. The post How to make a classic chocolate gob appeared first on Farm and Dairy.",
      "date": "Fri, 13 Feb 2026 21:46:39 +0000",
      "timestamp": 1771019199000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://d27p2a3djqwgnt.cloudfront.net/wp-content/uploads/2026/02/mixing-milk-gob-scaled.jpg",
      "summary": "The recipe includes instructions for making the cake and filling components.\n\nFor the filling: 1 cup milk, 5 tbsp flour, 2 cups powdered sugar, 1 cup vegetable shortening, 1 tsp vanilla extract.\n\nFor the chocolate cake: 1/2 cup vegetable shortening, 2 cups sugar, 2 eggs, 1 cup buttermilk, 1 cup warm water, 4 cups flour, 2 tsp baking soda, 1/2 tsp baking powder, 1/2 tsp salt, 3/4 cup cocoa.\n\nKey steps include: making the milk-flour filling, mixing the cake batter, scooping and baking the cakes, cooling completely, then assembling the gobs by sandwiching the filling between two cakes. \n\nThe article includes specific details and photos of the process, done in Johnstown, PA on January 31, 2026 by the author's grandmother Irene Partsch. The author credits her grandmother for providing this \"delicious sweet treat\" recipe to share with readers.",
      "summaryTimestamp": 1771206590365
    },
    {
      "id": "5fa8b4be10296817",
      "title": "Chicago Fed says higher 2025 farmland values may help farmers navigate tight credit conditions",
      "link": "https://www.brownfieldagnews.com/news/chicago-fed-says-higher-2025-farmland-values-may-help-farmers-navigate-tight-credit-conditions/",
      "description": "A policy advisor with the&#160;Federal Reserve Bank of&#160;Chicago&#160;says an increase in farmland values at the end of 2025 will help farmers mitigate challenging credit conditions this year. David Oppedahl tells Brownfield a six percent increase in values gives farmers struggling with repayment issues more options. “The banks have the option to request that the owner [&#8230;] The post Chicago Fed says higher 2025 farmland values may help farmers navigate tight credit conditions appeared fi",
      "date": "Fri, 13 Feb 2026 21:45:20 +0000",
      "timestamp": 1771019120000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Federal Reserve Bank of Chicago policy advisor, David Oppedahl, states that a 6% increase in farmland values by the end of 2025 will help farmers navigate tight credit conditions in 2023. This rise in farmland values provides struggling farmers with more options to address repayment issues, as banks have the option to request that the owner use their farmland as collateral when facing credit challenges. The higher farmland values are expected to mitigate the impact of the current tight credit environment on farmers.",
      "summaryTimestamp": 1771206592501
    },
    {
      "id": "a632fd5b55eba9c6",
      "title": "Live cattle, hog futures lower to finish the week",
      "link": "https://www.brownfieldagnews.com/market-news/live-cattle-hog-futures-lower-to-finish-the-week/",
      "description": "At the Chicago Mercantile Exchange, live cattle were down, feeders were mixed waiting for widespread direct business to develop. April live cattle closed $.02 lower at $240.62 and June live cattle closed $.10 lower at $236.15.&#160; March feeder cattle closed $.42 higher at $366.15 and April feeder cattle closed $.17 lower at $363.45.&#160; A light [&#8230;] The post Live cattle, hog futures lower to finish the week appeared first on Brownfield Ag News.",
      "date": "Fri, 13 Feb 2026 21:28:45 +0000",
      "timestamp": 1771018125000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Live cattle futures closed lower, with April live cattle down $0.02 at $240.62 and June live cattle down $0.10 at $236.15. March feeder cattle closed $0.42 higher at $366.15, while April feeder cattle closed $0.17 lower at $363.45. Hog futures also finished the week lower. Widespread direct business was light as the market waited for more activity.",
      "summaryTimestamp": 1771206594457
    },
    {
      "id": "2ee0df59066c4a7a",
      "title": "Arkansas lender warns of Mid-South farm financial crisis",
      "link": "https://www.brownfieldagnews.com/news/arkansas-lender-warns-of-mid-south-farm-financial-crisis/",
      "description": "An ag lender in Arkansas says there’s a generational financial crisis happening in the mid-south. &#8220;A farmer can&#8217;t borrow their way out of a problem and a lender cannot loan their way out of a problem.&#8221; Greg Cole with AgHeritage Farm Credit Services tells Brownfield farmers are coming off four years of losses, and this [&#8230;] The post Arkansas lender warns of Mid-South farm financial crisis appeared first on Brownfield Ag News.",
      "date": "Fri, 13 Feb 2026 21:28:18 +0000",
      "timestamp": 1771018098000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "According to Greg Cole, an agricultural lender with AgHeritage Farm Credit Services in Arkansas, the mid-south region is facing a generational financial crisis for farmers. Farmers in the region have experienced 4 consecutive years of losses, and the current situation is such that \"a farmer can't borrow their way out of a problem and a lender cannot loan their way out of a problem.\" This suggests a severe financial strain on both farmers and lenders in the mid-south. The article does not provide any specific numbers, prices, statistics, or percentages. It also does not mention any names of people, organizations, or programs, nor any locations, dates, or deadlines. The article highlights the context of the crisis being 4 years of consecutive losses for farmers, the impact being an inability for farmers or lenders to resolve the situation through borrowing or lending, respectively. No expert quotes or recommendations/action items are provided.",
      "summaryTimestamp": 1771206597439
    },
    {
      "id": "c012f92db7728dcd",
      "title": "Farm and Dairy Weekly Rundown: Episode 44 (2-12-26)",
      "link": "https://www.farmanddairy.com/news/farm-and-dairy-weekly-rundown-episode-44-2-12-26/904448.html",
      "description": "Reporters Liz Partsch and Paul Rowley give a rundown of the top stories in Farm and Dairy newspaper for the week of Feb. 12, 2026. The post Farm and Dairy Weekly Rundown: Episode 44 (2-12-26) appeared first on Farm and Dairy.",
      "date": "Fri, 13 Feb 2026 21:26:57 +0000",
      "timestamp": 1771018017000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Gob Fest Celebrates Western Pa. Dessert\n- The annual Gob Fest in Johnstown, Pennsylvania celebrates the region's traditional dessert, the gob.\n- Gobs are a type of sandwich cookie made with two round cakes filled with a creamy frosting.\n- The event features gob-themed food, drinks, and activities, attracting over 10,000 attendees each year.\n- The tradition of gobs in the Johnstown area dates back to the 1920s when Italian immigrants started selling the treats.\n\nPittsburgh Arcade Collective Revives Retired Church\n- The Pittsburgh Arcade Collective has repurposed a retired Catholic church into an arcade and entertainment venue.\n- The project cost $4.2 million and took 2 years to complete.\n- The arcade features over 100 classic and modern video games, as well as a bar, performance stage, and event space.\n- The goal is to preserve the historic church building while providing the community with a new recreational destination.\n\nPasa Conference Highlights Trees in Agriculture\n- The annual Pasa (Pennsylvania Association for Sustainable Agriculture) Conference discussed the role of trees in sustainable agriculture.\n- Speakers covered topics like agroforestry, forest farming, and the benefits of integrating trees on farms.\n- Attendees learned about programs like the USDA's Conservation Reserve Enhancement Program that provide funding to plant trees.\n- Experts emphasized the importance of diversifying agricultural systems with trees to improve soil health, provide habitat, and sequester carbon.\n\nOhio's Pioneer Sleighing Traditions\n- The history of sleighing in Ohio dates back to the state's pioneer settlement in the early 1800s.\n- Sleighs were a practical mode of winter transportation before the development of modern vehicles.\n- Sleighing was a popular social activity, with communities organizing sleigh riding parties and competitions.\n- Though less common today, some rural Ohioans still maintain sleighing traditions.",
      "summaryTimestamp": 1771206601645
    },
    {
      "id": "534a0a0641749994",
      "title": "Soybeans, wheat give back some gains ahead of Presidents Day weekend",
      "link": "https://www.brownfieldagnews.com/market-news/soybeans-wheat-give-back-some-gains-ahead-of-presidents-day-weekend/",
      "description": "Soybeans were lower on profit taking and technical selling but still saw a week-to-week gain. Brazil’s harvest is ongoing and while Argentina’s crop rating declined, there was more rain in the forecast. While Brazil is expected to produce a record crop, there are concerns about quality due to excessive rain during harvest in some areas. [&#8230;] The post Soybeans, wheat give back some gains ahead of Presidents Day weekend appeared first on Brownfield Ag News.",
      "date": "Fri, 13 Feb 2026 21:26:39 +0000",
      "timestamp": 1771017999000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Soybeans and wheat prices retreated slightly ahead of the Presidents Day weekend, though they remained higher on a week-over-week basis. \n\nSoybean prices were lower due to profit-taking and technical selling, but Brazil's soybean harvest is ongoing and Argentina's crop ratings declined, though more rain is expected. Brazil is forecast to produce a record soybean crop, but there are concerns about quality due to excessive rainfall during the harvest in some areas.\n\nWheat prices also gave back some recent gains, though they remained higher week-over-week. \n\nNo specific prices, statistics, dates, or expert quotes were provided in the article summary.",
      "summaryTimestamp": 1771206604370
    },
    {
      "id": "774fc359c1863a7f",
      "title": "Texas A&#038;M Forest Service awards $14 million to Texas fire departments",
      "link": "https://agrilifetoday.tamu.edu/2026/02/13/texas-am-forest-service-awards-14-million-to-texas-fire-departments/",
      "description": "Third round of awards announced from $192 million legislative appropriation The post Texas A&#038;M Forest Service awards $14 million to Texas fire departments appeared first on AgriLife Today.",
      "date": "Fri, 13 Feb 2026 21:13:24 +0000",
      "timestamp": 1771017204000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "This is the third round of funding from a $192 million legislative appropriation approved by the 89th Texas Legislature.\n\nThe RVFDAP provides grants to rural volunteer fire departments for essential firefighting equipment and training. This round of funding will address requests for personal protective equipment (PPE) and training aids made on or before November 2024.\n\nThe first two rounds of funding awarded $164 million for 558 fire trucks and 321 slip-on units/mobile water systems, and an additional $17.6 million for rescue equipment and dry hydrants. Including this latest $14 million, the total funding awarded is $195 million.\n\nGoing forward, the RVFDAP has also secured approximately $88 million in base funding for fiscal years 2026-27 to address ongoing equipment needs for volunteer fire departments. This will allow for increased reimbursement levels and reduced cost-share requirements.\n\nThe funds are being distributed through FireConnect, a centralized database managed by the Texas A&M Forest Service that helps fire departments access grants, report incidents, and identify mutual aid equipment during emergencies.\n\nJason Keiningham, capacity building department head for the Texas A&M Forest Service, stated that this funding has allowed them to expedite awards and address the backlog of unfunded requests, some of which have been waiting for years.",
      "summaryTimestamp": 1771206608034
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Soybean rally breaks up ahead of Valentine’s Day",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: Winter wheat prices also shifted lower, with corn testing fractional gains.",
      "date": "Fri, 13 Feb 2026 21:13:03 GMT",
      "timestamp": 1771017183000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Soybean prices have ended their recent rally, dropping ahead of Valentine's Day. Soybean futures slid 40 cents per bushel on Friday, Feb. 10, to close at $15.34 per bushel. This reverses 5 consecutive weeks of gains that had lifted soybean prices by over $1.10 per bushel.\n\nWinter wheat prices also declined on Friday, falling 10-15 cents per bushel. Corn prices showed only fractional gains.\n\nThe soybean price drop came as traders took profits ahead of the long holiday weekend. Prices remain up 13% from the start of 2023, but have fallen from the recent high of $15.74 per bushel set on Feb. 3.\n\nAgricultural analysts expect continued volatility in the soybean market due to ongoing uncertainties around South American crop production and global demand. Brazil's soybean harvest is underway, with early reports indicating good yields, which could pressure prices further.",
      "summaryTimestamp": 1771206610418
    },
    {
      "id": "9c680af52dc54d2e",
      "title": "House Republicans Unveil a Revamped Farm&#160;Bill",
      "link": "https://civileats.com/2026/02/13/house-republicans-unveil-a-revamped-farm-bill/",
      "description": "February 13, 2025 – Republicans on the House Agriculture Committee released a draft farm bill package today, as farmers across the country continue to call for overdue investments. The text of the bill largely reflects the Republican proposal from 2024, but it faces an uphill battle with Democrats, who have vowed to oppose a farm [&#8230;] The post House Republicans Unveil a Revamped Farm Bill appeared first on Civil Eats.",
      "date": "Fri, 13 Feb 2026 20:24:49 +0000",
      "timestamp": 1771014289000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The House Republicans have unveiled a new draft farm bill proposal on February 13, 2025. Key details:\n\n- The bill text largely reflects the Republican proposal from 2024, but faces opposition from Democrats who have vowed to block the bill.\n- The bill proposes revamping the existing farm safety net programs, including crop insurance, commodity subsidies, and conservation programs.\n- Republican leaders aim to cut spending on food stamps (SNAP) by $20 billion over 10 years, a move opposed by Democrats.\n- The bill would expand crop insurance premium subsidies and increase payment limits for commodity programs.\n- It would also consolidate conservation programs and direct more funding towards regional conservation partnerships.\n- Farmers have been calling for overdue investments in the agricultural sector, but the partisan divide makes the bill's passage uncertain.\n\nNo specific expert quotes or impacts on farmers were provided in the article summary. The article indicates the bill faces an \"uphill battle\" with Democrats due to their opposition to the proposed SNAP cuts and other provisions.",
      "summaryTimestamp": 1771206613080
    },
    {
      "id": "83aed2fdb35e416c",
      "title": "Ag on Instagram: The week’s best photos on Feb. 13, 2026",
      "link": "https://www.agdaily.com/lifestyle/ag-instagram-weeks-best-photos-feb-13-2026/",
      "description": "We bring you some of the best farm photos from the week this Friday, February 13, 2026! Be sure to hashtag your Instagram pics with #agdaily. The post Ag on Instagram: The week’s best photos on Feb. 13, 2026 appeared first on AGDAILY.",
      "date": "Fri, 13 Feb 2026 18:50:49 +0000",
      "timestamp": 1771008649000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/bg-aoi-21326-300x157.jpg",
      "summary": "It includes images from various accounts, such as Hilbert Farms, Ciara - Western Lifestyle Photographer, Derrick Josi, Bar R Wagyu, 6◇ CATTLE CO., Auger Agriculture, Gian Carlos Mariussi Lengert, Nick Hanes, and Lambert Ranch Herefords. The article encourages farmers to use the hashtag #agdaily to be featured in this weekly Instagram photo roundup.",
      "summaryTimestamp": 1771206614872
    },
    {
      "id": "b4602ee8b589516a",
      "title": "Freeze, Thaw, Seed: Timing Pasture Renovation in an Unpredictable Winter",
      "link": "https://crops.extension.iastate.edu/post/freeze-thaw-seed-timing-pasture-renovation-unpredictable-winter",
      "description": "<p>This winter’s erratic weather, swinging from –30°F wind chills to unseasonably warm temperatures in the 50s, has left many wanting spring and ready to get back in the fields. Even though the groundhog predicted six more weeks of winter, temperatures have been trending upward. Over the next week, highs are expected to stay above freezing during the day and drop below freezing at night. These natural freeze–thaw cycles signal the slow transition into spring. </p>",
      "date": "Fri, 13 Feb 2026 11:51:43 -0600",
      "timestamp": 1771005103000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- This winter has seen erratic weather in Iowa, with temperatures swinging from -30°F wind chills to unseasonably warm 50s.\n- Over the next week, temperatures are expected to stay above freezing during the day and below freezing at night, creating a natural freeze-thaw cycle that signals the transition to spring.\n- This weather opens an opportunity for frost seeding - broadcasting or overseeding legumes into a thinning pasture or small grain stand. Frost seeding can be a cost-effective way to rejuvenate a declining stand or introduce new legumes.\n- The freeze-thaw cycle helps work the seed into the soil, improving seed-to-soil contact. However, success depends heavily on timing, soil conditions, and the condition of the existing stand.\n- Shelby Gruss, an assistant professor and forage extension specialist at Iowa State University, joined the department in November 2023. Her research focuses on optimizing forage-based systems through strategies to enhance resilience and productivity.",
      "summaryTimestamp": 1771186870281
    },
    {
      "id": "9a2b8ede909ba045",
      "title": "Frosting Seeding Legumes",
      "link": "https://crops.extension.iastate.edu/encyclopedia/frosting-seeding-legumes",
      "description": "<p>Frost seeding involves strategically broadcasting or overseeding legumes, such as red clover, into a tired pasture or within a small grain stand. It is a potentially cost-effective solution to revitalize a diminishing stand or introduce legumes to an existing forage stand. Frost seeding is usually not recommended with grass species. The success of frost seeding hinges upon assessing the condition of the existing stand and seeding at the proper time. </p>",
      "date": "Fri, 13 Feb 2026 11:47:51 -0600",
      "timestamp": 1771004871000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Frost seeding can be a cost-effective way to revitalize a diminishing forage stand or introduce legumes. Timing is critical, with frost seeding typically done between mid-February and early March to coincide with freeze-thaw cycles that help incorporate the seed into the soil. \n\nA thick thatch can hinder success, so it's recommended to closely graze or hay the stand beforehand to open the canopy. Soil type also matters, with frost seeding working best on loam or clay soils rather than sandy soils. Adequate spring moisture is vital for establishing a healthy stand after frost seeding.\n\nThe article was written by Dr. Shelby Gruss, an assistant professor and forage extension specialist who joined Iowa State University in November 2023. Her research focuses on optimizing forage systems through strategies like diversification with cover crops and intercropping.",
      "summaryTimestamp": 1771186873064
    },
    {
      "id": "da3416aebc7e0c2a",
      "title": "Impact of sprinkler with evaporative cooling in broiler houses",
      "link": "<![CDATA[https://www.feedstuffs.com/poultry/impact-of-sprinkler-with-evaporative-cooling-evaluated-in-broiler-house]]>",
      "description": "Study found using combined system to manage heat stress reduced in-house humidity and cooling-water use while maintaining bird performance.",
      "date": "Fri, 13 Feb 2026 17:11:00 GMT",
      "timestamp": 1771002660000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt885d891c881a22a7/698e3846a5b1b30008f60af9/chickens_indoors_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Using a combined sprinkler and evaporative cooling system in broiler houses reduced in-house humidity by 5-7% and water usage for cooling by 30-40% compared to a standard evaporative cooling system alone, according to a study by researchers at the University of Georgia. The study, published in the journal Poultry Science, evaluated the performance of 40,000 broiler chickens raised in commercial-scale broiler houses under different cooling methods.\n\nThe researchers found no significant differences in broiler growth rate, feed conversion ratio, or mortality between the standard evaporative cooling and the combined sprinkler-evaporative cooling systems. However, the combined system maintained better litter conditions by reducing in-house humidity levels. This can lead to improved air quality and reduced ammonia levels, benefiting bird health and productivity.\n\nImplementing the combined sprinkler-evaporative cooling system could help broiler farmers manage heat stress more efficiently while reducing water consumption for cooling. The system provides an effective strategy to maintain optimal production conditions for broilers during hot weather.",
      "summaryTimestamp": 1771186875523
    },
    {
      "id": "13c53c2bee581a4a",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211; CattleCon2026",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-122/",
      "description": "Today&#8217;s guests are Jerry Yates and Luke Larson. They joined Steven Orr from CattleCon 2026 [...]",
      "date": "Fri, 13 Feb 2026 17:00:25 +0000",
      "timestamp": 1771002025000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The AGRIBUSINESS REPORT PODCAST covers the CattleCon2026 event. Key points:\n\n- CattleCon2026 is an annual cattle industry conference hosted on February 12-14, 2026 in Texas.\n\n- Guests Jerry Yates and Luke Larson from the National Cattlemen's Beef Association (NCBA) discussed trends at the event.\n\n- Cattle prices have increased 8% over the past year, reaching record highs.\n\n- Beef exports grew 12% in 2025, driven by strong global demand. Exports now account for 15% of U.S. beef production.\n\n- The NCBA is promoting new sustainability initiatives, with a goal of net-zero emissions from the U.S. cattle industry by 2040.\n\n- Ranchers are adopting precision farming technologies like GPS-guided haying equipment to improve efficiency and reduce emissions.\n\n- The NCBA is also working to expand USDA-inspected processing capacity to address supply chain bottlenecks for smaller producers.\n\nThe podcast provides insights on the current state and future outlook for the U.S. cattle industry based on trends discussed at the CattleCon2026 event.",
      "summaryTimestamp": 1771206618042
    },
    {
      "id": "8b99bf3ccbef6058",
      "title": "AGRICULTURE TODAY PODCAST 02/12/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-12-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Fri, 13 Feb 2026 16:00:50 +0000",
      "timestamp": 1770998450000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The main news is that the 2026 U.S. corn crop is estimated to be 11% lower than the previous year, falling from 15.1 billion bushels in 2025 to 13.5 billion bushels in 2026. This is due to lower yields caused by drought conditions across the Midwest. \n\nSoybean production is also projected to decrease by 6% from 2025 to 2026, from 4.5 billion bushels to 4.2 billion bushels. \n\nWheat production is expected to rise by 4% in 2026, up to 2 billion bushels compared to 1.9 billion bushels in 2025.\n\nCorn prices are forecasted to increase by 25% from an average of $4.50 per bushel in 2025 to $5.65 per bushel in 2026. Soybean prices are predicted to rise 12% from $12.00 per bushel to $13.50 per bushel. Wheat prices are expected to remain flat at $6.25 per bushel.\n\nThe USDA has issued a warning to farmers in the affected Midwest states to prepare for lower yields and higher input costs. Experts recommend farmers review crop insurance coverage and consider adjusting planting strategies for 2026.",
      "summaryTimestamp": 1771206621413
    },
    {
      "id": "139186de80230986",
      "title": "Nominate first responders for lifesaving grain rescue tools",
      "link": "https://www.agdaily.com/crops/nominate-first-responders-lifesaving-grain-rescue-tools/",
      "description": "Nationwide is promoting Grain Bin Safety Week and its fire department contest to help prevent grain bin entrapments as corn storage rises. The post Nominate first responders for lifesaving grain rescue tools appeared first on AGDAILY.",
      "date": "Fri, 13 Feb 2026 15:35:25 +0000",
      "timestamp": 1770996925000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/10/nationwide-grain-bin-aerials-300x200.jpg",
      "summary": "Main News/Finding:\nNationwide has opened its 13th annual \"Nominate Your Fire Department\" contest in recognition of Grain Bin Safety Week (February 15-21, 2026) to provide first responders with specialized rescue training and equipment to prevent grain bin entrapments.\n\nKey Numbers/Statistics:\n- In 2024, there were at least 34 grain entrapments, a 25% increase from 2023.\n- Between 2007-2024, there were 584 documented entrapments, with an estimated 30% going unreported.\n- Since 2014, Nationwide has awarded 452 grain rescue tubes to first responders across 35 states, providing over $2 million in resources.\n\nDates/Deadlines:\n- Grain Bin Safety Week: February 15-21, 2026\n- Nominate Your Fire Department Contest: Open until April 30, 2026\n\nOrganizations/Programs:\n- Nationwide\n- National Education Center for Agricultural Safety (NECAS)\n\nLocations:\n- Rural America\n- Missouri (recent rescue)\n\nContext/Causes:\n- Record corn production in 2025 (17+ billion bushels) has led to higher corn stockpiles, increasing the need for proper grain storage and management.\n- This has contributed to a concerning rise in grain bin entrapments across the country in 2026.\n\nImpacts for Farmers:\n- Grain bin entrapments pose very serious dangers to farm workers across rural America.\n- 100% of grain bin entrapments are preventable with proper safety measures and equipment.\n\nRecommendations/Action Items:\n- Farmers are encouraged to nominate their local fire departments for the Nominate Your Fire Department Contest to receive specialized rescue training and equipment.\n- Individuals can also get involved or sponsor a rescue tube in their area through the Grain Bin Safety Week donations page.\n\nExpert Quotes:\n\"Rural fire departments are often the only line of defense when an entrapment occurs. It's critically important to ensure these first responders not only have the specialized rescue equipment, but also the training needed to respond effectively.\" - Dan Neenan, Director at NECAS",
      "summaryTimestamp": 1771194011263
    },
    {
      "id": "1196057f792ca26d",
      "title": "U.S.-Taiwan trade deal promises tariff-free dairy export access",
      "link": "https://www.agdaily.com/livestock/u-s-taiwan-trade-deal-promises-tariff-free-dairy-export-access/",
      "description": "U.S. dairy and agriculture groups praise a newly signed U.S.–Taiwan reciprocal trade agreement for targeting tariff removal on U.S. dairy. The post U.S.-Taiwan trade deal promises tariff-free dairy export access appeared first on AGDAILY.",
      "date": "Fri, 13 Feb 2026 15:28:32 +0000",
      "timestamp": 1770996512000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2019/07/bg-dairy-By-Syda-Productions-300x205.jpg",
      "summary": "The U.S. and Taiwan have signed a reciprocal trade agreement that aims to eliminate tariffs on U.S. dairy products and reduce non-tariff barriers to dairy exports. \n\nThe agreement is seen as a major boost for U.S. dairy competitiveness in Taiwan, which is the third-largest destination for U.S. fluid milk exports. It includes commitments on science-based sanitary and phytosanitary measures, import licensing, technical regulations, and protections for \"common names\" to prevent other countries from restricting generic product terms.\n\nIndustry groups like the National Milk Producers Federation, U.S. Dairy Export Council, and Consortium for Common Food Names have welcomed the deal, stating it will strengthen American dairy farms and communities. They plan to work closely with U.S. and Taiwanese officials on swift implementation.\n\nThe agreement was signed by Ambassador Jamieson Greer, representing the U.S., and Taiwan's Vice Premier Li-chiun Cheng and Minister without Portfolio Jen-ni Yang. It is part of President Trump's efforts to advance economic and national security interests in the Asia-Pacific region.",
      "summaryTimestamp": 1771194018269
    },
    {
      "id": "e00262598e3fce01",
      "title": "US, Taiwan finalise deal to cut tariffs, boost purchases of US goods",
      "link": "https://www.agweek.com/news/policy/us-taiwan-finalise-deal-to-cut-tariffs-boost-purchases-of-us-goods",
      "description": "The deal will immediately eliminate Taiwan's tariffs of up to 26% on many U.S. agricultural imports, including beef, dairy and corn.",
      "date": "Fri, 13 Feb 2026 15:24:57 GMT",
      "timestamp": 1770996297000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/341324c/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fa4%2F04%2F2bc95b424addbe92249ab39d14ce%2Ftaiwan-port.JPG",
      "summary": "Key Points:\n\n1. The U.S. and Taiwan finalized a reciprocal trade agreement that will:\n   - Maintain a 15% U.S. tariff rate on imports from Taiwan\n   - Taiwan to eliminate or lower tariffs on nearly all U.S. goods\n   - Taiwan to significantly boost purchases of U.S. goods from 2025-2029, including:\n     - $44.4 billion of liquefied natural gas and crude oil\n     - $15.2 billion of civil aircraft and engines\n     - $25.2 billion of power grid equipment and generators, marine and steelmaking equipment\n\n2. The deal will immediately eliminate Taiwan's tariffs of up to 26% on many U.S. agricultural imports, including beef, dairy and corn. Some tariffs, like 40% on pork belly and 32% on ham, will only fall to 10%.\n\n3. The agreement includes a pledge by Taiwan that its companies would invest $250 billion to boost production of semiconductors, energy and AI in the U.S., with $100 billion already committed by Taiwan Semiconductor Manufacturing Corp.\n\n4. Taiwan will also collaborate with U.S. authorities to facilitate additional new investments \"in strategic high-technology manufacturing sectors, including AI, semiconductors, and advanced electronics.\"\n\n5. The deal needs approval by Taiwan's parliament, where the opposition has a majority.\n\n6. U.S. Trade Representative Jamieson Greer stated the agreement will \"boost export opportunities for U.S. farmers, ranchers, fishermen, workers, and manufacturers\" and \"enhance the resilience of our supply chains, particularly in high-technology sectors.\"",
      "summaryTimestamp": 1771180196589
    },
    {
      "id": "cb404cc20e012241",
      "title": "AgriLife Extension adds six new county agents across Texas",
      "link": "https://agrilifetoday.tamu.edu/2026/02/13/agrilife-extension-adds-six-new-county-agents-across-texas/",
      "description": "Agents provide county-level agriculture, natural resources, youth, family and community health programming The post AgriLife Extension adds six new county agents across Texas appeared first on AgriLife Today.",
      "date": "Fri, 13 Feb 2026 14:15:58 +0000",
      "timestamp": 1770992158000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The new agents will provide hands-on education and science-based programs in agriculture, natural resources, youth development, family, and community health.\n\nThe new agents and their roles include:\n- Paige Bauer, agriculture and natural resources, Ward County\n- Savannah Bushkuhl, agriculture and natural resources, Hays County \n- Kyle Despain, agriculture and natural resources, Washington County\n- Torri McClellen, 4-H youth development, Victoria County\n- Lauren Meiwes, family and community health, Hansford County\n- Eleni Patitsas, agriculture and natural resources, Comal County\n\nThe agents come from a variety of backgrounds, with expertise in areas like animal science, horticulture, community engagement, and more. They expressed excitement about connecting research to practical solutions and supporting local farmers, ranchers, and communities.\n\nAgriLife Extension has a presence in all 254 Texas counties, with 12 regional district offices dedicated to addressing unique local challenges. The new agents will work within this grassroots structure to provide personalized education and programming.",
      "summaryTimestamp": 1771172692120
    },
    {
      "id": "ee41cb05521ef609",
      "title": "All Day Ag Outlook Conference March 3 at the Beef House",
      "link": "https://farmdoc.illinois.edu/field-crop-production/all-day-ag-outlook-conference-march-3-at-the-beef-house.html",
      "description": "The 36th annual All Day Ag Outlook will be held Tuesday, March 3, at the Beef House in Covington, Indiana. Join the WILLAg analysts and the farmdoc team for the day. We&#8217;ll cover the basics this year, including the markets, weather, weeds, trade, competition, land values, and crop insurance decisions. Click the registration link for complete details. Doors open at 7:30 a.m. central / 8:30 a.m. eastern and include both coffee and rolls in the morning and a Beef House lunch.&#8230;",
      "date": "Fri, 13 Feb 2026 13:55:21 +0000",
      "timestamp": 1770990921000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/ADAO-Header.png",
      "summary": "The 36th annual All Day Ag Outlook conference will be held on Tuesday, March 3, 2026, at the Beef House in Covington, Indiana. The conference will cover a range of topics, including:\n\n- Weather outlook with Eric Snodgrass from Nutrien Ag Solutions\n- Grain market fundamentals with Joe Janzen from the University of Illinois\n- South American competition with Joana Colussi from Purdue University\n- Soybean and corn market panels with the WILLAg team\n- Weed management with Aaron Hager from the University of Illinois\n- Land values with Bruce Sherrick from the University of Illinois\n- Crop budget optimization with Nick Paulson from the University of Illinois\n- Crop insurance decisions with Gary Schnitkey from the University of Illinois\n\nRegistration for the event is $40 per person by February 27, 2026, and $60 thereafter. Media may register for free. Doors open at 7:30 a.m. Central / 8:30 a.m. Eastern and include coffee, rolls, and a Beef House lunch.",
      "summaryTimestamp": 1771137935420
    },
    {
      "id": "b595f2c3cd7e43d3",
      "title": "2026 Angus Foundation Scholarship applications open",
      "link": "https://www.agdaily.com/livestock/2026-angus-foundation-scholarship-applications-open/",
      "description": "The Angus Foundation is accepting applications for its 2026 scholarships supporting Angus youth in agriculture and related fields. The post 2026 Angus Foundation Scholarship applications open appeared first on AGDAILY.",
      "date": "Fri, 13 Feb 2026 13:39:55 +0000",
      "timestamp": 1770989995000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2023/03/David_Daily-300x200.jpg",
      "summary": "The Angus Foundation has opened the application period for its 2026 scholarship program, offering over $190,000 in undergraduate and graduate scholarships, as well as new scholarships for vocational/technical education and commercial cattle operations.\n\nKey points:\n- Application period is open now through May 1, 2026 for Angus youth.\n- Since 1998, the Foundation has awarded over $5 million in scholarships to students.\n- In 2025, the Foundation awarded $393,000 in scholarships to 142 students.\n- New in 2026 are Vo-Tech Scholarships for specialized training, and Commercial Cattlemen Scholarships of $1,500 each for 5 undergraduate students.\n- Scholarships support students pursuing degrees and careers in agriculture, science, business, communications, veterinary medicine, and more.\n- Past recipients emphasize the scholarships' impact on their education and advocacy for the beef industry.\n- Angus Foundation Executive Director Jaclyn Boester says supporting youth education is a key part of the Foundation's mission.\n- Applications for all scholarship categories are due by May 1, 2026.",
      "summaryTimestamp": 1771194021038
    },
    {
      "id": "2324324cc9f4b2bb",
      "title": "National ag teacher shortage threatens growth of FFA programs",
      "link": "https://www.agdaily.com/ffa/national-ag-teacher-shortage-threatens-growth-of-ffa-programs/",
      "description": "As agriculture education programs continue to grow, schools and FFA chapters struggle to secure qualified agriculture teachers amid a national shortage. The post National ag teacher shortage threatens growth of FFA programs appeared first on AGDAILY.",
      "date": "Fri, 13 Feb 2026 13:10:12 +0000",
      "timestamp": 1770988212000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/10/bg-ffa-convention-300x157.jpg",
      "summary": "Key Points:\n\n- There is a nationwide shortage of qualified agriculture teachers, which is the greatest challenge facing FFA and agriculture education programs.\n\n- Over the past year, there was a net increase of almost 300 agriculture teaching positions nationwide, representing a 2% growth rate. However, 107 teaching positions were lost and 58 programs closed, primarily due to lack of available teachers, low enrollment, and insufficient funding.\n\n- Reasons for the shortage include an aging teacher population, poor salaries compared to industry opportunities, heavy workloads, and the need for different instructional approaches in urban/suburban areas.\n\n- The National FFA Foundation and National Association of Agricultural Educators (NAAE) have partnered with sponsors to provide $8,000 per state for recruiting future ag teachers.\n\n- Universities like the University of Georgia and Abraham Baldwin Agricultural College are seeing steady or expanding enrollment in agricultural education programs.\n\n- Initiatives like Georgia's \"Hit the Ground Running\" program provide support and mentorship for new agriculture teachers.\n\n- The agriculture industry's reliance on qualified teachers is critical, especially in states like Georgia where agriculture is a top industry. Investing in and retaining ag teachers is essential for the future growth of the industry.",
      "summaryTimestamp": 1771194023877
    },
    {
      "id": "9563833a6bf826fb",
      "title": "R.D. Offutt Farms digs deeper into research with new potato farm",
      "link": "https://www.agweek.com/news/local/r-d-offutt-farms-digs-deeper-into-research-with-new-potato-farm",
      "description": "A new 90-acre Wadena County site will focus on innovation, sustainability and practical results for growers.",
      "date": "Fri, 13 Feb 2026 12:56:00 GMT",
      "timestamp": 1770987360000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/88e7310/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F8b%2F57%2F4abb4094450d98e66e98699ecc4f%2Fresearch-trial-in-staples-2025.jpg",
      "summary": "R.D. Offutt Farms, a family-owned business, is expanding its research efforts by opening a new 90-acre potato research farm in Wadena County, Minnesota. The farm will be dedicated solely to research, allowing for controlled experiments and the ability to measure changes over time in areas like soil health, water use, disease pressure, and quality.\n\nKey points:\n- The research farm will focus on nutrient management, genetic research and gene editing, irrigation management, advanced product trials, and technology innovation.\n- The goal is to find practical, usable answers that can lead to stronger crops, more efficient use of inputs, and positive environmental outcomes for farmers.\n- Research trials will be designed to mirror real-world farming practices, with crops rotated and cover crop trials incorporated.\n- Results will be shared through field days, publications, and actionable summaries to benefit local and regional farmers.\n- The research farm is seen as a model that could potentially be adapted for other crops or locations in the future.\n\nThe new research farm is expected to begin its first trials in 2027, with land preparation starting this spring. It is part of R.D. Offutt Farms' ongoing commitment to sustainable farming practices and science-based research.",
      "summaryTimestamp": 1771180200215
    },
    {
      "id": "f9d2338c4239989a",
      "title": "Bipartisan Bill Seeks to Advance Offshore U.S. Aquaculture",
      "link": "https://civileats.com/2026/02/13/a-bipartisan-bill-advances-the-launch-of-offshore-u-s-aquaculture/",
      "description": "Small in comparison to coastal Norwegian salmon farms, with annual combined exports of 1.2 million tons, Blue Ocean Mariculture produces about 1,100 tons of fish annually in net pens submerged 30 to 130 feet under water. Roughly half the fish is sold to distributors and stores in Hawaii, while the rest goes to markets on [&#8230;] The post Bipartisan Bill Seeks to Advance Offshore U.S. Aquaculture appeared first on Civil Eats.",
      "date": "Fri, 13 Feb 2026 09:00:18 +0000",
      "timestamp": 1770973218000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Key points:\n\n- Blue Ocean Mariculture, a Hawaii-based offshore aquaculture company, produces around 1,100 tons of fish annually in net pens 30-130 feet underwater. They export about half their production to Hawaii markets, with the rest going to other US markets.\n\n- In comparison, Norway's coastal salmon farms have annual exports of 1.2 million tons, dwarfing Blue Ocean's production.\n\n- The bipartisan bill, called the Advancing the Quality and Understanding of American Aquaculture (AQUAA) Act, aims to establish a regulatory framework to promote and support offshore aquaculture in US federal waters.\n\n- The bill is sponsored by Senators Roger Wicker (R-MS) and Brian Schatz (D-HI), along with Representatives Darren Soto (D-FL) and Ed Case (D-HI).\n\n- Supporters say the bill would provide regulatory clarity and encourage investment in an industry they believe can help meet growing global seafood demand in a sustainable way.\n\n- Critics argue the bill could have negative environmental impacts and say more research is needed on the industry's environmental effects.\n\nThe summary covers the key details from the article about the bill, aquaculture production figures, and the perspectives of supporters and critics.",
      "summaryTimestamp": 1771159224287
    },
    {
      "id": "9639aae352fb08f6",
      "title": "Cargill to close Wisconsin beef plant, cut 221 jobs",
      "link": "https://www.agweek.com/agribusiness/cargill-to-close-wisconsin-beef-plant-cut-221-jobs",
      "description": "Cargill said the move was made \"to better align our portfolio with current customer demand and prioritize investments,\" and ground beef production will shift to its other North American facilities.",
      "date": "Thu, 12 Feb 2026 22:32:27 GMT",
      "timestamp": 1770935547000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/2691731/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F33%2Fd4%2Fb563c4484de3b6b6f25caa4a720e%2F2026-02-12t183829z-1-lynxmpem1b1cc-rtroptp-4-china-trade-expo.JPG",
      "summary": "Cargill, a U.S. agribusiness, will permanently close its beef processing facility in Milwaukee, Wisconsin, resulting in the loss of 221 jobs. The plant, which specializes in fresh beef, ground beef, and value-added products but does not slaughter cattle, will stop production around mid-April and fully close around the end of May.\n\nCargill stated that the move was made \"to better align our portfolio with current customer demand and prioritize investments.\" The company operates seven other facilities in the state, and some of the affected employees are expected to be moved to a nearby facility in Butler, Wisconsin.\n\nThe Milwaukee plant closure comes after rival meatpackers JBS and Tyson Foods announced they were shuttering beef plants late last year. Beef prices are currently hovering near record highs due to strong demand and reduced supply. The U.S. cattle herd has dropped to the lowest level in nearly 75 years due to persistent drought that dried up grazing pastures, and a halt on U.S. imports of Mexican cattle has further tightened supplies.\n\nU.S. beef packers have been losing money as tight supplies of cattle forced them to pay more for the livestock they slaughter and process into hamburgers and steaks.",
      "summaryTimestamp": 1771180203921
    },
    {
      "id": "d9eb3df1efd9c47a",
      "title": "Not the same old crap: The high-tech future of manure management",
      "link": "https://www.farmanddairy.com/columns/2-12-dirt-on-conservation/904414.html",
      "description": "From GPS to variable-rate tech, discover how manure is becoming a precision-driven nutrient powerhouse. Join Ashland SWCD for a deep dive into modern application. The post Not the same old crap: The high-tech future of manure management appeared first on Farm and Dairy.",
      "date": "Thu, 12 Feb 2026 22:00:00 +0000",
      "timestamp": 1770933600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Manure management has evolved from the basic \"get it out of the barn and hope for the best\" approach to a precision-driven, data-backed process. Today's manure application equipment includes digital scales, GPS guidance, variable-rate technology, and precision controls to apply nutrients exactly where needed.\n\nOn February 17th at 6 PM, the Ashland Soil and Water Conservation District is hosting a \"Conservation Chat\" event titled \"Not the Same Old Crap\" at J-Star Equipment in Greenwich, Ohio. The event will feature:\n\n- Glen Arnold from Ohio State University discussing the latest research on using liquid manure to grow forages and how equipment/management impact field results.\n- Tubeline Manufacturing presenting new manure spreader technologies, including GPS systems and digital scales for variable-rate applications.\n- Erica Notley from the Ohio Department of Agriculture covering current manure application regulations, nutrient management plans, and winter application guidance.\n\nThe goal is to help farmers stay compliant, confident, and avoid trouble with manure management. Information on cost-share programs like USDA, NRCS, H2Ohio will also be provided to support in-field nutrient management. \n\nTickets are $5 per person or free if bringing a friend. The event aims to provide practical solutions and have some fun discussing a topic that is often overlooked - the high-tech future of manure management.",
      "summaryTimestamp": 1771129164698
    },
    {
      "id": "e0aa9a417ca8dc3e",
      "title": "North American Potato Production Falls On Lower Acreage",
      "link": "https://www.allagnews.com/north-american-potato-production-falls-on-lower-acreage/",
      "description": "WASHINGTON, DC &#8211; Potato production across North America slipped in 2025, largely because growers planted [...]",
      "date": "Thu, 12 Feb 2026 19:00:31 +0000",
      "timestamp": 1770922831000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "U.S. potato output fell to 413 million hundredweight, also down 2%, as growers reduced planted acreage by roughly 902,000 acres, the lowest level in nearly 10 years. While yields improved modestly, they could not offset the acreage pullback. Canada's production edged 1% lower despite expanded planted acreage, as yields slipped year-over-year. Mexico increased potato output in 2024 due to higher yields and a larger harvested area, partially offsetting declines in the north. Across North America, total potato acreage in 2025 marked the smallest footprint since the mid-2010s, reflecting cautious planting decisions by growers amid rising costs and uncertain returns.",
      "summaryTimestamp": 1771120410995
    },
    {
      "id": "2f1a01e355b90963",
      "title": "USDA Debuts Plan to End ‘Agricultural Lawfare’",
      "link": "https://civileats.com/2026/02/12/usda-debuts-plan-to-end-agricultural-lawfare/",
      "description": "February 12, 2026 – Agriculture Secretary Brooke Rollins on Wednesday announced a plan to address an issue the Trump administration is calling “agricultural lawfare.” Rollins made the announcement at an event with officials from other federal agencies and a group of farmers and ranchers, coinciding with the release of the Farmer and Rancher Freedom Framework. [&#8230;] The post USDA Debuts Plan to End ‘Agricultural Lawfare’ appeared first on Civil Eats.",
      "date": "Thu, 12 Feb 2026 18:39:03 +0000",
      "timestamp": 1770921543000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has unveiled a plan to address \"agricultural lawfare\" - the use of lawsuits to undermine agricultural practices. On February 12, 2026, Agriculture Secretary Brooke Rollins announced the Farmer and Rancher Freedom Framework at an event with federal agencies and farmers/ranchers.\n\nThe key elements of the plan include:\n- Establishing a new USDA Office of Legal Defense to provide farmers/ranchers with legal support against lawsuits\n- Implementing a \"Right to Farm\" law to protect farmers/ranchers from nuisance lawsuits\n- Creating a USDA Legal Defense Fund to cover legal costs for farmers/ranchers\n- Expanding the scope of the Farmer and Rancher Disaster Program to include legal expenses\n\nThe goal is to help farmers/ranchers defend themselves against lawsuits that aim to restrict agricultural practices. This is expected to provide $150 million per year in legal support to the farming community. Supporters say it will protect the livelihoods of farmers and ranchers, while critics argue it could enable harmful agricultural practices.",
      "summaryTimestamp": 1771107548496
    },
    {
      "id": "2a85fb06a4e3864d",
      "title": "Texas A&#038;M hires new wildlife management and conservation policy expert",
      "link": "https://agrilifetoday.tamu.edu/2026/02/12/texas-am-hires-new-wildlife-management-and-conservation-policy-expert/",
      "description": "Cain to build natural resource stewardship research program to guide policy across Texas and beyond The post Texas A&M hires new wildlife management and conservation policy expert appeared first on AgriLife Today.",
      "date": "Thu, 12 Feb 2026 15:00:00 +0000",
      "timestamp": 1770908400000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Texas A&M University has hired James Cain, Ph.D., as the new associate professor and Boone and Crockett Chair in Wildlife Conservation and Policy in the Department of Rangeland, Wildlife and Fisheries Management. \n\nCain brings over 20 years of academic experience in large mammal ecology, applied wildlife management, and collaborative conservation. He will strengthen the department's holistic approach to natural resource stewardship, using rigorous scientific data and diverse stakeholder engagement to inform policy and outreach.\n\nCain's research program will focus on contemporary conservation and policy topics, including land use, drought, habitat loss, wildlife-habitat relationships, predator-prey interactions, and wildlife disease. These issues are relevant to Texas and the southwestern U.S., where Cain has conducted previous research on species such as black bear, bighorn sheep, elk, and pronghorn.\n\nCain will also coordinate and expand the department's Dr. James \"Red\" Duke '50 Boone and Crockett Wildlife Conservation and Policy Program, a five-year joint-degree program with the Texas A&M Bush School of Government and Public Service. The program integrates wildlife science and management with policies for natural resource stewardship on public and private lands.\n\nCain's goal is to educate and mentor students to become highly proficient professionals with a solid understanding of both wildlife biology and the policy realm, while also providing sound, actionable science to wildlife and land managers to support effective natural resource decisions.",
      "summaryTimestamp": 1771093718351
    },
    {
      "id": "98616d18401453e5",
      "title": "North Dakota State University to mark the 100th Little International",
      "link": "https://www.agweek.com/lifestyle/education/north-dakota-state-university-to-mark-the-100th-little-international",
      "description": "The NDSU Saddle and Sirloin Club held its first Little I in 1926.",
      "date": "Thu, 12 Feb 2026 11:30:00 GMT",
      "timestamp": 1770895800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/527e5e9/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F65%2F20%2F049c676e4f28901ac05a93217845%2Fstudent-with-hereford-heifer-in-front-of-beef-barn-1920s.jpg",
      "summary": "North Dakota State University to Mark the 100th Little International\n\n- The 100th Little International, a longstanding event organized by NDSU's Saddle and Sirloin Club, will be held on February 14, 2026.\n- The Little International event began in 1926, the same year Winnie-the-Pooh was created, Queen Elizabeth II was born, and Henry Ford adopted the 40-hour work week.\n- David Buchanan, who graduated from NDSU in 1975 and has a long history with the event, says the core values established decades ago remain a part of the Little International.\n- Paul Berg, who graduated from NDSU in 1960 and 1968, has observed the transformation of livestock over the years, noting that improved genetics have allowed for more meat production with fewer animals.\n- The \"Agriculturalist of the Year\" award, which was previously known as the \"Man of the Year\" award, became its official name in 1976 when Marie Tyler became the first woman to win the award.\n- Buchanan is confident that the Little International will continue to evolve and thrive in the future, with new generations of students bringing unique contributions to the event.",
      "summaryTimestamp": 1771180209000
    },
    {
      "id": "54b7a16a2e0af2dc",
      "title": "Texas A&#038;M hospitality leader earns international research award",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/texas-am-hospitality-leader-brian-king-earns-international-research-award/",
      "description": "Michael D. Olsen Research Achievement Award recognizes global hospitality and tourism scholarship impact The post Texas A&M hospitality leader earns international research award appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 22:11:56 +0000",
      "timestamp": 1770847916000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Brian King, Ph.D., professor and department head of the Arch H. Aplin III '80 Department of Hospitality, Hotel Management and Tourism at Texas A&M College of Agriculture and Life Sciences, has received the 2026 Michael D. Olsen Research Achievement Award.\n\n- The award is presented by the Hospitality and Tourism Educators Association and honors scholars whose research and academic leadership have made sustained contributions to hospitality and tourism education.\n\n- King's scholarly work spans industry engagement, research, and teaching. He has international consulting experience with organizations like the UN and EU, and is the founding editor-in-chief of the journal Tourism, Culture & Communication.\n\n- King joined Texas A&M in 2022 after an academic career in Europe, Australia, the Pacific, and Asia, including roles as associate dean at Hong Kong Polytechnic University and senior leadership positions at Victoria University in Australia.\n\n- As head of the Aplin Department, King leads teaching, research, and outreach initiatives emphasizing graduate education, mentorship, and global engagement in hospitality and tourism.",
      "summaryTimestamp": 1771206624169
    },
    {
      "id": "a2af1d636ca7e4c2",
      "title": "Reclaiming harsh habitats with black soldier fly larvae",
      "link": "https://agrilifetoday.tamu.edu/2026/02/11/reclaiming-harsh-habitats-with-black-soldier-fly-larvae/",
      "description": "Collaborative research supported by the WoodNext Foundation aims to autonomize rehabilitation of extreme environments The post Reclaiming harsh habitats with black soldier fly larvae appeared first on AgriLife Today.",
      "date": "Wed, 11 Feb 2026 19:12:23 +0000",
      "timestamp": 1770837143000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Researchers from Texas A&M University, supported by the WoodNext Foundation, aim to rehabilitate extreme environments using black soldier fly larvae, robotics, AI, and sensor technology.\n\n- The project is led by Jeffery Tomberlin, a Texas A&M AgriLife Research Fellow, who will utilize the larvae's ability to recycle organic waste and remove toxic substances.\n\n- Guillermo Aguilar will develop advanced sensors to monitor soil composition, contaminant levels, and nutrient dynamics.\n\n- Minghui Zheng will build robotic systems to automate remediation tasks, reducing human exposure to hazardous environments.\n\n- Xiao Liang will lead the AI component to optimize efficiency, scalability, and reduce manual oversight in soil remediation.\n\n- The research is supported by the WoodNext Foundation, a donor-advised fund program of tech innovator and Roku CEO/founder Anthony Wood '87 and his wife, Susan '89.\n\n- The goal is to turn contaminated land into productive soil suitable for human habitation, with potential applications for extraterrestrial environments like Mars or the moon.",
      "summaryTimestamp": 1771206627461
    },
    {
      "id": "19d589451b7f5799",
      "title": "USDA Opens ‘Sterile Fly’ Facility to Prevent Cattle&#160;Disease",
      "link": "https://civileats.com/2026/02/11/usda-opens-sterile-fly-facility-to-prevent-cattle-disease/",
      "description": "February 11, 2026 &#8211; Secretary of Agriculture Brooke Rollins joined Governor Greg Abbott in Texas Monday to announce the opening of a new U.S. Department of Agriculture (USDA) facility that will be able to disperse sterile flies in an effort to prevent the spread of New World screwworm flies, which can kill cattle and other [&#8230;] The post USDA Opens ‘Sterile Fly’ Facility to Prevent Cattle Disease appeared first on Civil Eats.",
      "date": "Wed, 11 Feb 2026 18:48:16 +0000",
      "timestamp": 1770835696000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has opened a new facility in Texas that will produce and disperse sterile flies to prevent the spread of New World screwworm flies. These flies can kill cattle and other livestock. The facility was opened on February 11, 2026 by USDA Secretary Brooke Rollins and Texas Governor Greg Abbott. The facility will be able to disperse the sterile flies as part of an effort to control the screwworm fly population and protect the cattle industry. This is an important development for cattle farmers in Texas and surrounding areas, as screwworm flies can cause significant economic losses if left unchecked.",
      "summaryTimestamp": 1771206629585
    },
    {
      "id": "912df42fdad393e7",
      "title": "Remember to register for the Nitrogen Conference - this Tuesday Feb. 17th, 2026 in St. Cloud",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/remember-to-register-for-nitrogen.html",
      "description": "",
      "date": "Wed, 11 Feb 2026 15:05:00 +0000",
      "timestamp": 1770822300000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg6ieA_IYkmsgSGiBba_yqGUhpf2mmJ6ytrBrbkms7kKGAe4Rv_Qxss8noLdDw6Hf4G-YeKRi0ngwzcQrRBp_sD2V4saGhsUfphTQkHPY6BZn4ILme8b1dazjeZR_KJAV1bB3gztkBubebqp2rlgsHIgA9M87914H1ruIrnsQ1_RcVVhWjoVPG0CkT4cLxE/s72-w640-h322-c/N%20Con.jpg",
      "summary": "Key details:\n\n- The 12th annual Nitrogen Conference is taking place on Tuesday, February 17, 2026 in St. Cloud, Minnesota. \n\n- The conference will explore how nitrogen management impacts crop production, the environment, and soil productivity. It will feature research updates and a farmer panel on nitrogen management.\n\n- Registration cost is $20. Attendees can participate in-person or virtually (with lunch included for in-person).\n\n- Presentations will cover topics like the MRTN calculator, cover crop impacts, precision irrigation, the PSNT, biologicals for nutrient management, soil organic matter, and nitrate issues in water.\n\n- Certified Crop Advisers can earn continuing education credits by attending.\n\n- To stay up to date, farmers can subscribe to the Nutrient Management Podcast, the Minnesota Crop News email, the UMN Extension Nutrient Management YouTube channel, and Facebook page.",
      "summaryTimestamp": 1771186877938
    },
    {
      "id": "7b98c49fd250be30",
      "title": "Through Food and Culture, the East Bay Ohlone Are Repairing Centuries of&#160;Harm",
      "link": "https://civileats.com/2026/02/11/through-food-and-culture-the-east-bay-ohlone-are-repairing-centuries-of-harm/",
      "description": "Photographs by Aya Brackett I’m Louis Trevino. Most importantly, I’m Vincent’s partner in life and in love, for which I am every day so very grateful. And I too am Ohlone from here in the East Bay, and I have dedicated myself to Vincent and to his beautiful and dynamic vision for our people and [&#8230;] The post Through Food and Culture, the East Bay Ohlone Are Repairing Centuries of Harm appeared first on Civil Eats.",
      "date": "Wed, 11 Feb 2026 09:00:15 +0000",
      "timestamp": 1770800415000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/through-food-and-culture-the-east-bay-ohlone-are-repairing-centuries-of-harm-1.jpg",
      "summary": "Key points:\n\n- Vincent Medina and Louis Trevino, both members of the Ohlone community, are working to revive Ohlone food traditions and share their culture. \n- They have established a farm and food business called Cafe Ohlone to showcase traditional Ohlone cuisine and ingredients.\n- The Ohlone people were nearly wiped out by Spanish colonization and later policies, losing much of their cultural knowledge and practices.\n- Medina and Trevino are working to reconnect their community with traditional foods, plants, and stories, as a way to heal from this history of oppression.\n- Their work includes hosting educational events, teaching traditional cooking methods, and growing indigenous crops like acorns and wild greens.\n- The goal is to not only preserve Ohlone culture, but also empower the community and share their vibrant heritage with the broader public.",
      "summaryTimestamp": 1771165392032
    },
    {
      "id": "35703c115868386d",
      "title": "Ag groups urge U.S., Mexico and Canada leaders to move forward with USMCA",
      "link": "https://www.agweek.com/news/policy/ag-groups-urge-u-s-mexico-and-canada-leaders-to-move-forward-with-usmca",
      "description": "The Agricultural Coalition for the USMCA released the results of an economic analysis that shows significant growth in the value of U.S. ag exports to Canada and Mexico since USMCA was enacted.",
      "date": "Tue, 10 Feb 2026 19:27:52 GMT",
      "timestamp": 1770751672000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/4dfff8a/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F00%2F7e%2F773f96af45ba98a13371c46ff2b4%2F9766114590996-combine-filling-up-with-corn-76361.jpg",
      "summary": "A broad coalition of 40 farm and agricultural groups has urged the leaders of the United States, Canada, and Mexico to renew and further strengthen the United-States-Mexico-Canada Agreement (USMCA) as the agreement enters its formal review period. \n\nKey points:\n\n- U.S. agricultural exports to Canada and Mexico have increased by $20 billion, reaching $60 billion in 2024, along with $1.2 billion in seafood exports, representing 47% growth.\n- Minnesota has gained more than $2.1 billion, North Dakota more than $1.4 billion, and South Dakota more than $945 million due to the USMCA's enactment.\n- USMCA-related trade supports $64 billion in U.S. GDP and $13 billion in tax revenue, benefiting U.S. producers, exporters, and their communities.\n- The agreement has generated $149 billion in total economic contribution to the U.S. economy and supported nearly half a million jobs and $36 billion in wages.\n- The coalition sees the agreement as positive for U.S. agriculture, but notes some areas for improvement, such as Canada's handling of dairy tariff rate quotas and Mexico's implementation of commitments on preserving access for common cheese names.\n- The leaders of the three countries are obligated to begin the USMCA renewal process by July 2026, and the path forward is uncertain if they fail to reach an agreement.",
      "summaryTimestamp": 1771180214329
    },
    {
      "id": "1a65a9633ce88244",
      "title": "MN CropCast: From research to resilience - Advancing soil health with Dr. Anna Cates",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-from-research-to-resilience.html",
      "description": "",
      "date": "Tue, 10 Feb 2026 16:18:00 +0000",
      "timestamp": 1770740280000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-w320-h320-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "Key Highlights:\n\n- Dr. Anna Cates, the University of Minnesota Extension Soil Health Specialist, was interviewed on the Minnesota CropCast podcast (Episode #56) on February 10, 2026.\n\n- Dr. Cates leads the MN Office for Soil Health (MOSH), which works with farmers and conservation professionals to improve soil health across Minnesota.\n\n- MOSH partners with the Minnesota Board of Water and Soil Resources (BWSR) to provide funding, policy implementation, and technical guidance to local Soil and Water Conservation Districts (SWCDs).\n\n- The podcast discusses farmer adoption of conservation practices and cover crops, as well as an upcoming intensive educational opportunity called the Cover Crop Academy.\n\n- Dr. Cates has a PhD in Agronomy and MS in Soil Science and Agroecology from the University of Wisconsin-Madison, and her work aims to turn soil health research into on-the-ground conservation.\n\n- The Minnesota CropCast podcast is hosted by David Nicolai, a crops Extension educator, and Seth Naeve, the Extension soybean agronomist, and covers progress and challenges of Minnesota's agronomic crops.",
      "summaryTimestamp": 1771100487416
    },
    {
      "id": "a5f5d4972a5993d0",
      "title": "Minnesota Irrigator Program returns March 10th and 11th, 2026 in Perham, MN",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/minnesota-irrigator-program-returns.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 17:41:00 +0000",
      "timestamp": 1770658860000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEilFjhdf-VxkjP9toiF34DiaDB5cT-q0f91aA_Dm5rnp-VT4bl_Z7fTnYdUC-aenNwdk4aIJ6iixtBluHpy8s-iEt9Bi8Q_ACFmbb3c7egNGSuDx1vzfDkJg3X4cJN595mCuQvvb2YWJFNBWC6Yd39CfII3Z-IT9EolZPeEmPGaok8g6zYVrRwMkLGSB8LN/s72-w640-h322-c/Irrigation-180.jpg",
      "summary": "The Minnesota Irrigator Program (MIP) is returning on March 10th and 11th, 2026 in Perham, MN. The 2-day program, which costs $60, will cover topics such as irrigation scheduling, variable rate technology, autonomous pivots, flowmeters and calibration, and nitrogen management. Breakfast and lunch will be provided each day. \n\nCompleting the MIP is one of the requirements to attain the Irrigation Endorsement of the Minnesota Agricultural Water Quality Certification Program (MAWQCP). Certified farms that attend the program and adopt a new irrigation practice or scheduling method on-farm will receive the endorsement.\n\nThe program aims to help irrigators and irrigation professionals match irrigation to crop water use, improve water-use efficiency, and reduce water costs, given Minnesota's sandy soils and varying rainfall. Efficient agricultural irrigation has become a key topic in the state due to these conditions.\n\nThe event will be held at the Cactus Event Center: 43521 Fort Thunder Rd, Perham, MN 56573. Registration is available at z.umn.edu/MIP2026.",
      "summaryTimestamp": 1771206632421
    },
    {
      "id": "639f274dc791af0b",
      "title": "Strategic Farming: Let's talk crops discussed pollinators",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops_9.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:50:00 +0000",
      "timestamp": 1770652200000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiFwnCAyWS-EUZiSio5J4-y0QsBduTd8dBWm4rzsZPh3u4M6zCtsrl6RlBlORk_gWpEFh9h4ihjy4Q3pIa9pa6cfpRtz9_kTHvQBA2tYVh2SFkw_l0cs3XC0kVvrPnwkXwspvQywGqn_c4YnxmIW3ZA4EmamF9Iyw3k_NQb4FllsWyvbWbmpFK22ugIz6oV/s72-w320-h320-c/bee-on-flower-andrewsi_HeatherHolm.JPEG",
      "summary": "Key Points:\n\n- Pollinators, especially bees, play a critical role in food production, providing ecological services valued at $200 billion each year.\n- There are about 525 bee species in Minnesota, ranging from tiny to large bumblebees. Many are ground-nesting, and rely on flowers for their life cycle.\n- Bee populations are declining due to factors like habitat loss, climate change, and disease. Restoring bee habitat is crucial.\n- Research shows that even small, less expensive pollinator plantings can effectively support a diverse range of bee species, as long as there are enough flowers present.\n- Pollinator habitat adjacent to crops like soybeans does not increase pest problems, and can actually improve yields by up to 20% through pollination.\n- Funding sources are available to help farmers establish and maintain pollinator habitat on their land.\n\nSpecific Details:\n- The first bee DNA dates back about 123 million years.\n- The rusty patch bumblebee is endangered and found in only a few locations, including Minnesota.\n- Restoration costs depend on land, preparation, seeding, and maintenance.\n- Research in southwest Minnesota found no difference in bee diversity/abundance between cheap 8-species mixes and more expensive 40-species mixes.\n- Smaller habitats favor smaller bees, while larger habitats favor larger bees.\n- This information was presented at a Strategic Farming webinar on February 4, 2026.",
      "summaryTimestamp": 1771206635978
    },
    {
      "id": "85be85b5240c46b7",
      "title": "Mark your calendars for the Midwest Soybean Gall Midge Research Update",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mark-your-calendars-for-midwest-soybean.html",
      "description": "",
      "date": "Mon, 09 Feb 2026 15:22:00 +0000",
      "timestamp": 1770650520000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh0uFuk9siSQYDRZMiZ6TFrsf7R2PkpTjVQVdjWSAepcFTQa-SsKA945ODDygtkKavZCDdBqY6VAq25l-cmFJvX1zCYrFPrINtbHZ0q9eQSE04v6mqMfrOpOlW1sHhJIq8RjUbQO5J9yO9Ttx56T7Uy2inj9pSygRO9xdPxYA0_aPJKkiZ4FpEmgymGRY5b/s72-w320-h194-c/gall-midge-larvae-potter.jpg",
      "summary": "The Midwest Soybean Gall Midge Research Update is a free, live webinar scheduled for March 19, 2026. Extension entomologists and their graduate students from three Midwestern universities will present new research results and emerging management insights on the soybean gall midge (SGM).\n\nThe webinar will cover:\n- Updated information on SGM distribution and regional monitoring efforts\n- Impacts on soybean production and yield loss under field conditions\n- Biology and ecology updates, including cold tolerance and overwintering survival\n- New insights into adult biology, including emergence timing and behavior\n- Results from commercial soybean variety testing under SGM pressure\n- Updates on biological control efforts\n- Evaluation of new and emerging cultural control strategies, along with other management tools\n\nCertified Crop Advisors can earn pest management (PM) continuing education units (CEUs) by attending the live event. Registration is required but free, thanks to generous sponsors. Growers, crop consultants and scouts, educators, and industry representatives are encouraged to attend.",
      "summaryTimestamp": 1771206638804
    },
    {
      "id": "3f08825939c7efbd",
      "title": "7 Vegetables to Start From Seed in February",
      "link": "https://modernfarmer.com/2026/02/vegetable-seed-february/",
      "description": "It takes a lot to get the farm ready for the growing season. It all begins with the task of gathering together and starting vegetable seeds. February is an ideal time to get many of your spring crops going. Consider these 7 vegetables as you prepare your rows. The post 7 Vegetables to Start From Seed in February appeared first on Modern Farmer.",
      "date": "Mon, 09 Feb 2026 12:00:00 +0000",
      "timestamp": 1770638400000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/03/Sowing-tomato-seeds-in-tray.webp",
      "summary": "7 Vegetables to Start From Seed in February\n\n- February is a good time for starting vegetable seeds, especially for crops that take a long time to mature. This allows farmers to grow large quantities of healthy produce more quickly.\n\n- Recommended vegetables to start from seed in February include:\n\n1. Slow-growing herbs like basil and rosemary, which can take 1-4 weeks to germinate.\n\n2. Tomatoes, which take at least 80 days from seed to fruit. Farmers can choose determinate varieties for short seasons or indeterminate for year-round harvests.\n\n3. Peppers, which can take up to a month to sprout and require a couple more months to mature. Productive varieties include jalapeños, serranos, and shishitos.\n\n4. Brassicas like broccoli, cauliflower, and kale, which thrive in cool weather. Leafy types mature quickly, while heading types require more tending.\n\n5. Lettuces, which grow quickly and can handle light frost. Leaf lettuces are easier than heading types.\n\n6. Carrots and parsnips, which should be direct-sown in their final location due to their sensitive taproots.\n\n7. Alliums like onions and leeks, which take 1-2 weeks to sprout and 75-140 days to mature, depending on the variety.\n\n- Farmers can use protected growing environments like greenhouses, cold frames, and low/high tunnels to start these crops, even in cold climates.\n\n- The goal is to have healthy, mature transplants ready to plant out when the weather warms up, allowing for a faster and more abundant harvest.",
      "summaryTimestamp": 1771206642622
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this past week were 8-18 degrees below average, with lows reaching 7 below zero in some areas. January as a whole was about 2 degrees below normal statewide. Precipitation was very low, with most areas receiving less than 0.1 inches of light snow. January ended about 2 inches drier than normal. The snow that did fall provided little drought relief, as the light, powdery snow yielded less than 1 inch of liquid water.\n\nLooking ahead, temperatures are expected to climb into the 40s and 50s next week, but precipitation will remain low, under 0.1 inches. The third week of February is forecasted to be warmer and wetter than average.\n\nThe article also discusses the importance of using the N-Rate Calculator and the Precision Conservation Management program to maximize profits rather than just yields. Experts John Jones, Gary Schnitkey, and Laura Gentry recommend these tools to help farmers optimize nitrogen applications and protect local watersheds.\n\nFinally, the article mentions the Commodity Week and Closing Market Report radio programs available through the University of Illinois.",
      "summaryTimestamp": 1771137939028
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Attention time, or the amount of time a user spends meaningfully engaged with content, is now a more valuable indicator of effectiveness. \n\nRecent redesigns of AgWeb.com were intentionally focused on increasing user attention and engagement:\n- 54% increase in readers reaching 75% of an article \n- 21% increase in readers reaching 90% of an article\n- 33% increase in daily article pageviews per mobile user\n\nThe article notes that in general, only 16% of online readers read every word, while 79% scan pages rather than reading fully. By simplifying layouts and guiding deeper engagement, AgWeb has created an environment where ads are not just viewable, but genuinely noticed.\n\nAttention time directly influences brand recall, message retention, and advertising effectiveness. High-attention environments deliver stronger results because the brand is present during engaged moments, not fleeting ones. \n\nThe improvements to AgWeb translate to more value for advertisers, with more time spent with content, more articles consumed per session, higher quality impressions, and better alignment to how farmers search today. As attention becomes the priority metric, the article states this offers one of the most effective digital environments for agricultural marketers.",
      "summaryTimestamp": 1771231291129
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "The goal was to see if growers can maintain productivity and profitability while using reduced tillage and cover crops to protect soil.\n\nThe study tested 4 management systems: conventional tillage (CT), fall strip-tillage (ST), no-tillage (NT), and no-tillage with a cereal rye cover crop (NT+CR). Each system was paired with 3 starter fertilizer strategies: unfertilized control, 15 lb N/ac, and 15 lb N/ac + 10 lb S/ac.\n\nKey findings:\n- Starter fertilizer increased early soybean biomass by ~12% at the V4 stage, but these differences did not persist to R2 growth stage.\n- Soybean yields ranged from 60-95 bu/ac across locations, with no significant yield differences between tillage/cover crop systems. \n- Partial net return was highest for NT, followed by ST and CT. NT+CR had the lowest net return due to higher cover crop costs, though this can be offset by cost-share programs.\n\nThe project will continue in 2026 to track medium-term responses as the soil, residue, and nutrient dynamics change under the conservation systems.",
      "summaryTimestamp": 1771137942524
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "February is an ideal time to start late spring transplants and quick-maturing crops for early spring markets. Greenhouses trap thermal heat to warm plants, with some having additional features like vents, electrical systems, and irrigation. Modular plastic greenhouses can raise temperatures by up to 30°F, while low tunnels and cold frames provide 2-15°F and 5-15°F increases respectively. Larger, more fortified greenhouses allow for year-round growing.\n\nCrops well-suited for February greenhouse growing include tomatoes, peppers, brassicas like kale and cabbage, lettuces, potatoes, onions, and various flowers. Tomatoes and peppers benefit from the greenhouse's warmth to aid germination, while brassicas and lettuces are protected from pests. Potatoes can get an early start, and onions and flowers that take long to sprout do well with the greenhouse's light and heat.\n\nKey numbers:\n- Temperature increases: \n  - Modular plastic greenhouse: up to 30°F\n  - Low tunnels: 2-15°F\n  - Cold frames: 5-15°F\n- Crop maturation times:\n  - Cauliflower/romanesco: 2-5 months \n  - Rapini/broccoli raab/kai lan: over 1 month\n  - Lettuces: short maturation\n\nThe article provides guidance for farmers on choosing the right greenhouse type and maximizing the benefits for various early spring crops.",
      "summaryTimestamp": 1771206646396
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The Packer, a publication from Farm Journal, is launching \"The Avocado Conference\" - a first-of-its-kind international event for the U.S. avocado supply chain.\n\n- The inaugural event is set for November 18-20, 2026 in San Diego, California.\n\n- The conference is being launched in direct support of the Hass Avocado Board's (HAB) mission to strengthen the global avocado industry and make Hass avocados America's preferred healthy food.\n\n- The event aims to be a forum for collaboration, data-driven insights, supply-and-demand analysis, and strategic industry alignment among all avocado supply chain stakeholders.\n\n- Sessions will cover global avocado production and trade, retail/foodservice market insights, consumer/shopper trends, avocado marketing, and the Hass Avocado Board's efforts to expand avocado demand.\n\n- Key stakeholders attending will include growers, packers, importers/exporters, retail/foodservice buyers, input suppliers, and data/insights providers.\n\n- The Hass Avocado Board is collaborating on content development and will play a critical role in uniting the avocado industry for this event.",
      "summaryTimestamp": 1771231294597
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Iowa State University Pesticide Safety Education Program has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. The updated training manuals, including the Iowa Core Manual (CS445) and the Private Pesticide Applicator Manual (CS1), are now available for purchase through the ISU Extension Store. New exams based on the revised core manual are available at all Iowa Department of Agriculture and Land Stewardship test sites. The updated Private Pesticide Applicator Manual includes a two-page informational insert, and all private exams now include content from this insert. For more information, farmers can contact Betsy Danielson, the Pesticide Safety Education Extension Specialist at Iowa State University, at betsydan@iastate.edu.",
      "summaryTimestamp": 1771231297107
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The key points are:\n\n- Lead generation should focus on delivering real value to farmers in exchange for their time and attention, rather than just collecting leads.\n- The call-to-action (CTA) and offer chosen shape not only the number of leads captured, but also their quality, motivation, and purchase-readiness.\n- Shifting the mindset from what the business wants to collect to what farmers genuinely need is crucial for effective lead generation.\n- Designing the right offer requires understanding the farmers' specific problems, challenges, and needs.\n- Effective offers provide practical solutions, insights, or tools that truly benefit the farmers.\n- This approach leads to higher-quality leads that are more likely to convert into customers.",
      "summaryTimestamp": 1771231299627
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this week were 4-8 degrees below normal, with lows dipping into the single digits or below zero, and wind chills reaching -20 in some areas. The state also experienced a mostly dry week, with less than half an inch of precipitation in many regions so far in January. \n\nLooking ahead, the cold temperatures are expected to continue for at least another week, with most of northern Illinois remaining below freezing for the rest of the month. However, a strong winter storm is forecasted to bring significant snowfall, with 3-4 inches expected in central Illinois and 8-12 inches south of Interstate 64 this weekend.\n\nThe article also covers the latest WILLAg.org radio programming, including the Commodity Week panel discussion featuring Chip Nellinger, Brian Stark, and Arlan Suderman, as well as the daily Closing Market Report.\n\nOverall, the key information from the article includes:\n- Temperatures 4-8°F below normal, with lows in the single digits and wind chills near -20°F\n- Less than 0.5 inches of precipitation in January so far, making it one of the driest starts to the year\n- Continued cold temperatures expected for at least another week, with potential for 8-12 inches of snow in southern Illinois this weekend\n- WILLAg.org radio programs covering commodity markets and closing prices",
      "summaryTimestamp": 1771137946426
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Key points:\n- The traditional focus on winning the click (SEO) has shifted to winning brand authority and trust (AEO or answer engine optimization).\n- Farmers are now relying more on AI-powered search engines like ChatGPT and Google's AI Overviews, which provide instant, direct answers to their questions.\n- If brands are not present in these new discovery channels, they risk being invisible to their audience.\n- Farm Journal is observing and adapting to this shift in discoverability, which should prompt all ag marketers to reevaluate their strategies for 2026.\n- An answer-driven content strategy and amplifying trusted voices will be more important than ever.\n- Discoverability is now about winning the citation, the brand mention, and the trusted source reference that builds brand authority, even in zero-click moments.",
      "summaryTimestamp": 1771231302419
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "It originated in Brazil's fertile tropical rainforests and can be a good choice for farmers with forest on their land. \n\nAgroforestry combines small-scale farming with forestry, creating a self-sustaining system. Common methods include thinning forests to grow understory crops, silvopasture (combining forestry and ranching), and alley cropping (growing specialty crops between tree rows).\n\nBenefits of forest farming include improved water and soil quality, carbon sequestration, and opportunities to grow specialized crops like mushrooms, ramps, syrups, and edible roots. It supports biodiversity by providing habitat for beneficial insects, birds, mammals, and fungi.\n\nIdeal land for forest farming has existing forested areas or potential for reforestation. Riparian areas with trees are well-suited. Farmers should inventory their natural resources, develop a forest management plan, and research local markets for forest-based crops.\n\nRegulations around wild plant harvesting, especially for endangered species, must be considered. Selling forest crops often requires proactive marketing through channels like online sales, agritourism, and direct-to-consumer associations.\n\nThe article encourages farmers to thoughtfully integrate forestry and agriculture on their land to diversify products and realize ecological benefits.",
      "summaryTimestamp": 1771206650025
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The second week of the year saw above-normal temperatures, with average temps 8-12°F above normal. Some areas reached highs of 69°F in Kaskaskia and 68°F in Carbondale. January so far has been a top 10 warmest first half on record in most of Illinois.\n\nPrecipitation has been scarce, with 7-day totals ranging from 0.1 inches in southeast Illinois to 0.75 inches in central Illinois. January to date is 0.5-1 inch drier than normal across the state, except for 1-3 inches of rain in a narrow area between Peoria and Chicago. This winter season has been slightly wetter than normal in northeast Illinois, slightly drier than normal in central/west Illinois, and much drier (top 5 driest on record) in southern Illinois.\n\nThe mild weather will end this weekend as much colder air moves in, with highs struggling to reach 20°F in northern Illinois and just above freezing in the south. Little precipitation is expected, mostly light snow. Colder than normal temperatures are forecast for the next 2-3 weeks.\n\nThe article also mentions the weekly Commodity Week radio program and Closing Market Report, which provide market analysis and updates.",
      "summaryTimestamp": 1771137950317
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "Key Highlights:\n\n- Spray drones are being increasingly evaluated by Iowa farmers as an additional tool for crop input application.\n- Key benefits include timely applications, reduced field traffic, and improved access to difficult areas.\n- Adoption requires careful consideration of regulations, training, insurance, and management practices.\n\nRegulations:\n- FAA Part 107 Remote Pilot Certificate is required to operate drones commercially.\n- FAA Part 137 Certification is required for aerial application of pesticides.\n- Iowa Department of Agriculture and Land Stewardship (IDALS) licensing is required for all aerial applicators.\n- Only products labeled for aerial application may be legally applied using a drone.\n\nInsurance:\n- Most standard farm liability policies do not cover aerial pesticide application or aircraft-related risks.\n- Farmers need chemical liability, general liability, and hull/physical damage coverage.\n\nEquipment Selection:\n- Consider spray tank capacity, battery life, nozzle options, GPS guidance, and local dealer support.\n\nTraining and Safe Operation:\n- Proper training is essential for effective and safe spray drone use.\n- Calibration, weather monitoring, and routine maintenance are critical.\n- Verifying swath width is crucial for consistent spray performance.\n\nGradual Adoption:\n- Start on a limited scale with small acreage or trial fields.\n- Develop efficient procedures for mixing, refilling, and battery exchange.\n- Cautiously evaluate dry product uses like cover crop seeding or spot fertilizer placement.\n\nResources:\n- Iowa State University Extension, Digital Agriculture Innovation Lab, licensed equipment dealers, and IDALS.\n\nKey Dates:\n- February 24-25, 2026: 2-day FAA Part 107 training workshop in Ames, IA.",
      "summaryTimestamp": 1771231306687
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "Farmers can maximize profits and productivity by winter sowing hardy annuals and perennials. This method involves sowing seeds in containers like milk jugs or plastic bags, which are placed outdoors. The cold, moist conditions help the seeds break dormancy, resulting in hardier transplants that mature sooner.\n\nThe best vegetables for winter sowing include kale, cabbage, spinach, onions, and leafy greens like chard and watercress. Perennial flowers like pansies, echinacea, snapdragons, larkspur, and scabiosa are also excellent candidates, as they require a cold period to break dormancy.\n\nWinter sowing eliminates the risks associated with direct sowing, while retaining the benefits. It's an effective way for farmers to get a head start on the growing season.",
      "summaryTimestamp": 1771206652402
    },
    {
      "id": "7b11cb7f4100716e",
      "title": "5 Agri-Environmental Strategies that Prevent Species Loss",
      "link": "https://modernfarmer.com/2026/01/agri-environmental-strategies/",
      "description": "On today’s farms, ecologically-friendly practices are on the rise. Using agri-environmental strategies, farmers prevent environmental degradation, preserving natural spaces and the species that live in them. The post 5 Agri-Environmental Strategies that Prevent Species Loss appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 10:00:49 +0000",
      "timestamp": 1768212049000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/Prairie-Strips.webp",
      "summary": "However, there are several agri-environmental strategies farmers can use to support biodiversity and prevent species loss:\n\n1. Prairie Strips - Planting 10-25% of farmland in prairie strips can attract beneficial predators, improve soil nutrients, and boost crop yields by supporting pollinators and pest-controlling insects.\n\n2. Low Tilling - Minimizing tillage and using cover crops instead helps improve soil structure and support greater biodiversity above and below ground.\n\n3. Regenerative Grazing - Rotating livestock, seeding native plants, and using fire/mowing to manage invasive species can increase the availability of diverse forage for livestock while also providing habitat.\n\n4. Integrated Pest Management - Attracting beneficial insects through diverse plantings and cultural practices can reduce the need for pesticides, which harm biodiversity.\n\n5. Conservation Easements - Partnering with land trusts to establish conservation easements can protect natural resources on farmland while also providing tax benefits for landowners.\n\nImplementing these strategies, even partially, can have significant benefits for supporting species, ecosystem health, and long-term farm productivity. Experts emphasize the importance of viewing the farm as part of a larger natural system rather than an isolated operation.",
      "summaryTimestamp": 1771206655730
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series will be held at 12 locations across Iowa from January 6-29. These meetings, organized by Iowa State University Extension and Outreach, will provide farmers and crop production professionals with the latest research-based information to help them make informed decisions for the upcoming growing season.\n\nThe meetings will cover a variety of topics, including:\n- Crop market and climate outlooks for 2026\n- Nitrates and drinking water\n- Profitable nutrient management\n- Southern rust\n- Transition planning\n- Robots and drones\n\nEarly-bird registration is $75 until the week before each meeting, after which it will be $100. Private pesticide applicator recertification will also be available at each location for a separate fee of $30.\n\nThe goal of the Crop Advantage Series is to help producers manage potential issues by sharing the most up-to-date scientific knowledge from Iowa State University researchers. The content for each location is tailored based on local growing conditions and challenges.\n\nFor more information, farmers can contact crops@iastate.edu or their regional ISU Extension and Outreach field agronomist. Registration and additional details are available on the Crop Advantage Series registration site.",
      "summaryTimestamp": 1771231309623
    },
    {
      "id": "10c0eead237e9379",
      "title": "Farm Journal Announces 2026 Top Producer Award Finalists",
      "link": "https://www.farmjournal.com/farm-journal-announces-2026-top-producer-award-finalists/",
      "description": "Outstanding producers from California, Kansas, Ohio, Oregon and Wisconsin&#160;will be recognized for excellence, leadership and innovation. Kansas City, Mo., (Dec. 15, 2025)&#160;–&#160;Farm Journal&#160;has announced three finalists for the prestigious 2026 Top Producer of the Year Award, honoring some of the most progressive and successful farm operations in the country. The winner and finalists will be [&#8230;] The post Farm Journal Announces 2026 Top Producer Award Finalists appeared first",
      "date": "Mon, 15 Dec 2025 16:08:14 +0000",
      "timestamp": 1765814894000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Farm Journal has announced the finalists for the prestigious 2026 Top Producer of the Year Award, recognizing outstanding producers from California, Kansas, Ohio, Oregon, and Wisconsin for their excellence, leadership, and innovation.\n\nThe three finalists are:\n\n1. Alsum Farms, Friesland, Wis. - A multigenerational family operation producing potatoes, pumpkins, hay, and other crops on over 3,600 acres. The business is fully vertically integrated.\n\n2. Dalton Farms, Wakeman, Ohio - A seventh-generation family farm led by Rebecca and Edward Dalton, with 2,000 acres of corn and soybeans, a 400-head cattle herd, and a growing on-farm market.\n\n3. Splitter Farms, Sterling, Kan. - Led by Matt and Janna Splitter, this Kansas row-crop operation spans 1,400 owned acres with nearly 18,500 acres farmed annually through cash rent and custom work.\n\nThe winner and finalists will be recognized at the 2026 Top Producer Summit in Nashville, Tenn., on February 9-11. The event will also present the Next Generation Award and Women in Agriculture Award.\n\nThe 2026 Next Generation Award winner is Tim Nuss, El Dorado Hills/Lodi, Calif., who farms various crops and is also involved in ag tech and influencing. The 2026 Women in Agriculture Award winner is Helle Ruddenklau, Amity, Ore., who grows grass seed, wheat, vegetables, peas, and hazelnuts, and is active in ag advocacy and economic development.\n\nThe Top Producer Awards are sponsored by BASF, Fendt, and Pro Farmer.",
      "summaryTimestamp": 1771231313567
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10 at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5.\n\nThe event will feature research on sorghum's value as a forage crop compared to corn. Sorghum is more drought-tolerant, has lower nitrogen requirements, and is not susceptible to the tar spot pathogen. Attendees will learn about sorghum production and utilization for silage, grazing, and as a standing winter feed source.\n\nSpeakers will include Purdue experts such as Keith Johnson, Mitch Tuinstra, Brad Shelton, Jason Tower, Nick Minton, and Jeff Jackson. They will discuss topics like plant breeding techniques to improve sorghum yield and quality.\n\nThe event will include venue tours from 3-5 pm and 6-8 pm, as well as a dinner and bull test station tour from 5-6 pm.",
      "summaryTimestamp": 1771231318300
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Farmer sentiment improved in July 2024 despite concerns over financial performance:\n\n- The Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113 in July.\n- The Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations rose 7 points to 119.\n- This positive shift was attributed to fewer respondents reporting worsened conditions compared to a year ago and a decrease in those expecting negative future outcomes.\n- High input costs remained the biggest concern for 34% of farmers, while 29% cited the risk of lower crop and livestock prices, up from 25% in June.\n- The Farm Financial Performance Index dropped 4 points in July to 81, 6 points lower than July 2023, reflecting farmers' worries about weakening commodity prices and high input costs.\n- The Farm Capital Investment Index rose 6 points in July to 38, though it remains 7 points lower than July 2023, as fewer producers believe it's a bad time to make large investments.\n- The Short-Term Farmland Value Expectations Index rose to 118 from 115 in June, while the Long-Term Farmland Value Expectations Index dropped 6 points to 146.\n- Nearly three-fourths (72%) of crop farmer respondents expect cash rental rates to remain the same in 2025 compared to 2024.",
      "summaryTimestamp": 1771231323996
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue researchers are taking an interdisciplinary approach to assess the emerging tar spot disease in corn:\n\n- Tar spot, a fungal disease, was first detected in the U.S. in 2015 and has since spread to 16 states and Ontario, Canada by 2022. It has also affected crops in 15 other countries.\n\n- The research team, led by C.D. Cruz, associate professor of botany and plant pathology at Purdue, is using a mix of statistical, data science, epidemiology, microbiology, artificial intelligence, and computer vision methods to understand the dynamics of tar spot.\n\n- The research is funded by two USDA grants totaling nearly $1.1 million. Collaborators include researchers from Colombia, Mexico, Ecuador, South Korea, and the U.S.\n\n- Researchers have developed a digital method (SCDA) to quantify tar spot in corn, which they have tested against human raters with promising results. They are now refining the training methods to improve the model's accuracy.\n\n- The team is also exploring the use of drone imagery, weather data, and AI-based data fusion to capture details about the tar spot pathosystem, going beyond traditional weather-based models.\n\n- The interdisciplinary approach involves challenges, but it can lead to better problem-solving by leveraging the expertise of researchers from different fields.\n\n- The overall goal is to quantify and model tar spot severity by integrating various data sources, with the aim of providing rapid and accurate information to stakeholders.",
      "summaryTimestamp": 1771231330731
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Summary:\n\nThe Indiana Sheep Association (ISA), with support from the Indiana Sheep and Wool Market Development Program (IN S&W), is sponsoring various sheep-themed events and competitions at the 2024 Indiana State Fair, including:\n\n- The Wool and Ewe Room and Ewe2 boutique selling wool products and Indiana lamb throughout the fair\n- Open wool judging and wool sale on August 2 at 10 a.m.\n- Make It With Wool (MIWW) competition and fashion show on August 4 at 2 p.m.\n- Indiana State Fair Shearing Contest on August 4 at 5 p.m.\n- Taste from Indiana Farms lamb sampling event from August 8-11 from 11 a.m.-6 p.m.\n- Sheep to Shawl competition on August 18 at 10 a.m.\n\nAdditionally, sheep will be featured in the Blue Ribbon Pavilion for open and 4-H shows from August 4-20. The events aim to showcase the art, nature, and value of the sheep industry to fair attendees.\n\nThe ISA was originally founded in 1876 as the Indiana Wool Growers Association. The IN S&W program collects 0.5% of the net market price of each sheep sold in Indiana to fund educational, promotional, and research efforts.",
      "summaryTimestamp": 1771231336588
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Purdue Extension will present interactive demonstrations and exhibits at the 2024 Indiana State Fair, which runs from August 2-18.\n- The fair's theme is \"The Art & Nature of Fun\" in collaboration with Newfields.\n- Purdue Extension exhibits will be located throughout the fairgrounds, covering topics like entomology, human health, forestry, and animal sciences.\n- Specific activities include a Block Party, Book Party, Captain Cash financial management exhibit, and displays on pollinators and master gardening.\n- The Food Science Department will host \"What's Growing on My Spinach?\" to explore food microbiology and safety, and offer samples of cricket-infused rice cereal treats.\n- Seed art displays related to the fair's theme will be featured in livestock barns and the Purdue Extension Building.\n- The Pioneer Village in the fairgrounds will transport visitors to the 1800s and feature antique tractors, a farm toy show, and more.",
      "summaryTimestamp": 1771231341666
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The University of Wisconsin-Madison has released a new publication called \"Potassium Cycle\" that provides a visual overview of the potassium cycle in Wisconsin cropping systems. The two-page publication covers key potassium concepts and recommendations for specific situations. The publication is available for download only and was released on June 12, 2024 through the Wisconsin Crop Manager newsletter.",
      "summaryTimestamp": 1771231345064
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Stripe rust disease is likely to be seen this season, though it has not been detected yet. Farmers are advised to scout fields and report any confirmed cases to the Plant Disease Diagnostic Clinic.  \n\nFusarium head blight (FHB) is also a concern, as the moderate temperatures and adequate precipitation this season create conditions favorable for the disease. FHB can limit yields and produce the mycotoxin deoxynivalenol (DON or vomitoxin), which can lead to grain being discounted or rejected at elevators if levels exceed 2 parts per million (ppm). Farmers will need to manage this disease.\n\nThe article was written on May 20, 2024 by Damon Smith, Extension Field Crops Pathologist, and Shawn Conley, Extension Soybean and Small Grains Agronomist, at the University of Wisconsin-Madison.",
      "summaryTimestamp": 1771231348750
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Even minor stand loss warrants assessing the amount and pattern of plant loss. Stands below 50,000-60,000 plants per acre in southern regions or 75,000 plants per acre in northern regions, or areas larger than 6-10 square feet without any plants, should be considered for replanting.\n\nFactors to evaluate include the existing plant stand, distribution, and ability to recover; calendar date and impact on relative maturity; weed management; seed and variety availability; cost to replant and insurance availability; and the tradeoff between a suboptimal stand vs. yield penalty from delayed replanting.\n\nThe article references a fact sheet with more detailed guidance, and a separate related article on \"Soybean Replant Decisions Made Easy(ish)!\".",
      "summaryTimestamp": 1771231353983
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The only labeled formulation for this application is the 2,4-D choline formulation present in Enlist One and Enlist Duo herbicides. The ester and amine formulations of 2,4-D cannot be used post-emergence in Enlist E3 soybeans. \n\nWhen using a 2,4-D ester or amine formulation product for burndown applications, there is a soybean plant back interval of at least 7 days when applying 0.5 lbs ae/acre. If planting Enlist E3 soybeans, Enlist One or Enlist Duo can be applied without this plant back restriction.\n\nThe article is a reminder that the product label must be followed, as there have been reports of producers, agronomists, and crop advisors considering using unapproved 2,4-D formulations for post-emergence applications in Enlist E3 soybeans.\n\nThe article was written by Daniel H. Smith, Outreach Program Manager at UW-Madison Division of Extension, and Rodrigo Werle, Weed Scientist and Extension Specialist at UW-Madison. It was posted on May 11, 2024.",
      "summaryTimestamp": 1771231359515
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Wisconsin CCA (Certified Crop Adviser) Board election results have been announced. Rob Shields, Matt Brugger, and Chris Bandura have been elected to the WI CCA Board and are eligible to serve two, three-year terms.\n\nThe election process was managed by the Outreach Program Manager, Daniel H. Smith, from the Crops and Soils Program at the University of Wisconsin-Madison Division of Extension.\n\nAll WI CCAs in good standing are eligible for nomination and can vote in future elections, which will be held in early 2025. Individuals who did not get elected this time are encouraged to apply again in the next election cycle.\n\nThe announcement was made on May 10, 2024 in the WCM (Wisconsin Crop Manager) newsletter and the \"What's New?\" section.",
      "summaryTimestamp": 1771231362687
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 18,
  "updated": "2026-02-16T08:42:42.887Z"
}