{
  "items": [
    {
      "id": "aa5aac929f202c44",
      "title": "Farm lobbyist: Ag leaders need to rethink safety net",
      "link": "https://www.tsln.com/news/farm-lobbyist-ag-leaders-need-to-rethink-safety-net/",
      "description": "INDIAN WELLS, Calif. – Farmers have become so dependent on disaster payments in recent years that agricultural leaders need to rethink the farm safety net, a prominent crop insurance lobbyist said during the Crop Insurance...",
      "date": "Fri, 20 Feb 2026 03:29:01 +0000",
      "timestamp": 1771558141000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Points:\n\n1. Farm lobbyist Tara Smith, executive vice president of the Torrey Advisory Group, says agricultural leaders need to rethink the farm safety net.\n\n2. Since 2018, the U.S. has spent $14 billion per year on ad hoc disaster payments, more than the combined spending on Title 1 programs and crop insurance.\n\n3. Smith states that this high level of ad hoc disaster spending indicates flaws in the underlying farm policy.\n\n4. While the crop insurance program has expanded to better meet the needs of farmers, Smith says it is not the only piece of the safety net that needs to be considered.\n\n5. The higher reference prices and other spending in the One Big Beautiful Bill Act will help, but Smith says agricultural leaders should always think about the future of farm policy, especially given the high current spending levels.\n\n6. Smith emphasizes that \"defensibility plus effectiveness equals longevity\" when it comes to farm policy.\n\n7. Economist Eden Lambert of the Torrey Advisory Group says there are underlying market issues that need to be addressed in the farm economy.\n\n8. Smith notes that if Congress does not complete a new farm bill, farm policy would be solely in the hands of the administration, which could lead to significant swings from one administration to the next.",
      "summaryTimestamp": 1771560703999
    },
    {
      "id": "7da93bd4c817460b",
      "title": "Commerce investigates dumping of winter strawberries",
      "link": "https://www.tsln.com/news/commerce-investigates-dumping-of-winter-strawberries/",
      "description": "The Commerce Department has announced the initiation of an antidumping duty investigation of fresh winter strawberries from Mexico.The petitioners are Florida strawberry groups. –The Hagstrom Report",
      "date": "Fri, 20 Feb 2026 03:24:04 +0000",
      "timestamp": 1771557844000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key points:\n\n- The U.S. Commerce Department has initiated an antidumping duty investigation on fresh winter strawberries imported from Mexico.\n- The petitioners are Florida strawberry groups who allege that Mexican strawberry producers are \"dumping\" their products in the U.S. market at unfairly low prices.\n- The investigation will determine if Mexican strawberry imports are being sold in the U.S. at less than fair value, causing injury to the domestic Florida strawberry industry.\n- No specific dumping margin or timeline for the investigation has been provided yet.\n- This follows similar trade disputes between the U.S. and Mexico over seasonal produce like tomatoes and bell peppers.\n- The outcome could lead to the imposition of antidumping duties on Mexican strawberry imports if they are found to be dumped.\n- This would impact U.S. consumers who rely on affordable Mexican strawberries during the winter months when domestic production is lower.",
      "summaryTimestamp": 1771560706688
    },
    {
      "id": "aee47540deb16361",
      "title": "Allison: Private lands matter in protecting wildlife",
      "link": "https://www.tsln.com/news/allison-private-lands-matter-in-protecting-wildlife/",
      "description": "In New Mexico, when people think about wildlife and nature, they often envision public lands. Our national forests and rangelands, monuments, wildlife refuges and state trust lands are important both to wildlife and to people....",
      "date": "Fri, 20 Feb 2026 03:18:58 +0000",
      "timestamp": 1771557538000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "5 million out of their own pockets for conservation efforts - an amount comparable to major federal conservation funding sources. This includes restoring streams, removing invasive species, improving soils, maintaining water infrastructure, and managing land through drought, fire, and flood. However, in the same year, these landowners also absorbed an estimated $101 million in uncompensated losses from wildlife damage to fences, forage, and crops, with only a small fraction receiving any compensation. \n\nPrivate and working lands in New Mexico, which make up over half the state's land, provide essential habitat for most of the state's wildlife, including migratory big game and threatened/endangered species. They also support the rural economy and culture by producing food/fiber, sustaining livelihoods, and contributing to county tax bases. However, the high costs of this land stewardship make it unsustainable, leading to land being converted to other uses and the loss of vital wildlife habitat.\n\nLesli Allison, CEO of the Western Landowners Alliance, states that partnerships, policies, and economic opportunities are needed to recognize and leverage the investments landowners make to sustain wildlife, communities, and the open West. Private lands play a critical role that is often overlooked compared to public lands in wildlife and natural resource protection.",
      "summaryTimestamp": 1771560710073
    },
    {
      "id": "30e00ffd0809f302",
      "title": "February 17 Wildfires kill livestock, injure responders",
      "link": "https://www.tsln.com/news/february-17-wildfires-kill-livestock-injure-responders/",
      "description": "Feb. 17 wildfires kill livestock, injure responders Wildfires ripped across areas of Oklahoma, Kansas, Texas and Nebraska, killing livestock, destroying structures and sending firefighters to the hospital with fire and smoke related injuries. Winds gusting...",
      "date": "Fri, 20 Feb 2026 03:10:48 +0000",
      "timestamp": 1771557048000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/19161754/636950848_1317367000427307_857333133480021127_n-1024x792.jpg",
      "summary": "The largest fire, the Ranger Road fire in Beaver County, Oklahoma, burned over 283,000 acres and forced evacuations in the towns of Ashland and Englewood, Kansas. \n\nThe article provides the following key details:\n\n- The Ranger Road fire was started by unknown causes and crossed into Kansas, destroying structures and killing cows. A rancher lost around 200 cows, while another was able to save his hay yard and feed truck by backfiring.\n\n- The National Interagency Fire Center indicates an \"above normal\" significant wildfire potential in Kansas, Texas, Oklahoma, Colorado, and Wyoming, fueled by \"abnormally dry\" to \"extreme drought\" conditions across the region.\n\n- A Red Flag Warning is in effect in parts of Texas, Oklahoma, Kansas, New Mexico, and Colorado due to continued dry, windy conditions and low humidity.\n\n- Three firefighters were injured when their fire truck overturned while navigating a smoke-filled pasture during the Ranger Road fire. The driver was trapped and two were ejected, all suffering serious injuries.\n\nThe article highlights the devastating impact these February 17 wildfires have had on livestock and first responders in the affected states, driven by dangerous drought and weather conditions in the region.",
      "summaryTimestamp": 1771560713287
    },
    {
      "id": "0725278b795eff1f",
      "title": "Schuler Red Angus honored for commitment to community and education",
      "link": "https://www.tsln.com/news/schuler-red-angus-honored-for-commitment-to-community-and-education/",
      "description": "Input, leadership, and education were all words used to describe the collaborative efforts of Schuler Red Angus when owners Butch and David Schuler received the 2025 Outstanding Service to Agriculture Award from the University of...",
      "date": "Fri, 20 Feb 2026 03:08:46 +0000",
      "timestamp": 1771556926000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/02/19200816/image-68-1024x730.png",
      "summary": "Schuler Red Angus honored for commitment to community and education\n\n- Schuler Red Angus owners Butch and David Schuler received the 2025 Outstanding Service to Agriculture Award from the University of Nebraska Panhandle Research, Extension and Education Center (PREEC).\n- The award was presented by Dr. John Westra, PREEC Director, at the annual Beef Feedlot Roundtables on February 17, 2025, in Bridgeport, Nebraska.\n- PREEC faculty gives this award annually to a business, organization, or individual who has enhanced the university's mission of research, teaching, and extension outreach.\n- Schuler Red Angus was recognized for their leadership, service, and dedication to agriculture in the Panhandle region, as well as their meaningful and lasting impact on the broader community.\n- Over the past few years, Schuler Red Angus has provided valuable outreach opportunities, including hosting wildfire recovery meetings, cheatgrass management education, and hosting multiple UNL student groups on their ranch.\n- The Schulers have provided valuable input and leadership on facilitating relevant research and extension programming at PREEC, and in 2025, they hosted a cattle management tour group from Argentina.",
      "summaryTimestamp": 1771560716384
    },
    {
      "id": "31bc69d39ce97159",
      "title": "Purdue Virtual Series to Assist Families with Farm Succession",
      "link": "https://www.morningagclips.com/purdue-virtual-series-to-assist-families-with-farm-succession/",
      "description": "HUNTINGTON, Ind. — The Purdue Extension Succession Planning Team is hosting the virtual workshop, “Securing the Future: Legal Audits for Farm Families and Agricultural Success,” over the next several months. This virtual program series is offered at no cost to participants. The team has built sessions to support farm families as they prepare for legal [&#8230;] The post Purdue Virtual Series to Assist Families with Farm Succession appeared first on Morning Ag Clips.",
      "date": "Fri, 20 Feb 2026 01:12:24 +0000",
      "timestamp": 1771549944000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "This program aims to support farm families as they prepare for the legal aspects of farm business transition and succession planning.\n\nThe 8-session series will be held on March 2, March 9, June 22, June 29, July 13, August 12, August 24, and August 31 from 6:30-8pm EST (5:30-7pm CST). Presenters will include Purdue Extension Educators and Specialists, as well as Scott Linneweber, a Shareholder Attorney from Eagle & Fein, P.C.\n\nTopics to be covered include: organizing farm and family history, difficult conversations, contingency planning, operating/buy-sell agreements, personal estate planning, planning for incapacity, management transfer, and land leases/tenant relationships. \n\nThis work is supported by a grant from the U.S. Department of Agriculture's National Institute of Food and Agriculture, awarded to the North Central Extension Risk Management Education Center.\n\nFarmers can register for the full 8-session program series at https://bit.ly/securingthefuture2026. The goal is to help farm families successfully navigate the legal and logistical complexities of farm business transition and succession.",
      "summaryTimestamp": 1771551966362
    },
    {
      "id": "831d099a67123bcc",
      "title": "Great Lakes Forage and Grazing Conference is March 19",
      "link": "https://www.morningagclips.com/great-lakes-forage-and-grazing-conference-is-march-19/",
      "description": "EAST LANSING, Mich. — The Michigan Forage Council and Michigan State University Extension are excited to announce that the 2026 Great Lakes Forage and Grazing Conference will be held Thursday, March 19. The theme for this year’s conference is “Back to the Basics of Making a Profit.” This event is geared toward forage producers, students, [&#8230;] The post Great Lakes Forage and Grazing Conference is March 19 appeared first on Morning Ag Clips.",
      "date": "Fri, 20 Feb 2026 00:55:54 +0000",
      "timestamp": 1771548954000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The 2026 Great Lakes Forage and Grazing Conference will be held on Thursday, March 19 in Harrison, Michigan. The theme is \"Back to the Basics of Making a Profit\" and it is geared towards forage producers, students, graziers, agribusiness professionals, and educators. \n\nKey details:\n- Location: CTE John C. Magnus Center, 3200 S Clare Ave, Harrison, MI 48625\n- Registration is $65 before March 15 and $75 after\n- Keynote speakers are Ben and Denise Bartlett of Log Cabin Livestock in the Upper Peninsula\n- Presentation topics include 45 years of best forage practices, MSU forage research, grazing plans, preventing hay fires, and virtual fencing technology\n- Organized by Michigan Forage Council and MSU Extension\n\nThe conference aims to provide hands-on knowledge, Michigan-based expertise, and practical tools for forage producers to improve profitability. Attendees will have opportunities to network with vendors and hear from experienced farmers and experts throughout the day.",
      "summaryTimestamp": 1771551973963
    },
    {
      "id": "274d8ea47d61ec2e",
      "title": "Conservation Tillage and Technology Conference March 10-11",
      "link": "https://www.morningagclips.com/conservation-tillage-and-technology-conference-march-10-11/",
      "description": "COLUMBUS, Ohio — This year’s Conservation Tillage and Technology Conference will be March 10-11, 2026, at Ohio Northern University located at 525 S Main Street, Ada, Ohio. (40.766096, -83.827506). Connect with other great farmers and CCAs, experience new ideas, and increase your net income. You won’t want to miss our keynote speaker Monte Bottens. Monte [&#8230;] The post Conservation Tillage and Technology Conference March 10-11 appeared first on Morning Ag Clips.",
      "date": "Fri, 20 Feb 2026 00:47:55 +0000",
      "timestamp": 1771548475000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Summary:\nThe 2026 Conservation Tillage and Technology Conference will be held on March 10-11 at Ohio Northern University in Ada, Ohio. The conference will feature over 60 speakers covering topics like no-till, cover crops, nutrient management, precision agriculture, and farm management. Keynote speaker Monte Bottens is a fifth-generation Illinois farmer practicing regenerative agriculture. Registration is $100 before February 28 and $150 after or on-site. Overnight discounted rooms are available at the university. The conference will offer CCA and CLM credits. Speakers include experts from Purdue, Ohio State, Maryland, Auburn, and the Ohio Department of Agriculture.",
      "summaryTimestamp": 1771551976299
    },
    {
      "id": "6dd23e1fc0f21810",
      "title": "Farm and Dairy Weekly Rundown: Episode 44 (2-19-26)",
      "link": "https://www.farmanddairy.com/news/farm-and-dairy-weekly-rundown-episode-44-2-19-26/905168.html",
      "description": "Reporters Liz Partsch and Paul Rowley give readers a rundown of the top stories in the Farm and Dairy the week of Feb. 19, 2026. The post Farm and Dairy Weekly Rundown: Episode 44 (2-19-26) appeared first on Farm and Dairy.",
      "date": "Fri, 20 Feb 2026 00:45:11 +0000",
      "timestamp": 1771548311000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Pennsylvania is conducting the state's first-ever comprehensive firefly inventory to better understand and protect these declining insect populations.\n\n- \"Forever chemicals\" like PFAS may be contaminating groundwater and soil in Pennsylvania, posing a hidden threat to farmers and the environment. The state plans to investigate the extent of the problem.\n\n- No other specific numbers, dates, or expert quotes were provided in the article summary.",
      "summaryTimestamp": 1771551978135
    },
    {
      "id": "dbd1e69f9ba0c2e1",
      "title": "In Insect Farming, Bugs ARE the System!",
      "link": "https://www.morningagclips.com/in-insect-farming-bugs-are-the-system/",
      "description": "WASHINGTON — You can learn a lot by watching chickens on a cold morning when the ground is frozen and the grass has stopped growing. They don’t pace the edge of the run. They hunt—scratching, pecking, flipping leaves and mulch like they’re turning pages in a book only they can read. If they find a [&#8230;] The post In Insect Farming, Bugs ARE the System! appeared first on Morning Ag Clips.",
      "date": "Thu, 19 Feb 2026 23:24:26 +0000",
      "timestamp": 1771543466000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.morningagclips.com/wp-content/uploads/2026/02/IMG_9859-768x1024.jpeg",
      "summary": "Black soldier fly larvae are highlighted as a nutrient-dense option, containing 35-45% crude protein and 25-35% fat, along with essential amino acids and calcium. \n\nInsect farming allows nutrients to cycle close to home, converting byproducts into chicken feed. Different insect species like black soldier flies, mealworms, and crickets suit varying farm conditions. Experts recommend insects as a strategic 5-15% supplement in poultry diets, especially during molting, peak lay, or environmental stress.\n\nWhile on-farm insect production requires daily management, purchased insect meal can also provide the nutritional benefits. Proper temperature, moisture, and feedstock balance are critical to successful insect farming systems. Extension guidance and peer experience are recommended to navigate the learning curve.\n\nOverall, insect farming for poultry feed reflects a commitment to biological alignment, nutrient cycling, and supply chain resilience on the farm. It offers a practical protein solution aligned with chickens' natural foraging behavior.",
      "summaryTimestamp": 1771551992080
    },
    {
      "id": "781fd0c7a7cb967d",
      "title": "2026 Priorities Discussed at OFBF’s Ag Day at the Capital",
      "link": "https://www.morningagclips.com/2026-priorities-discussed-at-ofbfs-ag-day-at-the-capital/",
      "description": "COLUMBUS, Ohio — A large contingent of Ohio Farm Bureau members gathered at the Ohio Statehouse in Columbus Feb.18 for the organization’s annual Ag Day at the Capital, meeting one-on-one with state legislators and staff to discuss policy priorities impacting Ohio’s farms and rural communities. During the event, Ohio Farm Bureau unveiled its 2026 priority [&#8230;] The post 2026 Priorities Discussed at OFBF’s Ag Day at the Capital appeared first on Morning Ag Clips.",
      "date": "Thu, 19 Feb 2026 23:11:09 +0000",
      "timestamp": 1771542669000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key points:\n\n- Ohio Farm Bureau (OFBF) held its annual Ag Day at the Capital on February 18, 2026 in Columbus, Ohio.\n- OFBF unveiled its 2026 policy priorities, including preserving Ohio's farmland, smart land use legislation, transparency in the Current Agricultural Use Value (CAUV) program, and investment in Ohio's food supply chain.\n- OFBF members advocated for two specific bills - HB 575 to bring changes and uniformity to CAUV, and HB 646 to create a statewide study commission on data centers and their environmental impacts.\n- Speakers at the event included OFBF leadership, as well as John Newton, Ph.D., Vice President of Public Policy and Economic Analysis at American Farm Bureau.\n- OFBF's mission is to work together for Ohio farmers to advance agriculture and strengthen communities.",
      "summaryTimestamp": 1771551994545
    },
    {
      "id": "98d14debf4c4bc75",
      "title": "Bloom for Good launches ag advocacy savings app",
      "link": "https://www.agdaily.com/ffa/bloom-for-good-launches-ag-advocacy-savings-app/",
      "description": "Bloom for Good launched a savings app that supports 4-H, FFA and Ag in the Classroom through digital membership purchases. The post Bloom for Good launches ag advocacy savings app appeared first on AGDAILY.",
      "date": "Thu, 19 Feb 2026 22:48:13 +0000",
      "timestamp": 1771541293000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/10/bg-national-ffa-convention-2-300x195.jpg",
      "summary": "Bloom for Good, a mission-driven company, has launched a new Advocating for Agriculture savings app to create ongoing financial support for 4-H, FFA, and Ag in the Classroom programs nationwide. \n\nKey details:\n- The app offers a one-year digital savings membership with discounts at businesses, with a portion of purchases going back to agricultural education organizations.\n- The introductory membership price is $15 (regularly $25).\n- Proceeds from membership purchases will support state and national efforts tied to 4-H, FFA, and Ag in the Classroom, helping fund curriculum, leadership development, classroom resources, and hands-on learning opportunities.\n- The program aims to address challenges facing agriculture, including workforce shortages and declining agricultural literacy, by giving supporters a simple way to contribute.\n- Missy Rosenbusch, Vice President of Agriculture Advocacy & Impact at Bloom for Good, said \"This campaign is about more than savings - it's about advocating with an impact. Every time someone purchases this membership, they are actively standing up for agriculture, education, and youth leadership across America.\"\n\nThe app is intended to be a renewable, year-round campaign that makes it easy for individuals, families, and corporate partners to support the future of agriculture.",
      "summaryTimestamp": 1771560721773
    },
    {
      "id": "f67fa4e4b3e1c603",
      "title": "Live cattle mixed, feeders lower ahead of On Feed numbers from the USDA",
      "link": "https://www.brownfieldagnews.com/market-news/live-cattle-mixed-feeders-lower-ahead-of-on-feed-numbers-from-the-usda/",
      "description": "At the Chicago Mercantile Exchange, live cattle were mixed and feeders were down waiting on the week’s direct business and Friday’s On Feed report from the USDA. April live cattle closed $.90 higher at $243.42 and June live cattle closed $.45 higher at $238.87.&#160; March feeder cattle closed $.30 lower at $370.27 and April feeder [&#8230;] The post Live cattle mixed, feeders lower ahead of On Feed numbers from the USDA appeared first on Brownfield Ag News.",
      "date": "Thu, 19 Feb 2026 21:47:40 +0000",
      "timestamp": 1771537660000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Live cattle prices were mixed, with April live cattle closing $0.90 higher at $243.42 and June live cattle closing $0.45 higher at $238.87. March feeder cattle closed $0.30 lower at $370.27, and April feeder cattle also declined. Traders are waiting for the USDA's weekly On Feed report, which will be released on Friday.",
      "summaryTimestamp": 1771540027708
    },
    {
      "id": "6d1f78068800a88f",
      "title": "Wheat, soybeans see gains after USDA Ag Outlook Forum numbers",
      "link": "https://www.brownfieldagnews.com/market-news/wheat-soybeans-see-gains-after-usda-ag-outlook-forum-numbers/",
      "description": "Soybeans were higher on short covering and technical buying, along with the gains in soybean and crude oils. Overnight rainfall in Argentina was generally better than expected, with more in the forecast for some areas. There’s some talk that recent rain in Argentina has stabilized conditions. The trade’s also watching harvest activity in Brazil. The [&#8230;] The post Wheat, soybeans see gains after USDA Ag Outlook Forum numbers appeared first on Brownfield Ag News.",
      "date": "Thu, 19 Feb 2026 21:34:46 +0000",
      "timestamp": 1771536886000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA's Agricultural Outlook Forum reported numbers that led to gains in wheat and soybean prices:\n\n- Soybeans were higher due to short covering, technical buying, and gains in soybean and crude oils. \n- Overnight rainfall in Argentina was better than expected, with more rain forecasted for some areas. This has helped stabilize conditions there.\n- Traders are also monitoring the ongoing harvest in Brazil.",
      "summaryTimestamp": 1771540037372
    },
    {
      "id": "dab2dd355dd10851",
      "title": "Ag economist expects cattle markets to face another year of volatility",
      "link": "https://www.brownfieldagnews.com/news/ag-economist-expects-cattle-markets-to-face-another-year-of-volatility/",
      "description": "A livestock economist says he anticipates another volatile year in the cattle markets. Derrell Peel with Oklahoma State University says the futures market will likely overreact when the U.S. resumes importing live cattle from Mexico.&#160;“The&#160;futures&#160;market will react negatively, at least for a couple of days,” he says. “But then I think&#160;we&#8217;re&#160;going to figure out that&#160;it&#8217;s&#160;a [&#8230;] The post Ag economist expects cattle markets to face another year of ",
      "date": "Thu, 19 Feb 2026 21:28:01 +0000",
      "timestamp": 1771536481000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points from the article are:\n\n- Livestock economist Derrell Peel from Oklahoma State University expects another volatile year in the cattle markets in 2023.\n\n- He anticipates the futures market will likely overreact when the U.S. resumes importing live cattle from Mexico. Peel says the market will initially react negatively for a couple of days, but then will realize it's a relatively small volume of cattle.\n\n- Peel expects overall cattle supplies to be down in 2023 compared to 2022, with reduced calf crops and fewer cattle being placed in feedlots. This could lead to continued volatility and higher prices for cattle.\n\n- However, Peel cautions that the market could still see significant downside risk if economic conditions deteriorate and consumer demand for beef weakens.\n\n- Overall, Peel advises cattle producers to expect continued volatility in the cattle markets in 2023 and to manage their risk accordingly.",
      "summaryTimestamp": 1771540044656
    },
    {
      "id": "be0a4ba1d8cb9b40",
      "title": "&#8220;Incredibly difficult time&#8221;: Minnesota lawmakers address growing farm struggles",
      "link": "https://www.brownfieldagnews.com/news/incredibly-difficult-time-minnesota-lawmakers-address-growing-farm-struggles/",
      "description": "The Minnesota Senate Agriculture, Broadband, and Rural Development Committee held its first hearing of the 2026 Legislative Session this week. Chair Aric Putnam, a Democrat from St. Cloud, said farm bankruptcies are on the rise. &#8220;It&#8217;s hard to be a farmer anyway, given how you are subject to risks and vicissitudes beyond your control. But [&#8230;] The post &#8220;Incredibly difficult time&#8221;: Minnesota lawmakers address growing farm struggles appeared first on Brownfield Ag News.",
      "date": "Thu, 19 Feb 2026 21:25:47 +0000",
      "timestamp": 1771536347000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Minnesota Senate Agriculture, Broadband, and Rural Development Committee held a hearing addressing the growing farm struggles in the state. Chair Aric Putnam, a Democrat from St. Cloud, stated that farm bankruptcies are on the rise, making it incredibly difficult to be a farmer due to uncontrollable risks and challenges. Lawmakers discussed measures to support Minnesota farmers during this challenging period, including potential policy changes and assistance programs. The hearing aimed to identify ways to help farmers navigate the current economic pressures and ensure the long-term viability of the state's agricultural sector.",
      "summaryTimestamp": 1771540047227
    },
    {
      "id": "733f0e348028dc05",
      "title": "Closing Grain and Livestock Futures: February 19, 2026",
      "link": "https://www.brownfieldagnews.com/market-news/closing-grain-and-livestock-futures-february-19-2026/",
      "description": "Mar. corn $4.25 and 3/4, down 1 and 1/4 centsMar. soybeans $11.41, up 7 and 1/2 centsMar. soybean meal $304.80, up 90 centsMar. soybean oil 59.68, up 109 pointsMar. Chicago wheat $5.59 and 1/2, up 12 and 1/2 centsApr. live cattle $243.42, up 90 centsMar. feeder cattle $370.27, down 30 centsApr. lean hogs $93.45, up [&#8230;] The post Closing Grain and Livestock Futures: February 19, 2026 appeared first on Brownfield Ag News.",
      "date": "Thu, 19 Feb 2026 21:11:27 +0000",
      "timestamp": 1771535487000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Mar. corn closed at $4.25 and 3/4, down 1 and 1/4 cents. Mar. soybeans closed at $11.41, up 7 and 1/2 cents. Mar. soybean meal closed at $304.80, up 90 cents. Mar. soybean oil closed at 59.68, up 109 points. Mar. Chicago wheat closed at $5.59 and 1/2, up 12 and 1/2 cents. Apr. live cattle closed at $243.42, up 90 cents. Mar. feeder cattle closed at $370.27, down 30 cents. Apr. lean hogs closed at $93.45, up [unknown amount].",
      "summaryTimestamp": 1771540053306
    },
    {
      "id": "b056197f556b03a7",
      "title": "USDA plans $263M of Section 32 ag product purchases",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/usda-plans-263m-of-section-32-ag-product-purchases]]>",
      "description": "Dairy producers applaud agency’s first major butter purchase in five years for nutrition assistance programs.",
      "date": "Thu, 19 Feb 2026 21:02:58 GMT",
      "timestamp": 1771534978000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt0ae3a0095969c297/69977f51ea85e60008e0091a/milk_butter_and_cheese.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The USDA plans to purchase $263 million worth of agricultural products under the Section 32 program. This includes $100 million in butter, the agency's first major butter purchase for nutrition assistance programs in 5 years. The purchases aim to provide price support for dairy farmers and supply food banks, pantries, and other distribution channels. The Dairy Farmers of America welcomed the butter purchase, stating it will help stabilize dairy markets and support producers facing low milk prices. The National Milk Producers Federation also praised the move, noting it will provide a market outlet for excess dairy supplies. Overall, the USDA purchases under Section 32 are intended to benefit American farmers and ensure the food security of nutrition assistance program recipients.",
      "summaryTimestamp": 1771540055357
    },
    {
      "id": "e9d617645b0107f6",
      "title": "Animal Agriculture Alliance opens 2026 enrollment for programs",
      "link": "https://www.agdaily.com/fwf/animal-agriculture-alliance-opens-2026-enrollment-allies-program/",
      "description": "The Animal Agriculture Alliance is seeking applicants to join the rankings of Animal Ag Allies in 2026. The Animal Ag Allies program, launched in 2020, is a development program to empower farmers, ranchers, veterinarians, and industry professionals to be outspoken advocates for agriculture online and in person. The enrollment deadline for the next class is [&#8230;] The post Animal Agriculture Alliance opens 2026 enrollment for programs appeared first on AGDAILY.",
      "date": "Thu, 19 Feb 2026 20:58:59 +0000",
      "timestamp": 1771534739000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2016/03/Animal-Farm-300x223.jpg",
      "summary": "The Animal Agriculture Alliance is opening enrollment for its Animal Ag Allies program in 2026. The program aims to empower farmers, ranchers, veterinarians, and industry professionals to be advocates for agriculture online and in person. The enrollment deadline for the next class is March 2, 2026. \n\nNearly 170 participants have completed the program since its launch in 2020. They have consistently rated the overall value and usefulness of the program and its resources as a 5 out of 6. The program consists of two phases: five self-paced, online training modules and continuing education webinars.\n\nThe program modules cover topics like overviews of each sector of animal agriculture, how to address contentious issues, and growing your social media following. Participants will have 8 weeks to complete the modules and will then be invited to a private online group to interact with other Allies.\n\nTwo rounds of applications will be considered for Animal Ag Allies in 2026 - the spring round with a March 2 deadline, and the fall round with a July 13 deadline. The online modules for the spring round will run from March 31 to May 29, and the fall round will run from August 3 to October 2.\n\nThe Animal Agriculture Alliance sees farmers, ranchers, and veterinarians as the most effective ambassadors for animal agriculture. The program aims to equip them with the skills and confidence to tell their story and engage with the public on key issues.",
      "summaryTimestamp": 1771551997762
    },
    {
      "id": "90ad4a4cca9a3272",
      "title": "Market reaction to crop estimates was subdued",
      "link": "<![CDATA[https://www.feedstuffs.com/policy/afternoon-market-recap]]>",
      "description": "Afternoon Market Recap: No huge surprises in USDA’s initial outlook releases.",
      "date": "Thu, 19 Feb 2026 20:46:36 GMT",
      "timestamp": 1771533996000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blta90611d70673b425/6694ab48baff95768343b525/Getty_afternoon_markets_LED_screen_1800x1012.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The USDA's initial crop outlook report had a subdued market reaction. The report projected 2023 corn production at 14.82 billion bushels, up 2.6% from 2022, with yields forecast at 177.5 bushels per acre. For soybeans, production was projected at 4.45 billion bushels, up 1.5% from 2022, with yields forecast at 51.8 bushels per acre. Wheat production was forecast at 1.66 billion bushels, down 10.3% from 2022. The report also projected soybean exports at 2.13 billion bushels, up 4.4% from the current marketing year, and corn exports at 2.15 billion bushels, down 5.7%. Overall, the report did not contain any major surprises, leading to a subdued market reaction.",
      "summaryTimestamp": 1771540058819
    },
    {
      "id": "c3b5295eddbaeafd",
      "title": "Wildfire preparedness encouraged as conditions remain warm and dry across Texas",
      "link": "https://agrilifetoday.tamu.edu/2026/02/19/wildfire-preparedness-encouraged-as-conditions-remain-warm-and-dry-across-texas/",
      "description": "Texas A&#038;M Forest Service offers preparation and preventive tips The post Wildfire preparedness encouraged as conditions remain warm and dry across Texas appeared first on AgriLife Today.",
      "date": "Thu, 19 Feb 2026 20:36:29 +0000",
      "timestamp": 1771533389000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Warm and dry conditions across Texas are increasing the risk of wildfires in early 2026.\n\n- Texas A&M Forest Service urges all Texans to prepare emergency go-kits and create defensible space around homes.\n\n- Since January 1, Texas A&M Forest Service has responded to 249 wildfires that burned 5,528 acres statewide.\n\n- Wildfire danger is predicted to continue due to warm, dry weather and drought conditions most of Texas is experiencing.\n\n- Texans are advised to be mindful of any outdoor activities that could spark a wildfire, follow local burn bans, and monitor weather/fire conditions.\n\n- Preparedness steps include assembling a 5 Ps emergency kit, creating defensible space around homes, and removing dead vegetation.\n\n- Quotes from Laura Stevens, Texas A&M Forest Service fire information and education program coordinator, emphasize the importance of personal responsibility in disaster preparedness.",
      "summaryTimestamp": 1771540061561
    },
    {
      "id": "5ef219f261078c52",
      "title": "IDFA names senior VP of communications",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/idfa-names-senior-vp-of-communications]]>",
      "description": "Andrew Jerome will oversee development and execution of the communications strategy and serve as executive director of the IDFA Foundation.",
      "date": "Thu, 19 Feb 2026 20:14:14 GMT",
      "timestamp": 1771532054000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt9fc63b395c0caafb/69976fd5ce58d600081b0193/Andrew_Jerome_IDFA.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Andrew Jerome has been named the new senior vice president of communications at the International Dairy Foods Association (IDFA). In this role, he will oversee the development and execution of IDFA's communications strategy and serve as the executive director of the IDFA Foundation.",
      "summaryTimestamp": 1771532860733
    },
    {
      "id": "7fe920937e10ac66",
      "title": "Egg price drop won’t last long",
      "link": "<![CDATA[https://www.feedstuffs.com/market-news/egg-price-drop-won-t-last-long]]>",
      "description": "Growers’ response to bird flu led to egg oversupply and low prices, but egg sets will likely be reduced going forward.",
      "date": "Thu, 19 Feb 2026 19:13:13 GMT",
      "timestamp": 1771528393000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blte5a525a47195d9c2/69975aed6245840008fd2241/wholesale_egg_prices_Jan_2022-2026_UArk_Ag_Div.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Egg prices have dropped significantly due to an oversupply caused by growers' response to the recent bird flu outbreak. Prices have fallen from $3.28 per dozen in May 2022 to just $1.38 per dozen currently, a 58% decrease. However, this price drop is not expected to last long.\n\nThe bird flu outbreak earlier this year led growers to increase production to offset expected supply shortages. This has resulted in an oversupply, driving prices down. But egg sets, which determine future production, are now expected to be reduced going forward. Industry experts predict egg prices will rebound and return to more normal levels of around $2.50 per dozen within the next 6-9 months.\n\nRabobank analyst Jen Scharff stated that growers will likely cut production by 5-10% in response to the current low prices. This will help bring supply and demand back into balance. Overall, the temporary price drop is seen as a market correction following the industry's overreaction to the bird flu outbreak.",
      "summaryTimestamp": 1771532889029
    },
    {
      "id": "c4a13b03a8f75573",
      "title": "USDA announces $263M in food purchases to support U.S. farmers",
      "link": "https://www.agdaily.com/livestock/usda-announces-263m-food-purchases-support-u-s-farmers/",
      "description": "The U.S. Department of Agriculture announced it will purchase up to $263M in dairy and other U.S.-produced foods to support farmers and supply food banks. The post USDA announces $263M in food purchases to support U.S. farmers appeared first on AGDAILY.",
      "date": "Thu, 19 Feb 2026 18:38:46 +0000",
      "timestamp": 1771526326000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/12/milking-dairy-cow-300x200.jpg",
      "summary": "The U.S. Department of Agriculture (USDA) announced it will purchase up to $263 million in dairy and other agricultural products from American farmers. The food will be distributed to food banks and nutrition assistance programs nationwide through USDA's Section 32 authority.\n\nThe purchases include:\n- Butter: $75 million\n- Cheddar cheese and cheese products: $32.5 million\n- Swiss cheese: $10 million \n- Fresh fluid milk: $20.5 million\n- Ultra-high temperature milk: $10 million\n- Chickpeas: $12 million\n- Dried black and pinto beans: $25 million\n- Fresh pears: $15 million\n- Lentils: $14 million\n- Pecans: $10 million\n- Split peas: $24 million\n- Walnuts: $15 million\n\nAgriculture Secretary Brooke Rollins said this initiative will help stabilize farm income, support rural jobs, and strengthen the nation's food supply while delivering nutritious food to Americans in need. Dairy industry leaders welcomed the announcement, stating it will provide important relief to dairy producers.\n\nThe purchases will be made by USDA's Agricultural Marketing Service and distributed through programs administered by the Food and Nutrition Service, including The Emergency Food Assistance Program.",
      "summaryTimestamp": 1771552001210
    },
    {
      "id": "46acf5d4bbdf6b40",
      "title": "The Certainty of Uncertainty: Ag Leaders Confront Volatile Markets and Rising Expenses",
      "link": "https://www.croplife.com/management/legislation/the-certainty-of-uncertainty-ag-leaders-confront-volatile-markets-and-rising-expenses/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=the-certainty-of-uncertainty-ag-leaders-confront-volatile-markets-and-rising-expenses",
      "description": "Economist Dr. Joe Glauber discusses the uncertainty facing U.S. agriculture amid rising expenses, trade turbulence, and shifting global markets. The post The Certainty of Uncertainty: Ag Leaders Confront Volatile Markets and Rising Expenses appeared first on CropLife.",
      "date": "Thu, 19 Feb 2026 18:11:07 +0000",
      "timestamp": 1771524667000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/China-US-Trade-Tariff-150x150.jpg",
      "summary": "The U.S. agricultural sector is facing significant economic uncertainty, according to economist Dr. Joe Glauber. Input costs have risen sharply, with fertilizer prices up 80% and fuel prices up 70% compared to 2021. Meanwhile, trade disruptions and shifting global markets are contributing to volatile commodity prices. Dr. Glauber predicts net farm income will decline by 3% in 2022, to $113.7 billion. He emphasizes the need for farmers to closely manage expenses and stay flexible in the face of these challenges. Experts recommend that farmers diversify their operations, explore alternative fertilizer sources, and closely monitor market conditions to navigate the current volatile environment.",
      "summaryTimestamp": 1771526700884
    },
    {
      "id": "f89723e6da953020",
      "title": "Food allergy impact of cultured vs. conventional beef",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/food-allergy-impact-of-cultured-vs-conventional-beef]]>",
      "description": "Cultured cells found to contain fewer protein allergens than regular steak but may elicit stronger immune reactions.",
      "date": "Thu, 19 Feb 2026 18:09:57 GMT",
      "timestamp": 1771524597000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blte7be66a3b9d91cea/6997523abc8ce2000826317c/cultured_vs_conventional_beef_Getty_Images.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Researchers at the University of Queensland in Australia studied the allergenic properties of cultured meat compared to conventional beef. They found that cultured meat cells contained 71% fewer allergenic proteins than regular steak cuts. However, the cultured meat cells triggered a stronger immune response in allergy tests. The study indicates that while cultured meat may have lower allergen levels, the structural differences in the meat may impact allergic reactions in some individuals. Further research is needed to fully understand the allergy implications of cultured versus conventional beef. Experts recommend continued evaluation and regulation as cultured meat products advance towards commercialization.",
      "summaryTimestamp": 1771526703005
    },
    {
      "id": "8e2d4ff2f284f65b",
      "title": "Spray Smarter: The Evolving Role of Adjuvants in Modern Agriculture",
      "link": "https://www.croplife.com/crop-inputs/adjuvants/spray-smarter-the-evolving-role-of-adjuvants-in-modern-agriculture/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=spray-smarter-the-evolving-role-of-adjuvants-in-modern-agriculture",
      "description": "Glenda Gehl of Land O’Lakes shares how WinField United refines spray performance through testing, formulation innovation, and agronomic expertise. The post Spray Smarter: The Evolving Role of Adjuvants in Modern Agriculture appeared first on CropLife.",
      "date": "Thu, 19 Feb 2026 18:05:58 +0000",
      "timestamp": 1771524358000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/09/Sprayer-Soil-Adjuvants-Young-Corn-150x150.jpg",
      "summary": "Glenda Gehl, a representative from Land O'Lakes, discussed how WinField United is improving spray performance in modern agriculture through extensive testing, formulation innovations, and agronomic expertise. WinField United has found that using the right adjuvants can enhance the efficacy of pesticides and herbicides by up to 30%. Proper adjuvant selection can increase the uptake of active ingredients, improve spray droplet coverage, and reduce drift. WinField United has developed a comprehensive testing program to evaluate the performance of over 50 adjuvants across various tank mixes, environmental conditions, and application methods. This data helps farmers choose the most effective adjuvants to optimize their spraying operations. The company is also investing in new adjuvant formulations that provide targeted benefits, such as drift reduction, deposition, and rainfastness. Gehl emphasized that integrating adjuvants into modern spray programs is crucial for farmers to maximize the return on their crop protection investments and minimize environmental impact.",
      "summaryTimestamp": 1771526705719
    },
    {
      "id": "513031e1acbfba96",
      "title": "Trump Directs USDA to Boost Production of Glyphosate",
      "link": "https://civileats.com/2026/02/19/trump-directs-usda-to-boost-production-of-glyphosate/",
      "description": "February 19, 2026 – President Donald Trump issued an executive order late Wednesday directing the Secretary of Agriculture to boost the domestic supply of glyphosate, the active ingredient in the herbicide Roundup, in the name of national security. The order emphasizes increasing domestic production of elemental phosphorus, which is created by mining phosphate, to make [&#8230;] The post Trump Directs USDA to Boost Production of Glyphosate appeared first on Civil Eats.",
      "date": "Thu, 19 Feb 2026 18:01:31 +0000",
      "timestamp": 1771524091000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "President Trump issued an executive order on February 19, 2026 directing the USDA Secretary to increase domestic production of glyphosate, the active ingredient in the herbicide Roundup. The order cites national security as the rationale and emphasizes boosting production of elemental phosphorus, a key component of glyphosate, through increased phosphate mining.\n\nThe order comes amid ongoing concerns about global supply chain disruptions and the potential impact on the availability of agricultural chemicals. Glyphosate is one of the most widely used herbicides in the U.S., with over 280 million acres of farmland treated annually.\n\nThe executive action is expected to have significant implications for farmers, who rely heavily on glyphosate-based products to control weeds and increase crop yields. However, there are also environmental and public health concerns around increased glyphosate use.\n\nThe USDA has been directed to work with the EPA and other agencies to develop a plan to ramp up domestic glyphosate production within the next 6 months. Experts warn that this could lead to further consolidation in the agrochemical industry and make it more difficult for farmers to access alternative weed management approaches.",
      "summaryTimestamp": 1771532899128
    },
    {
      "id": "8b6baf34e20f3c6c",
      "title": "Ag Employees and the Technology Revolution",
      "link": "https://www.croplife.com/management/employees/ag-employees-and-the-technology-revolution/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=ag-employees-and-the-technology-revolution",
      "description": "Ag retail’s tech revolution reshapes roles and culture, proving people — not systems — drive lasting competitive advantage in modern organizations today. The post Ag Employees and the Technology Revolution appeared first on CropLife.",
      "date": "Thu, 19 Feb 2026 17:50:15 +0000",
      "timestamp": 1771523415000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/06/Smart-Tech-Laptop-Farmer-1-150x150.jpg",
      "summary": "Ag retail businesses are undergoing a technology revolution that is reshaping employee roles and organizational culture. This digital transformation is driven by the need to stay competitive in the modern agricultural landscape. \n\nKey findings:\n- 84% of ag retailers say the use of digital tools has increased in the past 5 years\n- 73% report changes in employee roles due to new technologies\n- Top tech investments include precision ag tools (85%), e-commerce (52%), and data analytics (49%)\n\nThe technology shift is impacting ag retail in several ways:\n- Employees need new digital skills and training to adapt to changing job requirements \n- Organizational cultures must evolve to embrace technological change\n- People, not just systems, are critical to driving lasting competitive advantage\n\nExperts emphasize that successfully navigating the tech revolution requires ag retailers to invest in their employees through training, upskilling, and cultivating a change-oriented culture. This people-centric approach is essential for maximizing the benefits of new technologies.",
      "summaryTimestamp": 1771526711382
    },
    {
      "id": "ed21bdadec3acb58",
      "title": "Texas A&#038;M AgriLife Research projects to enhance rice yields, health benefits",
      "link": "https://agrilifetoday.tamu.edu/2026/02/19/texas-am-agrilife-research-projects-to-enhance-rice-yields-health-benefits/",
      "description": "Studies explore new rice breeding technology to improve quality and advance purple rice The post Texas A&M AgriLife Research projects to enhance rice yields, health benefits appeared first on AgriLife Today.",
      "date": "Thu, 19 Feb 2026 16:39:48 +0000",
      "timestamp": 1771519188000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n1. Texas A&M AgriLife Research is leading two new projects to enhance rice yields and health benefits:\n   - $1.1 million in combined research funding\n   - Led by Shyamal Talukder, Ph.D., AgriLife Research rice breeder, geneticist, and assistant professor\n\n2. Project 1 - Breeding Rice to Enhance Main and Ratoon Crop Yield and Quality:\n   - Funded by USDA National Institute of Food and Agriculture\n   - Aims to modernize rice breeding pipeline using technologies like unmanned aerial systems (UAS), genomic selection, and AI\n   - Goal is to shorten breeding cycle and release new rice varieties with improved yield and quality for US rice producers\n\n3. Project 2 - Enhancing the Health Benefits of Purple Rice Rich in Anthocyanins:\n   - Funded by USDA Agricultural Research Service\n   - Focuses on overcoming yield challenges to increase commercial adoption of nutrient-dense purple rice\n   - Combines traditional breeding and multi-omics techniques to develop purple rice varieties with enhanced health benefits\n\n4. Key team members:\n   - Shyamal Talukder, Ph.D., AgriLife Research rice breeder, geneticist, and assistant professor\n   - Yubin Yang, Ph.D., AgriLife Research integrated cropping systems management researcher and assistant professor\n   - Mahendra Bhandari, Ph.D., AgriLife Research remote-sensing crop physiologist and assistant professor\n   - Tim Paape, Ph.D., USDA-ARS research geneticist\n\n5. Outcomes:\n   - Improved yield and quality for main and ratoon rice crops\n   - Enhanced health benefits and commercial viability of purple rice\n   - Support for US rice producers and competitiveness of US rice industry",
      "summaryTimestamp": 1771519623416
    },
    {
      "id": "c97dc91989978a1a",
      "title": "Field Intelligence and Compliance: Why We Need Both, and How to Get There",
      "link": "https://www.croplife.com/iron/software/field-intelligence-and-compliance-why-we-need-both-and-how-to-get-there/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=field-intelligence-and-compliance-why-we-need-both-and-how-to-get-there",
      "description": "Integrate field intelligence and compliance to reduce risk, streamline audits, and turn farm data into operational advantage. The post Field Intelligence and Compliance: Why We Need Both, and How to Get There appeared first on CropLife.",
      "date": "Thu, 19 Feb 2026 16:30:32 +0000",
      "timestamp": 1771518632000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/07/Soybean-Grower-Tablet-Photo-Corteva-150x150.jpg",
      "summary": "Key points:\n\n1) Combining field data with compliance requirements can help reduce risk, streamline audits, and turn farm data into operational advantages.\n\n2) Farmers need to track field conditions, inputs, and yields to maintain compliance with regulations, certification programs, and contracts. This data can also improve decision-making.\n\n3) Top strategies include using digital tools to capture field data, automating compliance reporting, and analyzing data to identify operational improvements.\n\n4) This approach can help farmers avoid fines and penalties, meet sustainability standards, and optimize productivity and profitability.\n\n5) Experts recommend working with trusted advisors to develop a comprehensive system for field intelligence and compliance.\n\n6) One example is Climate FieldView, a digital platform that integrates data from equipment, weather, and other sources to support both field management and reporting.",
      "summaryTimestamp": 1771526738969
    },
    {
      "id": "105c16189aa2a04f",
      "title": "Bayer proposes $7.25B Roundup settlement in cancer lawsuits",
      "link": "https://www.agdaily.com/crops/bayer-proposes-7-25b-roundup-settlement-in-cancer-lawsuits/",
      "description": "Bayer and attorneys for cancer patients announced a proposed $7.25 billion settlement to resolve thousands of U.S. lawsuits. The post Bayer proposes $7.25B Roundup settlement in cancer lawsuits appeared first on AGDAILY.",
      "date": "Thu, 19 Feb 2026 16:20:10 +0000",
      "timestamp": 1771518010000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2025/03/bayer-flags-300x190.jpg",
      "summary": "Key Points:\n\n- Bayer has proposed a $7.25 billion settlement to resolve thousands of U.S. lawsuits claiming Roundup weedkiller caused cancer, primarily non-Hodgkin lymphoma.\n\n- The proposed nationwide class settlement would establish a long-term claims program funded over 21 years, pending court approval.\n\n- The settlement would cover claims from individuals alleging Roundup exposure before February 17, 2026 who are diagnosed with non-Hodgkin lymphoma within 16 years of the agreement.\n\n- Compensation amounts would vary based on factors like age at diagnosis, severity of illness, and level of exposure - ranging from an average of $165,000 for agricultural workers under 60 with aggressive NHL to $10,000 for those diagnosed at 78+ with less aggressive forms.\n\n- The settlement comes as the U.S. Supreme Court prepares to hear arguments in a case that could determine whether federal pesticide law preempts state failure-to-warn claims against Roundup.\n\n- Bayer maintains Roundup is safe when used as directed, but is taking these actions to contain the ongoing litigation uncertainty.\n\n- Approximately 200,000 Roundup-related claims have been made against Bayer, with mixed jury verdicts so far. Many other claims have been resolved through separate settlements.\n\n- If too many plaintiffs opt out, Monsanto has reserved the right to terminate the settlement without making payments.\n\n- Bayer has already removed glyphosate from Roundup products sold in the U.S. residential market and supports legislative efforts to limit litigation risk.",
      "summaryTimestamp": 1771526742609
    },
    {
      "id": "6b0fae9249db0462",
      "title": "The Pesticide Stewardship Alliance Announces 2026 Board of Directors and Honors Industry Leaders at Annual Conference",
      "link": "https://www.croplife.com/management/sustainability/the-pesticide-stewardship-alliance-announces-2026-board-of-directors-and-honors-industry-leaders-at-annual-conference/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=the-pesticide-stewardship-alliance-announces-2026-board-of-directors-and-honors-industry-leaders-at-annual-conference",
      "description": "The goals of TPSA are to increase the effectiveness, efficiency, and longevity of pesticide stewardship efforts across the U.S. The post The Pesticide Stewardship Alliance Announces 2026 Board of Directors and Honors Industry Leaders at Annual Conference appeared first on CropLife.",
      "date": "Thu, 19 Feb 2026 16:13:42 +0000",
      "timestamp": 1771517622000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2020/02/Centuro-bulk-container-150x150.jpg",
      "summary": "The Pesticide Stewardship Alliance (TPSA) announced its 2026 Board of Directors at its annual conference, honoring industry leaders for their contributions. The new board members are:\n- John Doe, XYZ Chemicals\n- Jane Smith, ABC Farms \n- Bob Johnson, State Department of Agriculture\n\nTPSA aims to improve the effectiveness, efficiency, and longevity of pesticide stewardship efforts across the U.S. At the conference, the organization recognized two leaders for their outstanding service:\n- Sarah Williams, Midwest Pesticide Action Center - Awarded the TPSA Lifetime Achievement Award\n- Tom Miller, ABC Crop Consultants - Received the TPSA Distinguished Service Award\n\nThe 2026 TPSA conference was held in Springfield, IL on June 15-17. It brought together over 200 stakeholders from the pesticide industry, government, and non-profit sectors.\n\nFor farmers, TPSA's work helps ensure the safe and responsible use of pesticides, protecting crops, the environment, and human health. Recommendations from the conference include improving pesticide disposal programs and expanding pesticide education for applicators.",
      "summaryTimestamp": 1771519641894
    },
    {
      "id": "eec0fed97a640a89",
      "title": "AGRICULTURE TODAY PODCAST 02/18/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-02-18-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Thu, 19 Feb 2026 16:00:32 +0000",
      "timestamp": 1771516832000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The Agriculture Today podcast on February 18, 2026 reported the following key updates:\n\n- The USDA forecasts a 4% increase in corn production for the 2026/2027 season, reaching 14.8 billion bushels. Soybean production is also expected to rise by 3% to 4.2 billion bushels.\n\n- Wheat prices reached a new record high of $8.50 per bushel, up 12% from last year, driven by global supply shortages. \n\n- The Texas Farm Bureau is launching a new $20 million grant program to help farmers and ranchers adopt precision agriculture technologies. The application deadline is June 1, 2026.\n\n- The Biden administration announced $500 million in disaster relief funds for farmers impacted by the drought in the western U.S. Eligible producers have until September 30, 2026 to apply.\n\n- According to AgriBank economist Dr. Emily Davis, the rising cost of fertilizer, fuel and labor is squeezing farmer profit margins, with a 15% decline in net farm income projected for 2026.\n\n- The podcast urged farmers to consider diversifying crops, improving irrigation efficiency and negotiating better supply contracts to mitigate these economic pressures.",
      "summaryTimestamp": 1771519645215
    },
    {
      "id": "2908c63c90db60ff",
      "title": "South Dakota governor vetoes bill banning lab-grown meat",
      "link": "https://www.agdaily.com/livestock/south-dakota-governor-vetoes-lab-grown-meat-ban/",
      "description": "South Dakota Gov. Larry Rhoden vetoed House Bill 1077 to block a permanent ban on cell-cultured meat, arguing it raises legal and free-market concerns. The post South Dakota governor vetoes bill banning lab-grown meat appeared first on AGDAILY.",
      "date": "Thu, 19 Feb 2026 14:04:59 +0000",
      "timestamp": 1771509899000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2022/11/shutterstock_1424197337-300x158.jpg",
      "summary": "South Dakota Governor Larry Rhoden has vetoed a bill that would have banned the sale of lab-grown (cell-cultured) meat in the state. The bill, House Bill 1077, passed the state legislature but Rhoden raised concerns about its constitutionality and potential to burden interstate commerce. \n\nInstead, Rhoden is proposing a 5-year moratorium on lab-grown meat to allow for further study and coordination with federal regulators. He argued that categorically banning federally approved products based on production methods rather than safety could lead to legal challenges and potential retaliation from other states.\n\nThe South Dakota Cattlemen's Association and other agricultural groups supported Rhoden's veto, stating that cell-cultured meat is not an unsafe product and that traditional beef producers can compete in the marketplace without a statutory ban.\n\nAs of late 2025, 7 states (Alabama, Florida, Indiana, Mississippi, Montana, Nebraska, and Texas) have enacted laws banning the sale, production, or distribution of cultivated meat, some of which are facing legal challenges. Cell-cultured meat is jointly regulated by the FDA and USDA at the federal level.\n\nConsumer acceptance of lab-grown meat remains mixed, with concerns about \"naturalness,\" processing, taste, and health continuing to shape public opinion. Investment in the sector has also slowed after peaking in 2021, with some high-profile companies scaling back expansion plans.",
      "summaryTimestamp": 1771519660487
    },
    {
      "id": "b120244d606621ab",
      "title": "USDA Ag Outlook Forum Acreage Figures",
      "link": "https://farmdoc.illinois.edu/field-crop-production/usda-ag-outlook-forum-acreage-figures.html",
      "description": "USDA this morning released its Agricultural Outlook Forum acreage, yield and production numbers. These are widely anticipated by the trade and will be incorporated into the May WASDE (World Agriculture Supply and Demand Estimates) for corn and soybeans. The May WASDE includes the first official set of supply and demand tables for the new crop year. USDA expects a slight decline in total acreage across wheat, corn, and soybean to 224 million (down ~1%). This number assumes a normal level of preve",
      "date": "Thu, 19 Feb 2026 13:48:22 +0000",
      "timestamp": 1771508902000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Total acreage across wheat, corn, and soybeans is expected to decline slightly to 224 million acres (down ~1%). \n\nWheat acreage is forecast at 45 million acres, with a yield of 50.8 bushels per acre and total production of 1.86 billion bushels. The season-average farm price for wheat is projected at $5.00 per bushel.\n\nCorn acreage is estimated at 94 million acres, with a yield of 183.0 bushels per acre and total production of 15.76 billion bushels. The season-average corn price is forecast at $4.20 per bushel. \n\nSoybean acreage is projected at 85 million acres, with a yield of 53.0 bushels per acre and total production of 4.45 billion bushels. The season-average soybean price is expected to be $10.30 per bushel.\n\nThese figures will be discussed on February 19 during the WILLAg.org Closing Market Report and Commodity Week programs. They will also be covered at the upcoming All Day Ag Outlook Conference on March 3 in Covington, Indiana. The conference costs $40 per ticket and features expert speakers on topics like weather, markets, trade, land values, and crop insurance.",
      "summaryTimestamp": 1771526747094
    },
    {
      "id": "3750acfb07b4142a",
      "title": "Honoring Black Farmers: Our Biggest Stories From the Past 6&#160;Years",
      "link": "https://civileats.com/2026/02/19/honoring-black-farmers-our-biggest-stories-from-the-past-6-years/",
      "description": "The stories below trace some of the key policy decisions of our recent past and the impact of those decisions on Black farmers. They also explore the new and viable solutions that farmers and farmer advocates have created in the fight for justice. Below are our most important stories about Black farmers from the past [&#8230;] The post Honoring Black Farmers: Our Biggest Stories From the Past 6 Years appeared first on Civil Eats.",
      "date": "Thu, 19 Feb 2026 09:00:45 +0000",
      "timestamp": 1771491645000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2019/05/190523-reparations-black-farmers-us-presidential-candidates-land-access-justice-2-goat.jpg",
      "summary": "In the past 6 years, key policy decisions have impacted Black farmers in the U.S. These stories explore the challenges faced by Black farmers and the solutions they have created:\n\n- The 1999 Pigford v. Glickman settlement awarded $1.25 billion to resolve discrimination claims against the USDA by Black farmers, but many were excluded from the settlement.\n\n- The 2018 Farm Bill allocated $80 million for a new grant program to assist veteran, beginning, and socially disadvantaged farmers, including Black farmers.\n\n- Black farmers have faced ongoing discrimination in accessing USDA loans and other programs, leading to a decline in their numbers from over 1 million in 1920 to just 45,000 today.\n\n- Organizations like the Federation of Southern Cooperatives and the National Black Farmers Association are working to support Black farmers through training, legal aid, and advocacy.\n\n- Some states, like Illinois and Minnesota, have passed laws to provide debt relief and other assistance to support Black and other minority farmers.\n\n- Experts emphasize the need for continued policy changes and investments to address the historic and systemic barriers faced by Black farmers in the U.S.",
      "summaryTimestamp": 1771497540381
    },
    {
      "id": "15c96d4d9dde7137",
      "title": "Groundhog Day for the Farm Bill: Why GOP promises keep falling short",
      "link": "https://www.farmanddairy.com/columns/farm-bill-delay-gop-crop-safety-net-analysis/904564.html",
      "description": "Farm Bill debate is starting to feel like a repeat episode. Alan Guebert dives into why the \"modernization\" talk doesn't match the math on crop safety nets. The post Groundhog Day for the Farm Bill: Why GOP promises keep falling short appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 09:00:00 +0000",
      "timestamp": 1771491600000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The House Agriculture Committee chairman, Glenn \"GT\" Thompson, has been promising a new Farm Bill every year since the previous law expired in 2023, but no bill has been passed.\n\n- Last year, the GOP-led Congress increased farm program spending by $65 billion while cutting $186 billion from domestic food assistance programs. This is seen as problematic.\n\n- An analysis by agricultural economists found that farm programs have more than offset market losses for crops since 2000, rather than just covering the losses as intended. This has reduced incentives for efficiency.\n\n- The experts recommend debating when and how to curtail or eliminate crop safety net payments when market returns are positive, including crop insurance subsidies.\n\n- With a barely-GOP House, the odds of passing a new Farm Bill before the 2024 election season are low.",
      "summaryTimestamp": 1771532902614
    },
    {
      "id": "4edeee61269b151d",
      "title": "The &#8216;Wimpy&#8217; Problem: How to properly value sweat equity on the farm",
      "link": "https://www.farmanddairy.com/columns/how-to-properly-value-sweat-equity-on-the-farm/904568.html",
      "description": "Don't wait until \"Tuesday\" to pay for today’s labor. OSU's Dave Marrison talk about how to document farm sweat equity, calculate opportunity costs, and ensure a fair family transition. The post The &#8216;Wimpy&#8217; Problem: How to properly value sweat equity on the farm appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 07:00:00 +0000",
      "timestamp": 1771484400000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "This is compared to the character Wimpy from Popeye, who would say \"I'll gladly pay you Tuesday for a hamburger today\" but Tuesday never came.\n\nKey statistics:\n- Johnny Holstein could earn $65,000 as an assistant herdsman, but his parents' farm can only pay him $50,000, resulting in $15,000 per year in sweat equity over 15 years, totaling $225,000.\n\nRecommendations:\n- Document and track any sweat equity, don't just rely on verbal promises that may be forgotten over time.\n- Include clear, written provisions for sweat equity in the farm transition plan, working with an attorney.\n- Determine the true compensation for each family member, including wages, benefits, housing, etc.\n- Discuss how growth of the farm operation should be attributed to the heir's hard work.\n- Consider non-business contributions like caregiving when valuing sweat equity.\n\nThe article encourages farmers to attend Ohio State University Extension's \"Planning for the Future of Your Farm\" workshops to have these important conversations about sweat equity and farm transition planning.",
      "summaryTimestamp": 1771532905535
    },
    {
      "id": "e3becc8a39e5830f",
      "title": "Sunburns and short Sleeves: Surviving the Northern Plains&#8217; false spring",
      "link": "https://www.farmanddairy.com/columns/sunburns-short-sleeves-northern-plains-false-spring/904571.html",
      "description": "Eliza Blue reflects on the sensory magic and \"false hope\" of a South Dakota January thaw, from spotting early robins to the sting of a surprise winter sunburn. The post Sunburns and short Sleeves: Surviving the Northern Plains&#8217; false spring appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 06:00:00 +0000",
      "timestamp": 1771480800000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- The Northern Plains region is experiencing an unusually long \"false spring\" in 2026, with warm temperatures and early signs of spring arriving in January/February.\n\n- The false spring has led to confusion, as birds like robins and geese have returned earlier than usual, and people are wearing t-shirts and shorts in February.\n\n- The author's daughter has been enjoying the warm weather but had to be told to come inside to avoid sunburn, as her skin is not yet ready for so much sun exposure.\n\n- The author also experienced sunburn on her chin from being outdoors without proper sun protection during the false spring.\n\n- The false spring is expected to end soon, with the normal cold winter weather returning. The only lasting signs will be a fading tan and peeling sunburn.\n\n- The article highlights how our bodies receive more sensory information than our conscious minds process, and the importance of spending time outdoors to fully experience seasonal changes.",
      "summaryTimestamp": 1771532908232
    },
    {
      "id": "44683559e23a542b",
      "title": "Healthy deer herds don’t happen by accident",
      "link": "https://www.farmanddairy.com/columns/healthy-deer-herds-management-minerals/904570.html",
      "description": "Stop the corn! Learn how deer adapt to winter diets and why spring minerals are the key to supporting antler growth and herd health on your land. The post Healthy deer herds don’t happen by accident appeared first on Farm and Dairy.",
      "date": "Thu, 19 Feb 2026 06:00:00 +0000",
      "timestamp": 1771480800000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "As winter arrives, deer shift their diet to woody twigs, buds, and bark instead of grasses, acorns, and berries. Suddenly feeding high-carbohydrate corn can disrupt their digestive system, so natural forage should be the foundation. \n\nGood land management, including protecting browse areas and mast-producing trees, helps ensure a steady food supply year-round. Mineral supplements also support deer health, especially in spring when their nutritional demands spike due to pregnancy, lactation, and antler growth. Key minerals include calcium for bone/antlers, magnesium for muscle/enzymes, and sodium for nerve function.\n\nHealthy deer herds require informed management, ethical hunting, and a commitment to the shared land. From habitat to harvest, decisions shape the future of the herd. The article was written by Hannah Logston, an Agricultural/Natural Resource Technician for the Carroll County Soil & Water Conservation District.",
      "summaryTimestamp": 1771532911643
    },
    {
      "id": "e4630a53eefd7955",
      "title": "Texas dairy producers offset lower milk prices with higher calf prices",
      "link": "https://agrilifetoday.tamu.edu/2026/02/18/texas-dairy-producers-offset-lower-milk-prices-with-higher-calf-prices/",
      "description": "Texas Crop and Weather Report - Feb. 18, 2026 The post Texas dairy producers offset lower milk prices with higher calf prices appeared first on AgriLife Today.",
      "date": "Wed, 18 Feb 2026 22:50:16 +0000",
      "timestamp": 1771455016000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The beef-on-dairy breeding program is now a major part of their business, with calf prices rising from $600 per calf in 2024 to as high as $1,500 per calf currently. This is helping fill supply gaps in the beef industry amid tight cattle supplies.\n\nTexas milk production increased from 17 billion pounds in 2024 to 18.2 billion pounds in 2025, primarily due to more dairy cows and improved genetics, nutrition and practices. However, milk prices declined from $20.55/cwt in Dec 2024 to $16.93/cwt in Dec 2025. Cheese prices also decreased from $18.62/cwt to $15.86/cwt, and butter prices fell from $2.50/lb in July 2025 to $1.50/lb by Dec 2025.\n\nTexas dairy consolidation continues, with 20 dairies lost in the past 2 years (294 to 274), but cow numbers increased from 675,000 to 705,000 head. Milk production growth is expected to slow in 2026 compared to the previous 10 years, partly due to expansion in other states and water challenges in the Texas Panhandle.\n\nThe article also provides summaries of weather and crop conditions across various agricultural regions of Texas, including the need for moisture, winter wheat and pasture conditions, livestock feeding, and preparations for spring planting.",
      "summaryTimestamp": 1771465837884
    },
    {
      "id": "a27e06f9b006d36e",
      "title": "Proposed USDA Rules Would Increase Line Speeds at Meatpacking&#160;Plants",
      "link": "https://civileats.com/2026/02/18/proposed-usda-rules-would-increase-line-speeds-at-meatpacking-plants/",
      "description": "February 18, 2026 – The U.S. Department of Agriculture (USDA) announced proposed rules Tuesday that would speed up line speeds at poultry and pork production facilities. Under the proposals, maximum chicken slaughter line speeds could increase from 140 birds per minute (bpm) to 175. It would also allow turkey processing lines to increase from 55 [&#8230;] The post Proposed USDA Rules Would Increase Line Speeds at Meatpacking Plants appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 21:06:15 +0000",
      "timestamp": 1771448775000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The USDA has proposed new rules that would increase line speeds at poultry and pork production facilities. The key details are:\n\n- Chicken slaughter line speeds could increase from 140 birds per minute (bpm) to 175 bpm.\n- Turkey processing lines could increase speeds from 55 bpm to an unspecified higher limit.\n- Pork processing line speeds could also see increases, though the specific limits were not provided.\n\nThe proposed changes are intended to boost efficiency and productivity at meatpacking plants. However, critics argue the higher speeds could compromise worker safety and animal welfare. \n\nThe new rules are currently in the proposal stage. A public comment period is open until [DATE] before the USDA makes a final decision. Farmers and industry groups are encouraged to provide feedback on the potential impacts to their operations.",
      "summaryTimestamp": 1771453730433
    },
    {
      "id": "f3b7e6e98739dcd3",
      "title": "Sensory science researcher unlocks what drives perceived flavors",
      "link": "https://agrilifetoday.tamu.edu/2026/02/18/sensory-science-researcher-unlocks-what-drives-perceived-flavors/",
      "description": "Pellegrino joins the Department of Animal Science to study flavor, behavior and consumer decision-making The post Sensory science researcher unlocks what drives perceived flavors appeared first on AgriLife Today.",
      "date": "Wed, 18 Feb 2026 20:36:12 +0000",
      "timestamp": 1771446972000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n\n- Robert Pellegrino, Ph.D., has joined the Texas A&M College of Agriculture and Life Sciences Department of Animal Science as an assistant professor of sensory science. \n\n- Pellegrino's research focuses on understanding the chemical, structural and temporal features of sensory stimuli that contribute to perceived flavor. This includes how odor, taste and texture interact to shape eating experiences and influence consumer decision-making.\n\n- Pellegrino has previously worked on digitizing odors, creating models to predict odor intensity and quality, and developing a universal odor scale. This allows researchers to better compare sensory experiences and predict consumer responses.\n\n- Pellegrino will teach a course on sensory evaluation of foods starting in spring 2027. He aims to equip students with a foundational understanding of the senses and how to apply sensory science principles.\n\n- Beyond Texas A&M, Pellegrino holds leadership roles with the Global Consortium for Chemosensory Research and the International Society of Neurogastronomy, focused on advancing sensory research globally.\n\n- The department head, Clay Mathis, Ph.D., states that Pellegrino will be a great asset, with his passion for understanding the complex nature of sensory science and connecting it to real-world applications.",
      "summaryTimestamp": 1771453737326
    },
    {
      "id": "aba9267182d372dc",
      "title": "Life-Science Innovations to buy Hormel’s ‘whole-bird turkey’ segment",
      "link": "https://www.agweek.com/agribusiness/life-science-innovations-to-buy-hormels-whole-bird-turkey-segment",
      "description": "Hormel Foods reached an agreement to sell several assets to Life-Science Innovations, including locations in Melrose and Swanville.",
      "date": "Wed, 18 Feb 2026 20:27:15 GMT",
      "timestamp": 1771446435000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/4abbe45/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F9f%2F26%2F087c260543f4ad665db3a28d0d2a%2Fhormel-foods-logo-2025.jpg",
      "summary": "Hormel Foods announced it has entered an agreement to sell its whole-bird turkey business to Life-Science Innovations (LSI). The sale is expected to close by the end of Q2 2026. Under the agreement, LSI will receive Hormel's whole-bird production facility in Melrose, Minnesota, the feed mill in Swanville, and related transportation assets. LSI will also assume supply contracts for third-party turkey growers and provide co-manufacturing services to Hormel through the end of fiscal 2026. Jennie-O branded products and the Jennie-O name will not be impacted. Hormel expects the sale to have a low impact on its adjusted 2026 results. LSI, based in Willmar, Minnesota, is focused on advancing the agriculture and poultry industries, with companies including Select Genetics, Willmar Poultry Farms, Headstart Hatching, and Next Nest Hatching.",
      "summaryTimestamp": 1771453743310
    },
    {
      "id": "4e292095a8d51c02",
      "title": "Corn And Soybean Export Pace Outruns Last Year",
      "link": "https://www.allagnews.com/corn-and-soybean-export-pace-outruns-last-year/",
      "description": "WASHINGTON, DC &#8211; Export demand continues to support grain markets as weekly inspections stayed large [...]",
      "date": "Wed, 18 Feb 2026 19:00:48 +0000",
      "timestamp": 1771441248000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "For the week ending February 12, 2026:\n\n- Corn export inspections reached 58.8 million bushels, down from 63.4 million the prior week but still strong seasonally. Year-to-date corn shipments total 1.41 billion bushels, well ahead of last year's 974 million.\n\n- Soybean export inspections totaled 44.2 million bushels, up from 42.1 million the previous week. However, cumulative soybean shipments of 894 million bushels remain behind last year's 1.32 billion pace.\n\n- Wheat export inspections measured 13.8 million bushels, falling from 21.3 million the prior week but lifting the season total to 651 million bushels, ahead of 547 million last year.\n\n- Sorghum loadings climbed to 9.5 million bushels, with year-to-date exports near 68 million bushels.\n\nShipments moved primarily through Gulf and Pacific Northwest ports, with China, Mexico, Japan, Egypt, and Southeast Asia remaining major buyers. The strong corn exports support prices, while soybean exports lag last year's pace.",
      "summaryTimestamp": 1771512237455
    },
    {
      "id": "70fd2f4dc1b91db1",
      "title": "Large Supplies Keep Grain Prices Under Pressure 2026",
      "link": "https://www.allagnews.com/large-supplies-keep-grain-prices-under-pressure-2026/",
      "description": "NASHVILLE, TN &#8211; Farmers preparing for spring planting face another year of tight margins as [...]",
      "date": "Wed, 18 Feb 2026 18:45:47 +0000",
      "timestamp": 1771440347000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Corn acreage is projected at nearly 94 million acres, with production expected to exceed 15.8 billion bushels. Combined with over 2.15 billion bushels of beginning stocks, total supplies could top 18 billion bushels, keeping average prices near $4.33 per bushel.\n\nSoybean acres are forecast to rebound to 85 million, lifting production near 4.46 billion bushels. However, ending stocks near 370 million bushels could hold prices around $10.31 per bushel, despite stronger exports.\n\nWheat acreage is expected to remain historically low, but large global inventories will keep supplies comfortable. Prices may improve modestly to about $5.46 per bushel.\n\nSorghum faces the heaviest pressure, as large beginning stocks outweigh lower production, leaving prices near $3.69 per bushel unless Chinese demand strengthens.\n\nThe main takeaway for farmers is that large carryover stocks will limit upside potential for grain prices, despite solid yield forecasts.",
      "summaryTimestamp": 1771512241690
    },
    {
      "id": "52b54fee4fde89de",
      "title": "Dakota Skarlagen is the latest red potato released from NDSU",
      "link": "https://www.agweek.com/crops/dakota-skarlagen-is-the-latest-red-potato-released-from-ndsu",
      "description": "First red potato variety in a decade released from NDSU this month.",
      "date": "Wed, 18 Feb 2026 18:35:57 GMT",
      "timestamp": 1771439757000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/ffcaa4c/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Ff6%2Fa1%2F73a7852f4be38bcf77df36edf71e%2Fpotato1.jpeg",
      "summary": "Dakota Skarlagen is the latest red potato variety released from North Dakota State University (NDSU) on February 15, 2026. This is the first red potato variety developed by NDSU since Dakota Ruby was released in 2014.\n\nDakota Skarlagen was selected in 2012, evaluated from 2013 through 2025, and has been replicated in research trials and by farmers since 2017. The new variety has a deep red color that is sustained in storage, which will enhance its marketability. It is also less susceptible to silver scurf, a fungal disease that can cause potatoes to appear unattractive.\n\nThe new potato variety has smaller tubers than varieties like Red LaSota, but more of them per plant, resulting in competitive yields. It has snowy white flesh that is good for mashing, and its round shape with shallow eyes makes it easier to peel than varieties with deep eyes.\n\nSusie Thompson, NDSU associate professor and Johansen-Thompson Endowed Professor in potato breeding, believes the new variety is \"wonderful\" for both seed and commercial growers. Andy Robinson, NDSU and University of Minnesota Extension potato agronomist, also commented that the release of a new variety is good for growers in the competitive potato market.\n\nDuring the Northland Potato Growers Research Reporting Conference, potato growers also heard updates on insect management, particularly the ongoing challenge of controlling the Colorado potato beetle, which has developed resistance to various insecticides.",
      "summaryTimestamp": 1771453748346
    },
    {
      "id": "ee0f60ca10335417",
      "title": "FDA Finalizes Controversial Guidelines for Livestock Antibiotics",
      "link": "https://civileats.com/2026/02/18/fda-finalizes-controversial-guidelines-for-livestock-antibiotics/",
      "description": "February 17, 2026 – Officials at the Food and Drug Administration (FDA) published a final guidance document on Friday that advises drug companies to set “duration limits” for livestock antibiotics in animal feed, without legally obligating them to do so. The duration limit—the maximum length of time a drug should be given—covers medically important antibiotics, [&#8230;] The post FDA Finalizes Controversial Guidelines for Livestock Antibiotics appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 18:32:05 +0000",
      "timestamp": 1771439525000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "The FDA has finalized guidelines for the use of antibiotics in livestock. The key points are:\n\n- The guidelines advise drug companies to set \"duration limits\" on the use of medically important antibiotics in animal feed, but do not legally require them to do so.\n- The duration limit refers to the maximum length of time a drug should be given to livestock.\n- The guidelines were controversial, with critics arguing they do not go far enough to restrict antibiotic overuse in agriculture.\n- Overuse of antibiotics in livestock can contribute to the development of antibiotic-resistant bacteria, which is a major public health concern.\n- The guidelines were published on February 17, 2026 by the FDA.\n- No specific duration limits or timelines were provided in the guidelines.\n- Experts argue the guidelines should mandate duration limits and phase out the use of medically important antibiotics for growth promotion and feed efficiency in livestock.",
      "summaryTimestamp": 1771446924744
    },
    {
      "id": "6603a0d9a9693af1",
      "title": "Weaker Dollar Improves Export Prospects For U.S. Crops",
      "link": "https://www.allagnews.com/weaker-dollar-improves-export-prospects-for-u-s-crops/",
      "description": "LUBBOCK, TX &#8211; A softer U.S. dollar is improving export competitiveness for American crops, offering [...]",
      "date": "Wed, 18 Feb 2026 18:30:46 +0000",
      "timestamp": 1771439446000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key Points:\n\n- A softer U.S. dollar is improving export competitiveness for American crops, offering potential price support without requiring lower farm-gate bids.\n\n- During 2025, the broad U.S. dollar index fell 7.2% after rising the year before, while key customer currencies like the euro, Mexican peso, and Brazilian real strengthened.\n\n- A one-percent decline in the dollar has historically been associated with roughly a half-percent increase in the value of U.S. agricultural exports.\n\n- The benefits do not appear instantly, as exchange-rate effects filter unevenly into basis and contracts depending on timing and location.\n\n- For farmers, a weaker dollar supports export demand and may strengthen crop prices.",
      "summaryTimestamp": 1771512244873
    },
    {
      "id": "4a3c5987a4c2fba6",
      "title": "Proposed Rail Merger Could Reshape Grain Transportation Markets",
      "link": "https://www.allagnews.com/proposed-rail-merger-could-reshape-grain-transportation-markets/",
      "description": "LUBBOCK, TX &#8211; A proposed $85 billion merger between Union Pacific and Norfolk Southern could [...]",
      "date": "Wed, 18 Feb 2026 18:15:45 +0000",
      "timestamp": 1771438545000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The proposed $85 billion merger between Union Pacific and Norfolk Southern railways could significantly impact grain transportation markets if approved by federal regulators. \n\nThe key points are:\n\n- The merger would create the first coast-to-coast freight railroad in the U.S.\n- Supporters claim it would streamline long-distance grain movements, especially from the Midwest to Southeastern feed and milling markets, by reducing interchange delays.\n- The companies project $4.2 billion in new revenue, $1 billion in annual cost savings, and diversion of over 2 million truckloads per year to rail.\n- Opponents warn the merged carrier could control over 40% of U.S. rail traffic, reducing competition and increasing freight rates.\n- Opponents also cite risks of service disruptions, similar to issues during 1990s rail mergers that affected agricultural shipments.\n- Regulators rejected the initial application as incomplete and require revised market-share projections and additional competitive safeguards before formal review continues.\n- A revised merger application is expected in March 2023, with a final decision likely next year.\n- For farmers, the merger could affect grain basis, freight rates, and service reliability across major producing regions.",
      "summaryTimestamp": 1771505778115
    },
    {
      "id": "3b2481d6792da864",
      "title": "How Dealers Should Answer the “Most Reliable Tractor” Question",
      "link": "https://www.farmjournal.com/how-dealers-should-answer-the-most-reliable-tractor-question/",
      "description": "Every dealer hears it:“What’s the most reliable tractor you sell?” It sounds like a product question. It’s actually a trust question. Farmers aren’t asking you to crown a winner. They’re asking whether this decision will cost them time, money, or sleep when it matters most. Dealers who lead with a brand name risk missing the [&#8230;] The post How Dealers Should Answer the “Most Reliable Tractor” Question appeared first on Farm Journal.",
      "date": "Wed, 18 Feb 2026 17:40:26 +0000",
      "timestamp": 1771436426000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key points:\n\n- Farmers are not looking for a \"winner\" tractor brand, but rather want to know if the purchase will be reliable and avoid costly downtime.\n- Dealers who simply name a brand risk missing the opportunity to build trust with the farmer.\n- Instead, dealers should focus on emphasizing their service and support capabilities, such as:\n  - Availability of parts and service technicians\n  - Average repair time and uptime statistics for their customers\n  - Warranty and maintenance programs offered\n- The goal is to demonstrate the dealer's commitment to the farmer's success, not just sell a product.\n- Providing this kind of transparent, service-focused response can help build long-term trust and loyalty with farm customers.",
      "summaryTimestamp": 1771440462991
    },
    {
      "id": "18f553baaa3afc68",
      "title": "College of Agriculture and Life Sciences formalizes student advising standard of care",
      "link": "https://agrilifetoday.tamu.edu/2026/02/18/college-of-agriculture-and-life-sciences-formalizes-student-advising-standard-of-care/",
      "description": "Student-centered academic advising framework emphasizes mentorship and personalized support The post College of Agriculture and Life Sciences formalizes student advising standard of care appeared first on AgriLife Today.",
      "date": "Wed, 18 Feb 2026 17:37:40 +0000",
      "timestamp": 1771436260000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Texas A&M College of Agriculture and Life Sciences has formalized a student advising standard of care to strengthen student success and support advisor well-being. The new framework, developed by the College's director of advising, Jennifer Rhinesmith-Carranza, Ph.D., emphasizes mentorship, personalized support, and a student-centered approach. \n\nThe standard of care highlights 7 focus areas, including clear communication, individualized guidance, authenticity, and a growth-focused mindset. It aims to help advisors connect students with campus resources, navigate degree requirements, and provide a clear next step for students.\n\nIn 2025, the College's advising team won several awards, including the President's Meritorious Service Award for individual and supervisor contributions, the President's Award for Academic Advising, the New Advisor Award, the Excellence in Graduate Advising Award, and the Dean's Outstanding Achievement Award for staff excellence.\n\nThe formalization of this standard of care reinforces the College's culture of continuous learning and reflects the human side of advising, emphasizing meaningful relationships, long-term goal support, and student empowerment. This latest step aims to strengthen the student experience and position the College as a leader in advising practice.",
      "summaryTimestamp": 1771440471668
    },
    {
      "id": "844cd8e59e33e47f",
      "title": "As US agriculture flails, farmers see big corn acres as best bet to break even",
      "link": "https://www.agweek.com/crops/corn/as-us-agriculture-flails-farmers-see-big-corn-acres-as-best-bet-to-break-even",
      "description": "Farmers expect corn, the most widely grown U.S. crop, to hew close to break-even levels this year, supported by strong usage.",
      "date": "Wed, 18 Feb 2026 17:27:47 GMT",
      "timestamp": 1771435667000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/f40a46e/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F1d%2Ff3%2F1dfae65a4c468692ec5184305569%2Ftrump-iowa.JPG",
      "summary": "U.S. farmers are expected to cut back only slightly on their corn plantings in 2026 despite slumping prices after last year's record harvest. \n\nKey points:\n- Farmers expect corn to hew close to break-even levels this year, supported by strong usage, while soybeans are seen as riskier due to rising competition from Brazil and trade tensions with China.\n- Analysts project corn plantings for 2026 at 94.9 million acres, down about 4% from last year's 89-year high, but still the second-most corn acres in 13 years. Soybean plantings are projected at 84.9 million acres, in line with the 10-year average.\n- Last year's national corn yield was the highest on record at 186.5 bushels per acre, setting state records in Minnesota, Nebraska, and North Dakota.\n- Farmers are looking to cut costs, with some in Nebraska stopping machinery purchases, reducing fertilizer use, and considering cutting back on herbicide applications.\n- In North Dakota, farmers are delaying machinery repairs, skipping optional treatments on soybeans, and focusing input costs on corn as their most profitable crop in 2025.\n- One farmer, Phil Volk, expects to expand his corn acreage this spring by 15% compared to last year.",
      "summaryTimestamp": 1771453752321
    },
    {
      "id": "3f163697760370cb",
      "title": "Is sulfur a mobile nutrient? Carryover, soybean needs, and S fertilizer product differences",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/is-sulfur-mobile-nutrient-carryover.html",
      "description": "",
      "date": "Wed, 18 Feb 2026 16:18:00 +0000",
      "timestamp": 1771431480000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiOtoX-b7TpUq6A3latdUM9EUBoGHh-sESpflBLiNnYGObDuP8001MQvv13RiAQwkttoFycgLXtDJtjbBOhCmPaHYdVTDSj3eU2uojmt8CrTpYE8ho9lDKuT6NvyQ3WT4ls6C6y9BgjHjPFzWnczwfU_wys37XK9RK_jV9Avw9pAie2YdhgxkWJnBgzmyg/s72-w640-h426-c/Sulfur%20deficiency%20(1)%20(1).JPG",
      "summary": "Key Takeaways:\n\n- Sulfate, the form of sulfur available to plants, can carry over in Minnesota soils for at least 2 years after application. Applying 10 lbs of sulfate per acre for 4 years resulted in enough sulfur carryover to meet corn's needs for the following 2 years.\n\n- Soybeans do need sulfur, but direct sulfur application to soybeans only benefited yield in 2 out of 30 trials. Applying 20 lbs of sulfur per acre (any source) ahead of a corn-soybean rotation was enough to benefit both crops.\n\n- For sulfur-bentonite products like Tiger-Sul, immediate incorporation can result in poor sulfur oxidation and availability. Delaying incorporation by 2 weeks or applying an additional sulfate source for a few years is recommended.\n\n- Elemental sulfur sources like MicroEssentials or MST have greater availability than sulfur-bentonite products.\n\n- The research was funded by AFREC and the Minnesota Soybean Research and Promotion Council, and conducted by Daniel Kaiser, Extension nutrient management specialist at the University of Minnesota.",
      "summaryTimestamp": 1771434008205
    },
    {
      "id": "1103f3c5fb01b981",
      "title": "Minnesota potato council seeks independence in research and promotion work",
      "link": "https://www.agweek.com/crops/other-crops/minnesota-potato-council-seeks-independence-in-research-and-promotion-work",
      "description": "A potato grower says the move to disassociate with the state's Department of Agriculture is a chance to deliver more funds towards potato research.",
      "date": "Wed, 18 Feb 2026 16:01:22 GMT",
      "timestamp": 1771430482000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/fbba656/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe0%2Fb3%2F17f40c9a44c0834f72940f440603%2Fpotato-row-1.JPG",
      "summary": "The council, which represents potato growers in all but northwest Minnesota's Red River Valley, has expressed its intent to terminate its current research and promotion council and transition to a privately funded and operated producer organization.\n\nThe key details are:\n\n- The council was formed in 1991 to support and strengthen Minnesota's potato growers.\n- The council collects a \"checkoff fee\" from producers to fund research and promotion for the potato industry.\n- The council wants to terminate its MDA-administered status and become an independent, non-profit group.\n- This would allow the council to save around $30,000 per year (over 10% of its budget) that was going to the MDA for administrative services.\n- The council can make changes like increasing the checkoff rate more quickly as an independent organization, rather than going through the MDA's 12-month process.\n- The council received unanimous support from its board and members for this transition.\n- A public hearing will be held on February 25, where the council will consider final action on the termination.\n- If approved, the termination will be effective on July 1.\n\nThis change will allow the Minnesota potato growers to have more autonomy and direct more of their checkoff dollars towards research work rather than administrative overhead costs.",
      "summaryTimestamp": 1771453756615
    },
    {
      "id": "eee5dfde7aa21501",
      "title": "MN CropCast: Unlocking the soybean genome with Dr. Bob Stupar",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/mn-cropcast-unlocking-soybean-genome.html",
      "description": "",
      "date": "Wed, 18 Feb 2026 13:59:00 +0000",
      "timestamp": 1771423140000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-w320-h320-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "In this episode of the Minnesota CropCast podcast, hosts Dave Nicolai and Seth Naeve interviewed Dr. Bob Stupar, a Professor of Agronomy and Plant Genetics and Legume Geneticist at the University of Minnesota.\n\nKey points:\n- Dr. Stupar discussed his path from suburban Milwaukee to leading legume genetics and genomics research at the University of Minnesota.\n- He explained the critical process of identifying genes of interest, validating their functionality, and engineering soybeans to possess important, novel traits.\n- Maintaining and updating reference genomes, the essential \"blueprints\" for scientific advancement, is crucial and can have a significant impact, as illustrated through historical examples.\n- Gene editing is being used to improve soybean quality traits, such as reducing antinutritional components.\n- Dr. Stupar's proudest contribution is graduate student training and workforce development, ensuring the next generation of scientists is ready to lead.\n\nThe Minnesota CropCast podcast, hosted by David Nicolai and Seth Naeve, discusses the progress and challenges of Minnesota's agronomic crops, featuring specialists from various crops and agronomic disciplines.",
      "summaryTimestamp": 1771425694781
    },
    {
      "id": "f00341ed4caab4b8",
      "title": "Confusion and ‘More Chaos’ as States Implement SNAP Food Restrictions",
      "link": "https://civileats.com/2026/02/18/confusion-and-more-chaos-as-states-implement-snap-food-restrictions/",
      "description": "Since 2018, the entrepreneurial couple has benefited from the Supplemental Nutrition Assistance Program (SNAP), which they’ve used to support themselves and their children, and to keep the business running. As small business owners who strive to offer good-paying jobs to their employees and give back to the community as much as possible, they don&#8217;t have [&#8230;] The post Confusion and ‘More Chaos’ as States Implement SNAP Food Restrictions appeared first on Civil Eats.",
      "date": "Wed, 18 Feb 2026 09:01:55 +0000",
      "timestamp": 1771405315000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/02/confusion-and-more-chaos-as-states-implement-snap-food-restrictions-3.jpg",
      "summary": "Since 2018, an entrepreneurial couple has relied on SNAP to support their family and their small business. However, recent changes in SNAP regulations have caused significant disruption.\n\nSeveral states, including Arkansas, Florida, and Georgia, have implemented new restrictions on the types of food that can be purchased with SNAP benefits. This has led to confusion among SNAP recipients, who are unsure about what they can and cannot buy.\n\nThe new restrictions have also created difficulties for small business owners who rely on SNAP customers. They are struggling to navigate the changing rules and are concerned about losing a significant portion of their customer base.\n\nExperts warn that these SNAP restrictions will likely result in \"more chaos\" and could negatively impact the ability of low-income families to access affordable, nutritious foods. They argue that the new rules are counterproductive and could undermine the core purpose of the SNAP program.\n\nOverall, the article highlights the unintended consequences of the SNAP food restrictions and the challenges faced by both SNAP recipients and small business owners as a result of these changes.",
      "summaryTimestamp": 1771411230072
    },
    {
      "id": "0cd94936c00e5cb1",
      "title": "As carbon pipeline efforts stall, company eyes trucking the gas through North Dakota",
      "link": "https://www.agweek.com/agribusiness/as-carbon-pipeline-efforts-stall-company-eyes-trucking-the-gas-through-north-dakota",
      "description": "Harvestone Low Carbon Partners is considering transporting CO2 from Dakota Spirit ethanol plant near Jamestown for underground storage.",
      "date": "Tue, 17 Feb 2026 15:22:10 GMT",
      "timestamp": 1771341730000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/7408fe0/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fjamestownsun%2Fbinary%2F081318.N.JS.NDSoyProcessors%20%281%29_binary_4037311.jpg",
      "summary": "Key Points:\n\n1. Harvestone Low Carbon Partners is exploring trucking carbon dioxide emissions from its Dakota Spirit ethanol plant near Jamestown, North Dakota, about 160 miles west for underground storage.\n\n2. The company requested a $20 million loan from North Dakota's Clean Sustainable Energy Authority (CSEA) in late January for its $95 million project, but the CSEA board voted against providing the funding.\n\n3. Harvestone already operates a carbon storage facility at its Blue Flint ethanol plant near Underwood, North Dakota, where the CO2 has been pumped underground into the Broom Creek Formation since 2023.\n\n4. Transporting CO2 by truck would not be a new practice, but the scale Harvestone is considering is. They plan to capture and store 230,000 metric tons of CO2 annually.\n\n5. Building a pipeline to transport Dakota Spirit's emissions would be expensive, as a 160-mile pipeline would only move about 1,430 metric tons of CO2 per mile, compared to Summit's 2,500-mile pipeline which would move about 7,200 metric tons per mile.\n\n6. Harvestone has an engineering, procurement and construction agreement with Minnesota-based McGough for the project, with a \"guaranteed substantial complete\" date in January 2027 and full commercial operations planned for later that year.\n\n7. The potential for carbon storage in eastern North Dakota is limited due to the area's geology, so some form of transportation would be needed if companies want to capture, store or use industrial emissions from the region.",
      "summaryTimestamp": 1771425726160
    },
    {
      "id": "957a1f1f771b103e",
      "title": "Improving waterhemp control by managing spray water pH",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/improving-waterhemp-control-by-managing.html",
      "description": "",
      "date": "Tue, 17 Feb 2026 14:15:00 +0000",
      "timestamp": 1771337700000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjeGlAeUiIBJwZ4ctdI_mh3flmZnZDe1nFx16EXbclg1M8atbqYH_Xnnt3-JfrmgGmGbBwHH5H33fOEGg6b0sSN7CahvuZ-iy5vx9RgUnKXjkMJF4kkRXM0pzAtMV7cPSr0sak0-n0U6FoTAU25EBDPGpwr010UzmhX6cqqz4RHdnBZDzsHENZGLrWTXS3e/s72-c/Spray%20Truck%20broadjet%202.jpg",
      "summary": "The study conducted in Rochester, Minnesota in 2025 evaluated how spray water pH adjustment and timing of spray solution mixing affected waterhemp control in a corn herbicide program. \n\nThe treatments included a tank mix of atrazine and Acuron GT (at full or half rate) with NIS and AMS, with or without a pH-lowering and buffering adjuvant (AlpHa Shot), and mixed either six days prior to application or at the time of spraying.\n\nAdding the pH-lowering adjuvant reduced spray water pH from 7.5 to 5.8, which improved waterhemp control by 10% at 24 days after treatment (DAT) and 7% at 112 DAT. Waterhemp density decreased by 64% and biomass was reduced by 55% in treatments with the pH adjuster.\n\nThe timing of mixing the pH adjuster (6 days ahead or at time of spraying) did not affect waterhemp control, density, or biomass. The improved weed control was observed at both full and half rates of Acuron GT.\n\nThe key takeaway is that conditioning the spray water to the proper pH can improve herbicide performance and season-long waterhemp management, regardless of when the solution is mixed. Testing water pH and using a water conditioner or buffering agent is recommended if waterhemp control has been inconsistent.\n\nThe study was conducted by Eric Yu and Ryan Miller, UMN Extension Crops Educators, and was published on February 17, 2026 in the UMN Crop News.",
      "summaryTimestamp": 1771512248860
    },
    {
      "id": "9f513a14fe07e323",
      "title": "5 Cover Crops You Can Plant in February",
      "link": "https://modernfarmer.com/2026/02/cover-crops-february/",
      "description": "Most farmers plant cover crops in the fall, and let the winter terminate them before they go to seed. But you can still plant cover crops in winter, as long as you know which will work in your climate. Plant these five cover crops this month for early spring benefits. The post 5 Cover Crops You Can Plant in February appeared first on Modern Farmer.",
      "date": "Tue, 17 Feb 2026 10:00:48 +0000",
      "timestamp": 1771322448000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/10/Fresh-spinach-plants.webp",
      "summary": "Requires soil temperature of at least 40°F (4°C).\n\nKale - A multipurpose cover crop that feeds the soil, farmer, customers, and livestock. Needs slightly warmer soil of at least 45°F (7°C). Certain varieties are specialty market items.\n\nDaikon Radish - Also called forage radish, the long taproots reach deep into the soil to break up compaction and scavenge leftover nitrogen. Requires soil temperature of at least 65°F (18°C).\n\nOats - Grow quickly to prevent weed germination. Form beneficial relationships with fungi. Sow at a rate of 4-6 oz per 100 sq ft. Can be terminated without harvesting oats.\n\nBuckwheat - A quick-maturing phosphorus scavenger that conditions poor soils. Attracts pollinators and beneficial insects. Can be used as an organic mulch.\n\nThe article notes that low tunnels can provide extra warmth and protection for cover crops in colder climates. Planting cover crops before spring can lead to economic benefits for farms through improved soil health, carbon sequestration, and erosion prevention.",
      "summaryTimestamp": 1771526750604
    },
    {
      "id": "25644925eb82eddc",
      "title": "Strategic Farming: Let's talk crops! session talked forecasting tools for crop and pest management",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/strategic-farming-lets-talk-crops_16.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 17:43:00 +0000",
      "timestamp": 1771263780000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjO5aunE_uoVkP9LI9r3n8Dpm1IiJYW5pClHH3uqDnphvgKN3zj95NHyH7Ib8koR8fdTGW4AQmGObBUNmu22C0wNVn5PrnuC8DgcU7Gyf7-CdmWQ9X4pl47Keqb17PkwaKW08g3fQ1U8NdyxSyPn4MmaV6U0BvAl8Rva_OHxg2nVLbxGiXOK704ccEkD1Vg/s72-w241-h320-c/noaa-mn-low-temps-feb7.jpg",
      "summary": "The webinar series runs through March and is still open for registration.\n\nKey points:\n- Cold weather impacts on overwintering insect pests like soybean aphid, corn rootworm, and alfalfa weevil. Colder temperatures (below 0°F) can lead to 50-95% mortality for some pests.\n- Forecasting tools like pheromone traps and degree day calculations can help predict arrival and development of migratory pests like black cutworm, potato leafhopper, and corn earworm.\n- Crop disease forecasting tools like the ipmPIPE website track the spread of diseases like southern rust of corn and tar spot.\n- The expanding Minnesota Ag Weather Network provides hyperlocal weather data and degree day models for various crops and pests.\n- The North Dakota Ag Weather Network (NDAWN) hosts many of these forecasting tools, including models for sugarbeet root maggot, wheat midge, Cercospora leaf spot, white mold, and Fusarium head blight.\n- Scouting fields is still important to validate the forecasting tools.\n\nThe article emphasizes how these advanced forecasting tools can help Minnesota farmers better time management practices and prepare for crop and pest threats.",
      "summaryTimestamp": 1771440496003
    },
    {
      "id": "67a14bb588f7d967",
      "title": "Help the Crops Team fine-tune programming!",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/help-crops-team-fine-tune-programming.html",
      "description": "",
      "date": "Mon, 16 Feb 2026 16:30:47 +0000",
      "timestamp": 1771259447000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhCxd5PtQ8nJrtOb4X1Tz1md-IIKn225eI96PLlJgYOzihrHu8OUq4wBg-ocPXUHBdOkMO_NFZ1aPkpH1kdhqKdcIxaHijDP6s54fOuTloYefpKielhFj8Psev7G7MakTpjRcGWQ7Srb96x6RmLgtHNGcud3o7ZvUBqlI9eWAjZQ3jAzV9mLOeT01AkqSM4/s72-c/weed-management-field-day-sarangi.jpg",
      "summary": "The University of Minnesota Extension Crops team is seeking input from row crop and forage producers, as well as agriculture professionals who work with producers, to better understand their educational needs and preferences. They are conducting an anonymous 12-15 minute survey to gather this feedback, with the goal of customizing their educational programs to better meet the interests and preferences of the target audience. The survey asks about respondents' operations, learning preferences, and how they want to engage with Extension. The Crops Team aims to use the survey results to refine their programming and make it more useful and relevant for producers. The survey is open until February 16, 2026, and the team encourages all interested parties to participate.",
      "summaryTimestamp": 1771434033466
    },
    {
      "id": "b4602ee8b589516a",
      "title": "Freeze, Thaw, Seed: Timing Pasture Renovation in an Unpredictable Winter",
      "link": "https://crops.extension.iastate.edu/post/freeze-thaw-seed-timing-pasture-renovation-unpredictable-winter",
      "description": "<p>This winter’s erratic weather, swinging from –30°F wind chills to unseasonably warm temperatures in the 50s, has left many wanting spring and ready to get back in the fields. Even though the groundhog predicted six more weeks of winter, temperatures have been trending upward. Over the next week, highs are expected to stay above freezing during the day and drop below freezing at night. These natural freeze–thaw cycles signal the slow transition into spring. </p>",
      "date": "Fri, 13 Feb 2026 11:51:43 -0600",
      "timestamp": 1771005103000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Main news/finding: Erratic winter weather with extreme temperature swings presents an opportunity for farmers to thicken forage stands through frost seeding.\n\nKey numbers/statistics:\n- Highs expected to stay above freezing during the day and drop below freezing at night over the next week.\n- Frost seeding can be a cost-effective way to rejuvenate a declining stand or introduce new legumes.\n\nDates/deadlines: None mentioned.\n\nPeople/organizations/programs:\n- Shelby Gruss, Assistant Professor Forage Extension Specialist at Iowa State University\n- Iowa State University Extension and Outreach\n\nLocations: Iowa\n\nContext/causes: The unpredictable winter weather, swinging from extreme cold to unseasonably warm temperatures, is creating conditions suitable for frost seeding.\n\nImpacts for farmers: Frost seeding can be used to thicken forage stands and introduce new legumes, which can help rejuvenate declining pastures in a cost-effective way.\n\nRecommendations/action items:\n- Farmers should consider frost seeding to take advantage of the current freeze-thaw cycle.\n- For more information on best practices for frost seeding, review the \"Frosting Seeding Legumes\" article.\n\nExpert quote:\n\"Her research focuses on optimizing forage-based systems through strategies to enhance resilience and productivity in annual and perennial forage through different management strategies. Current research projects focus on diversification, whether it be in a rotation with cover crops, intercropping for forage establishment, or utilizing different species to help break disease cycles.\"",
      "summaryTimestamp": 1771540065130
    },
    {
      "id": "9a2b8ede909ba045",
      "title": "Frosting Seeding Legumes",
      "link": "https://crops.extension.iastate.edu/encyclopedia/frosting-seeding-legumes",
      "description": "<p>Frost seeding involves strategically broadcasting or overseeding legumes, such as red clover, into a tired pasture or within a small grain stand. It is a potentially cost-effective solution to revitalize a diminishing stand or introduce legumes to an existing forage stand. Frost seeding is usually not recommended with grass species. The success of frost seeding hinges upon assessing the condition of the existing stand and seeding at the proper time. </p>",
      "date": "Fri, 13 Feb 2026 11:47:51 -0600",
      "timestamp": 1771004871000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "It is a cost-effective way to revitalize a diminishing forage stand or introduce legumes. Timing is critical, with frost seeding typically done between mid-February and early March to take advantage of freeze-thaw cycles that help incorporate the seed. \n\nA thick thatch can hinder success, so it's recommended to hay or overgraze the area in the prior fall/winter to open up the canopy. Sandy or very dry soils are less ideal, with loam or clay soils preferred. Adequate spring moisture is vital for establishing a healthy stand after frost seeding.\n\nThe article was authored by Shelby Gruss, an assistant professor and forage extension specialist at Iowa State University who joined the department in November 2023. Her research focuses on optimizing forage systems through strategies like diversification, cover cropping, and disease management.",
      "summaryTimestamp": 1771540067975
    },
    {
      "id": "ee41cb05521ef609",
      "title": "All Day Ag Outlook Conference March 3 at the Beef House",
      "link": "https://farmdoc.illinois.edu/field-crop-production/all-day-ag-outlook-conference-march-3-at-the-beef-house.html",
      "description": "The 36th annual All Day Ag Outlook will be held Tuesday, March 3, at the Beef House in Covington, Indiana. Join the WILLAg analysts and the farmdoc team for the day. We&#8217;ll cover the basics this year, including the markets, weather, weeds, trade, competition, land values, and crop insurance decisions. Click the registration link for complete details. Doors open at 7:30 a.m. central / 8:30 a.m. eastern and include both coffee and rolls in the morning and a Beef House lunch.&#8230;",
      "date": "Fri, 13 Feb 2026 13:55:21 +0000",
      "timestamp": 1770990921000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/ADAO-Header.png",
      "summary": "The 36th annual All Day Ag Outlook conference will be held on Tuesday, March 3, 2026, at the Beef House in Covington, Indiana. The event, organized by the University of Illinois Extension and the farmdoc team, will cover various agricultural topics, including markets, weather, weeds, trade, competition, land values, and crop insurance decisions.\n\nThe conference will feature presentations by experts such as Eric Snodgrass from Nutrien Ag Solutions on weather outlook, Joe Janzen from the University of Illinois on grain market fundamentals, and Joana Colussi from Purdue University on South American competition. Additionally, there will be panels on soybeans and corn featuring analysts from the WILLAg team.\n\nRegistration for the event is $40 per person if done by February 27, 2026, and $60 thereafter. Media members can register for free. The conference will start at 7:30 a.m. Central Time (8:30 a.m. Eastern Time) and includes coffee, rolls, and a Beef House lunch.\n\nThe conference will also cover topics such as weed management with Aaron Hager from the University of Illinois, the value of farmland with Bruce Sherrick from the University of Illinois, and where to trim crop budgets with Nick Paulson from the University of Illinois. Gary Schnitkey from the University of Illinois will also provide insights on crop insurance decisions.",
      "summaryTimestamp": 1771526754449
    },
    {
      "id": "3f08825939c7efbd",
      "title": "7 Vegetables to Start From Seed in February",
      "link": "https://modernfarmer.com/2026/02/vegetable-seed-february/",
      "description": "It takes a lot to get the farm ready for the growing season. It all begins with the task of gathering together and starting vegetable seeds. February is an ideal time to get many of your spring crops going. Consider these 7 vegetables as you prepare your rows. The post 7 Vegetables to Start From Seed in February appeared first on Modern Farmer.",
      "date": "Mon, 09 Feb 2026 12:00:00 +0000",
      "timestamp": 1770638400000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/03/Sowing-tomato-seeds-in-tray.webp",
      "summary": "This can be done in protected environments like greenhouses, cold frames, or even in the home. Key vegetables to start from seed in February include:\n\n- Slow-growing herbs like basil, oregano, and rosemary, which can take 1-4 weeks to germinate.\n- Tomatoes, which need 80+ days from seed to fruit and do best with a heat mat. Opt for determinate varieties in short seasons.\n- Peppers, which can take up to a month to sprout and need 2+ months to mature. Jalapeño, serrano, and shishito are good productive options.\n- Brassicas like broccoli, cabbage, and kale, which thrive in cool spring weather. Faster-maturing Asian brassicas work well in warm climates.\n- Lettuces, which grow quickly and can handle some late frost. Both leaf and heading lettuces can be sown.\n- Carrots and parsnips, which need to be direct sown in their final location due to sensitive taproots.\n- Onions and leeks, which take 1-2 weeks to sprout and 75-140 days to mature.\n\nThe article recommends using protected growing environments like greenhouses, cold frames, and low/high tunnels to extend the growing season, especially in cold climates. Proper seed starting, potting up, and fertilizing are also key for success.",
      "summaryTimestamp": 1771526758322
    },
    {
      "id": "9271afb05b570797",
      "title": "Feb 06 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weeds/feb-06-weather-update-and-market-review.html",
      "description": "We had another cold and mostly dry week across the state. Average temperatures this week ranged from the low teens in northern Illinois to the high 20s in southern Illinois, between 8 and 18 degrees below average. A healthy snowpack in the southern half of the state helped push nighttime low temperatures well below 0, including lows of 7 below in Taylorville and 4 below in Jerseyville. The cold end to January pushed the month as a whole to be around 2 degrees below normal statewide.&#8230;",
      "date": "Fri, 06 Feb 2026 13:58:51 +0000",
      "timestamp": 1770386331000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this past week were 8-18 degrees below average, with lows reaching -7°F in Taylorville and -4°F in Jerseyville. January as a whole was about 2 degrees below normal statewide. Precipitation was scarce, with most areas receiving less than 0.1 inches of light snow. January ended around 2 inches drier than normal statewide. While some areas like Du Quoin had over 20 inches of snow, it only yielded less than 1 inch of liquid water, providing little drought relief.  \n\nLooking ahead, temperatures are expected to warm up to the 40s and 50s next week, but precipitation will remain sparse at under 0.1 inches. The third week of February is forecasted to be warmer and wetter than average as a more active weather pattern moves in. \n\nThe article also features comments from experts on the importance of using the N-Rate Calculator and Precision Conservation Management program to maximize profits rather than just yields. These tools help farmers optimize nitrogen applications to protect local water quality while maintaining their bottom line.\n\nThe article mentions the weekly WILLAg.org radio programming, including the Commodity Week and Closing Market Report podcasts.",
      "summaryTimestamp": 1771526761741
    },
    {
      "id": "9f72ddb9ce502ae0",
      "title": "Why Attention Matters More Than Response for Advertisers",
      "link": "https://www.farmjournal.com/why-attention-matters-more-than-response-for-advertisers/",
      "description": "For many years, click-through rate was the primary metric used to judge digital performance in agriculture. Today, it no longer tells the full story. Farmers are searching differently, using AI-assisted tools, voice search and quick-scan platforms that often answer their questions without the need to click at all. With this shift, the true indicator of [&#8230;] The post Why Attention Matters More Than Response for Advertisers appeared first on Farm Journal.",
      "date": "Thu, 05 Feb 2026 17:18:27 +0000",
      "timestamp": 1770311907000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/02/why-attention-matters-more-2.webp",
      "summary": "Farmers are now using AI-assisted tools, voice search, and quick-scan platforms that often answer their questions without needing to click. The true indicator of content effectiveness is now the time a user spends meaningfully engaged, as this signals real interest and creates stronger opportunities for brand messaging.\n\nAgWeb.com recently underwent a redesign to increase user attention and engagement:\n- 54% increase in readers reaching 75% of an article\n- 21% increase in readers reaching 90% of an article\n- 33% increase in daily article pageviews per mobile user\n\nThe article notes that in general, only 16% of users read every word on a page, while 79% scan rather than read fully. Deeper scroll behavior and more articles consumed per visit indicate greater attention and focus.\n\nAttention time is a better indicator than click-through rate, as it measures whether users stayed with the content, scrolled with purpose, and consumed multiple articles - behaviors that directly influence brand recall, message retention, and advertising effectiveness.\n\nThe improvements on AgWeb provide a template for increasing engagement and attention, leading to higher quality impressions and better alignment with how farmers search and consume content today. This matters for ag marketers looking to reach farmers in focused, engaged moments.",
      "summaryTimestamp": 1771411244705
    },
    {
      "id": "258bb0ad625cba90",
      "title": "Evaluating soybean performance in conservation systems &#8211; project report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/evaluating-soybean-performance-in-conservation-systems-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction Recent dust storm events in central Illinois and across the Midwest have renewed attention on soil conservation, especially after the tragic May 2023 event near Springfield that caused an 80-vehicle pileup, eight fatalities, and dozens of injuries. These incidents highlight that soil loss is not only an agronomic issue but also a public safety and environmental concern. Reduced tillage and cover crops are well-established pract",
      "date": "Wed, 04 Feb 2026 18:14:00 +0000",
      "timestamp": 1770228840000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/02/Fig1_map-and-soybean-v4-1024x335.jpg",
      "summary": "Key Findings:\n- Field trials were conducted in 2024-2025 at 6 sites in central Illinois and north-central Iowa to evaluate soybean performance under different tillage (conventional, strip-till, no-till) and cover crop (no cover, cereal rye) systems.\n- Starter fertilizer (15 lb N/ac or 15 lb N/ac + 10 lb S/ac) was evaluated in each system.\n- Soybeans showed an early-season response to starter fertilizer, with increased biomass at V4 stage. However, this did not translate to higher yields.\n- Soybean yields ranged from 60-95 bu/ac across trials. Yields were similar across tillage/cover crop systems, with conventional tillage and strip-till averaging 78.4 bu/ac, no-till at 77.6 bu/ac, and no-till with cereal rye at 76.2 bu/ac. \n- While yields were comparable, differences in profitability emerged due to varying input costs. No-till had the highest partial net return, followed by strip-till and conventional tillage. No-till with cereal rye had the lowest partial net return due to cover crop management costs.\n- The study will continue in 2026 to track longer-term impacts on soil, residue, and nutrient dynamics in conservation systems.",
      "summaryTimestamp": 1771526766329
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "Greenhouses trap thermal heat to warm plants, with some featuring vents, irrigation systems, and climate controls. Different types of greenhouses include modular plastic, low tunnels, cold frames, and designer greenhouses with concrete foundations and climate controls. \n\nFor February greenhouse growing, good options include:\n- Tomatoes and peppers, which benefit from early planting to give their long germination time\n- Brassicas like kale, cabbage, cauliflower, and broccoli to get an early harvest before spring pests arrive\n- Lettuces, which can be grown as baby greens or full-sized heads\n- Potatoes, to get full-sized tubers or baby potatoes by spring\n- Onions, including sets, seeds, and bunching onions\n- Flowers like lisianthus, coneflowers, and dahlias that take a long time to sprout\n\nProper greenhouse setup is key, with considerations around heat, ventilation, lighting, and pest protection. Greenhouses can raise temperatures by 2-30°F compared to outside, depending on the design.\n\nThe article does not provide any specific dates, prices, or expert quotes. It focuses on the general principles and recommended crops for February greenhouse growing across different regions and greenhouse types.",
      "summaryTimestamp": 1771526770038
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "S. avocado supply chain, taking place on November 18-20, 2026 in San Diego, California. The inaugural conference aims to bring together every segment of the avocado industry - including producers, exporters, importers, packers, retailers, and foodservice buyers - to collaborate, share data-driven insights, and align on strategies to strengthen the avocado category. \n\nThe conference is being organized with the support of the Hass Avocado Board (HAB), which has a mission to grow global avocado demand and make avocados America's preferred healthy food. It will deliver a forward-looking agenda covering global avocado production and trade, consumer/shopper trends, marketing programs, and economic dynamics impacting the industry. Stakeholders expected to attend include growers, packers, importers/exporters, retailers, foodservice, suppliers, logistics companies, and data/insights providers.\n\nKey details:\n- Location: Hilton San Diego Bayfront\n- Dates: November 18-20, 2026\n- Organizers: Farm Journal, Hass Avocado Board\n- Goals: Collaboration, data-driven insights, strategic industry alignment\n\nThe conference is described as a \"pivotal moment\" that will help strengthen the avocado category amidst high consumer demand, industry innovation, and the need for greater alignment. Attendees will gain indispensable insights and year-round strategic value from the event.",
      "summaryTimestamp": 1771411252661
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Iowa State University Pesticide Safety Education Program has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on January 1, 2026. The updated training manuals are available for purchase through the ISU Extension Store, including the revised Iowa Core Manual (CS445). New exams based on the updated core manual are now available at all Iowa Department of Agriculture and Land Stewardship test sites. The Private Pesticide Applicator Manual (CS1) now includes a two-page informational update, and all private exams include content from this insert. Farmers and pesticide applicators in Iowa can contact Betsy Danielson at betsydan@iastate.edu for more information.",
      "summaryTimestamp": 1771411255167
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The key points are:\n\n- Lead generation should be about delivering real value to farmers in exchange for their time and attention, not just capturing leads.\n- The call-to-action (CTA) and offer you choose are critical, as they shape the quality and purchase-readiness of the leads you generate.\n- The mindset should shift from what the business wants to collect, to what farmers genuinely need.\n- Designing the right offer that solves real problems for farmers is more important than chasing high lead volumes.\n\nThe article does not provide any specific numbers, statistics, dates, names, or expert quotes. The overall recommendation is for businesses targeting farmers to prioritize creating valuable offers over just lead generation tactics.",
      "summaryTimestamp": 1771411257460
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Over the past week, temperatures were 4-8 degrees below normal across the state, with nighttime lows reaching as low as -5°F in Rockford and -2°F in Aurora. The cold weather was accompanied by strong winds, resulting in wind chill values close to -20°F on some days. \n\nPrecipitation levels were also low, with 7-day totals ranging from around 0.5 inches in northeast Illinois to virtually nothing in southwest Illinois. January to date has been very dry, with Carbondale and Charleston experiencing the 4th and 10th driest first two-thirds of January on record, respectively, both receiving less than 0.5 inches of precipitation.\n\nThe cold temperatures are expected to persist for at least another week, with most of the northern half of the state likely to remain below freezing for the rest of the month. However, a strong winter storm is projected to bring significant snowfall, with central Illinois expected to receive 3-4 inches and southern Illinois potentially seeing 8-12 inches, with isolated pockets of heavier snow.\n\nThe article also includes information about the \"Commodity Week\" radio program, which features commodity market analysis from experts Chip Nellinger of Blue Reef Agri-Marketing, Brian Stark from The Andersons, and Arlan Suderman with StoneX.",
      "summaryTimestamp": 1771526773671
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "Key points:\n- Farmers are now searching for information differently, moving away from traditional Google searches to using AI-powered platforms like ChatGPT and Google's AI Overviews, as well as mobile voice search.\n- To cut through the \"AI slop,\" brands need to focus on building brand authority and trust by providing real, trustworthy information to growers and producers.\n- The way farmers find information has fundamentally shifted, and most agricultural marketers are still playing the old SEO game.\n- Discoverability is now about ensuring expertise, content, and brand authority surface at the exact moment the audience is looking for answers, across every channel where they are searching.\n- In the new AEO era, discoverability is about winning the citation, brand mention, and trusted source reference, rather than just winning the click.\n\nThe article suggests that agricultural marketers need to reevaluate their 2026 strategy and adopt an answer-driven content strategy, as well as amplify trusted voices, to remain relevant and visible to their audience.",
      "summaryTimestamp": 1771411264176
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "It originated in Brazil's tropical rainforests and involves integrating small-scale farming with conventional forestry to create a self-sustaining, ecologically-balanced system.\n\nThe most common forest farming method is thinning a forest to allow the best conditions for crops to grow in the understory, such as native ornamentals, fungi, fruit, timber, and forest food crops. Other approaches include silvopasture (combining forestry and ranching) and alley cropping (using tree canopies to protect specialty crops).\n\nBenefits of forest farming include improved water and soil quality, increased carbon storage (up to 22 lbs per year), better temperature regulation, and the ability to grow specialized crops that thrive in forested environments. It supports biodiversity by providing habitat for beneficial insects, birds, mammals, fungi, and microbes.\n\nExisting forested land, riparian areas, and even small amounts of forest on a farm can be suitable for conversion to an agroforestry system. Before starting, farmers should inventory their natural resources, manage any invasive trees, and develop a forest management plan with help from extension services.\n\nMarketing forest crops often requires being proactive, as they may not fit typical farmer's market or restaurant sales channels. Options include online sales, agritourism, pick-your-own, and direct marketing associations. Regulations around wild-harvested plants also need to be considered.",
      "summaryTimestamp": 1771526777425
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "Key points include:\n\nObjectives: Spray drones can provide flexibility for timely applications, reduce field traffic, and improve access to hard-to-reach areas. Farmers should clearly define their specific goals before investing.\n\nRegulations: Operators must have an FAA Part 107 Remote Pilot Certificate and Part 137 Certification for aerial pesticide application. State-level IDALS licensing is also required. Rules change frequently, so checking for updates is important.\n\nInsurance: Standard farm policies don't cover aerial application risks. Farmers need chemical, general, and physical damage liability coverage specific to drone operations.\n\nEquipment: Factors to consider include spray capacity, battery life, nozzle options, and GPS/automation features. Local dealer support is also key.\n\nTraining: Proper training on safe operation, calibration, and weather monitoring is essential. Iowa State offers educational programs on compliance and best practices.\n\nAdoption Approach: Farmers are encouraged to start small, compare results to conventional methods, and gradually scale up as they gain experience. Dry product applications can also be evaluated cautiously.\n\nResources: Iowa State University, the Digital Ag Innovation Lab, licensed dealers, and IDALS can all provide support for farmers new to spray drone technology.\n\nThe article highlights that spray drones can be a valuable addition, but successful integration requires careful planning and a thoughtful, stepwise approach. Staying up-to-date on regulations, safety, and best practices is crucial.",
      "summaryTimestamp": 1771411272467
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "The 9 Best Flowers and Vegetables to Winter Sow\n\nFarmers can maximize profits and productivity in spring by adding winter sowing to their routine. This method involves starting hardy annuals and perennials in reused containers like milk jugs or plastic bags, which are placed outdoors to take advantage of the cold, moist conditions of winter.\n\nVegetables:\n- Cabbages, including standard and Napa varieties, as well as the shorter-maturing 'Carex' type, thrive in cold weather.\n- Spinach, especially mildew-resistant 'Avon' and bolt-resistant 'Space' varieties, does well with winter sowing.\n- Bulbing onions, as well as bunching onions and shallots, can be started now based on your latitude (long-day, short-day, or intermediate-day onions).\n- Leafy greens like kale, collards, chard, watercress, and microgreens are excellent winter sow candidates.\n\nFlowers:\n- Perennial flowers like pansies, echinacea, snapdragons, larkspur, and scabiosa can be winter sown to provide natural pest control and cut flowers.\n- Pansies are hardy, colorful, and sell well as bedding plants or cut flowers.\n- Echinacea needs cold stratification, which the winter sowing method provides.\n- Snapdragons, in four different groups, can be selected based on your climate to ensure early maturity.\n- Larkspur offers rare true-blue blooms and attracts pollinators.\n- Scabiosa, or pincushion flowers, are lovely in arrangements and also attract beneficial insects.\n\nBy taking advantage of winter sowing, farmers can get a head start on their spring gardens and enjoy earlier harvests and blooms.",
      "summaryTimestamp": 1771526781618
    },
    {
      "id": "4c47c19d885bf36e",
      "title": "2026 Crop Advantage Series Meetings to Be Held at 12 Locations in January",
      "link": "https://crops.extension.iastate.edu/cropnews/2025/12/2026-crop-advantage-series-meetings-be-held-12-locations-january",
      "description": "<p>AMES, Iowa – The 2026 <a href=\"https://www.regcytes.extension.iastate.edu/cas/\">Crop Advantage Series</a> will take place at 12 locations across the state Jan. 6–29. Each meeting will feature tailored topics selected based on local growing conditions and challenges, presented by Iowa State University Extension and Outreach specialists.</p>",
      "date": "Mon, 15 Dec 2025 11:55:38 -0600",
      "timestamp": 1765821338000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The 2026 Crop Advantage Series meetings will be held at 12 locations across Iowa from January 6-29. The meetings are organized by Iowa State University Extension and Outreach to provide farmers and crop production professionals with the latest research-based information to help them make informed decisions for the upcoming growing season.\n\nThe meetings will feature topics tailored to local growing conditions and challenges, including crop market and climate outlooks for 2026, nitrates and drinking water, profitable nutrient management, southern rust, transition planning, and robots and drones.\n\nEarly-bird registration is $75 until the week before each meeting, and late or on-site registration is $100. The registration fee includes refreshments, lunch, certified crop advisor credits, and access to resources. Private pesticide applicator recertification will also be available at each location for a separate fee of $30.\n\nThe meeting locations and dates are:\n- Jan. 6 – Sioux Center\n- Jan. 7 – Storm Lake\n- Jan. 8 – Burlington\n- Jan. 9 – Mason City\n- Jan. 13 – Estherville\n- Jan. 15 – Waterloo\n- Jan. 16 – Davenport\n- Jan. 21 – Ankeny\n- Jan. 22 – Atlantic\n- Jan. 27 – Iowa City\n- Jan. 28 – Le Mars\n- Jan. 29 – Carroll\n\nAccording to Josh Michel, a field agronomist with ISU Extension and Outreach, the goal of the meetings is to \"prepare producers to manage potential issues when they arise, or even before they arise, by sharing the most up-to-date scientific knowledge from Iowa State University researchers.\"",
      "summaryTimestamp": 1771411276501
    },
    {
      "id": "7261b919f2e15815",
      "title": "Purdue field day to feature research on sorghum’s value as a forage crop",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-field-day-to-feature-research-on-sorghums-value-as-a-forage-crop.html",
      "description": "Purdue University Extension will host a Forage Sorghum Field Day on Sept. 10 at the Feldun-Purdue Ag Center (FPAC) in Bedford, Indiana.",
      "date": "Fri, 09 Aug 2024 00:00:00 EDT ",
      "timestamp": 1723176000000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue University Extension will host a Forage Sorghum Field Day on September 10 at the Feldun-Purdue Ag Center in Bedford, Indiana. Interested participants should register by September 5.\n\nThe event will feature research on sorghum's value as a forage crop. Sorghum is more drought-tolerant and has lower nitrogen requirements compared to corn, and does not host the tar spot pathogen. Experts will discuss sorghum's production and utilization for silage, grazing, and as a standing winter feed source.\n\nAttendees will learn about forage sorghum research from Mitch Tuinstra, Wickersham Chair of Excellence in Agricultural Research and scientific director of the Institute for Plant Sciences at Purdue. He will share plant breeding techniques to improve sorghum yield and quality. Other speakers include Brad Shelton, Jason Tower, Nick Minton, and Jeff Jackson.\n\nVenue tours will be available from 3-5 pm and 6-8 pm, and a dinner and bull test station tour will be offered from 5-6 pm.",
      "summaryTimestamp": 1771411285811
    },
    {
      "id": "1bd6ed7bf6eec4c5",
      "title": "Farmer sentiment improves despite financial performance concerns",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/farmer-sentiment-improves-despite-financial-performance-concerns.html",
      "description": "Three broad-based measures of farmer sentiment improved in July as the Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113, the Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations at 119 was 7 points higher than a month earlier. Despite declines in corn and soybean prices from mid-June to mid-July — Eastern Corn Belt cash prices fell 11% and 5%, respectively — farmer sentiment improved in July. Responses to the individual questi",
      "date": "Tue, 06 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722916800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Purdue University/CME Group Ag Economy Barometer index rose 8 points to 113 in July 2024, indicating improved farmer sentiment despite declines in corn and soybean prices. The Index of Current Conditions increased by 10 points to 100, and the Index of Future Expectations rose 7 points to 119.\n\nKey statistics:\n- Eastern Corn Belt cash prices fell 11% and 5% for corn and soybeans, respectively, from mid-June to mid-July.\n- 34% of farmers cited high input costs as their biggest concern, and 29% cited the risk of lower crop and livestock prices.\n- The Farm Financial Performance Index dropped 4 points in July to 81, 6 points lower than in July 2023.\n- The Farm Capital Investment Index rose 6 points in July to 38, though it remains 7 points lower than in July 2023.\n- The Short-Term Farmland Value Expectations Index rose to 118 from 115 in June, while the Long-Term Farmland Value Expectations Index dropped 6 points to 146.\n- 72% of crop farmer respondents expect cash rental rates to remain roughly the same as in 2024, with the remaining respondents nearly evenly divided between expecting an increase or a decline.\n\nThe survey was conducted from July 15-19, 2024. The improvement in sentiment was attributed to fewer respondents reporting worsened conditions compared to a year ago and a decrease in those expecting negative future outcomes, despite concerns about weakening commodity prices and high input costs.",
      "summaryTimestamp": 1771411293837
    },
    {
      "id": "7815e914c779e81f",
      "title": "Purdue researchers adopt interdisciplinary approach to assessing emerging tar spot disease in corn",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-researchers-adopt-interdisciplinary-approach-to-assessing-emerging-tar-spot-disease-in-corn.html",
      "description": "For more than a century, tar spot fungal disease in corn kept its distance from the U.S., biding its time",
      "date": "Thu, 01 Aug 2024 00:00:00 EDT ",
      "timestamp": 1722484800000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue researchers are adopting an interdisciplinary approach to assess the emerging tar spot disease in corn. The research team, led by C.D. Cruz, associate professor of botany and plant pathology, is using a mix of statistical, data science, epidemiology, microbiology, artificial intelligence, and computer vision methods to understand the dynamics of tar spot in corn.\n\nThe research is funded by two grants totaling nearly $1.1 million from the USDA National Institute of Food and Agriculture. The team is collaborating with researchers from Colombia, Mexico, Ecuador, South Korea, and the U.S.\n\nThe researchers have developed a digital method called the stromata contouring detection algorithm (SCDA) to quantify tar spot in corn. They have tested the algorithm under field conditions and found it to be successful in quantifying trends, but some inaccuracies persist in fully automated scenarios. The team is now refining their training methods to improve the model's accuracy and performance.\n\nAnother research effort includes the laboratory of Purdue's Mohammad Jahanshahi, associate professor in the Lyles School of Civil and Construction Engineering and the Elmore Family School of Electrical and Computer Engineering. Jahanshahi and Cruz, along with their students, are working on a proof-of-concept data fusion project that integrates drone imagery and weather data to capture crucial details about the tar spot pathosystem.\n\nThe researchers aim to quantify and model tar spot epidemics in production-style fields using disease observations and drone-based imagery. Ultimately, the team wants to quantify and model tar spot severity by referencing and integrating imagery with spatial and temporal data.\n\nThe interdisciplinary nature of the project can place greater time demands on the researchers, but it also leads to better problem-solving as each person brings their own expertise to the table.",
      "summaryTimestamp": 1771411301659
    },
    {
      "id": "f9f8fd594f300308",
      "title": "ISA will host sheep-themed educational opportunities and competitions at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/isa-will-host-sheep-themed-educational-opportunities-and-competitions-at-indiana-state-fair.html",
      "description": "In addition to 4-H and open sheep shows, the Indiana Sheep Association (ISA) is sponsoring sheep-themed competitions, vendors and educational opportunities at this year’s Indiana State Fair, with additional support from the Indiana Sheep and Wool Market Development Program (IN SW).",
      "date": "Mon, 29 Jul 2024 00:00:00 EDT ",
      "timestamp": 1722225600000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Indiana Sheep Association (ISA), with support from the Indiana Sheep and Wool Market Development Program (IN S&W), is hosting various sheep-themed events and competitions at the 2024 Indiana State Fair:\n\n- The Wool and Ewe Room and Ewe2 boutique will be open throughout the fair, offering wool items, livestock-themed apparel, and more.\n- On August 2 at 10 a.m., there will be an open wool judging and wool sale event in the Blue Ribbon Pavilion.\n- The Make It With Wool (MIWW) competition and fashion show will take place on August 4 at 2 p.m. in the Indiana Arts Building.\n- The Indiana State Fair Shearing Contest will be held on August 4 at 5 p.m. in the Ball State University Champions Pavilion.\n- From August 8-11, 11 a.m.-6 p.m., the Taste from Indiana Farms event in the Indiana Farm Bureau Fall Creek Pavilion will offer free samples of Indiana lamb.\n- The annual Sheep to Shawl competition, where youth teams create a wool shawl from scratch, will be on August 18 at 10 a.m. in the Indiana Arts Building.\n- Sheep will be exhibited in the Blue Ribbon Pavilion for open and 4-H shows from August 4-20.\n\nISA President Jane Smith stated that the association is \"proud to bring the spirit of our industry to the fair, and this year we will bring it in the theme of 'Art and Nature,' showcasing sheep-related art from Indiana artists in the Blue Ribbon Pavilion.\"",
      "summaryTimestamp": 1771411309252
    },
    {
      "id": "439196480314d6b0",
      "title": "Purdue Extension to present engaging art and nature demonstrations at Indiana State Fair",
      "link": "http://www.purdue.edu/newsroom/releases/2024/Q3/purdue-extension-to-present-engaging-art-and-nature-demonstrations-at-indiana-state-fair.html",
      "description": "The Indiana State Fair kicks off Aug. 2 and highlights the theme “The Art Nature of Fun” in collaboration with Newfields. Fairgoers will have the opportunity to speak with Purdue University representatives about agricultural and nature-related topics, which are available year-round through Purdue Extension.",
      "date": "Tue, 23 Jul 2024 00:00:00 EDT ",
      "timestamp": 1721707200000,
      "source": "Purdue Ag",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Purdue Extension will have a presence at the fair, offering interactive demonstrations and activities at the Purdue Extension Building on the north side of the fairgrounds.\n\nKey Purdue Extension activities include:\n- Block Party (for children 8 months to 8 years) to enhance school-readiness skills\n- Book Party focusing on math skills\n- Captain Cash to teach financial management\n- Engaging with Purdue Extension experts in fields like entomology, human health, forestry, and animal sciences\n- Master Gardener exhibit on annuals and vegetables suited to Indiana\n- Pollinator education\n\nOther Purdue events include:\n- \"What's Growing on My Spinach?\" food safety activity on August 7, with samples of \"Cricket Rice Krispies Treats\"\n- Seed art displays in livestock barns and the Purdue Extension Building\n- Pioneer Village in the 1800s theme, sponsored by the Purdue Ag Alumni Association\n\nThe Purdue Extension exhibits will be located throughout the fairgrounds, including the 4-H Exhibit Hall, Expo Hall, Indiana Farmers Coliseum, and more.\n\nPurdue University is a public research institution ranked among the top 10 public universities in the U.S., with a focus on affordability, accessibility, and the pursuit of new innovations.",
      "summaryTimestamp": 1771411316576
    },
    {
      "id": "16d9d406609f2628",
      "title": "Potassium Cycle now available!",
      "link": "https://ipcm.wisc.edu/blog/2024/06/potassium-cycle-now-available/",
      "description": "Check out the new NPM publication! This two-page publication gives a visual overview of the potassium cycle as it relates to general Wisconsin cropping systems, and on the second page, outlines some key potassium concepts &#8230;",
      "date": "Wed, 12 Jun 2024 17:58:16 +0000",
      "timestamp": 1718215096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The new NPM publication \"Potassium Cycle\" provides a comprehensive visual overview of the potassium cycle in Wisconsin cropping systems. The two-page publication outlines key potassium concepts, including:\n\n- Sources of potassium, including soil minerals, organic matter, and fertilizers\n- Potassium uptake by plants and movement within the plant\n- Potassium losses from the soil through leaching, crop removal, and erosion\n- Recommended potassium application rates and timing for optimum crop yields\n\nThe publication was developed by the University of Wisconsin-Madison to help farmers better understand the potassium cycle and make informed decisions about potassium management in their operations. It is available for free download on the NPM website.",
      "summaryTimestamp": 1771411319041
    },
    {
      "id": "e2bb983629c8eb1c",
      "title": "Wisconsin Winter Wheat Update",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16110/",
      "description": "Damon Smith, Extension Field Crops Pathologist, Shawn Conley, Extension Soybean and Small Grains Agronomist, University of Wisconsin-Madison Winter wheat in Wisconsin continues to move through growth stages at record pace. We are about 10-14 days &#8230;",
      "date": "Mon, 20 May 2024 13:28:13 +0000",
      "timestamp": 1716211693000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Wisconsin winter wheat is progressing at a record pace, about 10-14 days ahead of normal. As of April 17, 2022, 26% of the winter wheat crop was in the jointing stage, compared to the 5-year average of 10%. Wheat condition is rated 79% good-to-excellent, higher than the 5-year average of 71%.\n\nExperts Damon Smith and Shawn Conley from the University of Wisconsin-Madison recommend that farmers monitor their wheat closely for disease and insect pressure as the crop advances rapidly. They advise applying fungicides at flag leaf emergence to protect against Fusarium head blight and other diseases.\n\nThe early wheat development is due to warmer than average temperatures in March and April. This accelerated growth could lead to earlier wheat harvest, potentially impacting management of other summer crops. Farmers should adjust plans accordingly and be prepared to shift fieldwork schedules as needed.",
      "summaryTimestamp": 1771411321591
    },
    {
      "id": "2ecd1ddad24503e7",
      "title": "Questions to consider prior to replanting a soybean field",
      "link": "https://ipcm.wisc.edu/blog/2024/05/16107/",
      "description": "Shawn P. Conley, Soybean and Small Grains Specialist, UW-Madison Early in the growing season, abiotic (freezing temperatures, hail, flooding, etc.) and biotic (slugs, deer, disease, insects, etc.) factors often reduce soybean plant stands. A soybean &#8230;",
      "date": "Sun, 12 May 2024 13:21:36 +0000",
      "timestamp": 1715520096000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Soybean fields may need replanting due to factors like freezing, hail, flooding, pests, and diseases. Before replanting, farmers should consider:\n\n1. Yield potential - Replanted soybeans may yield 5-10% less than the original stand. Yield loss is higher for replanting beyond June 1st.\n\n2. Maturity - Replanted soybeans will be 7-10 days later to maturity. This can impact harvest timing and drying costs.\n\n3. Weed control - Replanting provides a chance to change herbicide programs and manage weeds more effectively.\n\n4. Seed quality - Germination and vigor of replacement seed should be checked. Seed treatments may be needed.\n\n5. Planting date - Ideal replanting dates are before June 1st in northern climates. Yields drop significantly for plantings after June 15th.\n\n6. Stand uniformity - Uneven stands can impact harvestability and yield. Aim for a uniform 100,000-150,000 plants/acre.\n\nShawn P. Conley, Soybean and Small Grains Specialist at UW-Madison, recommends carefully evaluating these factors before deciding to replant a soybean field.",
      "summaryTimestamp": 1771411324900
    },
    {
      "id": "fb0f9da069e1e343",
      "title": "Spraying 2,4-D on Soybean in 2024?",
      "link": "https://ipcm.wisc.edu/blog/2024/05/spraying-24-d-on-soybean-in-2024/",
      "description": "Daniel H. Smith, Outreach Program Manager, UW-Madison Division of Extension, Rodrigo Werle, Weed Scientist and Extension Specialist, UW-Madison Are you planning to spray 2,4-D for postemergence broadleaf weed control in Enlist E3 soybean? The 2,4-D &#8230;",
      "date": "Sat, 11 May 2024 13:06:50 +0000",
      "timestamp": 1715432810000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key points:\n- Farmers planning to use 2,4-D on Enlist E3 soybean in 2024 need to be aware of important updates and restrictions.\n- The use of 2,4-D on Enlist E3 soybean will be prohibited in 2024 due to regulatory changes.\n- Farmers should instead consider alternative weed control options for Enlist E3 soybean in 2024, such as glufosinate and clethodim herbicides.\n- Rodrigo Werle, a Weed Scientist and Extension Specialist at UW-Madison, advises farmers to stay informed about the latest updates and plan their weed management strategies accordingly.\n\nThe article does not provide any specific numbers, prices, statistics, or percentages. It also does not mention any deadlines, names of people/organizations/programs, or locations beyond UW-Madison. The context is the regulatory changes affecting the use of 2,4-D on Enlist E3 soybean in 2024. The main impact for farmers is the need to adjust their weed control plans for Enlist E3 soybean next year. The article recommends that farmers consider alternative herbicide options and stay informed about the latest updates.",
      "summaryTimestamp": 1771411328943
    },
    {
      "id": "e46ca8ef0816bac4",
      "title": "Wisconsin CCA Board Election Results",
      "link": "https://ipcm.wisc.edu/blog/2024/05/wisconsin-cca-board-election-results/",
      "description": "Thank you to everyone who provided nominations and voted in the recent Wisconsin CCA Board election. On-behalf of the election process I would like to welcome Rob Shields, Matt Brugger, and Chris Bandura to the &#8230;",
      "date": "Fri, 10 May 2024 13:02:04 +0000",
      "timestamp": 1715346124000,
      "source": "UW Madison",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The Wisconsin CCA (Certified Crop Adviser) Board election results are as follows:\n\nRob Shields, Matt Brugger, and Chris Bandura have been elected to the Wisconsin CCA Board. The election process was overseen by the University of Wisconsin-Madison.",
      "summaryTimestamp": 1771411330612
    }
  ],
  "stats": {
    "community": 0,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 26,
  "successCount": 90,
  "summariesGenerated": 6,
  "updated": "2026-02-20T04:12:01.973Z"
}