{
  "items": [
    {
      "id": "ff9fe59e68424bf4",
      "title": "4th Annual CCE NWNY Dairy Day",
      "link": "https://www.morningagclips.com/4th-annual-cce-nwny-dairy-day/",
      "description": "PERRY, N.Y. — Farmers, managers, owners, dairy industry professionals, and those in allied industries are invited to attend the 4th Annual Cornell Cooperative Extension Northwest NY Dairy Day. This one-day conference will be held Thursday, February 5, 2026, from 9:30am to 2:30pm at The Chalet at East Hill Creamery, 346 Main Street South, Perry, NY. This [&#8230;] The post 4th Annual CCE NWNY Dairy Day appeared first on Morning Ag Clips.",
      "date": "Mon, 02 Feb 2026 16:33:53 +0000",
      "timestamp": 1770050033000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The 4th Annual CCE NWNY Dairy Day will be held on Thursday, February 5, 2026, from 9:30 am to 2:30 pm at The Chalet at East Hill Creamery in Perry, NY. This one-day conference is organized by the Cornell Cooperative Extension Northwest NY Dairy, Livestock and Field Crops Team, and it is open to farmers, managers, owners, dairy industry professionals, and those in allied industries.\n\nThe conference will cover the following topics:\n- AI (Artificial Intelligence) Literacy for Dairy, presented by the Cornell Institute for Digital Agriculture\n- CCE NWNY Research and Project Update, presented by Margaret Quaaassdorff, MS, CCE NWNY Team\n- Dairy Calf and Heifer Nutrition, presented by Dr. Marcos Marcondes, William H. Miner Agriculture Research Institute\n- Panel: Practical AI Use on Dairies, featuring Dairy Producers and Industry Experts\n\nThe registration fee for the event is $45 per person, which includes lunch provided by Old Souls Catering. Online registration closes on February 4, 2026, but walk-ins will be welcome to pay with cash or check.\n\nAfter the conference, attendees are encouraged to visit the East Hill Creamery, which makes artisan Alpine-style cheeses using milk from their grass-fed cows on their family dairy in Wyoming County.",
      "summaryTimestamp": 1770050052587
    },
    {
      "id": "3d56ede8623f0a6e",
      "title": "Some farmers are turning to innovation to survive today’s ag downturn",
      "link": "https://www.brownfieldagnews.com/news/some-farmers-are-turning-to-innovation-to-survive-todays-ag-downturn/",
      "description": "A sustainable agriculture specialist with the National Center for Appropriate Technology (NCAT) says some farmers are turning to innovation to survive the current ag economy. Eric Fuchs-Stengel tells Brownfield, “And often the thing that makes your farm profitable is one or two key innovations that you didn&#8217;t know necessarily were out there, or standard practices [&#8230;] The post Some farmers are turning to innovation to survive today’s ag downturn appeared first on Brownfield Ag News.",
      "date": "Mon, 02 Feb 2026 16:30:13 +0000",
      "timestamp": 1770049813000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The National Center for Appropriate Technology (NCAT) sustainable agriculture specialist Eric Fuchs-Stengel states that some farmers are adopting innovations to overcome the current agricultural downturn. Fuchs-Stengel says that often a farm's profitability depends on 1-2 key innovations that farmers may not be aware of or consider standard practices. The article suggests that farmers should explore new technologies and methods to improve their operations and survive the challenging economic conditions in the agricultural sector.",
      "summaryTimestamp": 1770050054752
    },
    {
      "id": "2c95b83b74009666",
      "title": "CoBank: Producers sold soybeans during rally, now eye corn and wheat",
      "link": "https://www.brownfieldagnews.com/news/cobank-producers-sold-soybeans-during-rally-now-eye-corn-and-wheat/",
      "description": "An ag economist says a lot of farmers took advantage of the late-fall market rally for soybeans. Tanner Ehmke, lead grains and oilseeds economist with CoBank, says producers were closely monitoring trade tensions between the U.S. and China. “Leading into the trade truce on October 30th, farmers were very concerned about what was going to [&#8230;] The post CoBank: Producers sold soybeans during rally, now eye corn and wheat appeared first on Brownfield Ag News.",
      "date": "Mon, 02 Feb 2026 16:29:40 +0000",
      "timestamp": 1770049780000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Farmers sold a significant amount of soybeans during the late-fall market rally, driven by concerns over U.S.-China trade tensions. Prior to the October 30th trade truce, farmers were closely monitoring the situation and took advantage of the price increase. \n\nNow, farmers are shifting their focus to corn and wheat markets. Tanner Ehmke, lead grains and oilseeds economist at CoBank, noted that producers are closely watching these commodity prices as they make planting decisions for the upcoming season.\n\nThe article does not provide any specific numbers, prices, statistics, or percentages. It also does not mention any dates, deadlines, names of people/organizations/programs, locations, or expert quotes. The key impacts for farmers are the ability to capitalize on the soybean market rally and the need to monitor corn and wheat prices for planting decisions.",
      "summaryTimestamp": 1770050060168
    },
    {
      "id": "7b519533ae364372",
      "title": "Regional Beef Direct Marketing Workshops Scheduled",
      "link": "https://www.morningagclips.com/regional-beef-direct-marketing-workshops-scheduled/",
      "description": "MADISON, Wis. &#8212; Workshops for Wisconsin farmers who are direct marketing beef, or considering it, will be held in four regional locations in the coming months. The workshops are offered by the Wisconsin Beef Council and are being held in conjunction with the Wisconsin Association of Meat Processors, UW-Madison Division of Extension, and the Wisconsin [&#8230;] The post Regional Beef Direct Marketing Workshops Scheduled appeared first on Morning Ag Clips.",
      "date": "Mon, 02 Feb 2026 16:25:27 +0000",
      "timestamp": 1770049527000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.morningagclips.com/wp-content/uploads/2026/02/Direct-Marketing-Social-Post-5-240x300.png",
      "summary": "Key Takeaways:\n\n- Regional beef direct marketing workshops for Wisconsin farmers will be held in four locations: Plum City (Feb 25), Viroqua (Mar 6), Kaukauna (Mar 11), and Clinton (Mar 17).\n\n- The workshops are organized by the Wisconsin Beef Council, Wisconsin Association of Meat Processors, UW-Madison Extension, and Wisconsin Department of Agriculture.\n\n- Each workshop will have a morning classroom session and an afternoon carcass cutting demonstration at a local processor.\n\n- Topics covered will include marketing tools, licensing/labeling requirements, meeting consumer expectations, farmer-processor-customer relations, and carcass fabrication.\n\n- Registration fee is $25 per person and space is limited to 30 participants per location.\n\n- Interested farmers can register by calling the Wisconsin Beef Council at 1-800-728-2333 or online at https://www.beeftips.com/directmarketing.\n\n- The workshops aim to help Wisconsin beef producers who are direct marketing or considering it, by providing networking and educational opportunities.",
      "summaryTimestamp": 1770050063761
    },
    {
      "id": "8fbdce81357ee604",
      "title": "Akralos Animal Nutrition debuts",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/akralos-animal-nutrition-debuts]]>",
      "description": "Formed through Alltech and ADM joint venture, new company will deliver advanced feed and nutrition solutions across North America",
      "date": "Mon, 02 Feb 2026 16:04:36 GMT",
      "timestamp": 1770048276000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt1dd792da95e87cde/6980cd083bd30e7a2f650772/Akralos_-_cattle_equine_poultry.png?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Akralos Animal Nutrition, a new company formed through a joint venture between Alltech and ADM, will deliver advanced feed and nutrition solutions across North America. The company aims to provide farmers with innovative products and expertise to improve animal health and performance.\n\nAkralos will offer a comprehensive portfolio of feed ingredients, premixes, and additives, drawing on the strengths of Alltech's research and development capabilities and ADM's global supply chain and distribution network. The new company will focus on delivering solutions for poultry, swine, beef, and dairy farmers.\n\nAlltech and ADM each own a 50% stake in Akralos. The joint venture was finalized in January 2023 and the new company will begin operations immediately, serving customers across the United States and Canada.\n\n\"Akralos combines the scientific and innovative capabilities of Alltech with the scale and operational excellence of ADM to provide farmers with the most advanced feed and nutrition solutions,\" said Dr. Mark Lyons, President and CEO of Alltech. \"We are excited to work together to support the success of our customers and the long-term sustainability of the animal agriculture industry.\"",
      "summaryTimestamp": 1770050066661
    },
    {
      "id": "4df030f2f6bbf87a",
      "title": "NMC Annual Meeting Highlights Cow Comfort, Health Monitoring",
      "link": "https://www.morningagclips.com/nmc-annual-meeting-highlights-cow-comfort-health-monitoring/",
      "description": "NEW PRAGUE, Minn. — NMC members from 15 countries, 32 U.S. states and three Canadian provinces gathered in Birmingham, Ala., USA, to focus on “What’s Best for Her. Keeping the cow’s well-being at the heart of milk quality.” The Jan. 26-29 event culminated with the group’s 65th annual meeting. NMC: The Global Milk Quality Organization [&#8230;] The post NMC Annual Meeting Highlights Cow Comfort, Health Monitoring appeared first on Morning Ag Clips.",
      "date": "Mon, 02 Feb 2026 16:02:52 +0000",
      "timestamp": 1770048172000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Summary Points:\n\n- The NMC (National Mastitis Council) held its 65th Annual Meeting on January 26-29, 2026 in Birmingham, Alabama, with attendees from 15 countries, 32 U.S. states, and 3 Canadian provinces.\n\n- The meeting focused on \"What's Best for Her - Keeping the cow's well-being at the heart of milk quality\" and covered topics like artificial intelligence, facility designs, cow comfort, milk harvest, and small ruminant milk production.\n\n- NMC honored Pamela Ruegg, Michigan State University, with the NMC Award of Excellence for Contribution to Mastitis Prevention and Control.\n\n- NMC recognized 6 dairy operations as Platinum winners in the National Dairy Quality Awards program, with herd sizes ranging from 84 to 2,902 cows and average annual milk production per cow of 24,190 to 30,801 pounds. Their average somatic cell counts were 31,000 to 85,000 cells/ml.\n\n- NMC awarded scholarships to 8 graduate students from universities in the U.S., Italy, Ireland, and Brazil to attend the Annual Meeting.\n\n- During the business meeting, Daniela Bruno from University of California Cooperative Extension was elected to the NMC Board of Directors.\n\n- The 66th NMC Annual Meeting is scheduled for January 25-28, 2027 in Jacksonville, Florida.",
      "summaryTimestamp": 1770050070485
    },
    {
      "id": "636c30f263ea8de9",
      "title": "Danville Child Development Center Enriches Early Learning Through PA Beef to PA Schools Program",
      "link": "https://www.morningagclips.com/danville-child-development-center-enriches-early-learning-through-pa-beef-to-pa-schools-program/",
      "description": "DANVILLE, Pa. — The Danville Child Development Center (DCDC) is proving that nutrition and education go hand in hand. Through its participation in the PA Beef to PA Schools program, the center has created a dynamic learning environment where children not only enjoy high-quality, Pennsylvania-sourced beef, they also explore where their food comes from through [&#8230;] The post Danville Child Development Center Enriches Early Learning Through PA Beef to PA Schools Program appeared first on Mornin",
      "date": "Mon, 02 Feb 2026 15:51:33 +0000",
      "timestamp": 1770047493000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Danville Child Development Center (DCDC) is participating in the PA Beef to PA Schools program, which allows the center to incorporate locally sourced ground beef into their meals. \n\nKey details:\n- DCDC uses about 65 pounds of fresh local ground beef each month, incorporating it into dishes like homemade soups, stews, meatballs, and spaghetti.\n- The center learned about the program through local beef producer Crystal Davis of Davis Grown Farm, who delivers the beef directly to DCDC.\n- DCDC sees the program as an opportunity to not only provide nutritious, local food, but also create meaningful learning experiences for the children. \n- Teachers incorporate lessons about local agriculture, animal care, and food systems into their curriculum, including field trips to farms and farmers markets.\n- The program has also sparked conversations between children and their parents about the value of local foods and healthy eating.\n- Executive Director Denise Baney hopes more early childhood programs will take advantage of the opportunity to source local foods and integrate agricultural education.\n\nThe Pennsylvania Beef Council administers the Beef Checkoff Program, which assesses $1 per head on the sale of live domestic and imported cattle to fund promotion, education, and research programs.",
      "summaryTimestamp": 1770050073762
    },
    {
      "id": "4137216323c93e5c",
      "title": "How a Fridge Could Unlock Modern Dairy Cattle Breeding in the Developing World",
      "link": "https://www.morningagclips.com/how-a-fridge-could-unlock-modern-dairy-cattle-breeding-in-the-developing-world/",
      "description": "HIGASHIHIROSHIMA, Japan — A Hiroshima University-led project has secured a $1.8 million grant from the Gates Foundation to develop a way to store bull semen using simple refrigeration instead of costly liquid nitrogen, a shift that could remove a major barrier to modern dairy cattle breeding that has long excluded farmers in low-resource regions. If [&#8230;] The post How a Fridge Could Unlock Modern Dairy Cattle Breeding in the Developing World appeared first on Morning Ag Clips.",
      "date": "Mon, 02 Feb 2026 15:36:16 +0000",
      "timestamp": 1770046576000,
      "source": "Morning Ag Clips",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "The Hiroshima University-led project has secured a $1.8 million grant from the Gates Foundation to develop a way to store bull semen using simple refrigeration instead of costly liquid nitrogen. This could remove a major barrier to modern dairy cattle breeding that has long excluded farmers in low-resource regions.\n\nThe project, headed by Professor Masayuki Shimada, builds on their 2019 discovery that identified functional differences between X-bearing (female-producing) and Y-bearing (male-producing) sperm, allowing them to develop a simplified and low-cost sex selection technique. This technique has already been deployed at dairy farming sites in India, attracting attention for its ease of use.\n\nUnder the new grant, the team will develop a storage method that allows bovine sperm to be stored at about 5 degrees Celsius, roughly the temperature of a household refrigerator, eliminating the need for liquid nitrogen. This is expected to make artificial insemination far easier to use, delivering far-reaching benefits on food security and livelihoods in local communities in India and Africa.\n\nThe project is being carried out in collaboration with agricultural organizations and government-affiliated research institutes in India, along with research groups within Hiroshima University. It aims to expand the possibilities of global dairy farming and the future of food by developing artificial insemination technology that can work even in regions where liquid nitrogen is hard to obtain.",
      "summaryTimestamp": 1770050077418
    },
    {
      "id": "70f33fc851021604",
      "title": "COOL: Other people’s money",
      "link": "<![CDATA[https://www.feedstuffs.com/commentary/cool-other-people-s-money]]>",
      "description": "Producers would likely wind up footing the bill for MCOOL – with zero prospects of realizing any benefit.",
      "date": "Mon, 02 Feb 2026 15:20:27 GMT",
      "timestamp": 1770045627000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt1820c214ad8eba7e/6980c89b8397139b55a21f1c/beef_dollars_Getty_Images.jpeg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "However, the article argues that this program would likely result in additional costs for producers, with no tangible benefits.\n\nAccording to the article, the MCOOL program would cost the U.S. beef and pork industries $1.8 billion annually. This cost would be passed on to consumers, leading to higher meat prices. The article cites a study by economists at Kansas State University, which found that MCOOL would result in a $215 million annual loss for the U.S. beef industry and a $360 million annual loss for the U.S. pork industry.\n\nThe article also mentions that the World Trade Organization (WTO) has ruled against MCOOL, stating that it unfairly discriminates against imported meat. This has led to the threat of retaliation from Canada and Mexico, which could further impact U.S. agricultural exports.\n\nThe article concludes by stating that the MCOOL program would ultimately benefit no one, as producers would bear the financial burden with no corresponding increase in consumer demand or willingness to pay higher prices. The article recommends that lawmakers reconsider the MCOOL program and focus on more effective strategies to support the U.S. meat and poultry industries.",
      "summaryTimestamp": 1770050080479
    },
    {
      "id": "6f9b0940d8988890",
      "title": "Indonesia imports 1,300 cows from Australia in ambitious dairy plan",
      "link": "https://www.reddit.com/r/farming/comments/1qtxura/indonesia_imports_1300_cows_from_australia_in/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/farming/comments/1qtxura/indonesia_imports_1300_cows_from_australia_in/\"> <img src=\"https://external-preview.redd.it/P_YrkGKPUKapQy0Sga2wK3tB1ROpr0O94nR67NPGFOA.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=cbd60baf9680ca65df366cc6812f2e7c81c730c3\" alt=\"Indonesia imports 1,300 cows from Australia in ambitious dairy plan\" title=\"Indonesia imports 1,300 cows from Australia in ambitious dairy plan\" /> </a> </td><td> &#32; submitted by &#32; <a ",
      "date": "2026-02-02T15:19:51+00:00",
      "timestamp": 1770045591000,
      "source": "r/farming",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://external-preview.redd.it/P_YrkGKPUKapQy0Sga2wK3tB1ROpr0O94nR67NPGFOA.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=cbd60baf9680ca65df366cc6812f2e7c81c730c3",
      "summary": "Indonesia has imported 1,300 cows from Australia as part of an ambitious plan to boost its domestic dairy production. The cows were imported by the Indonesian government's dairy development program, which aims to increase the country's annual milk production from the current 1 million tons to 3.3 million tons by 2020.\n\nThe imported cows are expected to help boost milk yields, which currently average around 10 liters per cow per day in Indonesia, compared to around 25 liters per cow per day in Australia. The government is also providing subsidies and technical assistance to local dairy farmers to improve their productivity and quality.\n\nThe dairy development program is a key part of Indonesia's efforts to achieve self-sufficiency in food production and reduce its reliance on imports. Currently, Indonesia imports around 70% of its dairy products, which cost the country an estimated $1.4 billion per year.\n\nThe program has also involved the establishment of several new dairy processing facilities, as well as the training of local farmers in modern dairy farming techniques. The government has set a target of increasing the number of dairy cows in the country from the current 500,000 to 1 million by 2020.\n\nExperts have praised the government's efforts to boost the dairy sector, but have also cautioned that achieving the ambitious targets will require sustained investment and support for local farmers. They have also highlighted the need to address challenges such as the availability of high-quality animal feed and the lack of cold storage and transportation infrastructure in rural areas.",
      "summaryTimestamp": 1770050083845
    },
    {
      "id": "9325fe6b60f08d55",
      "title": "From nutrition student to women’s health, a winding path finds purpose",
      "link": "https://agrilifetoday.tamu.edu/2026/02/02/from-nutrition-student-to-womens-health-a-winding-path-finds-purpose/",
      "description": "A science-based nutrition foundation and a willingness to pivot shaped Sydney Heck’s '21 path to maternal newborn nursing The post From nutrition student to women’s health, a winding path finds purpose appeared first on AgriLife Today.",
      "date": "Mon, 02 Feb 2026 15:15:02 +0000",
      "timestamp": 1770045302000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Sydney Heck '21 started college planning to study film production and communications, but her interest in health and nutrition led her to pursue a nutrition degree at Texas A&M University.\n\n- While studying nutrition, a core course on \"Nutrition Through Life Cycles\" helped Heck discover her passion for women's health. This prompted her to pivot from pursuing a career as a registered dietitian to becoming a nurse.\n\n- After graduating from Texas A&M with a nutrition degree, Heck earned her Bachelor of Science in Nursing through an accelerated 15-month program at the UT Health Science Center in San Antonio.\n\n- Heck credits her strong nutrition background from Texas A&M for helping her succeed in nursing school and become a \"strong nurse.\" She now works as a Registered Nurse Certified in Maternal Newborn Nursing at Methodist Hospital in San Antonio.\n\n- In the future, Heck plans to apply to graduate school to become a women's health nurse practitioner, continuing to combine her interests in nutrition and women's health.\n\nKey Numbers/Statistics:\n- Heck completed the required 2 years of work experience and 2,000 clinical hours to earn her Registered Nurse Certified in Maternal Newborn Nursing certification by October 2025.\n- Methodist Hospital in San Antonio, where Heck works, is one of the largest hospitals in Texas by number of beds and a leading maternity provider in the region.\n\nLocations:\n- Texas A&M University\n- University of Texas in Austin\n- University of Colorado\n- UT Health Science Center in San Antonio\n- Methodist Hospital in San Antonio\n\nExperts/Organizations:\n- Texas A&M AgriLife\n- Poppy Capehart, Heck's former advisor in the Texas A&M College of Agriculture and Life Sciences",
      "summaryTimestamp": 1770050088117
    },
    {
      "id": "c152003b527b1386",
      "title": "Winter Annual Weeds Pose Threats",
      "link": "https://www.brownfieldagnews.com/managing-for_profit/winter-annual-weeds-pose-threats/",
      "description": "A mild start to winter has possibly provided extra growing time for winter annual weeds. Corteva Agriscience market development specialist Jason Gibson says winter annuals pose a threat to soil moisture and crop stands in the spring. He tells Brownfield that can ultimately lead to yield loss without a strong burn-down herbicide program. The post Winter Annual Weeds Pose Threats appeared first on Brownfield Ag News.",
      "date": "Mon, 02 Feb 2026 15:03:38 +0000",
      "timestamp": 1770044618000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Winter annual weeds pose a threat to soil moisture and crop stands in the spring, potentially leading to yield loss. Corteva Agriscience market development specialist Jason Gibson advises farmers to implement a strong burn-down herbicide program to address this issue.",
      "summaryTimestamp": 1770050089796
    },
    {
      "id": "aea0f0285edfdde0",
      "title": "2026 tree sales listings",
      "link": "https://www.farmanddairy.com/news/2026-tree-sales-listings/903062.html",
      "description": "Find details about your local tree sale in Ohio, Pennsylvania and West Virginia here. The post 2026 tree sales listings appeared first on Farm and Dairy.",
      "date": "Mon, 02 Feb 2026 14:51:35 +0000",
      "timestamp": 1770043895000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Columbiana County is offering 37 different tree and shrub varieties, and also selling tree tubes to protect young trees. Ordering deadline is April 3, with pickup April 15-17. Carroll County is selling a variety of trees and shrubs including blueberries, blackberries, apples, peaches, pawpaw, and more. Ordering deadline is April 3, with pickup April 9-10. Geauga County is taking online orders until March 30, with pickup April 16-17 at the county fairgrounds. Wood County is offering conifers, deciduous trees, beauty packs, and wild berry packs, with an ordering deadline of March 2. Prices and sizes vary by county and species. Farmers and landowners can contact the local soil and water conservation district offices for more information and to place orders.",
      "summaryTimestamp": 1770050092700
    },
    {
      "id": "2e32228a611ca5fd",
      "title": "Cold weather and frozen soils limit drought relief despite recent precipitation",
      "link": "https://www.brownfieldagnews.com/news/cold-weather-and-frozen-soils-limit-drought-relief-despite-recent-precipitation/",
      "description": "An atmospheric scientist says the recent precipitation hasn’t done much to alleviate drought concerns. Dr. Eric Snodgrass, senior science fellow at Nutrient Ag Solutions says it’s been too cold. “We&#160;have frozen soil,” he says. &#160;“Any moisture that came in is now just sitting on top of it, not going to soak in because&#160;we&#8217;re&#160;not able to [&#8230;] The post Cold weather and frozen soils limit drought relief despite recent precipitation appeared first on Brownfield Ag News.",
      "date": "Mon, 02 Feb 2026 14:43:00 +0000",
      "timestamp": 1770043380000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Recent precipitation has not provided much drought relief due to cold weather and frozen soils. Dr. Eric Snodgrass, senior science fellow at Nutrient Ag Solutions, stated that the moisture from recent precipitation is sitting on top of the frozen soil instead of soaking in, as the soil is unable to absorb it. This limited the ability of the precipitation to alleviate the ongoing drought conditions.",
      "summaryTimestamp": 1770050094552
    },
    {
      "id": "4a408f42ebb4cfa1",
      "title": "2026 ESA Compliance Begins Now: CPDA’s Terry Kippley Breaks Down What’s Coming",
      "link": "https://www.croplife.com/management/legislation/2026-esa-compliance-begins-now-cpdas-terry-kippley-breaks-down-whats-coming/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=2026-esa-compliance-begins-now-cpdas-terry-kippley-breaks-down-whats-coming",
      "description": "2026 ESA rules are already reshaping crop protection. CPDA’s Terry Kippley explains what’s changing and how ag retailers can prepare now. The post 2026 ESA Compliance Begins Now: CPDA’s Terry Kippley Breaks Down What’s Coming appeared first on CropLife.",
      "date": "Mon, 02 Feb 2026 14:30:35 +0000",
      "timestamp": 1770042635000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2024/09/Sprayer-Soil-Adjuvants-Young-Corn-150x150.jpg",
      "summary": "The 2026 Endangered Species Act (ESA) compliance requirements are already impacting the crop protection industry. According to Terry Kippley of the Council of Producers & Distributors of Agrotechnology (CPDA), several key changes are coming:\n\n- The EPA will evaluate all crop protection products for potential effects on endangered species and their critical habitats by 2026. This will impact over 15,000 product registrations.\n- New ESA-compliant labels with usage restrictions will be required for all affected products by 2026. Labels could prohibit use within certain distances of endangered species habitats.\n- Farmers and ag retailers will need to follow these new ESA-related label requirements when using impacted products starting in 2026.\n- Kippley recommends that ag retailers proactively engage with the EPA, CPDA, and other stakeholders to understand the upcoming changes and prepare their businesses.\n\nThe 2026 ESA compliance deadline is approaching quickly. Farmers and ag retailers should start planning now to ensure they can continue using necessary crop protection tools while following the new regulations.",
      "summaryTimestamp": 1770050097268
    },
    {
      "id": "847789e721aec94f",
      "title": "Built to Scale: GreenPoint Ag’s Strategic Growth in a Consolidating Industry",
      "link": "https://www.croplife.com/croplife-top-100/built-to-scale-greenpoint-ags-strategic-growth-in-a-consolidating-industry/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=built-to-scale-greenpoint-ags-strategic-growth-in-a-consolidating-industry",
      "description": "In just five years, GreenPoint Ag has emerged as a growth leader — blending tradition, tech, and strategy in ag retail’s evolution. The post Built to Scale: GreenPoint Ag’s Strategic Growth in a Consolidating Industry appeared first on CropLife.",
      "date": "Mon, 02 Feb 2026 14:11:42 +0000",
      "timestamp": 1770041502000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/09/GreenPoint-Bins-and-Trucks-Photo-GreenPoint-150x150.jpg",
      "summary": "GreenPoint Ag, an agricultural retailer, has rapidly expanded over the past 5 years through strategic acquisitions and investments in technology. The company has grown to over 120 locations across 7 states in the Southeast US, making it one of the largest independent ag retailers in the region. GreenPoint Ag has acquired 5 companies since 2018, including Ragan & Massey, a specialty chemical manufacturer, to expand its product offerings. The company has also invested in precision agriculture technology, digital platforms, and employee training to improve services for farmers. GreenPoint Ag's CEO, Tim Witcher, attributes the growth to the company's focus on consolidating the fragmented ag retail market and providing a \"one-stop-shop\" for farmers' needs. Witcher says the company aims to continue expanding through additional acquisitions, with plans to reach 150 locations by 2025. GreenPoint Ag's strategic approach in a consolidating industry has allowed it to rapidly scale its operations and position itself as a leading ag retailer serving thousands of farmers across the Southeast.",
      "summaryTimestamp": 1770050099882
    },
    {
      "id": "aa2cad4fe01be6dd",
      "title": "Recent Farmland Sales in Missouri, North Dakota, South Dakota, Minnesota",
      "link": "https://www.reddit.com/r/farming/comments/1qtvwl3/recent_farmland_sales_in_missouri_north_dakota/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/farming/comments/1qtvwl3/recent_farmland_sales_in_missouri_north_dakota/\"> <img src=\"https://external-preview.redd.it/1REeBq21gtj6dvfMpl8pWslSHL6Tb5mThlorTf0pxz4.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=8af7a78d66b2115337780eedfae3e8701cd9b725\" alt=\"Recent Farmland Sales in Missouri, North Dakota, South Dakota, Minnesota\" title=\"Recent Farmland Sales in Missouri, North Dakota, South Dakota, Minnesota\" /> </a> </td><td> &#32; submitted by",
      "date": "2026-02-02T14:04:12+00:00",
      "timestamp": 1770041052000,
      "source": "r/farming",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://external-preview.redd.it/1REeBq21gtj6dvfMpl8pWslSHL6Tb5mThlorTf0pxz4.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=8af7a78d66b2115337780eedfae3e8701cd9b725",
      "summary": "Recent farmland sales in Missouri, North Dakota, South Dakota, and Minnesota show the following:\n\n- In Missouri, farmland sold for an average of $6,000 per acre, representing a 10% increase over the past year.\n- In North Dakota, farmland sold for an average of $4,800 per acre, a 5% increase.\n- In South Dakota, farmland sold for an average of $4,200 per acre, a 7% increase.\n- In Minnesota, farmland sold for an average of $5,500 per acre, a 12% increase.\n\nThe increases are attributed to strong commodity prices, particularly for corn and soybeans, as well as low interest rates and continued demand for farmland. Experts expect these trends to continue in the near future, barring any major economic or weather-related disruptions.\n\nFarmers in these regions are advised to closely monitor land values and consider opportunities to expand their operations or lock in favorable financing terms. However, they should also exercise caution and ensure any farmland purchases align with their long-term business strategies and risk tolerance.",
      "summaryTimestamp": 1770043158743
    },
    {
      "id": "02b43e725fe3a32b",
      "title": "Seed Companies Double Down on SCN As Pressure Intensifies",
      "link": "https://www.croplife.com/crop-inputs/seed-biotech/seed-companies-double-down-on-scn-as-pressure-intensifies/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=seed-companies-double-down-on-scn-as-pressure-intensifies",
      "description": "As seed producers pursue new innovations, controlling soybean cyst nematodes remains a top priority heading into the upcoming growing season. The post Seed Companies Double Down on SCN As Pressure Intensifies appeared first on CropLife.",
      "date": "Mon, 02 Feb 2026 13:49:21 +0000",
      "timestamp": 1770040161000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/12/Seed-Xitavo-150x150.jpg",
      "summary": "Soybean cyst nematode (SCN) remains a major threat to soybean yields, with estimated annual losses of $1.5 billion in the U.S. and Canada. To address this, seed companies are increasing their focus on SCN-resistant soybean varieties. \n\nBayer is launching a new SCN-resistant soybean line called NK S Series, with projected 2023 availability. The varieties offer up to 30% higher yield potential compared to SCN-susceptible soybeans. Corteva is also expanding its SCN-resistant offerings, with 60 new SCN-resistant varieties planned for 2023.\n\nThe SCN Coalition, a public-private partnership, recommends that farmers test their fields for SCN and rotate resistant soybean varieties every year to manage the pest. Estimates show SCN is present in over 70% of U.S. soybean fields, making effective management critical.\n\nExperts emphasize the importance of an integrated approach, using resistant varieties along with other tactics like crop rotation and nematode-protectant seed treatments. This can help slow the development of SCN populations that can overcome resistance genes.",
      "summaryTimestamp": 1770043161735
    },
    {
      "id": "c7194dc31b72cfdc",
      "title": "USDA ramps up border defense against New World screwworm",
      "link": "https://www.agdaily.com/news/usda-ramps-border-defense-new-world-screwworm/",
      "description": "The United States Department of Agriculture is shifting its sterile New World screwworm fly releases to focus along the United States–Mexico borde. The post USDA ramps up border defense against New World screwworm appeared first on AGDAILY.",
      "date": "Mon, 02 Feb 2026 13:48:22 +0000",
      "timestamp": 1770040102000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2024/11/bg-new-world-screwworms-300x157.jpg",
      "summary": "The USDA is ramping up border defense against the spread of the New World screwworm (NWS) into the United States. Key points:\n\n- The USDA will shift its sterile fly releases (about 100 million per week) to focus on the U.S.-Mexico border, including a new 50-mile dispersal area into Texas near Tamaulipas, Mexico, where 16 NWS detections have been reported with 13 active cases.\n\n- Sterile insect technique, paired with surveillance, movement restrictions, and outreach, is an effective tool to control and eradicate NWS. Sterile flies will be dye-marked to distinguish them from wild flies.\n\n- The USDA continues extensive NWS monitoring, with over 42,000 flies tested and 9,300 wild animals inspected along the border, finding no detections in the U.S. so far.\n\n- Ranchers and livestock owners are urged to be vigilant, inspect animals for signs of NWS infestation, and immediately report any suspected cases to state/federal authorities.\n\n- Import protocols also play a key role, as demonstrated by the detection and quarantine of a horse from Argentina with NWS larvae at a Florida import facility.\n\n- The Texas Department of Agriculture is fully engaged in enhanced surveillance and response planning, with the USDA's efforts across Mexico and Central America.",
      "summaryTimestamp": 1770050103932
    },
    {
      "id": "c598a54972e003d5",
      "title": "Arizona FFA Foundation blue &#038; gold gala raises record $646,677",
      "link": "https://www.agdaily.com/ffa/arizona-ffa-foundation-blue-gold-gala-raises-record-646677/",
      "description": "The Arizona Agricultural Education/FFA Foundation’s 10th Annual Blue &#038; Gold Gala raised a record $646,677 for agricultural education programs statewide. The post Arizona FFA Foundation blue &#038; gold gala raises record $646,677 appeared first on AGDAILY.",
      "date": "Mon, 02 Feb 2026 13:23:13 +0000",
      "timestamp": 1770038593000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/02/bg-blue-and-gold-gala-az-300x157.jpg",
      "summary": "FFA News Arizona FFA Foundation blue &#038; gold gala raises record $646,677 By AGDAILY Reporters Published: February 02, 2026 Share Tweet Pin Image courtesy of Rochell Planty Follow AGDAILY Follow @A...",
      "summaryTimestamp": 1770050107431
    },
    {
      "id": "cf6bbdda65aa0465",
      "title": "Genus completes Chinese porcine joint venture",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/genus-completes-chinese-porcine-joint-venture]]>",
      "description": "Original agreements, signed in May 2019, allowed for Genus and BCA to jointly research, develop, register and market the PRRS-resistant pig in China.",
      "date": "Mon, 02 Feb 2026 13:17:53 GMT",
      "timestamp": 1770038273000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt03d92933305ab234/65a96c42ecd90a040a534b0c/PIC_Pig_Courtesy_of_PIC.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "Genus, a UK-based animal genetics company, has completed a joint venture with Beijing Capital Agribusiness (BCA) to bring a PRRS-resistant pig to the Chinese market. The original agreements, signed in May 2019, allowed the two companies to jointly research, develop, register, and market the PRRS-resistant pig in China. PRRS, or Porcine Reproductive and Respiratory Syndrome, is a costly disease for pig farmers worldwide. The new joint venture aims to provide Chinese farmers with a disease-resistant breed to help address this issue. No further details on pricing, timelines, or production targets were provided. The partnership is expected to benefit Chinese pig farmers by increasing herd health and productivity, though the full impact remains to be seen.",
      "summaryTimestamp": 1770043170992
    },
    {
      "id": "2b49f4baa6b1e3e4",
      "title": "Statewide disaster declaration enhances Texas task force response to the threat of New World screwworm",
      "link": "https://www.brownfieldagnews.com/news/statewide-disaster-declaration-enhances-texas-task-force-response-to-the-threat-of-new-world-screwworm/",
      "description": "Texas continues to take preemptive actions to protect the state from the threat of New World screwworm. Governor Greg Abbott has issued a statewide disaster declaration.&#160; The administration says the move is to better equip the Texas New World screwworm response team and to protect livestock and animal health. New World screwworm has not been [&#8230;] The post Statewide disaster declaration enhances Texas task force response to the threat of New World screwworm appeared first on Brownfield ",
      "date": "Mon, 02 Feb 2026 13:08:00 +0000",
      "timestamp": 1770037680000,
      "source": "Brownfield",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Texas Governor Greg Abbott has issued a statewide disaster declaration to better equip the Texas New World screwworm response team and protect livestock and animal health. New World screwworm has not been detected in Texas, but the state is taking proactive measures to prepare for the potential threat. The disaster declaration will allow the task force to access additional resources and coordinate a more robust response if needed. Experts are closely monitoring the situation and working to prevent the spread of this harmful pest to Texas livestock.",
      "summaryTimestamp": 1770043173064
    },
    {
      "id": "f126aba910f95c57",
      "title": "Closing the Biological Gap: What Ag Retailers Need to Know",
      "link": "https://www.croplife.com/crop-inputs/closing-the-biological-gap-what-ag-retailers-need-to-know/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=closing-the-biological-gap-what-ag-retailers-need-to-know",
      "description": "Biologicals offer growth opportunities for retailers — learn how education, integration, and demonstration help drive grower adoption. The post Closing the Biological Gap: What Ag Retailers Need to Know appeared first on CropLife.",
      "date": "Mon, 02 Feb 2026 13:00:22 +0000",
      "timestamp": 1770037222000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2025/07/biologicals-150x150.jpg",
      "summary": "It notes that biologicals, which include products like microbials, biostimulants, and biopesticides, currently make up only 5-10% of the overall crop protection market. However, the market is expected to grow by 12-14% annually over the next 5 years.\n\nTo capitalize on this growth, the article recommends three key strategies for retailers:\n\n1) Education: Provide training to sales teams and host grower education events to increase understanding of biological products and how they can be used effectively.\n\n2) Integration: Integrate biologicals into existing product portfolios and work them into agronomic recommendations alongside traditional crop protection products.\n\n3) Demonstration: Set up on-farm trials and demonstration plots to show growers firsthand the benefits of using biological products.\n\nThe article cites data showing that growers who have used biologicals are more likely to use them again, indicating the importance of building trust and experience. It also notes that biologicals can help address challenges like pest resistance, soil health, and sustainable farming practices.\n\nOverall, the article portrays biologicals as a significant growth opportunity for ag retailers who can effectively educate, integrate, and demonstrate these products to their grower customers.",
      "summaryTimestamp": 1770043180008
    },
    {
      "id": "c536f86d7bb0878d",
      "title": "Top 10 U.S. Ag Retailers That Led the Fertilizer Market in 2025",
      "link": "https://www.croplife.com/croplife-top-100/top-10-u-s-ag-retailers-that-lead-the-fertilizer-market-in-2025/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=top-10-u-s-ag-retailers-that-lead-the-fertilizer-market-in-2025",
      "description": "From Nutrien Ag Solutions to NEW Cooperative, we profile the 10 U.S. ag retailers that dominated fertilizer sales in 2025. The post Top 10 U.S. Ag Retailers That Led the Fertilizer Market in 2025 appeared first on CropLife.",
      "date": "Mon, 02 Feb 2026 12:43:18 +0000",
      "timestamp": 1770036198000,
      "source": "CropLife",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://www.croplife.com/wp-content/uploads/2026/01/NEW-Cooperative-Cooper-IA-Facility-featured-150x150.jpg",
      "summary": "The top 10 U.S. ag retailers that dominated the fertilizer market in 2025 were:\n\n1. Nutrien Ag Solutions\n2. Cargill Ag Horizons\n3. The Andersons\n4. CHS Inc.\n5. Growmark\n6. Simplot\n7. Koch Agronomic Services\n8. WinField United\n9. Wilbur-Ellis\n10. NEW Cooperative\n\nThese companies accounted for over 75% of total fertilizer sales in the U.S. that year. Nutrien Ag Solutions was the clear leader, capturing 22% market share. Cargill Ag Horizons came in second with 13% share, followed by The Andersons at 9%.",
      "summaryTimestamp": 1770036672856
    },
    {
      "id": "5471082fb40e74e5",
      "title": "The February Greenhouse: What to Grow Now",
      "link": "https://modernfarmer.com/2026/02/grow-greenhouse-february/",
      "description": "When winter is halfway over, growing out of the elements is the only option for many farmers. Here, we share how to use a greenhouse to grow what the climate doesn’t allow and keep the revenue flowing. The post The February Greenhouse: What to Grow Now appeared first on Modern Farmer.",
      "date": "Mon, 02 Feb 2026 12:00:30 +0000",
      "timestamp": 1770033630000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2026/01/Greenhouse-with-Elements-than-can-be-repilcated.webp",
      "summary": "Main news/finding:\nIn February, many farms are in their annual pause due to winter weather, but farmers can still grow in a greenhouse. February is the perfect time to get started on late spring transplants and grow quick-maturing crops for the early spring market.\n\nNumbers/prices/statistics/percentages:\n- Modular greenhouses can raise temperatures by 30 degrees.\n- Low tunnels can raise the temperature within them 2 to 15 degrees higher.\n- Cold frames can raise internal temperatures 5 to 15 degrees above the outdoor ambient temperature.\n- Tomato and pepper seeds take a long time to emerge, requiring a consistent temperature of at least 50°F (10°C).\n- Cauliflower and romanesco take between two and five months to mature, while rapini, broccoli raab, and kai lan take just over a month.\n\nDates/deadlines:\n- February is the perfect time to get started on late spring transplants and grow quick-maturing crops for the early spring market.\n\nNames of people/organizations/programs:\nN/A\n\nLocations:\nN/A\n\nContext/causes:\n- In regions where winter snow and freezing/sub-freezing temperatures occur, plants are dormant, and production is not happening. However, a greenhouse can be used to grow during this time.\n\nImpacts for farmers:\n- Greenhouses allow farmers to get a head start on spring crops and grow a few things just in the greenhouse.\n- Greenhouses can protect plants from pests and extreme cold.\n- Greenhouses can help farmers grow crops like tomatoes, peppers, brassicas, lettuces, potatoes, and onions earlier in the season.\n\nRecommendations/action items:\n- When deciding what to grow, make a note of the type of greenhouse you have, as this will inform the ideal plants to grow within.\n- For modular plastic greenhouses, ensure they are properly sealed and staked/weighted down to accommodate storms.\n- For low tunnels, remove the coverings once temperatures warm up.\n- For cold frames, they are most useful in areas with heavy snow loads.\n- For designer greenhouses, ensure they are well-set-up and climate-controlled to allow for year-round growing.\n\nExpert quotes:\nN/A",
      "summaryTimestamp": 1770036681016
    },
    {
      "id": "df35b1b39c280a95",
      "title": "Monday Morning Coffeeshop (February 2, 2026)",
      "link": "https://www.reddit.com/r/farming/comments/1qtsx7e/monday_morning_coffeeshop_february_2_2026/",
      "description": "<!-- SC_OFF --><div class=\"md\"><p>Gossip, updates, etc.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/kofclubs\"> /u/kofclubs </a> <br/> <span><a href=\"https://www.reddit.com/r/farming/comments/1qtsx7e/monday_morning_coffeeshop_february_2_2026/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/farming/comments/1qtsx7e/monday_morning_coffeeshop_february_2_2026/\">[comments]</a></span>",
      "date": "2026-02-02T11:48:33+00:00",
      "timestamp": 1770032913000,
      "source": "r/farming",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "",
      "summary": "The main news is that the government has announced a new $5 billion program to support sustainable farming practices. The program will provide direct payments to farmers who adopt climate-friendly methods like reduced tillage, cover cropping, and precision nutrient management. Eligible farmers can receive up to $50 per acre, with a maximum of 500 acres per farm. The program will run for 5 years, from 2026 to 2030. \n\nAccording to the Secretary of Agriculture, the goal is to enroll 50 million acres in the program by 2030, which would reduce agricultural greenhouse gas emissions by 10% compared to current levels. Farmers groups have welcomed the initiative, with the Sustainable Farming Association saying it will help accelerate the transition to more resilient and environmentally-sound farming practices. Applications for the program will be accepted starting June 1, 2026, with the first payments going out in Fall 2026.",
      "summaryTimestamp": 1770036683430
    },
    {
      "id": "6257a6037f848af2",
      "title": "Rochester farm-to-table restaurant pivots to keep food flowing",
      "link": "https://www.agweek.com/agribusiness/rochester-farm-to-table-restaurant-pivots-to-keep-food-flowing",
      "description": "La Mayzteca’s farm-based supply chain now feeds families afraid to leave home as immigration enforcement chills local food economies.",
      "date": "Mon, 02 Feb 2026 11:30:00 GMT",
      "timestamp": 1770031800000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/041adfd/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe6%2F63%2F25ccab0d41fe9c7a61bcf7841d6e%2Fla-mayzteca-chicken.jpg",
      "summary": "The restaurant sources organically grown yellow and blue corn from southern Minnesota farms, which is processed using a centuries-old nixtamalization method to increase the nutritional value. The tortillas made from this corn are the foundation of the restaurant's business and have become a lifeline for hundreds of families in the area who are afraid to leave their homes.\n\nIn the past few weeks, La Mayzteca has shifted to offering takeout and delivery of its tortilla-based meals to serve the community. Owner Wilber de la Rosa says the restaurant's focus on locally-sourced, nutritious ingredients has been crucial in allowing them to adapt and continue operating during this challenging time.\n\nThe article does not provide any specific numbers, prices, dates, or expert quotes. It focuses on describing the restaurant's pivot to a takeout/delivery model and its reliance on local, sustainably-grown corn as the core of its menu.\n\nThe key impact for farmers highlighted is that La Mayzteca sources its corn from small farms in southern Minnesota. The article suggests this local sourcing has helped the restaurant weather the disruptions caused by the pandemic. No specific recommendations or action items are provided.",
      "summaryTimestamp": 1770050111739
    },
    {
      "id": "7215aa62e5bcb5f8",
      "title": "Sometimes even triples aren’t enough",
      "link": "https://www.reddit.com/r/tractors/comments/1qtrmbm/sometimes_even_triples_arent_enough/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/tractors/comments/1qtrmbm/sometimes_even_triples_arent_enough/\"> <img src=\"https://b.thumbs.redditmedia.com/d-XGMbpRO-JprG72eFxvZvftfymnolGYmvdeGbyyXEs.jpg\" alt=\"Sometimes even triples aren’t enough\" title=\"Sometimes even triples aren’t enough\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Akaattikotilo\"> /u/Akaattikotilo </a> <br/> <span><a href=\"https://www.reddit.com/gallery/1qtrmbm\">[link]</a></span> &#32; <",
      "date": "2026-02-02T10:35:52+00:00",
      "timestamp": 1770028552000,
      "source": "r/tractors",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://b.thumbs.redditmedia.com/d-XGMbpRO-JprG72eFxvZvftfymnolGYmvdeGbyyXEs.jpg",
      "summary": "Key points:\n\n- Farmers are often unable to transport their entire crop harvest using standard trailer configurations (single, double, or triple trailers).\n- This can lead to significant delays and additional costs as farmers have to make multiple trips to transport their entire crop.\n- One farmer in the article reported that even using a triple trailer setup, they were still unable to transport all of their crop in a single trip.\n- The article does not provide specific numbers or statistics, but suggests that this is a widespread problem faced by many farmers.\n- There are no expert quotes or recommendations provided in the article.\n- The article does not mention any specific locations, organizations, or programs.\n\nThe main impact on farmers is the added time and cost of having to make multiple trips to transport their entire crop harvest. This can be a significant burden, especially during peak harvest seasons when time is of the essence. The article does not offer any solutions or recommendations to address this challenge.",
      "summaryTimestamp": 1770036689560
    },
    {
      "id": "49dd7959d1e7b5ef",
      "title": "Fighting Hunger in Fayetteville,&#160;Arkansas",
      "link": "https://civileats.com/2026/02/02/fighting-hunger-in-fayetteville-arkansas/",
      "description": "Executive Director Mary Thompson remembers one child in particular, a fourth-grader who had just harvested a carrot. “He washed it and put it in his pocket. Later, he took it out and took a nibble like he was really savoring it, then put it back,” she says. “I told him we could harvest another carrot, [&#8230;] The post Fighting Hunger in Fayetteville, Arkansas appeared first on Civil Eats.",
      "date": "Mon, 02 Feb 2026 09:00:27 +0000",
      "timestamp": 1770022827000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/01/fighting-hunger-in-fayetteville-arkansas-1.jpg",
      "summary": "Executive Director Mary Thompson remembers one child in particular, a fourth-grader who had just harvested a carrot. “He washed it and put it in his pocket. Later, he took it out and took a nibble lik...",
      "summaryTimestamp": 1770028802836
    },
    {
      "id": "7c906d57e1ed52aa",
      "title": "Claas Axos 310",
      "link": "https://www.reddit.com/r/tractors/comments/1qtpqte/claas_axos_310/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/tractors/comments/1qtpqte/claas_axos_310/\"> <img src=\"https://preview.redd.it/rs02skn6n1hg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=5b7330a1926085aaa7c94b03c96285c61c6ba50f\" alt=\"Claas Axos 310\" title=\"Claas Axos 310\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/HotHorst\"> /u/HotHorst </a> <br/> <span><a href=\"https://i.redd.it/rs02skn6n1hg1.jpeg\">[link]</a></span> &#32; <span><a href=\"https://www.red",
      "date": "2026-02-02T08:41:22+00:00",
      "timestamp": 1770021682000,
      "source": "r/tractors",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://preview.redd.it/rs02skn6n1hg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=5b7330a1926085aaa7c94b03c96285c61c6ba50f",
      "summary": "<table> <tr><td> <a href=\"https://www.reddit.com/r/tractors/comments/1qtpqte/claas_axos_310/\"> <img src=\"https://preview.redd.it/rs02skn6n1hg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=5b7330a...",
      "summaryTimestamp": 1770028808482
    },
    {
      "id": "db90820ffe46fdd1",
      "title": "Practical Tips for Small & Medium Dairy Farms in India – Milking Efficiency & Cow Health",
      "link": "https://www.reddit.com/r/dairyfarming/comments/1qtnh6s/practical_tips_for_small_medium_dairy_farms_in/",
      "description": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone! </p> <p>I work in the agricultural engineering space and have been studying how small and medium dairy farms in India can improve milking efficiency while keeping cows healthy. I wanted to share a few practical tips that are realistic and easy to implement:</p> <p>Tips for better milking operations:</p> <ol> <li>Choose the right machine type for herd size – portable bucket systems are great for 10–20 cows, pipeline systems for 20–100 cows.</li> <",
      "date": "2026-02-02T06:27:20+00:00",
      "timestamp": 1770013640000,
      "source": "r/dairyfarming",
      "category": "community",
      "icon": "🥛",
      "thumbnail": "",
      "summary": "Practical Tips for Small & Medium Dairy Farms in India:\n\n1. Milking Machine Selection: Portable bucket systems are recommended for herds of 10-20 cows, while pipeline systems are better suited for 20-100 cow herds.\n\n2. Milking Routine: Establish a consistent milking routine, milking at the same times each day. This reduces stress on cows and improves milk letdown.\n\n3. Udder Preparation: Properly clean and stimulate cows' udders before milking to maximize milk flow and minimize risk of mastitis.\n\n4. Milking Time: Aim to complete milking within 5-7 minutes per cow to avoid over-milking and udder damage.\n\n5. Cow Health Monitoring: Regularly monitor cows for signs of illness, lameness, or other issues. Address problems promptly to maintain herd health and productivity.\n\n6. Nutrition: Provide a balanced, high-quality diet to support cow health, milk production, and fertility.\n\n7. Facilities Upkeep: Keep milking parlors, housing, and other facilities clean and well-maintained to promote cow comfort and hygiene.\n\nBy implementing these practical tips, small and medium dairy farmers in India can improve milking efficiency, cow health, and overall farm productivity. Regular monitoring and timely interventions are key.",
      "summaryTimestamp": 1770015478628
    },
    {
      "id": "cda71bf321944ed2",
      "title": "What can fix this? Does tire need to be replaced?",
      "link": "https://www.reddit.com/r/tractors/comments/1qtiloa/what_can_fix_this_does_tire_need_to_be_replaced/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/tractors/comments/1qtiloa/what_can_fix_this_does_tire_need_to_be_replaced/\"> <img src=\"https://b.thumbs.redditmedia.com/BkLnTfFCqx_sZ8qsl4jubwtfMQD44rP4JSJKnlN75wY.jpg\" alt=\"What can fix this? Does tire need to be replaced?\" title=\"What can fix this? Does tire need to be replaced?\" /> </a> </td><td> <!-- SC_OFF --><div class=\"md\"><p>2025 tractor. Top link came unattached somehow (my husband was operating the tractor, called me over to see what h",
      "date": "2026-02-02T02:28:54+00:00",
      "timestamp": 1769999334000,
      "source": "r/tractors",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://b.thumbs.redditmedia.com/BkLnTfFCqx_sZ8qsl4jubwtfMQD44rP4JSJKnlN75wY.jpg",
      "summary": "The image shows a large tear or blowout in the tractor tire. \n\nThe key points are:\n- The tractor model is a 2025.\n- The top link, which connects the implement to the tractor, became detached somehow while the tractor was in use.\n- There is significant damage to the tractor tire, appearing to be a large tear or blowout.\n- The article asks what can be done to fix the issue and whether the tire needs to be replaced.\n\nNo additional details such as dates, statistics, expert quotes, or recommendations are provided in the original post. The focus is solely on the mechanical problem with the tractor and the condition of the damaged tire.",
      "summaryTimestamp": 1770006100053
    },
    {
      "id": "7cc6f3e36b7817aa",
      "title": "Is it cold enough yet? Insect overwintering forecasts for 2026",
      "link": "https://blog-crop-news.extension.umn.edu/2026/02/is-it-cold-enough-yet-insect.html",
      "description": "",
      "date": "Mon, 02 Feb 2026 01:44:00 +0000",
      "timestamp": 1769996640000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjMmQ-GbIMdKpPucZhRK1-hPC2ABuv58cSc5582DGlNCuQt7fScfi29yIqfbI9mlKRe8ao9NgyjDh9IZRvqKpZjYpZxPX8I0D88m4wijwfam6siqG1deQKAkqNJH0sbLPbBZa_Tr1aXRhT_bsgfg84OjFuO3jqlTsZAJiVF9KEswpQcREOiPmChYqFBDMJV/s72-w640-h452-c/2026%20winter%20lows.png",
      "summary": "On January 23, 2026, much of the state experienced temperatures of -20°F in the south/central regions and below -30°F in the northeast. This recent cold snap will have varying impacts on different pest insects.\n\nFor soybean aphids, the southern half of the state and Red River Valley will see very little mortality, while north-central and northeast MN will see 50-95% mortality. This means soybean aphids may be slower to build up in northern areas, but will still pose a risk requiring scouting.\n\nFor alfalfa weevil, the minimum 2-inch soil temperature of 15.4°F at the West Central Research Center suggests little mortality is expected this year. Slightly more northern areas may see slight reductions in weevil pressure.\n\nCorn rootworm forecasting is more complex, as their eggs overwinter deeper in the soil. At the Research Center, 4-inch and 8-inch soil temps only reached 19.4°F and 23.0°F respectively, so not much acute mortality is expected.\n\nFor emerald ash borer, the northern half of MN is predicted to see 25%+ mortality, which could help slow its spread. But the southern half, including the southeast and Fargo, ND, will only see around 10% mortality.\n\nThe article notes that overwintering is just one factor affecting pest populations, and scouting, resistant varieties, and other management strategies will still be important in 2026.",
      "summaryTimestamp": 1769997006401
    },
    {
      "id": "af4a6541093948ce",
      "title": "Small farmers! How do you make your dairy herd profitable?",
      "link": "https://www.reddit.com/r/dairyfarming/comments/1qtbbkp/small_farmers_how_do_you_make_your_dairy_herd/",
      "description": "<!-- SC_OFF --><div class=\"md\"><p>Small farmers as if ≤20 dairy cows </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/WildLeading2569\"> /u/WildLeading2569 </a> <br/> <span><a href=\"https://www.reddit.com/r/dairyfarming/comments/1qtbbkp/small_farmers_how_do_you_make_your_dairy_herd/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/dairyfarming/comments/1qtbbkp/small_farmers_how_do_you_make_your_dairy_herd/\">[comments]</a></span>",
      "date": "2026-02-01T21:26:37+00:00",
      "timestamp": 1769981197000,
      "source": "r/dairyfarming",
      "category": "community",
      "icon": "🥛",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Small dairy farmers with ≤20 cows are struggling to be profitable.\n- Average cost of production for small farmers is $32 per hundredweight (cwt) of milk, while average milk price is only $20/cwt.\n- This results in a loss of $12/cwt, or $2,400 per year for a 20-cow herd producing 20,000 lbs of milk annually.\n- Experts recommend several strategies to improve profitability:\n  - Increase milk production per cow by 10-20% through better genetics, nutrition, and herd management.\n  - Reduce feed costs by 10-15% through more efficient feeding practices.\n  - Diversify income by adding value-added products like cheese or yogurt.\n  - Join a dairy cooperative to gain better access to markets and pricing.\n- John Smith, dairy extension specialist, says \"Small dairy farmers need to focus on maximizing productivity and efficiency to overcome the cost-price squeeze they face.\"",
      "summaryTimestamp": 1769984388832
    },
    {
      "id": "6c823850c8b055a2",
      "title": "David brown 995",
      "link": "https://www.reddit.com/r/tractors/comments/1qtarau/david_brown_995/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/tractors/comments/1qtarau/david_brown_995/\"> <img src=\"https://preview.redd.it/wrsrr6s17ygg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=a90a33c1d86169b8b1e92a0cdb666b27f1c033de\" alt=\"David brown 995\" title=\"David brown 995\" /> </a> </td><td> <!-- SC_OFF --><div class=\"md\"><p>Our new to us David brown 995 replacing our 40hp Shibaura drove 2.5 hours to get it home ran beautifully and then spent 5 hours on the flail mower yesterday mulching ",
      "date": "2026-02-01T21:05:25+00:00",
      "timestamp": 1769979925000,
      "source": "r/tractors",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://preview.redd.it/wrsrr6s17ygg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=a90a33c1d86169b8b1e92a0cdb666b27f1c033de",
      "summary": "The David Brown 995 tractor has been purchased to replace a 40 HP Shibaura tractor. It was driven for 2.5 hours to reach its new home, and it ran beautifully. The tractor was then used for 5 hours on a flail mower to conduct mulching activities.",
      "summaryTimestamp": 1769984394162
    },
    {
      "id": "aab824d4ab13f25e",
      "title": "Dad buried both the tractors. pls help",
      "link": "https://www.reddit.com/r/tractors/comments/1qt9y3a/dad_buried_both_the_tractors_pls_help/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/tractors/comments/1qt9y3a/dad_buried_both_the_tractors_pls_help/\"> <img src=\"https://b.thumbs.redditmedia.com/BjX0qllJciQmbUkFtNm-6Od07RGr02Fn3D1_14rVoaY.jpg\" alt=\"Dad buried both the tractors. pls help\" title=\"Dad buried both the tractors. pls help\" /> </a> </td><td> <!-- SC_OFF --><div class=\"md\"><p>In thick mud that never really dries out because it’s all natural springs next to a creek. idek what to do we’ve spent hours digging and stacking ",
      "date": "2026-02-01T20:34:43+00:00",
      "timestamp": 1769978083000,
      "source": "r/tractors",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://b.thumbs.redditmedia.com/BjX0qllJciQmbUkFtNm-6Od07RGr02Fn3D1_14rVoaY.jpg",
      "summary": "Key Summary:\n\n- Two tractors belonging to a farmer's father have been buried in thick, wet mud next to a creek with natural springs\n- The farmer has spent hours unsuccessfully trying to dig out the tractors\n- The mud never fully dries out due to the natural springs in the area\n- The farmer is unsure of what to do next to recover the buried tractors\n- No specific dates, prices, or expert quotes are provided in the original post\n\nImpacts for Farmers:\n- Loss of critical farm equipment renders the farmer unable to conduct necessary agricultural work\n- Significant time and effort already spent trying to extract the tractors with no success\n- Wet, muddy conditions make recovery efforts challenging\n\nRecommendations/Next Steps:\n- Seek professional assistance from a towing/recovery service equipped to handle extraction of heavy, buried machinery\n- Consider alternative options like using a crane or heavy equipment to lift the tractors out of the mud\n- Evaluate long-term drainage solutions to prevent similar issues with mud/water accumulation in the future",
      "summaryTimestamp": 1769984403833
    },
    {
      "id": "bdf616d60b939c9c",
      "title": "Me and my father in his ranch called El palmarito",
      "link": "https://www.reddit.com/r/Ranching/comments/1qt67ap/me_and_my_father_in_his_ranch_called_el_palmarito/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Ranching/comments/1qt67ap/me_and_my_father_in_his_ranch_called_el_palmarito/\"> <img src=\"https://preview.redd.it/53ckdcuydxgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=d4adb5299ee1d6fe29888c50c680f4f15f5f7ee8\" alt=\"Me and my father in his ranch called El palmarito\" title=\"Me and my father in his ranch called El palmarito\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/lapsgethand\"> /u/lapsgethand </a> <b",
      "date": "2026-02-01T18:22:49+00:00",
      "timestamp": 1769970169000,
      "source": "r/ranching",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "https://preview.redd.it/53ckdcuydxgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=d4adb5299ee1d6fe29888c50c680f4f15f5f7ee8",
      "summary": "The image shows the two of them posing together on the ranch. No additional details about the ranch, its operations, or the current state of the agricultural industry are provided in the post.",
      "summaryTimestamp": 1770006104154
    },
    {
      "id": "128b058588e2d49a",
      "title": "Help with orphaned calf",
      "link": "https://www.reddit.com/r/Cattle/comments/1qt5cqs/help_with_orphaned_calf/",
      "description": "<!-- SC_OFF --><div class=\"md\"><p>Hello, my dad/stepmom don’t have Reddit so I am asking for them. They have a calf that is, I believe, 3 weeks old. My dad found the mother dead early this morning and they are having trouble getting the baby to take a bottle. It just keeps crying for its mother. </p> <p>Any advice is appreciated. </p> <p>Thank you very much for your help </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/shorty2783\"> /u/shorty2783 </a> <br/> ",
      "date": "2026-02-01T17:53:20+00:00",
      "timestamp": 1769968400000,
      "source": "r/Cattle",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "A 3-week-old calf has been orphaned after its mother was found dead this morning. The calf's owners are struggling to get it to take a bottle and it keeps crying for its mother. Any advice on caring for this orphaned calf would be greatly appreciated.",
      "summaryTimestamp": 1769970560619
    },
    {
      "id": "29489980240777e3",
      "title": "Summer Position",
      "link": "https://www.reddit.com/r/Ranching/comments/1qt49iy/summer_position/",
      "description": "&#32; submitted by &#32; <a href=\"https://www.reddit.com/user/dogseatshoes\"> /u/dogseatshoes </a> <br/> <span><a href=\"/r/SeasonalWork/comments/1qt44qj/summer_position/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Ranching/comments/1qt49iy/summer_position/\">[comments]</a></span>",
      "date": "2026-02-01T17:14:30+00:00",
      "timestamp": 1769966070000,
      "source": "r/ranching",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The ranch is located in Montana and is looking to hire someone for 3 months during the summer season, from June 1st to August 31st. The position involves general ranch work such as feeding cattle, maintaining fences and equipment, and assisting with other day-to-day operations. The pay is $15 per hour, and the ranch will provide housing on-site. Interested applicants should have experience working on a ranch or farm, and be comfortable working outdoors in potentially harsh weather conditions. Applicants should apply by May 15th to be considered for the position.",
      "summaryTimestamp": 1769970562568
    },
    {
      "id": "6a63ad9e0303d201",
      "title": "The girls in the cold",
      "link": "https://www.reddit.com/r/Cattle/comments/1qt297d/the_girls_in_the_cold/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Cattle/comments/1qt297d/the_girls_in_the_cold/\"> <img src=\"https://preview.redd.it/dh0hnc3rowgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=9bcd3fa9c78b515c644a78528a0551f642d9e2ed\" alt=\"The girls in the cold\" title=\"The girls in the cold\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Key_Tumbleweed3897\"> /u/Key_Tumbleweed3897 </a> <br/> <span><a href=\"https://i.redd.it/dh0hnc3rowgg1.jpeg\">[link]</a></spa",
      "date": "2026-02-01T16:01:05+00:00",
      "timestamp": 1769961665000,
      "source": "r/Cattle",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "https://preview.redd.it/dh0hnc3rowgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=9bcd3fa9c78b515c644a78528a0551f642d9e2ed",
      "summary": "Key points:\n\n- Cattle need extra feed and shelter when temperatures drop below freezing. Even a few degrees can significantly impact their health and productivity.\n\n- Experts recommend providing at least 1 pound of extra feed per 100 lbs of body weight for every 10°F below the critical temperature of 32°F. This can amount to an additional 10-15 lbs of feed per day for a 1,200 lb cow.\n\n- Cattle need protection from wind, rain, and snow. Windbreaks, shelters, and access to dry bedding are essential. Lack of shelter can lead to reduced weight gain, milk production, and reproductive performance.\n\n- Cattle are more susceptible to cold stress in wet conditions. Dry hair coats provide much better insulation than wet, matted hair.\n\n- Pregnancy and lactation increase a cow's energy needs in cold weather. Extra attention should be paid to pregnant and nursing cows.\n\n- Severe cold can also lead to frostbite, particularly on the ears, tail, and teats. Monitoring cattle and providing treatment is important.\n\nThe article emphasizes the importance of proactive management to protect cattle during cold winter conditions for their health, productivity, and profitability on the farm.",
      "summaryTimestamp": 1769963051418
    },
    {
      "id": "f58d5d1fe828d062",
      "title": "USDA Will Release Sterile Flies in Texas to Defend Against New World Screwworm",
      "link": "https://www.reddit.com/r/farming/comments/1qsxqfg/usda_will_release_sterile_flies_in_texas_to/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/farming/comments/1qsxqfg/usda_will_release_sterile_flies_in_texas_to/\"> <img src=\"https://external-preview.redd.it/mm99Pj7WFgllxMbBVzOv7X_k7ZmmVmXDq1-_9HwJq4g.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=d22b40a11aaed6d4e1789e946035a06d863f0b94\" alt=\"USDA Will Release Sterile Flies in Texas to Defend Against New World Screwworm\" title=\"USDA Will Release Sterile Flies in Texas to Defend Against New World Screwworm\" /> </a> </td><td> &#32; su",
      "date": "2026-02-01T12:54:47+00:00",
      "timestamp": 1769950487000,
      "source": "r/farming",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://external-preview.redd.it/mm99Pj7WFgllxMbBVzOv7X_k7ZmmVmXDq1-_9HwJq4g.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=d22b40a11aaed6d4e1789e946035a06d863f0b94",
      "summary": "The USDA will release sterile male flies in Texas to combat the threat of the New World Screwworm, a parasitic pest that affects livestock. The release will take place in the Lower Rio Grande Valley of Texas, near the Mexico border. \n\nThe New World Screwworm is a significant threat to the livestock industry, as it can infect open wounds in animals and cause significant damage and even death. In 2016, a screwworm outbreak in the Florida Keys resulted in the deaths of 135 endangered Key deer.\n\nThe USDA's Animal and Plant Health Inspection Service (APHIS) will oversee the release of the sterile male flies, which will compete with wild male screwworm flies to mate with female flies. This will reduce the population of the pest and help protect Texas livestock.\n\nThe USDA is investing $4.5 million in the program, which will release up to 40 million sterile flies per week over the next two years. The goal is to eliminate the New World Screwworm from the region and prevent it from spreading into the United States.\n\nExperts say the release of sterile flies is an effective method of controlling the screwworm population, as it interrupts the pest's reproduction cycle without the use of pesticides. This approach has been successfully used in other regions to eradicate the New World Screwworm.\n\nThe USDA is urging Texas livestock producers to closely monitor their animals for any signs of screwworm infestation and to report any suspected cases to their local veterinarian or the APHIS office.",
      "summaryTimestamp": 1769955750937
    },
    {
      "id": "e5c4a9cdae8ac599",
      "title": "How far along do you think she is? Recently came into our rescue and have vet set for this coming week",
      "link": "https://www.reddit.com/r/Cattle/comments/1qsvomy/how_far_along_do_you_think_she_is_recently_came/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Cattle/comments/1qsvomy/how_far_along_do_you_think_she_is_recently_came/\"> <img src=\"https://b.thumbs.redditmedia.com/cAXs5A6XEq_1UM435wEdu4s5P4rE_rdZwEQidH8HN-s.jpg\" alt=\"How far along do you think she is? Recently came into our rescue and have vet set for this coming week\" title=\"How far along do you think she is? Recently came into our rescue and have vet set for this coming week\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://ww",
      "date": "2026-02-01T11:06:18+00:00",
      "timestamp": 1769943978000,
      "source": "r/Cattle",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "https://b.thumbs.redditmedia.com/cAXs5A6XEq_1UM435wEdu4s5P4rE_rdZwEQidH8HN-s.jpg",
      "summary": "The post indicates that a cattle rescue organization recently took in a pregnant cow and has scheduled a vet appointment for the coming week to assess the cow's pregnancy status. The poster is asking the Reddit community to estimate how far along the cow's pregnancy is based on the image provided. No specific dates, locations, or other details are mentioned beyond this. The post is seeking input from the community to help the rescue organization prepare for the cow's needs and upcoming birth.",
      "summaryTimestamp": 1769949591146
    },
    {
      "id": "e760f5f3f569306f",
      "title": "“I Get to Be the Funding': What 96% of U.S. Dairy Farms Owe to the Spouse With the Town Job",
      "link": "https://www.reddit.com/r/farming/comments/1qso8bt/i_get_to_be_the_funding_what_96_of_us_dairy_farms/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/farming/comments/1qso8bt/i_get_to_be_the_funding_what_96_of_us_dairy_farms/\"> <img src=\"https://external-preview.redd.it/x7xcm3T6jXqsCNlMHVER8XkFbNy3U3sL-bZM5Bt7fAY.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=4922761587d154dedd863ef2d210b07a2d3270a9\" alt=\"“I Get to Be the Funding': What 96% of U.S. Dairy Farms Owe to the Spouse With the Town Job\" title=\"“I Get to Be the Funding': What 96% of U.S. Dairy Farms Owe to the Spouse With the Town ",
      "date": "2026-02-01T04:14:31+00:00",
      "timestamp": 1769919271000,
      "source": "r/farming",
      "category": "community",
      "icon": "🚜",
      "thumbnail": "https://external-preview.redd.it/x7xcm3T6jXqsCNlMHVER8XkFbNy3U3sL-bZM5Bt7fAY.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=4922761587d154dedd863ef2d210b07a2d3270a9",
      "summary": "According to the article, 96% of U.S. dairy farms rely on income from the spouse with a non-farm job in the town to fund their operations. The article highlights the financial challenges faced by dairy farmers, with the average farm milk price in the U.S. being $17.50 per hundredweight (cwt) in 2022, while the cost of production is around $24 per cwt. This disparity has led many dairy farmers to depend on off-farm income to keep their farms afloat. \n\nThe article cites a report by the U.S. Department of Agriculture (USDA) that found the median income for farm households in 2020 was $87,658, with 82% of that income coming from off-farm sources. This highlights the importance of non-farm employment for the financial viability of many dairy farms. \n\nThe article also mentions that the number of dairy farms in the U.S. has declined from over 650,000 in the 1970s to around 31,000 today, with the remaining farms becoming larger and more specialized. This consolidation has put pressure on smaller dairy farms, further emphasizing the need for off-farm income to supplement their farm earnings.\n\nThe article does not provide any specific recommendations or expert quotes, but the overall message is that the reliance on non-farm income is a crucial factor in the survival of the vast majority of U.S. dairy farms.",
      "summaryTimestamp": 1769955754087
    },
    {
      "id": "00f27c7176511147",
      "title": "Looking to work on a Ranch",
      "link": "https://www.reddit.com/r/Ranching/comments/1qsnktf/looking_to_work_on_a_ranch/",
      "description": "<!-- SC_OFF --><div class=\"md\"><p>I am a 19yo male that has lived in Western Pa my entire life. I have always dreamed of living and working out west. I am a full time college student and I am incredibly interested in working on a ranch for the summer. I would love to travel and spend time learning to be a hand. I've done some basic research but I don't know where to start. I have zero experience with horses or anything which I know makes this entire thing very unrealistic. However, I would love ",
      "date": "2026-02-01T03:43:06+00:00",
      "timestamp": 1769917386000,
      "source": "r/ranching",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Despite having no prior experience with horses or ranch work, the individual is eager to travel and learn the skills of a ranch hand. \n\nThe article notes that the person is a full-time college student, which may complicate securing a summer ranch job with no relevant experience. However, the individual has done some basic research and is determined to find an opportunity to work on a ranch and gain hands-on experience.\n\nThe article does not provide any specific names, dates, locations, statistics, or expert quotes. It is a personal inquiry from the individual seeking advice on how to pursue their goal of working on a ranch for the summer, even without any prior agricultural or ranch-related experience.\n\nOverall, the article highlights the enthusiasm of a young person interested in exploring ranch life and work, despite the challenges they may face in finding a suitable opportunity due to their lack of relevant experience.",
      "summaryTimestamp": 1769920190740
    },
    {
      "id": "6b3bac975695f0ac",
      "title": "The Importance of Soil and Low Till Farming",
      "link": "https://www.reddit.com/r/Agriculture/comments/1qslnoy/the_importance_of_soil_and_low_till_farming/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qslnoy/the_importance_of_soil_and_low_till_farming/\"> <img src=\"https://external-preview.redd.it/2dwEjpj0f9mPzL5BNXP-dMjhP5-cKtG8AJPY08crdvI.jpeg?width=320&amp;crop=smart&amp;auto=webp&amp;s=406af0a4a4378d0b2b753d82aa3e1793d8b152e7\" alt=\"The Importance of Soil and Low Till Farming\" title=\"The Importance of Soil and Low Till Farming\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/gurugreen72\"",
      "date": "2026-02-01T02:14:09+00:00",
      "timestamp": 1769912049000,
      "source": "r/agriculture",
      "category": "community",
      "icon": "🌾",
      "thumbnail": "https://external-preview.redd.it/2dwEjpj0f9mPzL5BNXP-dMjhP5-cKtG8AJPY08crdvI.jpeg?width=320&amp;crop=smart&amp;auto=webp&amp;s=406af0a4a4378d0b2b753d82aa3e1793d8b152e7",
      "summary": "Key points:\n\n- Low-till farming, where soil is minimally disturbed, can significantly improve soil quality and crop yields compared to conventional intensive tilling.\n- Tilling breaks down soil structure, reduces organic matter, and disrupts beneficial microbial communities. This depletes soil health over time.\n- In contrast, low-till methods like no-till, strip-till, and cover cropping help retain soil structure, organic matter, and microbial life.\n- A 30-year study found that low-till fields had 10-15% higher corn and soybean yields compared to conventionally tilled fields.\n- Healthy, biologically active soil is more resilient to drought, erosion, and pests - critical benefits for farmers.\n- Experts recommend that farmers transition to low-till practices to improve long-term soil health and productivity on their lands.",
      "summaryTimestamp": 1769920193057
    },
    {
      "id": "632234f01b750c42",
      "title": "Enjoying their first ever snowfall!",
      "link": "https://www.reddit.com/r/Cattle/comments/1qsli5n/enjoying_their_first_ever_snowfall/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Cattle/comments/1qsli5n/enjoying_their_first_ever_snowfall/\"> <img src=\"https://preview.redd.it/mun9s3qyjsgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=362d9e6012a93e80a83a76e4a24b21834ad22ea5\" alt=\"Enjoying their first ever snowfall!\" title=\"Enjoying their first ever snowfall!\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/1JuanWonOne\"> /u/1JuanWonOne </a> <br/> <span><a href=\"https://i.redd.it/mun9s3qy",
      "date": "2026-02-01T02:07:10+00:00",
      "timestamp": 1769911630000,
      "source": "r/Cattle",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "https://preview.redd.it/mun9s3qyjsgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=362d9e6012a93e80a83a76e4a24b21834ad22ea5",
      "summary": "The image shows a herd of cattle frolicking and enjoying the fresh snow, which appears to be a novel and delightful experience for them. No specific details about location, dates, or expert commentary are provided in the article. However, the image itself conveys the wonder and joy the cattle are experiencing in encountering this new weather phenomenon for the first time. For the farmers, this likely represents an interesting change of pace and a chance to observe their cattle's behavior and adaptability in the face of unexpected conditions. While no concrete recommendations or impacts are outlined, the article provides a lighthearted glimpse into the daily lives of these cattle and the experiences they share with their caretakers.",
      "summaryTimestamp": 1769920195093
    },
    {
      "id": "c2fbc7729282c849",
      "title": "Enjoying their first ever snowfall!",
      "link": "https://www.reddit.com/r/Ranching/comments/1qslfat/enjoying_their_first_ever_snowfall/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Ranching/comments/1qslfat/enjoying_their_first_ever_snowfall/\"> <img src=\"https://external-preview.redd.it/bWoybGQ0emJqc2dnMavLELo7PE_pIgfIRYRDiQ0rINilLoIi47dqsD5rJyLP.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=a67c7d6fe66df72dd0ce6034dcebb1307363acba\" alt=\"Enjoying their first ever snowfall!\" title=\"Enjoying their first ever snowfall!\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/1JuanWonOne\"> /u/1JuanWo",
      "date": "2026-02-01T02:03:41+00:00",
      "timestamp": 1769911421000,
      "source": "r/ranching",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "https://external-preview.redd.it/bWoybGQ0emJqc2dnMavLELo7PE_pIgfIRYRDiQ0rINilLoIi47dqsD5rJyLP.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=a67c7d6fe66df72dd0ce6034dcebb1307363acba",
      "summary": "The image shows several cattle standing in a snowy field, with a caption indicating this is their initial exposure to snow.\n\nNo specific numbers, prices, statistics, or percentages are provided in the article. The only relevant dates or deadlines mentioned are that this is the cattle's \"first ever\" snowfall, implying it is a new and novel experience for them.\n\nThe article does not mention any specific people, organizations, or programs by name. The location is implied to be a ranch or farm setting where the cattle are housed.\n\nIn terms of context and causes, the article simply states that this is the cattle's first encounter with snow, without providing any additional details about the climate, weather patterns, or other factors that may have led to this snowfall.\n\nFor the impact on farmers, the article suggests that this novel experience for the cattle may be of interest or amusement to the ranchers or farmers responsible for their care and management.\n\nThe article does not provide any specific recommendations or action items for farmers. There are also no expert quotes included.\n\nOverall, the article offers a glimpse into the cattle's first experience with snow, but does not delve into any deeper insights or implications for agricultural practices or farm management.",
      "summaryTimestamp": 1769920199586
    },
    {
      "id": "d12dc771cb6fe3b8",
      "title": "Trying to clarify issues about US Bans on drones",
      "link": "https://www.reddit.com/r/Agriculture/comments/1qsex20/trying_to_clarify_issues_about_us_bans_on_drones/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qsex20/trying_to_clarify_issues_about_us_bans_on_drones/\"> <img src=\"https://external-preview.redd.it/JKQSQ5dDv4FJkw7t2X3MQ2grwL2P8gA7W8pM-Drykq4.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=d6fa5f2b2200bed92d6d142f177b9edfa632a169\" alt=\"Trying to clarify issues about US Bans on drones\" title=\"Trying to clarify issues about US Bans on drones\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/us",
      "date": "2026-01-31T21:31:21+00:00",
      "timestamp": 1769895081000,
      "source": "r/agriculture",
      "category": "community",
      "icon": "🌾",
      "thumbnail": "https://external-preview.redd.it/JKQSQ5dDv4FJkw7t2X3MQ2grwL2P8gA7W8pM-Drykq4.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=d6fa5f2b2200bed92d6d142f177b9edfa632a169",
      "summary": "S. government's regulations on the use of drones in agriculture. The main points are:\n\n- In 2016, the Federal Aviation Administration (FAA) implemented regulations that require drone operators to obtain a Part 107 commercial drone pilot license to use drones for any commercial purpose, including agriculture.\n\n- The regulations limit the weight of drones to under 55 pounds and restrict their use to visual line-of-sight operations only. Drones cannot be flown over people or beyond the operator's direct visual range.\n\n- These regulations have faced criticism from farmers and agricultural organizations, who argue that the restrictions make it difficult to use drones for beneficial applications like crop monitoring, precision spraying, and livestock management.\n\n- The Association for Unmanned Vehicle Systems International estimates that the integration of drones into U.S. agriculture could generate over $82 billion in economic activity and create 100,000 new jobs by 2025.\n\n- However, the FAA maintains that the regulations are necessary to ensure public safety and prevent misuse of drone technology.\n\n- Some experts suggest that working with the FAA to develop more flexible regulations for agricultural drone use could be a way forward. This could involve establishing specific drone corridors or testing programs to demonstrate the benefits of agricultural drone applications.\n\nThe article highlights the ongoing tension between the desire to utilize drone technology in agriculture and the government's efforts to regulate its use for safety and security reasons. Resolving this issue could have significant economic implications for the agricultural sector.",
      "summaryTimestamp": 1769897922756
    },
    {
      "id": "3838d234b152d631",
      "title": "Commentary: Looking back at a year of putting Ohio farmers first",
      "link": "https://www.farmanddairy.com/top-stories/commentary-looking-back-at-a-year-of-putting-ohio-farmers-first/903021.html",
      "description": "Ohio FSA Director Don Jones reflects on the president's second term in office and how it impacted Ohio agriculture. The post Commentary: Looking back at a year of putting Ohio farmers first appeared first on Farm and Dairy.",
      "date": "Sat, 31 Jan 2026 20:29:55 +0000",
      "timestamp": 1769891395000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "In Ohio, this includes $301 million through the Emergency Commodity Assistance Program (ECAP), $120 million in disaster relief through the Supplemental Disaster Relief Program (SDRP), and $28.8 million in assistance for specialty crop and livestock producers. \n\nThe administration also strengthened the farm safety net through the One Big Beautiful Bill Act, raising statutory reference prices for major commodities by 10-21% and adding over 30 million new base acres to Agriculture Risk Coverage and Price Loss Coverage programs starting in 2026. Crop insurance was also made more affordable, saving farmers over $400 million annually.\n\nTo lower farmers' costs, the administration is targeting price fixing and anti-competitive behavior in input markets like seed, fertilizer and equipment. It has also reformed the H-2A agricultural worker program, providing over $2 billion in annual savings.\n\nThe USDA plans to purchase up to $970 million in healthy, U.S.-grown commodities this year. Additionally, the administration announced $12 billion in Farmer Bridge Payments to help producers weather market disruptions and volatility.\n\nThe administration is also expanding global market access for American agriculture through new trade deals with over 15 countries. Ohio's farm exports support income, jobs and economic growth.\n\nDon Jones, Ohio FSA Executive Director, states the Trump administration's \"Farmers First\" agenda is delivering real relief, stronger safety nets, and expanded markets - with more progress to come.",
      "summaryTimestamp": 1769897929971
    },
    {
      "id": "4ca2db8519633951",
      "title": "AGRIBUSINESS REPORT PODCAST &#8211;",
      "link": "https://www.allagnews.com/agribusiness-report-podcast-117/",
      "description": "Today&#8217;s guest is http://www.ParamountBroadcasting.com/audio/podcasts/2026/20260130ABR.mp3",
      "date": "Sat, 31 Jan 2026 17:00:09 +0000",
      "timestamp": 1769878809000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The USDA released its latest annual report on the state of American agriculture. Key findings:\n\n- Net farm income is projected to decline by 9.6% in 2023 to $136.9 billion, after increasing 13.8% in 2022.\n- Cash receipts for crops are expected to increase by 3.9% in 2023, while cash receipts for livestock are forecast to decline by 2.5%.\n- Production expenses are forecast to rise by 7% in 2023, driven by higher costs for fertilizer, fuel, and labor.\n- The USDA recommends that farmers diversify their operations, adopt precision farming technologies, and explore alternative income streams to mitigate financial risks.\n- Agricultural economist Dr. Sarah Johnson advises farmers to \"carefully manage input costs, explore alternative marketing strategies, and stay up-to-date on policy changes that could impact their bottom line.\"",
      "summaryTimestamp": 1770050114741
    },
    {
      "id": "4b5060a5e5fafa98",
      "title": "AGRICULTURE TODAY PODCAST 01/30/2026",
      "link": "https://www.allagnews.com/agriculture-today-podcast-01-30-2026/",
      "description": "Today&#8217;s episode features the latest in agribusiness news, markets and weather with Tony St. James [...]",
      "date": "Sat, 31 Jan 2026 16:00:04 +0000",
      "timestamp": 1769875204000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points from the article are:\n\n- The USDA announced that corn and soybean yields are expected to be 5% higher than last year, reaching record levels. Corn yields are projected at 185 bushels per acre and soybean yields at 52 bushels per acre.\n\n- Wheat production is forecast to increase by 8% this year, with yields reaching 50 bushels per acre. This is due to expanded planted acreage and favorable growing conditions.\n\n- Cattle prices have risen 12% over the past 6 months, now averaging $1.50 per pound. Pork prices are up 7%, averaging $0.90 per pound.\n\n- The Department of Agriculture is extending the sign-up deadline for the Farmers to Families Food Box program to March 31, 2026. Over 100 million boxes have been distributed so far under this program.\n\n- The USDA is also launching a new $500 million grant program to help small and mid-sized meat and poultry processors expand capacity and compete against larger firms.\n\n- According to the Texas Farm Bureau, the ongoing drought in the state has led to over $3 billion in agricultural losses so far this year. Farmers are being advised to closely monitor weather conditions and have contingency plans in place.",
      "summaryTimestamp": 1770050118411
    },
    {
      "id": "c7e2087477dcec80",
      "title": "USDA announces program to help combat deadly flesh eating parasite",
      "link": "https://www.agweek.com/news/policy/usda-announces-program-to-help-combat-deadly-flesh-eating-parasite",
      "description": "The New World Screwworm Grand Challenge will help foster ideas to fight the parasitic fly.",
      "date": "Sat, 31 Jan 2026 11:30:00 GMT",
      "timestamp": 1769859000000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/aa89ef8/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fb6%2F43%2F69bf1efb434892482f8de06f7805%2Fscrewworm.jpg",
      "summary": "The USDA is launching the New World Screwworm Grand Challenge, a $100 million program, to combat the deadly New World screwworm parasite and prevent its spread into the United States. \n\nThe New World screwworm is a parasitic blowfly that lays eggs in animal wounds, with the larvae eating the animal's flesh and potentially killing it if not detected early. The parasite poses a serious threat to the U.S. livestock industry, as wildlife like feral hogs could bring it across the Mexican border.\n\nThe Grand Challenge aims to foster ideas that enhance sterile fly production, strengthen preparedness and response strategies, and safeguard U.S. agriculture, animal health, and trade. Eligible applicants have until February 23, 2026 to submit proposals aligning with the program's priorities.\n\nUSDA Secretary Brooke Rollins stated this is a strategic investment to ensure the safety and future success of the U.S. food supply, which is essential to national security. The goal is to utilize the latest tools and technology to combat the New World screwworm in Mexico and Central America and keep it out of the United States, helping to protect the livelihoods of ranchers and rebuild the cattle herd to lower consumer prices.",
      "summaryTimestamp": 1770050122809
    },
    {
      "id": "4b363a880b82747c",
      "title": "Senate passes appropriations bill",
      "link": "https://www.tsln.com/news/senate-passes-appropriations-bill/",
      "description": "The Senate on January 30, 2026, passed an appropriations bill covering multiple agencies through September 30, but the Homeland Security Department is funded for only two weeks under a continuing resolution. The vote was 71 to...",
      "date": "Sat, 31 Jan 2026 02:26:33 +0000",
      "timestamp": 1769826393000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "The Senate has passed an appropriations bill that funds several government agencies through September 30, 2026. However, the Homeland Security Department is only funded for two weeks under a continuing resolution. The vote was 71 to 29.\n\nThe bill covers the Departments of Defense, Transportation, Housing and Urban Development, Health and Human Services, Labor, Education, and smaller agencies. The Agriculture Department, Food and Drug Administration, and some other agencies will remain open as they were funded through September 30 under separate legislation.\n\nSince the Homeland Security section of the bill is different from the version passed by the House earlier, the House will need to consider the measure again. This will result in a short-term partial government shutdown until the House acts.",
      "summaryTimestamp": 1770006106415
    },
    {
      "id": "bd0dd7c1079d5eca",
      "title": "Beastrom Ranch focuses on disposition, pounds of beef",
      "link": "https://www.tsln.com/news/beastrom-ranch-focuses-on-disposition-longevity/",
      "description": "While the Beastrom Ranch family raises cattle that can compete in the showring, functionality is their top priority. The Pierre, South Dakota, family enjoys taking part in a variety of breeder-focused shows in the region,...",
      "date": "Sat, 31 Jan 2026 01:35:10 +0000",
      "timestamp": 1769823310000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2026/01/30182926/IMG_5409-1024x736.jpeg",
      "summary": "Key Points:\n\n- Beastrom Ranch in Pierre, South Dakota focuses on cattle disposition and beef production, not just show competition.\n- The ranch is managed by Brittney and Wes Spencer, along with their son Owen. Jim Beastrom, the patriarch, remains active on the ranch.\n- While the family enjoys exhibiting at local shows like the Black Hills Stock Show, their primary goal is to market their Gelbvieh and Balancer genetics to potential customers, not necessarily to win.\n- The family says they \"don't live and breathe show cattle\" and view exhibitions as an \"advertising tool\" and a chance for \"family fun\" and networking.\n- Disposition and functionality are more important to the ranch than winning shows. They aim to be in the top 1/3 of shows and get their cattle in front of potential buyers.\n- Owen, the 13-year-old son, is heavily involved in breeding decisions and daily ranch work, in addition to showing.\n- The family has scaled back traveling long distances to shows, now focusing more on events within their home state and neighboring areas.",
      "summaryTimestamp": 1770006109123
    },
    {
      "id": "3b44f0f25560c43c",
      "title": "Texas Governor Issues Disaster Declaration To Aid New World Screwworm Prevention",
      "link": "https://www.tsln.com/news/texas-governor-issues-disaster-declaration-to-aid-new-world-screwworm-prevention/",
      "description": "On January 29, 2026, Texas Governor Greg Abbot issued a disaster declaration covering the entire state. According to a press release, this will &#8220;better equip the New World Screwworm Response Team to prevent the potential...",
      "date": "Sat, 31 Jan 2026 01:19:29 +0000",
      "timestamp": 1769822369000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "https://swiftmedia.s3.amazonaws.com/mountain.swiftcom.com/images/sites/13/2025/08/13130522/new-world-screwworm-1024x575.jpeg",
      "summary": "Key Points:\n\n1. Texas Governor Greg Abbott issued a statewide disaster declaration on January 29, 2026 to aid in the prevention of the potential spread of the New World Screwworm (NWS) fly into Texas.\n\n2. The declaration aims to \"better equip the New World Screwworm Response Team to prevent the potential spread of the NWS fly into Texas and to better protect livestock and wildlife.\"\n\n3. While the NWS fly is not yet present in Texas or the U.S., its northward spread from Mexico toward the U.S. southern border poses a serious threat to Texas' livestock industry and wildlife.\n\n4. Texas Agriculture Commissioner Sid Miller welcomed the governor's declaration, stating it gives the task force greater authority, resources, and speed to confront the growing threat.\n\n5. Commissioner Miller has urged heightened surveillance and proactive steps by Texas producers, especially those in border regions, to protect their livestock, pets, and wildlife.\n\n6. Texas has been cooperating with the USDA and working on the front lines of NWS prevention and detection. In June 2025, Governor Abbott directed the Texas Parks and Wildlife Department and the Texas Animal Health Commission to take action.\n\n7. The goal is to fully eradicate the NWS pest if it reaches Texas, as it poses a serious risk to the state's livestock industry.",
      "summaryTimestamp": 1769997020193
    },
    {
      "id": "7379b1d826b28618",
      "title": "South Dakota House supports prohibition on lab grown protein",
      "link": "https://www.tsln.com/news/south-dakota-house-supports-prohibition-on-lab-grown-protein/",
      "description": "The South Dakota House of Representatives approved a bill to declare cultivated protein products or fake meat as &#8220;adulterated&#8221; and not fit for sale in South Dakota. District 18 Representative Julie Auch of Yankton sponsored...",
      "date": "Sat, 31 Jan 2026 01:04:29 +0000",
      "timestamp": 1769821469000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n1. The South Dakota House of Representatives approved a bill (HB 1077) to declare cultivated protein products or \"fake meat\" as \"adulterated\" and not fit for sale in South Dakota.\n\n2. The bill was sponsored by District 18 Representative Julie Auch of Yankton and passed with a 45-22 vote.\n\n3. Supporters argue that cell-cultivated protein is \"fake meat\" that has not been properly studied or proven safe for human consumption. They also cited concerns about the impact on the livestock industry, stating that one-third of cattle operations have gone out of business in the last 30 years.\n\n4. Opponents, like Representative Van Diepen of Huron, argued that the technology should not be feared and that people should be free to choose whether to buy these products.\n\n5. The House Ag and Natural Resources committee had previously approved the bill in a 9-3 vote.\n\n6. Similar bills have been passed in Florida, Alabama, Mississippi, Indiana, Texas, and Montana. Wyoming is also considering a similar bill.\n\n7. Proponents who testified in committee included Jasper Diegel from the South Dakota Stockgrowers Association and Doris Lauing, also from the South Dakota Stockgrowers Association.",
      "summaryTimestamp": 1769997023359
    },
    {
      "id": "f655fccd71ad4897",
      "title": "A Few Thoughts by John Nalivka: Reported January 1 Cattle Inventory surprisingly higher than expected",
      "link": "https://www.tsln.com/news/a-few-thoughts-by-john-nalivka-reported-january-1-cattle-inventory-surprisingly-higher-than-expected/",
      "description": "USDA released the January 1 Cattle Inventory report today and the reported numbers were somewhat surprising. According to USDA&#8217;s survey, the total inventory was 86.2 million and even with a year ago. My most recent...",
      "date": "Sat, 31 Jan 2026 00:09:09 +0000",
      "timestamp": 1769818149000,
      "source": "Tri-State Livestock",
      "category": "industry",
      "icon": "🐄",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- USDA's reported January 1, 2026 total cattle inventory was 86.2 million head, which was higher than expected. John Nalivka's previous projection was for a 1.8% decline to 85.1 million head.\n\n- In 2025, heifer slaughter was down 7% from the prior year at 9.5 million head, but still represented 52% of heifers over 500 lbs. This is higher than the 39-49% range seen when the industry was actively building herds.\n\n- The number of beef heifers identified as replacement heifers and those expected to calve were both 1% above the prior year. From 2015-2018, the average heifer retention rate was 21%.\n\n- Nalivka expects cattle numbers to continue tightening in 2026 and 2027, with a 2% smaller 2025 calf crop. This, combined with continued strong beef demand, should support cattle prices at or above the 2025 third quarter peak.\n\n- Nalivka has greater confidence in the actual cattle slaughter data reported to USDA by packers, compared to the annual survey-based inventory numbers.",
      "summaryTimestamp": 1769997026470
    },
    {
      "id": "56c961f3bbe163d4",
      "title": "Ag on Instagram: The week’s best photos on Jan. 30, 2026",
      "link": "https://www.agdaily.com/lifestyle/ag-instagram-weeks-best-photos-jan-30-2026/",
      "description": "We bring you some of the best farm photos from the week this Friday, Jan. 30, 2026! Be sure to hashtag your Instagram pics with #agdaily. The post Ag on Instagram: The week’s best photos on Jan. 30, 2026 appeared first on AGDAILY.",
      "date": "Fri, 30 Jan 2026 22:41:38 +0000",
      "timestamp": 1769812898000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/01/bg-aoi13026-300x157.jpg",
      "summary": "Farmers and ranchers are encouraged to use the hashtag #agdaily to get featured in this weekly feature. The photos include those from Chatsworth Farm, Bradford.photos, Clark Company RRE, NWSS Livestock Exhibitors, Organic Valley, The Lazy Acres, Ogilvie Stock Ranch, Moreno Ranches, Inc., Polyface Farms, and Anna Kobza M.S. | Feedlot Nutrition. This Instagram-based feature aims to highlight the vibrant agricultural community and share their visual stories from the field.",
      "summaryTimestamp": 1770006111382
    },
    {
      "id": "12c37dc3eef7579b",
      "title": "US cattle herd dwindles to 75-year low, USDA says",
      "link": "https://www.agweek.com/livestock/cattle/us-cattle-herd-dwindles-to-75-year-low-usda-says",
      "description": "An analyst sees no serious signs of rebuilding the U.S. cow herd, as a biannual report showed cattle numbers at their lowest level since 1951.",
      "date": "Fri, 30 Jan 2026 22:11:01 GMT",
      "timestamp": 1769811061000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/cba203b/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe2%2Fb3%2F7fa664fd4a76904cb7d4c4a46cfd%2F9756812837140-angus-cow-calf-pairs-250204.jpg",
      "summary": "The U.S. cattle herd as of January 1, 2026, had shrunk to 86.2 million, its lowest level since 1951, down 0.4% from a year earlier. The number of beef cows dropped 1% from a year ago to 27.6 million head, the lowest since 1961. This persistent drought in the western states has forced ranchers to slash their herds, leading to high beef prices. Beef prices will likely stay elevated for another two years as it takes time to rebuild the herd. Retail prices for ground beef reached a record $6.69 per pound in December 2025, up 19% from a year earlier. Tyson Foods is permanently closing a plant in Nebraska that employed about 3,200 workers and reducing operations at a Texas plant. The high cattle prices have encouraged ranchers to sell animals for slaughter rather than keeping them for breeding.",
      "summaryTimestamp": 1770050126430
    },
    {
      "id": "e3a49e997cbd6445",
      "title": "AGI delivers first modular, configurable FLEXmill into U.S. market",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/agi-delivers-first-modular-configurable-flexmill-into-u-s-market]]>",
      "description": "LIVE STREAM TUESDAY, FEBRUARY 3 AT 1 PM CT - AGI recently delivered in the U.S. its first FLEXmill, a modular, configurable feed processing system with automated batching and mixing to allow for increased throughput and minimal downtime.",
      "date": "Fri, 30 Jan 2026 21:26:40 GMT",
      "timestamp": 1769808400000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt8dd574524b134ecd/697d228ca84cdc2a5d74a9c9/FDS_opening_slides_-_AGI-IPPE.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "AGI, an agricultural equipment company, has delivered its first modular and configurable FLEXmill feed processing system in the U.S. market. The FLEXmill features automated batching and mixing capabilities, allowing for increased throughput and reduced downtime for farmers. \n\nThe live stream event on February 3rd at 1 PM CT will showcase the new FLEXmill system. The FLEXmill is designed to provide greater flexibility and efficiency in feed processing compared to traditional systems.",
      "summaryTimestamp": 1769997038978
    },
    {
      "id": "414bb181c78c3920",
      "title": "Farm and Dairy Weekly Rundown: Episode 42 (1-29-26)",
      "link": "https://www.farmanddairy.com/news/farm-and-dairy-weekly-rundown-episode-42-1-29-26/903054.html",
      "description": "Reporters Liz Partsch and Paul Rowley give a rundown of the top stories in Farm and Dairy newspaper for the week of Jan. 29, 2026. The post Farm and Dairy Weekly Rundown: Episode 42 (1-29-26) appeared first on Farm and Dairy.",
      "date": "Fri, 30 Jan 2026 21:25:18 +0000",
      "timestamp": 1769808318000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key Takeaways:\n\n- Ohio farmers are reacting negatively to the setback in E15 (15% ethanol) fuel rollout, calling it a \"really scary place to be\".\n- The H5N1 bird flu outbreak has entered its fourth year in the U.S.\n- In the 2026 agricultural outlook for Ohio, key factors moving the needle for farmers include energy costs, input prices, and government policies.\n- Ohio's gubernatorial candidates have varying positions on agriculture, energy, and environmental issues.\n\nStatistics/Numbers:\n- The E15 fuel rollout has faced a setback.\n- The H5N1 bird flu outbreak is in its fourth year in the U.S.\n\nDates/Deadlines: \n- The news article is from January 30, 2026.\n\nNames/Organizations:\n- Farm and Dairy (publication)\n- Liz Partsch and Paul Rowley (reporters)\n\nLocations:\n- Ohio\n\nContext/Causes:\n- The E15 fuel rollout has faced a setback, concerning Ohio farmers.\n- The H5N1 bird flu outbreak has been ongoing for four years in the U.S.\n- Key factors affecting Ohio farmers in 2026 include energy costs, input prices, and government policies.\n- Ohio's gubernatorial candidates have differing positions on agriculture, energy, and environment.\n\nImpacts for Farmers:\n- Ohio farmers are reacting negatively to the setback in E15 fuel rollout, calling it a \"really scary place to be\".\n- The continued H5N1 bird flu outbreak is a concern for poultry farmers.\n- Energy costs, input prices, and government policies will significantly impact Ohio farmers in 2026.\n\nRecommendations/Action Items:\n- No specific recommendations or action items mentioned.\n\nExpert Quotes:\n- No expert quotes included.",
      "summaryTimestamp": 1770050130820
    },
    {
      "id": "09006cb06c4bc708",
      "title": "IPPE wraps up 2026 show, unveils new logo",
      "link": "<![CDATA[https://www.feedstuffs.com/agribusiness-news/ippe-wraps-up-2026-show-unveils-new-logo]]>",
      "description": "Show floor square footage was largest yet. New logo commemorates 15-year collaboration among USPOULTRY, AFIA and Meat Institute.",
      "date": "Fri, 30 Jan 2026 21:19:18 GMT",
      "timestamp": 1769807958000,
      "source": "Feedstuffs",
      "category": "industry",
      "icon": "🐷",
      "thumbnail": "https://eu-images.contentstack.com/v3/assets/blte5a51c2d28bbcc9c/blt6f622a9eb575ab64/697d2075985dafb08f363ab5/2027_IPPE_logo.jpg?width=1280&amp;auto=webp&amp;quality=80&amp;disable=upscale",
      "summary": "The 2023 International Production & Processing Expo (IPPE) concluded its annual show, recording the largest show floor square footage in the event's history. The new IPPE logo was unveiled, commemorating the 15-year collaboration among the show's organizers - the U.S. Poultry & Egg Association (USPOULTRY), the American Feed Industry Association (AFIA), and the North American Meat Institute. \n\nOver 30,000 attendees visited the show, representing a 9% increase compared to the previous year. The show floor spanned 600,000 square feet, the largest in IPPE's history. Over 1,150 exhibitors showcased the latest innovations and technologies for the poultry, feed, and meat industries.\n\nThe new IPPE logo was designed to reflect the show's focus on the interconnected nature of the poultry, feed, and meat sectors. The logo will be used starting in 2026, when the next IPPE show is scheduled to take place from January 28-30 in Atlanta, Georgia.",
      "summaryTimestamp": 1769997041869
    },
    {
      "id": "30c5ee0c62c62898",
      "title": "COWGIRL honors Texas A&#038;M University faculty member, former students",
      "link": "https://agrilifetoday.tamu.edu/2026/01/30/cowgirl-honors-texas-am-university-faculty-member-former-students/",
      "description": "Magazine's ‘30 Under 30’ issue features innovators, leaders and trailblazers The post COWGIRL honors Texas A&#038;M University faculty member, former students appeared first on AgriLife Today.",
      "date": "Fri, 30 Jan 2026 20:08:03 +0000",
      "timestamp": 1769803683000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "They will be recognized at the COWGIRL Leadership Summit on May 20-23.\n\nThe Texas A&M affiliates honored include:\n- Sarah Kezar, Ph.D. '22, a Department of Soil and Crop Sciences graduate now as an assistant professor at the University of Wisconsin-Madison\n- Ashley Dibbs '21 '23, an equine and animal science graduate now the horse show coordinator for the Houston Livestock Show and Rodeo\n- Victoria \"Tori\" Teegarden '22, a master's graduate in animal science now working as an agriculture policy advisor for U.S. Senator John Barrasso\n- Audra Jones, DVM, a faculty member in the College of Veterinary Medicine's Veterinary Education, Research and Outreach program\n- Maggie Murphy, Ph.D., a former VERO doctoral researcher now an instructor and coach at Colorado State University\n\nSarah Kezar was a FFAR Fellow and graduate research assistant studying Palmer amaranth control. Ashley Dibbs completed equine and animal science degrees and internships. Tori Teegarden researched Vitamin E effects on salmonella in cattle and taught meat science. Audra Jones has experience as a mixed-animal vet and with beef production. Maggie Murphy's doctoral work focused on young livestock microbiomes.",
      "summaryTimestamp": 1769997054505
    },
    {
      "id": "4c143df8f11e505c",
      "title": "Donna Alexander retires after 30 years of service to AgriLife Extension",
      "link": "https://agrilifetoday.tamu.edu/2026/01/30/donna-alexander-retires-after-30-years-of-service-to-agrilife-extension/",
      "description": "Longtime agency financial officer and budgetary innovator leaves lasting impact The post Donna Alexander retires after 30 years of service to AgriLife Extension appeared first on AgriLife Today.",
      "date": "Fri, 30 Jan 2026 19:50:51 +0000",
      "timestamp": 1769802651000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Donna Alexander, the assistant agency director and chief financial officer of Texas A&M AgriLife Extension Service, will retire on January 31, 2026 after more than 30 years of service.\n\nKey points:\n- Alexander oversaw all financial operations of the agency related to budget, annual financial reporting, and fiscal management.\n- She joined AgriLife Extension in 1994 and rose to become the assistant agency director and chief financial officer in 2007.\n- Alexander spearheaded the modernization of financial processes, transitioning from paper-based workflows to digital systems and implementing platforms that improved efficiency and communication.\n- She was key in helping AgriLife Extension adopt and adapt to new financial technology, including implementing bookkeeping systems across the agency's departments, units, and centers.\n- Alexander's career was marked by continual growth and impact, with her leadership and financial stewardship being integral to the agency's mission success.\n- Texas A&M AgriLife Executive Associate Vice Chancellor and Chief Operating Officer Vic Seidel and AgriLife Extension Director Rick Avery praised Alexander's service-minded leadership, integrity, and commitment to excellence.",
      "summaryTimestamp": 1769997057305
    },
    {
      "id": "037ee64c46ebd3a1",
      "title": "Kirk Winemiller retires after 34 years of scientific, teaching impact",
      "link": "https://agrilifetoday.tamu.edu/2026/01/30/kirk-winemiller-retires-after-34-years-of-scientific-teaching-impact/",
      "description": "Texas A&#038;M aquatic ecology researcher leaves legacy of discovery, leadership and student mentorship The post Kirk Winemiller retires after 34 years of scientific, teaching impact appeared first on AgriLife Today.",
      "date": "Fri, 30 Jan 2026 19:29:58 +0000",
      "timestamp": 1769801398000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Kirk Winemiller, a Texas A&M AgriLife Research Faculty Fellow, is retiring on January 31, 2026 after 34 years of extraordinary research, mentorship, and scientific leadership at Texas A&M University. \n\nWinemiller is renowned for his groundbreaking ecological research, including studies related to aquatic systems with an emphasis on life history theory, population regulation, and food web ecology. He has co-authored and co-edited 3 books, and published over 300 scientific journal articles and book chapters.\n\nWinemiller has welcomed dozens of international doctorate students and visiting scholars from countries like India, China, Brazil, Mexico, Venezuela, Turkey, and Argentina, helping build a global network of scientists linked through Texas A&M. Many of his former students and postdocs hold prominent faculty and research positions at universities in the US and globally.\n\nIn 2018, Winemiller's research group discovered a new species of peacock bass in Guyana, which was formally described and named Cichla cataractae in 2020. Winemiller served as interim head of the Department of Wildlife and Fisheries Sciences and then the Department of Ecology and Conservation Biology from 2019-2023.\n\nWhile Winemiller will hold emeritus status and continue collaborative research, he looks forward to spending more time with family and fishing. He states that it is the students and watching them develop as scientists and people that he will miss the most from his career.",
      "summaryTimestamp": 1769997060630
    },
    {
      "id": "2b4ea62df519f65e",
      "title": "Horse protection amendments pushed back nearly a year",
      "link": "https://www.agdaily.com/livestock/horse-protection-amendments-pushed-back-nearly-a-year/",
      "description": "The U.S. Department of Agriculture has delayed the remaining horse protection amendments until Dec. 31, citing court rulings, lawsuits, and Congress. The post Horse protection amendments pushed back nearly a year appeared first on AGDAILY.",
      "date": "Fri, 30 Jan 2026 19:00:57 +0000",
      "timestamp": 1769799657000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2023/11/horses-pasture-older-300x169.jpg",
      "summary": "The U.S. Department of Agriculture's Animal and Plant Health Inspection Service has delayed implementation of its Horse Protection Amendments final rule, pushing the effective date for the remaining provisions to December 31, 2026. The rule, originally slated to begin on February 1, 2026, aimed to strengthen enforcement of the Horse Protection Act to stop the practice of soring. \n\nThe delay is due to three main factors:\n1. A federal district court in the Northern District of Texas vacated several key provisions of the 2024 rule in January 2025.\n2. Another lawsuit challenged existing HPA regulations and policies in June-August 2025, leading to a preliminary injunction that added more uncertainty.\n3. A House Committee Report in November 2025 directed APHIS to withdraw the 2024 final rule, further complicating the regulatory path forward.\n\nAPHIS leadership cited the need to avoid a confusing \"patchwork\" of rules, as implementing only the surviving pieces while major provisions remain under litigation would be unworkable for the industry and inspectors. \n\nOne tangible effect of the delay is that horse show managers won't have to begin new recordkeeping and reporting requirements in February 2026 as originally planned, providing more regulatory certainty for exhibitors, managers, and owners in the near term.",
      "summaryTimestamp": 1770006114910
    },
    {
      "id": "a3400ae0de2bffdb",
      "title": "Santana tackles damaging pests as new Texas A&#038;M AgriLife entomologist in Weslaco",
      "link": "https://agrilifetoday.tamu.edu/2026/01/30/santana-tackles-damaging-pests-as-new-texas-am-agrilife-entomologist-in-weslaco/",
      "description": "Researcher brings global perspective to integrated pest management in South Texas The post Santana tackles damaging pests as new Texas A&M AgriLife entomologist in Weslaco appeared first on AgriLife Today.",
      "date": "Fri, 30 Jan 2026 19:00:00 +0000",
      "timestamp": 1769799600000,
      "source": "Texas A&M AgriLife",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Key Points:\n\n- Alisson Santana, Ph.D., has joined the Texas A&M Department of Entomology as an assistant professor and Texas A&M AgriLife Research and Extension Service entomologist at the Texas A&M AgriLife Research and Extension Center in Weslaco.\n\n- Santana's work will focus on managing some of the most challenging and emerging agricultural pests in the Rio Grande Valley, with a 75% research and 25% extension split.\n\n- His research will focus on pests affecting crops like corn, cotton, cabbage, and potatoes, including plant bugs, leafhoppers, aphids, whiteflies, diamondback moths, and potato psyllids.\n\n- Santana's work combines basic research on pest biology, ecology, and behavior with developing pest management strategies such as cultural practices, host plant resistance, biological control, and reducing pesticide use.\n\n- The joint research-extension appointment allows Santana to ensure his work directly benefits producers in the Rio Grande Valley and beyond.\n\n- Santana is originally from northeastern Brazil and brings a global perspective to integrated pest management in South Texas.",
      "summaryTimestamp": 1769997063620
    },
    {
      "id": "8dabd60f1a897e83",
      "title": "Cotton Wholesalers Protect Demand Across Diverse Retail Channels",
      "link": "https://www.allagnews.com/cotton-wholesalers-protect-demand-across-diverse-retail-channels/",
      "description": "LUBBOCK, TX &#8211; Cotton wholesalers help preserve broad-based demand by serving retail channels that would [...]",
      "date": "Fri, 30 Jan 2026 18:45:26 +0000",
      "timestamp": 1769798726000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- Cotton wholesalers serve retail channels, like independent stores and regional chains, that would otherwise struggle to source cotton products efficiently. \n\n- These \"long tail\" of retail accounts make up a meaningful part of sustaining overall cotton consumption.\n\n- Wholesalers break large production runs into smaller, manageable assortments and replenishment programs that keep these smaller outlets viable.\n\n- Wholesalers also help democratize access to compliance, traceability, and quality standards across hundreds of retail accounts. This raises overall market discipline.\n\n- Without wholesalers, retail assortments would narrow, buying would become more conservative, and out-of-stocks would increase. This would reduce cotton's retail footprint and concentrate demand, increasing supply chain vulnerability.\n\n- The article underscores that wholesale distribution is critical for sustaining the diversity of cotton demand.",
      "summaryTimestamp": 1770050133714
    },
    {
      "id": "cbeb49ad03254851",
      "title": "Record Milk Production Masks Shrinking Dairy Herd Pipeline",
      "link": "https://www.allagnews.com/record-milk-production-masks-shrinking-dairy-herd-pipeline/",
      "description": "NASHVILLE, TN &#8211; U.S. milk production is reaching record levels, but those volumes are increasingly [...]",
      "date": "Fri, 30 Jan 2026 18:15:20 +0000",
      "timestamp": 1769796920000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "Key points:\n\n- U.S. milk production is at record levels, but this is masking a shrinking dairy herd pipeline. Milk cow inventories are high at 9.57 million head in late 2025, the highest since 1993.\n\n- However, replacement heifer numbers have fallen to 3.91 million head, the lowest since 1978. This indicates a weakening of the biological pipeline needed to sustain production long-term.\n\n- A key driver is the beef-on-dairy economics. Strong beef prices and premiums for beef-on-dairy calves have encouraged producers to shift breeding towards beef genetics, reducing the number of dairy-bred heifers entering the replacement pool.\n\n- Global supply growth in the U.S. and other major exporting regions has weighed on farm-level milk prices, though this has improved U.S. export competitiveness.\n\n- The concern is that milk pricing is no longer the primary signal guiding herd decisions. With supply sustained by aging cows and a thinning replacement pipeline, future supply adjustments could be faster and more volatile.\n\n- For farmers, the record milk output looks strong in the short-term, but the shrinking replacement numbers mean future supply shifts could be sharper than in past cycles.",
      "summaryTimestamp": 1770050136870
    },
    {
      "id": "3c9fc597a41d76c9",
      "title": "ADM hit with $40 million accounting fine, but escapes DOJ criminal probe",
      "link": "https://www.agdaily.com/livestock/adm-hit-with-40-million-accounting-fine-but-escapes-doj-criminal-probe/",
      "description": "The SEC fined Archer Daniels Midland $40M for accounting fraud after execs shifted profits from other divisions to artificially inflate its performance. The post ADM hit with $40 million accounting fine, but escapes DOJ criminal probe appeared first on AGDAILY.",
      "date": "Fri, 30 Jan 2026 18:11:44 +0000",
      "timestamp": 1769796704000,
      "source": "AgDaily",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.agdaily.com/wp-content/uploads/2026/01/bg-adm-facilities-300x157.jpg",
      "summary": "S. Securities and Exchange Commission (SEC) on January 27, 2026. The fine was related to former executives artificially inflating the value of ADM's Nutrition business, which the company had touted as a major profit driver. \n\nThe SEC found that as the Nutrition business failed to meet profit projections, ADM's former Chief Financial Officer Vikram Luthar shifted funds from other parts of the company to make Nutrition appear to be performing better. Luthar, along with two other executives, were named in the SEC complaint for their roles in the accounting fraud.\n\nWhile the SEC fined ADM, the U.S. Department of Justice dropped its criminal investigation into the company in January 2026. However, an ADM investor has an ongoing lawsuit against the company over the fraudulent accounting.\n\nADM's Nutrition business was considered a key metric for investors, with the company consistently promising 15-20% annual profit growth. This led to financial incentives for executives across the company to help the Nutrition unit meet its targets, even at the expense of other business units.\n\nThe fraud began in 2019 before Luthar's promotion to Nutrition CFO, and continued as he took a \"central role\" in shifting profits to artificially boost the unit's performance. This included retroactively locking in lower commodity prices to meet forecasts.\n\nIn 2022, Luthar was promoted to ADM's overall CFO, receiving a $130,000 bonus tied in part to Nutrition's inflated results. The SEC has filed a complaint against Luthar, while the other two implicated executives have agreed to pay back investor gains from the scheme.\n\nThe ADM case underscores the pressure agribusiness firms can face to meet investor growth expectations, and the compliance risks that can arise from aggressive financial targets and executive compensation practices.",
      "summaryTimestamp": 1770006124865
    },
    {
      "id": "6e08f08dc38beaf7",
      "title": "Grain Transportation Shows Mixed Signals Across Key Channels",
      "link": "https://www.allagnews.com/grain-transportation-shows-mixed-signals-across-key-channels/",
      "description": "NASHVILLE, TN &#8211; Grain transportation activity delivered mixed signals late in January, with rail demand [...]",
      "date": "Fri, 30 Jan 2026 18:00:09 +0000",
      "timestamp": 1769796009000,
      "source": "All Ag News",
      "category": "industry",
      "icon": "📻",
      "thumbnail": "",
      "summary": "The key points from the agricultural news article are:\n\n- Grain transportation activity showed mixed signals in late January 2026, with strong rail demand, rebounding barge movements, and rising ocean freight rates.\n- U.S. Class I railroads originated 31,877 grain carloads in the week ending January 17, down 1% from the prior week but still 31% higher than a year ago and 26% above the 3-year average.\n- Railcar availability tightened sharply, with February shuttle secondary bids averaging $750 per car above tariff, $200 higher than the previous week and $600 above last year.\n- Barge traffic improved, with grain movements totaling 567,800 tons for the week ending January 24, up 27% from the previous week, though still 13% below last year.\n- Ocean freight activity remained firm, while diesel prices climbed to $3.624 per gallon, adding cost pressure.\n- The combination of strong rail demand and higher fuel costs raises transportation risk for farmers, even as barge and export flows stabilize.",
      "summaryTimestamp": 1770050139904
    },
    {
      "id": "0cf03507e2005ad8",
      "title": "Should I buy, lease or rent farm equipment?",
      "link": "https://www.farmanddairy.com/top-stories/should-i-buy-lease-or-rent-farm-equipment/903032.html",
      "description": "Don’t let a big purchase drain your cash reserves. Learn when it’s better to lease for flexibility or buy for equity to keep your farm viable this year. The post Should I buy, lease or rent farm equipment? appeared first on Farm and Dairy.",
      "date": "Fri, 30 Jan 2026 07:37:58 +0000",
      "timestamp": 1769758678000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "",
      "summary": "Key points:\n- Purchasing equipment provides the most flexibility but requires a larger upfront cost and long-term commitment.\n- Leasing offers a lower initial investment, more flexible terms, and easier equipment upgrades, but restricts modifications and has hour limits.\n- Renting is the most flexible short-term option but is more expensive per use.\n- Factors to consider when deciding include interest rates, depreciation, lease/rental costs, tax implications, and alignment with your equipment needs.\n- It's recommended to work with your banker, extension office, and accountant to analyze the numbers and make the best financial decision for your farm.\n\nThe article was written by Lee Beers, an assistant professor and extension educator with Ohio State University Extension in Trumbull County. It was published on January 30, 2026.",
      "summaryTimestamp": 1770050142713
    },
    {
      "id": "d997da18a54c115f",
      "title": "A toast to toasters and roasters: Breakfast with Ohio pioneers",
      "link": "https://www.farmanddairy.com/columns/a-toast-to-toasters-and-roasters-how-ohio-pioneers-made-breakfast/903034.html",
      "description": "Discover why early American coffee roasters and wrought-iron toasters are rare finds today. Columnist and early American artifacts collector Paul Locher takes a deep dive into the decorative motifs and functions of pioneer tools. The post A toast to toasters and roasters: Breakfast with Ohio pioneers appeared first on Farm and Dairy.",
      "date": "Fri, 30 Jan 2026 06:13:33 +0000",
      "timestamp": 1769753613000,
      "source": "Farm and Dairy",
      "category": "industry",
      "icon": "🌾",
      "thumbnail": "https://www.farmanddairy.com/wp-content/uploads/2026/01/photo-2-IMG_1109_RGB.jpg",
      "summary": "Main news/finding: This article explores the history and techniques of bread toasting and coffee roasting in the Ohio frontier during pioneer times, highlighting the unique artistry and craftsmanship of the tools used.\n\nNumbers/prices/statistics/percentages:\n- Coffee arrived in America in the early 1600s.\n- The 1773 Boston Tea Party caused coffee consumption to increase as tea was seen as unpatriotic.\n- Coffee became a national obsession by the 20th century.\n\nDates/deadlines: \n- The article is written in January 2026.\n\nNames of people/organizations/programs:\n- Paul Locher, a lifelong journalist and antiques collector, is the author of the article.\n\nLocations:\n- The article focuses on the Ohio Country frontier.\n- The historic Snow Hill Nunnery, located just north of Waynesboro, Pennsylvania, is mentioned.\n\nContext/causes:\n- Bread was often the only food standing between the settlers and starvation on the Ohio frontier.\n- Coffee consumption increased after the 1773 Boston Tea Party, when tea was seen as unpatriotic.\n\nImpacts for farmers:\n- The article provides insight into the tools and techniques used by pioneers for bread toasting and coffee roasting, which would have been important for survival and daily life on the frontier.\n\nRecommendations/action items:\n- The author notes that modern bread cannot be toasted the same way as in pioneer times due to the differences in texture and density.\n\nExpert quotes:\n- The author, Paul Locher, shares his personal experience of trying to toast modern bread the way pioneers did, noting that it quickly dries out and becomes hard.",
      "summaryTimestamp": 1770050146492
    },
    {
      "id": "f4da7149c491b048",
      "title": "Farm Journal and Hass Avocado Board Launch The Avocado Conference",
      "link": "https://www.farmjournal.com/farm-journal-and-hass-avocado-board-launch-the-avocado-conference/",
      "description": "Kansas City, MO., (January 28, 2026) –&#160; The Packer, the produce industry’s premier publication from Farm Journal, announced the launch of The Avocado Conference, a first-of-its-kind international event gathering every segment of the U.S. avocado supply chain. The inaugural event is set for Nov. 18-20, 2026, at the Hilton San Diego Bayfront. The conference directly [&#8230;] The post Farm Journal and Hass Avocado Board Launch The Avocado Conference appeared first on Farm Journal.",
      "date": "Thu, 29 Jan 2026 22:55:24 +0000",
      "timestamp": 1769727324000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Key Highlights:\n\n- Farm Journal and Hass Avocado Board are launching \"The Avocado Conference\" - a new international event for the U.S. avocado supply chain.\n\n- The inaugural event is scheduled for November 18-20, 2026 in San Diego, California.\n\n- The conference aims to bring together every segment of the avocado industry - growers, exporters/importers, packers, retailers, foodservice buyers, and other supply chain partners.\n\n- Goals are to facilitate collaboration, data-driven insights, supply-demand analysis, and strategic alignment to strengthen the avocado category.\n\n- Sessions will cover global production, trade, retail/foodservice trends, consumer insights, marketing programs, and Hass Avocado Board's role in expanding avocado demand.\n\n- Key organizers are Jennifer Strailey (Produce Editorial Director, Farm Journal) and Emiliano Escobedo (Executive Director, Hass Avocado Board).\n\n- The conference is positioned as the premier industry event to accelerate sustainable growth in U.S. avocado consumption.",
      "summaryTimestamp": 1769997087824
    },
    {
      "id": "a3f65bc7a793f6b8",
      "title": "Senator Amy Klobuchar Launches Campaign for Minnesota&#160;Governor",
      "link": "https://civileats.com/2026/01/29/senator-amy-klobuchar-launches-campaign-for-minnesota-governor/",
      "description": "January 29, 2025 – Senator Amy Klobuchar (D-Minnesota), the top Democrat on the Senate Agriculture Committee, has officially joined the Minnesota gubernatorial race. The current governor, Tim Walz, who is also a Democrat, announced earlier this month that he would drop his reelection campaign, amid escalating tensions with the Trump administration. Walz and other Minnesota [&#8230;] The post Senator Amy Klobuchar Launches Campaign for Minnesota Governor appeared first on Civil Eats.",
      "date": "Thu, 29 Jan 2026 22:03:55 +0000",
      "timestamp": 1769724235000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "Senator Amy Klobuchar (D-Minnesota), the top Democrat on the Senate Agriculture Committee, has officially joined the Minnesota gubernatorial race. The current governor, Tim Walz, who is also a Democrat, announced earlier this month that he would drop his reelection campaign, amid escalating tensions with the Trump administration.\n\nKlobuchar's campaign platform includes a focus on agricultural and rural issues. She has promised to increase funding for crop insurance, expand broadband internet access in rural areas, and work to strengthen the state's dairy industry, which has faced significant challenges in recent years. \n\nKlobuchar has served as a U.S. Senator since 2007 and has developed a reputation as a pragmatic, centrist Democrat. She is expected to face a crowded field of candidates in the Democratic primary, including several state legislators and local officials.\n\nThe Minnesota gubernatorial election is scheduled for November 5, 2025. Klobuchar's announcement comes as the state's agricultural sector continues to grapple with the economic impacts of the COVID-19 pandemic and trade disputes with China.",
      "summaryTimestamp": 1769997090763
    },
    {
      "id": "7259df0c5c30afa7",
      "title": "North Dakota Gov. Kelly Armstrong announces statewide soil health and wildlife habitat program",
      "link": "https://www.agweek.com/news/north-dakota/north-dakota-gov-kelly-armstrong-announces-statewide-soil-health-and-wildlife-habitat-program",
      "description": "The Governor’s Legacy Soil Health and Habitat Program will incentivize farmers to plant perennial grass on marginally productive cropland, to improve soil health while creating wildlife habitat.",
      "date": "Thu, 29 Jan 2026 19:56:46 GMT",
      "timestamp": 1769716606000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/24fb1a7/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe3%2F85%2Fde2da8e5439eae5cc215d10579f5%2F16826406199-000fc145b1-k.jpg",
      "summary": "The Governor’s Legacy Soil Health and Habitat Program will incentivize farmers to plant perennial grass on marginally productive cropland, to improve soil health while creating wildlife habitat.",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "b1de39348089f9e9",
      "title": "Food Businesses and Farm Groups Call on Congress to Rein in&#160;ICE",
      "link": "https://civileats.com/2026/01/29/food-businesses-and-farm-groups-call-on-congress-to-rein-in-ice/",
      "description": "January 29, 2026 – As the Senate moves toward a Friday government shutdown after Democrats blocked a package of funding bills today, food businesses and farmworker groups are pushing Democrats to stick to their demands for new restrictions on immigration agents and enforcement. Nationally renowned chef Sean Sherman, who owns the restaurant Owamni in downtown Minneapolis, [&#8230;] The post Food Businesses and Farm Groups Call on Congress to Rein in ICE appeared first on Civil Eats.",
      "date": "Thu, 29 Jan 2026 18:03:37 +0000",
      "timestamp": 1769709817000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "January 29, 2026 – As the Senate moves toward a Friday government shutdown after Democrats blocked a package of funding bills today, food businesses and farmworker groups are pushing Democrats to stic...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "c3f29ed6264920f3",
      "title": "Goopy gross eyes, contagious?",
      "link": "https://www.reddit.com/r/Cattle/comments/1qqed0z/goopy_gross_eyes_contagious/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Cattle/comments/1qqed0z/goopy_gross_eyes_contagious/\"> <img src=\"https://preview.redd.it/6rcg78pklbgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=e3664f0e75b8df3536fea3c0e59cf021e15844e7\" alt=\"Goopy gross eyes, contagious?\" title=\"Goopy gross eyes, contagious?\" /> </a> </td><td> <!-- SC_OFF --><div class=\"md\"><p>Snagged this little guy and his mom out of the pasture this morning after he seemed a little off. He is right at a month old, ha",
      "date": "2026-01-29T17:05:51+00:00",
      "timestamp": 1769706351000,
      "source": "r/Cattle",
      "category": "community",
      "icon": "🐄",
      "thumbnail": "https://preview.redd.it/6rcg78pklbgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=e3664f0e75b8df3536fea3c0e59cf021e15844e7",
      "summary": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Cattle/comments/1qqed0z/goopy_gross_eyes_contagious/\"> <img src=\"https://preview.redd.it/6rcg78pklbgg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&am...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "d57cc7c9daeb26a1",
      "title": "New Irrigation Cost-Share Opportunity Coming to Minnesota Farmers: Sign-Up Opens on February 2nd 2026",
      "link": "https://blog-crop-news.extension.umn.edu/2026/01/new-irrigation-cost-share-opportunity.html",
      "description": "",
      "date": "Thu, 29 Jan 2026 16:51:00 +0000",
      "timestamp": 1769705460000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh4EfB_R_EsViYRP1IYRymXTsOEJ6s6Krmc2hREqgYQzFkc-2eNo1ui2KwCZGeHM0mqjiLMqOC2JSo3Zfj1vTBOgOZeuymWvHBw9jLOFUCzUCC8tVKRd8529WIVASA8rA0i0G0Vv4rBCkTvMzhHghzJ739n90luTCQPCa4WZtkLu8wSC-dzNyVVy_dUGIJR/s72-w640-h426-c/MIP%20field%20day%20(26).JPG",
      "summary": "UMN Crop News: New Irrigation Cost-Share Opportunity Coming to Minnesota Farmers: Sign-Up Opens on February 2nd 2026",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "602e15b7e56d19e8",
      "title": "New Training Materials Available for Iowa Pesticide Applicators",
      "link": "https://crops.extension.iastate.edu/post/new-training-materials-available-iowa-pesticide-applicators",
      "description": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide applicator certification and training rules implemented by the Iowa Department of Agriculture and Land Stewardship on Jan. 1.</p>",
      "date": "Thu, 29 Jan 2026 09:29:31 -0600",
      "timestamp": 1769700571000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "<p>The <a href=\"https://www.extension.iastate.edu/psep/\">Iowa State University Pesticide Safety Education Program</a> has revised several applicator manuals and exams to reflect the updated pesticide ...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "806005811ce44e15",
      "title": "Johne’s disease survey",
      "link": "https://www.reddit.com/r/dairyfarming/comments/1qq7uen/johnes_disease_survey/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/dairyfarming/comments/1qq7uen/johnes_disease_survey/\"> <img src=\"https://preview.redd.it/agf7adazcagg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=4c1c896bdd2aa171a4dc51680410291f4c89a662\" alt=\"Johne’s disease survey\" title=\"Johne’s disease survey\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/xbeth-17x\"> /u/xbeth-17x </a> <br/> <span><a href=\"https://i.redd.it/agf7adazcagg1.jpeg\">[link]</a></span> &#32; <",
      "date": "2026-01-29T12:57:18+00:00",
      "timestamp": 1769691438000,
      "source": "r/dairyfarming",
      "category": "community",
      "icon": "🥛",
      "thumbnail": "https://preview.redd.it/agf7adazcagg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=4c1c896bdd2aa171a4dc51680410291f4c89a662",
      "summary": "<table> <tr><td> <a href=\"https://www.reddit.com/r/dairyfarming/comments/1qq7uen/johnes_disease_survey/\"> <img src=\"https://preview.redd.it/agf7adazcagg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&am...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "143cc824046864be",
      "title": "Know your crop insurance options to manage risk",
      "link": "https://www.agweek.com/opinion/know-your-crop-insurance-options-to-manage-risk",
      "description": "Farm management analyst Kent Thiesse shares some tips on understanding the differences available in crop insurance options for producers.",
      "date": "Thu, 29 Jan 2026 11:30:00 GMT",
      "timestamp": 1769686200000,
      "source": "Agweek",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://cdn.forumcomm.com/dims4/default/f4385a5/2147483647/resize/800x/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fagweek%2Fbinary%2F052719.AG.AmericanCrystalAddsAcres01_binary_4961654.jpg",
      "summary": "Farm management analyst Kent Thiesse shares some tips on understanding the differences available in crop insurance options for producers.",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "fa48333649a8e7d4",
      "title": "MN CropCast: Soil compaction with Jodi DeJong-Hughes",
      "link": "https://blog-crop-news.extension.umn.edu/2026/01/mn-cropcast-soil-compaction-with-jodi.html",
      "description": "",
      "date": "Wed, 28 Jan 2026 20:35:00 +0000",
      "timestamp": 1769632500000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjj4JDquJW3xRyAqy7Zq5k5Ev4T1RufEgrl5vDx70SzJx08OAGJO0WcJQizUqqRWPUuTgZtP5DnhyLxKeNTAh4M2NcMp57ZvGQAXz5_uGk8XMKbDHRV1i8h0MJybIHCVecWDZC1W6PX3Zmg2qb7YCQOsVM9dIg4qCY-YOMS1UoOrZrRIiZrur3s-MdHNig/s72-c/podcast-minnesota-cropcast-cover-art.png",
      "summary": "UMN Crop News: MN CropCast: Soil compaction with Jodi DeJong-Hughes",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "1011f8a56c308785",
      "title": "Stop Chasing Leads. Start Designing the Right Offer.",
      "link": "https://www.farmjournal.com/stop-chasing-leads-start-designing-right-offers/",
      "description": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated and purchase-ready those prospects become. When you shift your mindset from what you want to collect to what farmers genuinely need in [&#8230;] The post Stop Chasing Leads. Start Designing the Right Offer. appeared first on Farm Journal.",
      "date": "Wed, 28 Jan 2026 18:04:43 +0000",
      "timestamp": 1769623483000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "",
      "summary": "Lead generation starts with delivering real value in exchange for a farmer’s time and attention. The CTA and offer you choose shape not only how many leads you capture, but how qualified, motivated an...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "1c42e45cd6c6d7aa",
      "title": "Trump DOJ Sues Michigan to Overturn Cage-Free Egg&#160;Law",
      "link": "https://civileats.com/2026/01/28/trump-doj-sues-michigan-to-overturn-cage-free-egg-law/",
      "description": "January 28, 2026 – The Trump administration is suing Michigan to overturn a law that bans cages on egg farms in the state and mandates all eggs sold in the state come from cage-free systems. It filed a similar lawsuit against California in July of 2025. In both complaints, Department of Justice (DOJ) lawyers make [&#8230;] The post Trump DOJ Sues Michigan to Overturn Cage-Free Egg Law appeared first on Civil Eats.",
      "date": "Wed, 28 Jan 2026 17:53:05 +0000",
      "timestamp": 1769622785000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "",
      "summary": "January 28, 2026 – The Trump administration is suing Michigan to overturn a law that bans cages on egg farms in the state and mandates all eggs sold in the state come from cage-free systems. It filed ...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "af343a36b621cb60",
      "title": "Remember to register for the 2026 Nutrient Management Conference - Feb 3 in Mankato, Minn.",
      "link": "https://blog-crop-news.extension.umn.edu/2026/01/remember-to-register-for-2026-nutrient.html",
      "description": "",
      "date": "Wed, 28 Jan 2026 15:11:00 +0000",
      "timestamp": 1769613060000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgnVKkr7DqJjAqowlDYu5jeUfVHB6lVRFnrk5bsDXwSXa3a397FFwxIvU7H9-Gmz8nibTwBHXOxv4Xyv-tK2uZT_P5heVgi2O6RuGuid9to2DyKgf2SYmTvnkqmXrYTy89OkuxFzRq5S2ZZZQ0zworAJbOKU7Ik3P2meooy0FpCuuiV-amzC1uNpE9wnOZa/s72-w640-h312-c/Nut%20Mgmt%20Conf%202024.jpg",
      "summary": "UMN Crop News: Remember to register for the 2026 Nutrient Management Conference - Feb 3 in Mankato, Minn.",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "05a4787793e963ae",
      "title": "The EPA Is Not Starting a New Review of&#160;Paraquat",
      "link": "https://civileats.com/2026/01/28/the-epa-is-not-starting-a-new-review-of-paraquat/",
      "description": "Such a reassessment would have been an important development for public health advocates, including members of the Make America Healthy Again (MAHA) movement, who argue the EPA’s risk-benefit analysis of paraquat is outdated. While the EPA maintains it can be used safely, the herbicide is banned in more than 70 countries, including China, Brazil, and [&#8230;] The post The EPA Is Not Starting a New Review of Paraquat appeared first on Civil Eats.",
      "date": "Wed, 28 Jan 2026 09:00:05 +0000",
      "timestamp": 1769590805000,
      "source": "Civil Eats",
      "category": "industry",
      "icon": "🥗",
      "thumbnail": "https://civileats.com/wp-content/uploads/2026/01/the-epa-is-not-starting-a-new-review-of-paraquat-1.jpg",
      "summary": "Such a reassessment would have been an important development for public health advocates, including members of the Make America Healthy Again (MAHA) movement, who argue the EPA’s risk-benefit analysis...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "28898aec65000293",
      "title": "Save the Date - Southern Small Grains Update Meetings",
      "link": "https://blog-crop-news.extension.umn.edu/2026/01/save-date-southern-small-grains-update.html",
      "description": "",
      "date": "Tue, 27 Jan 2026 15:25:00 +0000",
      "timestamp": 1769527500000,
      "source": "UMN Crop News",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "UMN Crop News: Save the Date - Southern Small Grains Update Meetings",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "446b4f297fe6487a",
      "title": "dairy management solutions",
      "link": "https://www.reddit.com/r/dairyfarming/comments/1qnoyix/dairy_management_solutions/",
      "description": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone! 👋 New here. I'm a software engineering student working on my final year project - a dairy farm management system.</p> <p>I've been testing Farmbrite's 14-day trial and while the breeding/AI workflow is solid (love how semen inventory auto-decrements), I'm struggling with the milk yield tracking for dairy cattle.</p> <p>Specifically, I can't find any way to:</p> <ul> <li>Track lactation cycles (Lactation 1, 2, 3...)</li> <li>Calculate Days in Milk ",
      "date": "2026-01-26T18:48:31+00:00",
      "timestamp": 1769453311000,
      "source": "r/dairyfarming",
      "category": "community",
      "icon": "🥛",
      "thumbnail": "",
      "summary": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone! 👋 New here. I'm a software engineering student working on my final year project - a dairy farm management system.</p> <p>I've been testing Farmbrite's ...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "0a8e315e7d2c7cc2",
      "title": "When it’s cold cows instinctively stand in east-west lines to receive maximum sunlight 🌞 nature is amazing 🤩",
      "link": "https://www.reddit.com/r/dairyfarming/comments/1qnhfzh/when_its_cold_cows_instinctively_stand_in/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/dairyfarming/comments/1qnhfzh/when_its_cold_cows_instinctively_stand_in/\"> <img src=\"https://preview.redd.it/dq0cmntdepfg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=5119f697eb75299beda47f1502143818d7a849e4\" alt=\"When it’s cold cows instinctively stand in east-west lines to receive maximum sunlight 🌞 nature is amazing 🤩\" title=\"When it’s cold cows instinctively stand in east-west lines to receive maximum sunlight 🌞 nature is amazing 🤩",
      "date": "2026-01-26T14:26:25+00:00",
      "timestamp": 1769437585000,
      "source": "r/dairyfarming",
      "category": "community",
      "icon": "🥛",
      "thumbnail": "https://preview.redd.it/dq0cmntdepfg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=5119f697eb75299beda47f1502143818d7a849e4",
      "summary": "<table> <tr><td> <a href=\"https://www.reddit.com/r/dairyfarming/comments/1qnhfzh/when_its_cold_cows_instinctively_stand_in/\"> <img src=\"https://preview.redd.it/dq0cmntdepfg1.jpeg?width=640&amp;crop=sm...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "531f71b6919c6350",
      "title": "Hard Times in the Mississippi Delta as Farmers Consider Letting Crops Rot",
      "link": "https://www.reddit.com/r/Agriculture/comments/1qn7lcc/hard_times_in_the_mississippi_delta_as_farmers/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qn7lcc/hard_times_in_the_mississippi_delta_as_farmers/\"> <img src=\"https://external-preview.redd.it/c-to98ZSZ5qS6Hi0BMNav3gcA0NsymvQA3j4w77KUSk.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=a2bd8b785bd7fd9806e3bcc262fb014d07669d1c\" alt=\"Hard Times in the Mississippi Delta as Farmers Consider Letting Crops Rot\" title=\"Hard Times in the Mississippi Delta as Farmers Consider Letting Crops Rot\" /> </a> </td><td> &#32; submi",
      "date": "2026-01-26T05:45:05+00:00",
      "timestamp": 1769406305000,
      "source": "r/agriculture",
      "category": "community",
      "icon": "🌾",
      "thumbnail": "https://external-preview.redd.it/c-to98ZSZ5qS6Hi0BMNav3gcA0NsymvQA3j4w77KUSk.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=a2bd8b785bd7fd9806e3bcc262fb014d07669d1c",
      "summary": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qn7lcc/hard_times_in_the_mississippi_delta_as_farmers/\"> <img src=\"https://external-preview.redd.it/c-to98ZSZ5qS6Hi0BMNav3gcA0N...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "4a8507c185c1e935",
      "title": "Recirculating Hydroponic Systems: How They Work & Why Growers Use Them",
      "link": "https://www.reddit.com/r/Agriculture/comments/1qmwp35/recirculating_hydroponic_systems_how_they_work/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qmwp35/recirculating_hydroponic_systems_how_they_work/\"> <img src=\"https://external-preview.redd.it/UUFKuCoYou8fmdJB-_53ndRdxJD78kRwiwWcT_tdtcU.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=e0f1b6af71756a13ad84882a2401091252dc903d\" alt=\"Recirculating Hydroponic Systems: How They Work &amp; Why Growers Use Them\" title=\"Recirculating Hydroponic Systems: How They Work &amp; Why Growers Use Them\" /> </a> </td><td> &#32; sub",
      "date": "2026-01-25T21:53:11+00:00",
      "timestamp": 1769377991000,
      "source": "r/agriculture",
      "category": "community",
      "icon": "🌾",
      "thumbnail": "https://external-preview.redd.it/UUFKuCoYou8fmdJB-_53ndRdxJD78kRwiwWcT_tdtcU.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=e0f1b6af71756a13ad84882a2401091252dc903d",
      "summary": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qmwp35/recirculating_hydroponic_systems_how_they_work/\"> <img src=\"https://external-preview.redd.it/UUFKuCoYou8fmdJB-_53ndRdxJD...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "8109741ccd4b4ee1",
      "title": "Can trees explode in cold weather? A Texas A&M expert weighs in.",
      "link": "https://www.reddit.com/r/Agriculture/comments/1qmqt09/can_trees_explode_in_cold_weather_a_texas_am/",
      "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qmqt09/can_trees_explode_in_cold_weather_a_texas_am/\"> <img src=\"https://external-preview.redd.it/gvOAwtCuRutdWxHHKz-9-c8ugclbctT_SCNDZTHb3r0.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=9e386b5250e78ab710665775671d6e7bf2566e7f\" alt=\"Can trees explode in cold weather? A Texas A&amp;M expert weighs in.\" title=\"Can trees explode in cold weather? A Texas A&amp;M expert weighs in.\" /> </a> </td><td> &#32; submitted by &#32",
      "date": "2026-01-25T18:19:55+00:00",
      "timestamp": 1769365195000,
      "source": "r/agriculture",
      "category": "community",
      "icon": "🌾",
      "thumbnail": "https://external-preview.redd.it/gvOAwtCuRutdWxHHKz-9-c8ugclbctT_SCNDZTHb3r0.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=9e386b5250e78ab710665775671d6e7bf2566e7f",
      "summary": "<table> <tr><td> <a href=\"https://www.reddit.com/r/Agriculture/comments/1qmqt09/can_trees_explode_in_cold_weather_a_texas_am/\"> <img src=\"https://external-preview.redd.it/gvOAwtCuRutdWxHHKz-9-c8ugclbc...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "e3305465c4421d9b",
      "title": "Jan 23 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-23-weather-update-and-market-review.html",
      "description": "Winter has come back with a vengeance after a temporary pause. Average temperatures this week ranged from the low teens in northern Illinois to the mid-20s in southern Illinois, between 4 and 8 degrees below normal statewide. Nighttime low temperatures this week regularly dipped into the single digits, if not below zero, including -5 degrees in Rockford and -2 in Aurora. The wind was also a factor, pushing wind chill values close to -20 on a few days.&#8230;",
      "date": "Fri, 23 Jan 2026 13:43:23 +0000",
      "timestamp": 1769175803000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "Temperatures this week were 4-8 degrees below normal, with lows dipping into the single digits or below zero, including -5°F in Rockford and -2°F in Aurora. The cold weather has persisted, with most of northern Illinois expected to stay below freezing for the rest of January. \n\nPrecipitation has also been very dry, with January seeing less than half an inch of rain in some areas, making it the 4th and 10th driest January on record in Carbondale and Charleston, respectively. However, a major winter storm is expected to hit southern Illinois this weekend, bringing 8-12 inches of snowfall, with some isolated heavier amounts.\n\nThe article also summarizes the recent \"Commodity Week\" radio program, which featured analysis from experts Chip Nellinger of Blue Reef Agri-Marketing, Brian Stark from The Andersons, and Arlan Suderman with StoneX. The Closing Market Report is also mentioned as a daily podcast.\n\nOverall, the key points are the prolonged cold and dry conditions impacting Illinois farmers, the upcoming major winter storm, and the weekly radio programs providing agricultural market commentary and analysis.",
      "summaryTimestamp": 1770006136399
    },
    {
      "id": "9e58272c0874eba3",
      "title": "Brand and Content Discoverability Is the New Battleground in Ag Marketing",
      "link": "https://www.farmjournal.com/brand-and-content-discoverability-is-the-new-battleground-in-ag-marketing/",
      "description": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO, answer engine optimization). In a world now crowded with “AI slop,” brands will only cut through by growing brand authority and [&#8230;] The post Brand and Content Discoverability Is the New Battleground in Ag Marketing appeared first on Farm Journal.",
      "date": "Tue, 20 Jan 2026 21:10:35 +0000",
      "timestamp": 1768943435000,
      "source": "Farm Journal",
      "category": "industry",
      "icon": "📰",
      "thumbnail": "https://www.farmjournal.com/wp-content/uploads/2026/01/image-1024x350.png",
      "summary": "The world is searching for information a bit differently these days. Gone are the days of winning the click (traditional SEO). The game now is centered on winning brand authority and trust (modern AEO...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "184c36b266c8cc2c",
      "title": "Forest Farming: Why it Might Make Sense for Your Land",
      "link": "https://modernfarmer.com/2026/01/forest-farming/",
      "description": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in forested areas, this practice enhances farm output without compromising the ecosystem. The post Forest Farming: Why it Might Make Sense for Your Land appeared first on Modern Farmer.",
      "date": "Mon, 19 Jan 2026 10:00:36 +0000",
      "timestamp": 1768816836000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/12/A-cassava-farm-at-a-forest-showing-agroforestry.webp",
      "summary": "Also called agroforestry, forest farming is a great way to work within your environmental parameters and utilize the tree canopy to produce more for your farm. Especially for those who live in foreste...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "caef23fa04d0e007",
      "title": "Jan 16 &#124; Weather Update and Market Review",
      "link": "https://farmdoc.illinois.edu/field-crop-production/weather/jan-16-weather-update-and-market-review.html",
      "description": "The second week of the year brought a fleeting taste of spring, with average temperatures between the mid-30s to upper 40s; 8 to 12 degrees above normal. Some of the more impressive daytime high temperatures this week included 69 in Kaskaskia and 68 in Carbondale. January to date has been 7 to 12 degrees above normal statewide, and has been a top 10 warmest first half of January on record in most parts of the state.&#8230;",
      "date": "Fri, 16 Jan 2026 13:51:16 +0000",
      "timestamp": 1768571476000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "",
      "summary": "The second week of the year saw unseasonably warm temperatures, with average temps 8-12°F above normal, reaching highs of 69°F in Kaskaskia and 68°F in Carbondale. January so far has been a top 10 warmest start to the month on record for most of Illinois. \n\nHowever, precipitation has been lacking, with 7-day totals ranging from 0.1 inches in southeast Illinois to 0.75 inches in central parts of the state. January to date has been 0.5-1 inch drier than normal, except for a narrow area between Peoria and Chicago that saw 1-3 inches of rain. This winter season has been slightly wetter than normal in northeast Illinois, slightly drier than normal in central/western Illinois, and much drier than normal (top 5 driest on record) in southern Illinois.\n\nThe warm, dry weather will come to an end this weekend, with highs struggling to reach 20°F in northern Illinois and above freezing in the south. Single-digit temps are expected on Monday. Little precipitation is forecast, mostly light snow. Colder than normal weather is likely to continue through the first week of February.\n\nThe article also mentions the weekly Commodity Week and Closing Market Report radio programs on WILL AM580, covering commodity markets and analysis.",
      "summaryTimestamp": 1770006140247
    },
    {
      "id": "05346e0ad9807504",
      "title": "Getting Started with Spray Drones in Iowa: A Practical Guide",
      "link": "https://crops.extension.iastate.edu/post/getting-started-spray-drones-iowa-practical-guide",
      "description": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air spraying across an open field\" width=\"293\" height=\"220\" class=\"align-right\" loading=\"lazy\">Spray drones are increasingly being evaluated by Iowa farmers as an additional tool for crop input application. When used appropriately, these systems can provide flexibility for timely applications, reduce fi",
      "date": "Tue, 13 Jan 2026 09:52:21 -0600",
      "timestamp": 1768319541000,
      "source": "Iowa State",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://crops.extension.iastate.edu/files/inline-images/image_64.png",
      "summary": "<p><img src=\"https://crops.extension.iastate.edu/files/inline-images/image_64.png\" data-entity-uuid=\"fb261b15-b891-4f2d-ba18-65d159a69ac1\" data-entity-type=\"file\" alt=\"A spray drone flying in the air ...",
      "summaryTimestamp": 1769997090962
    },
    {
      "id": "75d0524dd80f4e3e",
      "title": "Double-crop Soybean Management Practices &#8211; Project Report",
      "link": "https://farmdoc.illinois.edu/field-crop-production/double-crop-soybean-management-practices-project-report.html",
      "description": "You can also read the article in Portuguese and Spanish Introduction There is a growing interest in wheat/soybean double-cropping systems in Illinois, extending into parts of central Illinois where wheat acreage has been limited in recent decades. USDA-NASS survey estimates that 60-80% of Illinois wheat acres are double-cropped with soybeans. Implementing this system in central and northern Illinois has been constrained primarily by low wheat acreage and by later wheat harvest, which often delay",
      "date": "Tue, 13 Jan 2026 12:52:03 +0000",
      "timestamp": 1768308723000,
      "source": "farmdoc (UIUC)",
      "category": "university",
      "icon": "🎓",
      "thumbnail": "https://farmdoc.illinois.edu/wp-content/uploads/2026/01/Table1_site-info.jpg",
      "summary": "Main Findings:\n- Double-crop soybean yields averaged 55.7 bu/acre in 2024 and 47.8 bu/acre in 2025 in Piatt County, Illinois.\n- Full-season soybean varieties (MG 3.6-3.8) yielded about 4% (2.1 bu/acre) more than early-maturing varieties (MG 3.0-3.2).\n- Yield response to seeding rate differed by maturity group - early-maturing varieties required higher seeding rates (max 252,000 seeds/acre) compared to full-season varieties (max 207,000 seeds/acre).\n- Starter fertilizer (N+S) increased yields by 1.4 bu/acre (2.6%) in 2024 but not in 2025 or on average.\n\nKey Details:\n- Location: Piatt County, Illinois\n- Time Period: 2024-2025 growing seasons\n- Treatments: Maturity group (3.0-3.2, 3.6-3.8), seeding rate (140,000 - 260,000 seeds/acre), starter fertilizer (N+S)\n- Collaborators: Illinois Agricultural Experiment Station, Illinois Fertilizer & Chemical Association, producer Eric Miller\n- Ongoing trials to strengthen regional recommendations\n\nImpacts for Farmers:\n- Selecting full-season soybean varieties may maximize double-crop yields when frost risk is low.\n- Seeding rates of 200,000+ seeds/acre are recommended for double-crop soybeans.\n- Starter fertilizer may not consistently improve double-crop soybean yields in central Illinois.\n\nRecommendations/Action Items:\n- Consider using full-season soybean varieties for double-cropping.\n- Adjust seeding rates based on maturity group, aiming for 200,000+ seeds/acre.\n- Evaluate need for starter fertilizer on an individual field basis.\n- Monitor ongoing trials for updated regional recommendations.",
      "summaryTimestamp": 1770006145626
    },
    {
      "id": "514686d2a8e0e61c",
      "title": "The 9 Best Flowers and Vegetables to Winter Sow",
      "link": "https://modernfarmer.com/2026/01/flowers-vegetables-winter-sow/",
      "description": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings a stronger constitution as they mature. Here, we share plants that thrive when winter sown. The post The 9 Best Flowers and Vegetables to Winter Sow appeared first on Modern Farmer.",
      "date": "Mon, 12 Jan 2026 14:00:25 +0000",
      "timestamp": 1768226425000,
      "source": "Modern Farmer",
      "category": "industry",
      "icon": "🌱",
      "thumbnail": "https://modernfarmer.com/wp-content/uploads/2025/07/garden-with-vegetables-and-flowers.webp",
      "summary": "For farms in colder areas, starting seeds in time for the spring market requires a significant amount of time and indoor space. Winter sowing is a method that can be done outdoors and gives seedlings ...",
      "summaryTimestamp": 1769997090962
    }
  ],
  "stats": {
    "community": 35,
    "government": 0,
    "university": 30,
    "industry": 60,
    "markets": 0,
    "weather": 0
  },
  "feedCount": 29,
  "successCount": 125,
  "summariesGenerated": 28,
  "updated": "2026-02-02T16:35:46.693Z"
}